{
    "name": "El Salvadoreño",
    "place_id": "ChIJFw94JMn1wokRVc9k0ooMjOQ",
    "grid": "BX1",
    "address": "619 Melrose Ave, Bronx, NY 10455, USA",
    "rating": 4.2,
    "user_ratings_total": 229,
    "phone_number": "(646) 637-8179",
    "reviews": [
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMWJYSnVWbXgzTTNobWFXNVRZVFJ4T1ZONmFXYxAB",
            "text": "El restaurante se ha vuelto muy caro y, para colmo, racionan el repollo para las pupusas. La porción que sirven es insuficiente. Hay mejores restaurantes salvadoreños que no hacen eso en Yonkers y en el Bronx."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMUHpwdnJQczQtc1FnEAE",
            "text": "Muy mal servicio , y además no aceptan pagos con tarjeta , tomando en cuenta que las pupusas dejan mucho que desear 0 recomendable"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRmFrZ3dXRUkzWVRoSmVsbHJVRE5SWVRoZldFRRAB",
            "text": "Todo es bueno y la atención es súper"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RU1EZGhVRVoxYkVOamNYWkhiVlIwVkY5S01tYxAB",
            "text": "es una lástima que este lugar este tal cual, parace en decadencia, la comida no es nada extraordinario lo cual deberían de mejor pero también el ambiente, los baños sucios,el piso sucio, en verano sin aire acondicionado. No dan ganas de volver salvo porque no hay más opciones de comida \"salvadoreña\" en el área."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWVNHTXRPVVZZWnpZd1RWbHlObkZZTlhsd1RVRRAB",
            "text": "Comida Riquizima ….La Quesadilla #1 🧡"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMmJqUXRiM2M1ZDBOelYyMUxaMVpGVGxkdk9IYxAB",
            "text": "Las pupusas estaban deliciosas, la atencion 10 de 10"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWG55cUtJMU12blFREAE",
            "text": "Las pupusas están buenísimas!! El servicio es execelente."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaFpqaGNREAE",
            "text": "Yo pasé a ordenar popusas para llevar. Le dejé saber a la muchacha que volvería en 20 minutos. Cuando vuelvo mi orden se lo habían entregado a otro cliente y la muchacha me dice espera otro 30 minutos."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcDVhbzd3RRAB",
            "text": "Mal servicio llevamos esperando más de media hora por 3 pollos con tajadas ni siquiera está lleno"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM1BEdWF3EAE",
            "text": "Las mejores pupusas del Barrio! Llevo años comprando en este lugar y en los alrededores y nadie tiene las pupuas tan ricas cómo aquí. Lo único malo es el servicio."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOHF5UVNREAE",
            "text": "El repollo  tiene  que  ser  más  fino  no tan grueso"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNVpYTzlBRRAB",
            "text": "I've been coming here for years after today will never come again the cook came out with no gloves on she had food all over her face and apron the bathroom had no toilet paper stools all over toilet and floor and the worst part huge cockroach underneath the table when we were eating the waiter came and killed it all told us we have so many they like to run all over the counter are you kidding me and they raised the prices so high now at so many years for a restaurant that's infested with cock roaches"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ0xXU2NnEAE",
            "text": "Un lugar muy agradable para comer en privado.. en espeial, cocinan con amor.. Gracias"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuODd2RFFnEAE",
            "text": "Restaurante salvadoreño, muy típico y sirven unas pupusas muy ricas, el ambiente muy agradable y buen espacio, recomendado al 100, música agradable y pantallas se televisión para ver tus partidos preferidos, buen lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLU1YMWR3EAE",
            "text": "Excellent  services very friendly and the food made at the moment  so delicious"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcy1Lc3RnRRAB",
            "text": "Pues hablo por my y mi hija que lo disfrutamos mucho cuando bamos al salvadureño ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOXBXR19RRRAB",
            "text": "Muy buenas pupusas y las meseras son muy bonitas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM0pQZ21BRRAB",
            "text": "Food was outstanding. Prices were very reasonable for the quantity and quality.  A little hot inside with no AC but bearable. Will definitely be returning"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibDZUOUhBEAE",
            "text": "This place is amazing. I love their Pupusas and the orchata . A must do again. Good customer service. Excellent dishes ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeFBIZ2tRRRAB",
            "text": "It was packed! Took a little time to get my food.the food was incredibly good.the service was very friendly"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLXQ2UW5RRRAB",
            "text": "Muy buena atención muy buena comida se los recomiendo 👏 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX29YNDhnRRAB",
            "text": "Very good place to eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b2VlRmh3RRAB",
            "text": "Really enjoyed the pupusas! Very good value."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0LTlQYWxnRRAB",
            "text": "Quite and slow I like that. I am in no hurry to get no where so I enjoy my meal better. I order Pupusa I love the taste and the zises where great from the price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dnYyX0dBEAE",
            "text": "Ahhh, to be in a restaurant so authentic, from food, service and culture, that it feels like family. ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0enFhLXNBRRAB",
            "text": "This place has good food, delicious beef soup, pupusas and tamales are my favorite meals. I should try other dishes. Cash only. Order some food to bring home."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdXVYVFJnEAE",
            "text": "Me encanta este lugar se lo recomiendo sobre todo a mis paisanos salvadoreños ahí tienen las mejores pupusas de El salvador en New York"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMzc2SFlBEAE",
            "text": "my parents gave me corn tamales from there and im in love!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeFlUbWZREAE",
            "text": "Muy excelente servicio y la comida súper rica ✨🤩"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdmFXOExREAE",
            "text": "Pupusa de pollo y queso, estaban riquísima, tenía mucho tiempo que no la comía, la masa muy suave, el pollo y queso delicioso."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa1lIbldBEAE",
            "text": "Pésimo lugar no hay servicio en las mesas siempre está sucio habían platos en las mesas pésimo servicio"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1enFMTUhREAE",
            "text": "Unas deliciosas pupusa"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOTYza3B3RRAB",
            "text": "Servicio muy lento y el personal de servicio nada amable"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadWZpVHd3RRAB",
            "text": "La comida muy buena, pedimos pupusas de todo estilo y estaban muy ricas"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOTZEQkdnEAE",
            "text": "Soy mexicano pero me encantan las pupusas de este restaurante mi calificación es mi humilde opinión"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOGNYSm9RRRAB",
            "text": "Omg. The Chicken and cheese pupusas are one of the best pupusas around the area. Aside from lorroco y queso ones. I recommend them.\n\nLas pupusas de pollo y queso son unas delicias bien hechas con un sabor único y buenos🤤 😋  aparte de las de lorroco y queso 🧀 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bVBDZklBEAE",
            "text": "Order in advance if you’re taking out.pupusas are definitely good here!i will soon try more items from here"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c3NmdVpREAE",
            "text": "La comida como en casa el servicio un poco lento y eso de que solo cash 💸  limita a los gastos ya que si quiero algo extra no lo puedo comprar por que ya no se anda con cash pero la comida el sabor la calidad muy buena y los precios acequible"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoXzVyaHlRRRAB",
            "text": "My favvvv place to eat at. The pupusas are sooo good and fresh. They're handmade at the moment when you purchase so it may take a little bit to get your pupusas but it's so worth it. The sopa de res too is sooo good. The flavor is so good and not a plain soup. 5/5 stars<3"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMHNEV0J3EAE",
            "text": "Comida autentica, el local huele a humedad y huele mal al entrar. La comida excelente y el servicio también. Necesita algo más de luz,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoalB2SGtBRRAB",
            "text": "I have only ever had the pupusas (veganized - beans/mushrooms/jalapeños) and they are super tasty. They are made fresh on demand and are accomodating with the combos. The natural juices are a bit on the sugary side. One down side is that it is cash only but there is an atm on site."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoakt5c1V3EAE",
            "text": "The food take forever we have to wait about 45 minutes just to get pupusas"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNGFlbTZBRRAB",
            "text": "This place was ok. Thus far. I've only tried the pork pupusas. It was the first time I've tried them. They were ok. The cabbage salad and the sauce were the saving graces of the meal.  I will leave this review open ended until I get another 2 dishes to bring the rating up. But at the moment, it's a 3 thus far."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvenJuLVN3EAE",
            "text": "Nice authentic feel, seems like a popular spot among locals. Got the #1 plus a side of their plantains (both pictured) and it was delicious. Our waitress only spoke Spanish but we were able to get by :)"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNGRlcndBRRAB",
            "text": "La comida de este lugar es buenísimo …la sopa de pollo es muy bueno y las pupusa  …las recomiendo están muy bueno"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNk02cmdRRRAB",
            "text": "I order 4 pupusas to go and I waited over 30 minutes for my food. There was only two other guest dining indoors and I saw about 4 more guests come in after 10 minutes of being there and saw how they got their food before I did. When I asked…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeDR6M0ZnEAE",
            "text": "The worse place to buy food, specially if placing order over the phone. I recently order a red snaper, I specifically ask the person whose taking my order what are the size of the fish. Because the asking price was $18.00 for the platter. She answered \" they are big, they good size\". When I pick up my order I received a small baby red snaper fish that can easily fit the palm of my hands and the fish was hard as a rock due to over frying the fish. The fish tasted like leftover that was sitting in the freezer, Not fresh. check your order before paying at that restaurant. If ordering red snaper fish check your order before paying they might do you the same."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMmM3V3l3RRAB",
            "text": "Great food but mannn poor the waitress, it's only one lady serving the entire place... She does a good job but the owners should be more conscious... That poor lady does work for 2 people."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVZ0pyc1FBEAE",
            "text": "Delicious food best pupusas & tamal de elote in the Bronx"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOWRfSElBEAE",
            "text": "Run, don’t walk, to El Salvadoreño! The papusas really pa-pushed the envelope of flavor! Good price, fast service with a smile."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtN3BQRW9RRRAB",
            "text": "I like the pupusas revueltas 🇸🇻. Cash only, no delivery. You can dine in. They also offer salvadorian cheese, quesadillas, horchata, tamales"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdTRmakFREAE",
            "text": "Great food and service, but it takes them a lot of time to have your order ready (over 15-20 min) and they do not accept card (they provide an ATM inside the local though)"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURha1BfbkZ3EAE",
            "text": "Lo unico que compre fueron pupusas, pero si todo el menu sabe tan rico como las pupusas, no le doy 5 estrellas, les doy un 10."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdFlHZEZ3EAE",
            "text": "Yo pase a comprar en este lugar y pedí 10 pupusas que supuestamente tienen el precio de 2.50 y resulta que me cobraron 32 dolares y cuando le pregunte a la mesera me dijo que costaban a 3 dolares cada uno entonces los 2 dolares extra de que eran?yo me sentí estafada en este lugar ya no volveré nunca más en este sitio"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMFozc3ZRRRAB",
            "text": "The people were very nice and the food was great\n\nAlso their horchata and lemonade is literally perfect no words"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bmRid3FRRRAB",
            "text": "i only speak as far as the Pupusas: OMG best ones I've ever had and i've been to a few places in the bx but this one is by far the best!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteG9Yd0d3EAE",
            "text": "Good hispanic food. Look clean. Waitress try to give a good service. You can enjoy the moment in that place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ejZibnpBRRAB",
            "text": "It's decent food for the price they put I see myself coming back again"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbl92eXVBRRAB",
            "text": "No hay suficiente personal para trabajar tardan mucho para servir la comida y demas los duenos deverian contratar mas empleados porque dos meseros no alcanzan"
        }
    ],
    "reviews_count": 59
}