{
    "name": "Wingstop",
    "place_id": "ChIJSe2GR8_1wokRww1wtO9qnZU",
    "grid": "BX1",
    "address": "356 E 149th St, Bronx, NY 10455, USA",
    "rating": 3,
    "user_ratings_total": 232,
    "phone_number": "(718) 949-9464",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWlMwWndWREJDY0RSMlFUUlNiSFp1ZW0xQ04zYxAB",
            "text": "Option’s for the Chicken Sandwich is awesome. Not sure how if they have lettuce & tomatoes & cheeses."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV2VIUm1ZekJ5VERKVVpFbHRla0pRVmtkNVVuYxAB",
            "text": "Thought this would change third ace for me but nope! Chicken sandwich was burnt, dry and the pickle looks gross oh  and fries cold smh! I Love wing stop but will not return to this one a waste of money I don’t have! I eat take out as a treat! This truly ruined my day! THANKS for the disappointment super tight right now"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRFZIVnhVbVZMUWpkMmQzazJlSGR3VW1sa2RtYxAB",
            "text": "Over an hour wait. Tons of people crowded at the front waiting for their order as well. Phone constantly ringing. Don’t order online at this wingstop."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdmFXSm1YMXBRV0RCVFkyTldSR3hxVEVKRmNGRRAB",
            "text": "very slow no good service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdFRFUnNYekJXVTNObVlVbHBkMWhIT1ZCalJuYxAB",
            "text": "Originally from bk but i was in the bronx to get my hair done .. stopped at this wing stop and Naila indeed wanted my sale 😭 she went over and beyond so i can get my order as embarrassing as i felt she gave great customer service ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYjc2cUQwcHFHWlZREAE",
            "text": "My experience at this wingstop is always good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNU21qNV94M3VLTGdnRRAB",
            "text": "Always open up late (5-8minutes). It says 11 but opens at 11:05/08. Never have food ready. Not friendly. Always seem I am bothering them (servers)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQTHpoZDI2NmZHc0tBEAE",
            "text": "If you like salty food come here. gah damn 😂 I just had this for the first time in over a year and I won't be buying again. The salt level on this food is incredibly high."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaGZ6UUNBEAE",
            "text": "This is one of the worst food experiences in the Bronx. If it weren't for the deals offered, I would never step foot in this God-forsaken location. It's horribly managed and the \"service\" shouldn't even be called service. It's almost like the workers have genuine contempt for the customers and don't care to assist people paying their money in any way. Even ordering online doesn't help to avoid the unpleasantness of the staff. It saddens me deeply that this is what we're given while other locations in the city are given so much more."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXN2N0JBEAE",
            "text": "fire"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWNMa1d3EAE",
            "text": "Worst experience of my life never again these people uneducated"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWV6dEFnEAE",
            "text": "THIS WINGSTOP IS HORRIBE EKEPT IS THE WORST I ASKED HER TO GIVE ME MY ORDER SHE REFUSED BECAUSE IT SAYS PENDING BUT WINGSTOP ALWAYS SAY PENDING WHEN U MAKE AN ORDER"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdjdYVVVnEAE",
            "text": "0 stars if I could. Ordered for pick up they started cooking my food when I arrived even after coming 10 min after estimated ready time"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMmVIRDFnRRAB",
            "text": "Whoever works the midnight shift on Tuesdays just know yall are the best thank you for preparing the food SO well cus everything was BOMB down to my soda being delivered to me without ice so it wouldn’t water down ily guys"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncllMMHVnRRAB",
            "text": "Buena comida"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfblBLdVRREAE",
            "text": "Horrible wings was to hard I came there at night on 1/21/25 and the young boy darkskin with dreads that  was on cash register also false advertising"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNXRlbDBBRRAB",
            "text": "Have been waiting over 20mins for a sandwich and when asked what’s going on with the food got a rude attitude"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQza2ZUN2NBEAE",
            "text": "they take forever with the food & i got into a altercation with one of the employees and they threw my food out. terrible employees i will never come back to wingstop"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbGVDa1dnEAE",
            "text": "OMG SALTY SALTY SALTY! Their food should come with a warning ⚠️  The dry seasoning on the Chicken was so overwhelming I had to remove the outer coating of  the chicken the best I could because I was hungry and it was so expensive.  Food Buyer beware!  They get two thumbs down my family shall not be ordering anything from them ever again.  Dear Foodies you have been ⚠️. Eat at your own risk. Blessings, peace and light to all."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueThpNEt3EAE",
            "text": "Mi experiencia fue muy mala el domingo 29 de septiembre del 2024 como a las 6:30 pm. me acerqué a comprar pero me dijeron que no estaban atendiendo que solo delivery estaban atendiendo una total decepción ese negocio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bTViSVRBEAE",
            "text": "Started eating there again for the past week or so 😩🤦🏽‍♀️It’s SOO Good. Always the same, no disappointments. Cashier’s in store are always kind & respectful. Not overly crowded ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MThDYWR3EAE",
            "text": "We waited for about an hour for the food and paid extra for some sauces. The sauces were no where to be found. No ice in our drinks, and door dash/ grub hub drivers were getting their food prioritized. Would not recommend going."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMi1lMV9BRRAB",
            "text": "I really like the food a lot but the lady who served me today was in a bad mood and gave me the wrong order and change and it is not the first time she has served me and she always does it in a very bad mood and it is rude."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicWNXa0dBEAE",
            "text": "Very clean and very nice to be able to get some good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiZ2JENWxRRRAB",
            "text": "Food is mid location is horrible"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidnNHLVd3EAE",
            "text": "The owner doesn’t care about his business. The place should be shut down. 🤢"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMHNubFlnEAE",
            "text": "this is the worst restaurant in the bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNic3FmeXZnRRAB",
            "text": "Awesome and wide variety of flavors on the wings. Love ❤ it... 👍🏾 definitely would go again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydFAzWk93EAE",
            "text": "Food was good, service is really top of the chart"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX2J1WFBnEAE",
            "text": "The worst Wingstop orders take way too long and they have bugs inside"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXVtal9RRRAB",
            "text": "If I can give them no stars,  I would’ve my experience was unacceptable. First of all my food came super cold then all the sauces were wrong on my boneless chicken wings To the point that they couldn’t be eaten. They didn’t send me my kids chicken fingers so I called the store. No one picks up goes into a voicemail that is full. I sent corporate a message four days later they still haven’t responded, this is unacceptable. It’s disgusting. So I didn’t get to eat and lost my money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdklTZ3BnRRAB",
            "text": "This is my second bad review on this location. I’ll start with a message to the entire staff by saying that just because you’re in the Bronx, doesn’t mean you don’t have to care. Twice I’ve had my order messed up with items missing. Last time I pulled up and cussed out a rude male employee. This time DoorDash took care of that. Hiring managers: DO BETTER and get you some Gen Z’s with reading comprehension 🙄"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OUlxV0VREAE",
            "text": "I ordered from this Wingstop and had it delivered me and my family was eating and my mom went to pick up her drink and   found a roach in it. She called the Wingstop in 149th that she ordered from she had told them about the issue and they accused my mother of lying. And said that she put it in her drink why would we do that? He said that we were lying and that we are crazy. He and his staff kept hanging up when we brought it up and threatened to call the cop and said to look at his reviews and said that he’s the best. Yet half his reviews are 1 star or 2. The Manager is rude and disrespectful. Never order from this location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c1l5OHhBRRAB",
            "text": "It Was Terrible 😔 The Lady At The Register Was Real Nasty And Bland 😔 The Food Was 0 stars Just A Terrible Experience All iN All. And The Food Was Cold 🥶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaW9pQlBREAE",
            "text": "I don’t play about my money especially when I’m using Ubereats to make an order. Y’all know how expensive it is. Since yall wanna give me old and stale wings, I will make sure it will be known. Do not come here if you don’t want people playing with your FOOD and MONEY. Yall got me messed up because why does biting into a chicken wing feel like im biting into a rock?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELWJQXzR3RRAB",
            "text": "they should just close down if they can’t read or follow directions. Every single time I Oder online they send boneless wen I Oder bone in   Is like they don’t care cause they think people not ganan go to the store"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaU9IYV9nRRAB",
            "text": "I literally ordered from here and they refused to give my order thinking i was scamming. I had to refund the order in front of them and they did not care at all."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaW8tazN3RRAB",
            "text": "Por el servicio estaba busy y sólo avía una persona atendiendo tomando la orden."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eDhySkVREAE",
            "text": "Ordered through wingstop order never came dont eat here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bnNiTXhBRRAB",
            "text": "Literally ordered my food an hour to show up and they didn’t even start making it but DoorDash said it was ready for pick up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dU9YSktnEAE",
            "text": "3rd time ordering from Grubhub , I got a large fried corn each time & instead they sent me FRIES !! Which I cannot eat ! If an item is out just cancel the damn order or mark it out on your third party sites . SIMPLE !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Z2EzcmpRRRAB",
            "text": "BEST WINGSTOP IN MY HOOD!!! ALWAYS FRESHLY DEEP FRIED & SERVED 2 PERFECTION"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eG8zSnN3RRAB",
            "text": "In this place there is a lot of disorder, it looks like a nightclub, loud music and inattentive and arrogant people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObC1paWR3EAE",
            "text": "I placed an order online for my daughter to pick up in store and get her food . When arriving at this location , my daughter calls me back states manager was extremely rude , place is disgusting , top it off he deny giving her the order that was placed via Uber and told her I needed to come from queens to get the order . I’ve never in my life ever went thru something like this or have I ever had issue when placing an order via Uber and manager tell you I can’t send someone to pick it up for me . It’s very unprofessional. There no signs anywhere that state this . It’s horrible experience !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNOMjkwTRAB",
            "text": "They stole my $60 dollar order.\n\nThis is my confirmation number #24056876139479040"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNjR1S2JREAE",
            "text": "I ordered garlic Parmesan wings from these guys &  I tried the  boneless and flats and both tasted like throw up , it’s like they just sprinkle a whole bunch of Parmesan cheese and no garlic , no sauce just dry Parmesan cheese wings 🤮 couldn’t even finish my food ! Had to throw it out 35 dollars to the garbage never again !!! 👎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcHVEYjZBRRAB",
            "text": "SO GOOD!!!!!!! 10/10 i got the lemon pepper and louisiana rub. DELICOUS PERFECT SEASONING AND EVERYTHING AND IT WAS HOT . THE FRIES WERE A BIT SOGGY BUT SOOO GOOD ASWELL AND THE RANCH PUT EVEYTHINH TOGETHER!!!!! all of these reviews are bad but honestly this food was amazing .( depending on the day wingstop has its moments )"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd3U2WWN3EAE",
            "text": "The wing are pretty decent, but the drinks they give you are ROOM temperature and the fries are WAY too salty and are disgusting. The cheese fries aren't actually cheese fries and they just give you cheese sauce for your fries. It's stupid. It was my first time ordering WingStop and will for sure be my last. Definitely not worth the price, so glad I got it for half off on DoorDash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbGJLSUJnEAE",
            "text": "This placed used to be okay but ever since last night I will never go back to this business ever again. Are the wings supposed to have feathers on it when you get your order because I got all my wings with feathers. That’s truly disgusting and disappointing again don’t support this place and I just read in the same reviews they found a rat tail so yeah that’s crazy I’m good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscnRtcF9RRRAB",
            "text": "First time and this place smells like fry rats instead of chicken and fry’s and the food was burnt horrible just try the 9 bucks combo and never again"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcU1HN21BRRAB",
            "text": "Not the best location, as of now thanks to covid, the place is still clean. Take out only for the moment. Staff are patient, but I expect that to diminish once the city opens up at full 100%. The wings are good, but expensive. 6 little wings with fries and a drink for 13 dollars. Geez, thank God they give lots of fries. Good luck trying to find free parking, your best bet is to pay 4 parking and then walk a few blocks to the location. Or you can go by bus or train."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2a2JXbEx3EAE",
            "text": "9/1/21, My first time at Wingstop, menu was easy figure out. Choice of heat was described along with dipping sauces.8 Chicken vignettes come with 🍟 and drink $15. The fries reminded me of five guys and they forgot my drink. I will definitely come back for the fries.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbzVhbVFBEAE",
            "text": "Great customer service, so let’s start there. This was the second time ordering a Diet Coke from this location. Although you can’t taste what I did through a photo, rest assured it is not mixed well and is extremely watery. The mango…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLaXByN3RBRRAB",
            "text": "This location is cool. I work down the block so I placed my order an hour before my lunch break, and yes it was ready when I got there (literally sitting on the rack just waiting for me lol) 😋 the wings were crispy and the Louisiana rub…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbDlTOFRBEAE",
            "text": "This place I give it a star only because there is no way to put a zero so disappointed me and my wife ordered from here and we waited a hour for them to give it to the uver driver and the food wasn’t good at all it was salty and a lot of…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdC1DVWVBEAE",
            "text": "Some workers here have attitude. Only place that can't switch my fries for corn. Messed up my order a few times."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeHVDVm93RRAB",
            "text": "Every piece of my order was wrong. I wanted an hour for my order just for it to be all wrong. I ordered 2 Cajun meal deals and all I got was boneless Louisiana rub, none of the add one the combo was supposed to have. Replaced fries with corn?????? I didn’t even get any of the drinks I ordered. This place is absolutely incompetent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbnFPTG93RRAB",
            "text": "Firstly the Customer Service at this Location is one of the worst I have experienced. The girl at the register was so Dry and Dead energy it made me not even want the food. Her energy alone was disgusting so I should have known. She just…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1LU9lc1pREAE",
            "text": "This visit was very disappointing. Waited 40 minutes for ten wings. There were about 15 uber drivers upfront complaining and waiting for their pickups. New walk-in customers were told that they couldn't order because they were too backed up.  Outside the store filthy inside young workers with poor customer service yelling every order 30 minute wait. My food cold by the time I got it and the fkat soda it came with made it even more unappealing. Friday night not a good time ti eat here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MWNtTE13EAE",
            "text": "Absolutely horrible service. Food was missing from the order. Corn was green from the box of fries being placed on top. Buffalo sauce all over the wing stop bag because no one cared in how they placed our food. We spoke to the “manager” but…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bFpTLTR3RRAB",
            "text": "Horrible experience. I made an order over the phone and they told me 25 mins but I had to wait 45 minutes. I said okay I understand because they're busy but once I got home I see that they didn't give me ranch, forgot my fries and gave me…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMktPZS13RRAB",
            "text": "These people are thieves, and as usual running scams. They don't offer DELIVERY AT ALL, they run it throught DOORDASH, when they mess up the order or don't deliver it and they have charged your card, they will give you the run around how Wingstop is not responsible for the delivery you have to call Doordash, who in turn says they don't have your information because it was done through Wingstop, so you have to go back to contact Wingstop again.\n\nSo they will cancel your orders and then when you ask for your money back, they will give you what they want not what you paid and they took from your account.\n\nNowhere on their app it says that their delivery is run through Doordash, or that they are not responsible to give you your money back if Doordash (their chosen partner in business) doesn't deliver your food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOG9qSnBBRRAB",
            "text": "Workers are NOT ready to handle a large amount of people yet, it is a newly opened location. The food was excellent despite having waited 50 mins for 3 order of wings. Again, the food was amazingly delicious. Would still go eat from there again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LWRfc05nEAE",
            "text": "Gave them a 2nd try. The wings are greasy, they will probably mess up a minor part of your order (forget sauce, switch out diet dr pepper for a bottle of water) and honestly they are pretty expensive (the size of their tenders is quite…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxd1picUdBEAE",
            "text": "OMG the worst fast food i have ever eating in my life, even my 8 year said to me mommy this is horrible,  the chicken was tasteless with too much sauce  french fries soggy and unsweet tea had was too sweat. I don't know if is this…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaWJXTHZnRRAB",
            "text": "Terrible wingstop to order from. They're terrible at counting boneless wings in an order. I ordered 20. How did I get 16 only? Also, if you order any brownies, they won't give you any. I've ordered from them on uber eats twice already."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdEpXQ1lBEAE",
            "text": "They hardly answer the phone. And three times when I placed a order here I was missing stuff. I like the food better than another wing stop I tried. But I wish management was better with handling customer concerns and needs."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMnVyUHp3RRAB",
            "text": "Came into get a gift card as a stocking stuffer for my son since he frequents Wingstop after school. None of the employees knew how to assist me. Additionally the wait time is always a minimum of 15 mins and that's if you're lucky."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NXUzYk1nEAE",
            "text": "The manager Oliver is a very unprofessional and disgusting excuse for management. Called to complain about my order being incorrect. And he has the audacity to tell me that he will not issue me a refund because I called already to tell them…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNnZPUzBnRRAB",
            "text": "This place takes almost as long to serve your order as the year they took to open after being built. Be prepared to wait 45 minutes to an hour to be served. Beside that, due to covid there is no indoor seating, the place is quite small and…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbzhXbUdnEAE",
            "text": "Siempre he pedido aquí, pero tengo un par de quejas. Una, las alitas de ajo, parmesano y limón y pimienta apenas tienen condimento y están blandas o secas. hoy tuve que esperar 45 minutos mientras las personas que vinieron después de mí recibían su pedido rápidamente. sabores mediocres de comida fría pero la calidad de las alas es buena. También hoy arruinaron mi pedido, había pedido cajún y pimienta con limón y solo obtuve pimienta con limón y no obtuve ningún chapuzón. ¿Sabes lo difícil que fue comerse esas alitas secas sin salsa? las patatas fritas vudú tenían más sabor que las alas. tuve que untar las alas con salsa picante para comerlas. Recomendaría otros sabores que no sean limón, pimienta o ajo parmesano o que se pongan alitas en otro lugar. Ah, y la Coca-Cola Light es repugnante, sabe a agua mineral diluida, pero cualquier otro sabor está bien."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydDlIVlpBEAE",
            "text": "The chicken tenders and fries in the lunch combo were oily. Tasted like they used the same oil all week without straining the oil. I will definately not eat at wingstop ever again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeHZ2amlRRRAB",
            "text": "Short-staffed, improper deployment, constant bottleneck. Even if you ordered online be prepared to wait 20 minutes to pay and receive your COLD food. The 2 stars given is because the food is good, everything else is poorly executed."
        }
    ],
    "reviews_count": 73
}