{
    "name": "Taqueria el Tanque",
    "place_id": "ChIJU_dWzW71wokRv2g-vQGWKxA",
    "grid": "BX1",
    "address": "260 Brook Ave, Bronx, NY 10454, USA",
    "rating": 4.6,
    "user_ratings_total": 32,
    "phone_number": "(347) 269-8237",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weE1UTlhORkUzYTBaT1psQXRkWEZGT1VJeFpVRRAB",
            "text": "The carnitas, chorizo, and al pastor were all flavorful and juicy. That said, they really need to double up the tortillas; everything fell apart halfway through.\nThe lengua was just okay, and it was oddly $5 even though the sign on the wall didn’t mention any price difference - VERY misleading.\nAlso worth noting: they don’t serve beer and wouldn’t let me use the bathroom. For $24 worth of tacos you'd think they'd be nicer."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMVQxTjVkRGR5WjJoM0xWRXpiRTVzWmtnNFprRRAB",
            "text": "LA COMIDA DELICIOSA. ISAURA LA MEJOR."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OblJVY3dlamw2WjFGUlVFOVNRVTFzT0haRVFsRRAB",
            "text": "The food is delicious but the service is terrible. I called to place an order to pick up, in which I asked the FAVOR if they could make me the nachos without onion (as I had already eaten it several times before), they explained to me that the guacamole had onion, to which I said it was fine, I just didn't want the onion apart mixed with all the preparation of the nachos and cheese; they confirmed that it was fine and that it will happen in 15 minutes.\n\nUpon arriving at the place, the women mocked and replied that they had no order, despite showing them the evidence of the call and their number, they did not offer to prepare it either.\n\nI was already used to them never saying hello, so bad!! The food is delicious!!! But the attitude of women is very bad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaU1XMXFTbXhYZEhkd2RXdFBVVlJpUjFGWVkyYxAB",
            "text": "My favorite Mexican spot in the area the words I can use to describe the food are consistently good"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdmRWTnhXa0UzUTNVeVZqZFdSRGRHUmkxVGFVRRAB",
            "text": "Bueno bonito y barato siempre pido delivery."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTWFpMWFTM3AwYlhsdWMyWk1TRGhUVVdwbk5GRRAB",
            "text": "La torta milanesa con todo !  Vale la pena !  ES UNA TORTOTA QUE OMG !! PRIMERA VES QUE COMPRO PERO POR SUPUESTO QUE VOY A REGRESAR 😊"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOS24wTWFvMm91ZWZBEAE",
            "text": "Bn rápidos y precisos,bn atenciones"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb2UyQVFBEAE",
            "text": "El mejor servicio que puede aver"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveXN1cGFBEAE",
            "text": "Delicious Mexican food. I highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveXF1djZ3RRAB",
            "text": "Best food I ever had. Recommend it to try it out 👍🔥👌"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMzh2cGZBEAE",
            "text": "Best place to eat . You will Feel like you're in Mexico"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNkstSFpnEAE",
            "text": "The tacos (carnitas and al pastor) I ordered were dry, very disappointing. The toppings for the taco were lettuce, white sauce and cheese."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LUlTbE5nEAE",
            "text": "Hand made tortillas, good size of tacos and nice salsas. The service is very friendly and the prices are good. I will definitely return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQa3JUai1nRRAB",
            "text": "Saw this place on Google maps with 5 stars so had to try it out. Now I know why it has full ratings. Never in my life had I ever had tacos this good. Usually the meat is very chewy and dry. The steak tacos were cooked to perfection. The lady also was very quick to take my order, didn’t have to wait very long. Great service."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMHNiQnNBRRAB",
            "text": "Muy rica la comida,muy recomentado"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNXBYRDVRRRAB",
            "text": "La Comida Riquísima.\nEl servicio es excelente.\nRecomendable!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb19iQlZ3EAE",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\n**Amazing Tacos and Authentic Mexican Flavors!**\n\nTaqueria el Tanque is an absolute gem! The tacos are delicious, with fresh ingredients and perfectly seasoned meat. The salsa and guacamole are out of this world. The staff is friendly and the service is quick. The vibrant and cozy atmosphere makes it a great spot for a casual meal. Highly recommend the carnitas and al pastor tacos. I'll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybzViMzhnRRAB",
            "text": "Their beef rice bowl with home made tortillas was DELICIOUS!!! They’re new to the area but definitely not new to flavor. Will be ordering more from here. There’s outdoor seating as well, which was convenient. Friendly service as well & fair prices!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMal8zNHhRRRAB",
            "text": "The Mexican style steak I had on 7/1/2024 oh my goodness. Dios mío. So fresh and the tortillas are homemade!!!!!! I don’t think I’m gonna go anywhere near or else. EL TAQUE ES BUENO. Oh my. Gracias."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkZ1B6UkVREAE",
            "text": "A great place for homemade food, tacos, nachos, breakfasts and different options with flavor, quality and freshness.\n\nEl Tank Taqueria offers a very cozy and quiet place to enjoy eating there.\n\nThe service of the cooks is very cordial and friendly and always aware of what is missing or what they need.\n\nI highly recommend the tacos 🌮 the particularity is that they are made with handmade tortillas.\n\nThe other delicious and varied dishes create endless options so you can enjoy with your family on a weekend or during regular days.\n\nThey have a delivery service and regular applications. I highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdHFPVFJ3EAE",
            "text": "Stumbled in here after I saw it got a huge renovation! Such a lovely and intimate spot to eat some great tacos or even nachos.\n\nMy partner and I came in at around 6:30pm on a Monday and it was not busy at all. We sat at 2 stools and decided to dine in, the cooks were amazing and friendly. No wait staff, but the people making your food make sure to bring out your food and check on you.\n\nThe prices for what you get is honestly amazing, super affordable to eat in here and you will not leave hungry. We got the steak nachos and their tacos on special carnitas. I personally thought the nachos were pretty good, my only critique would be that it needed a bit more ingredients spread within the nachos like cilantro, onion and tomato. My bf said that his carnitas tacos were okay, but the meat was a bit dry.\n\nAll in all great flavor to the food and such a great atmosphere. Will definitely come back to try other things."
        }
    ],
    "reviews_count": 21
}