{
    "name": "Hong Kong",
    "place_id": "ChIJG2HxIMn1wokRuE9HGSnWVaQ",
    "grid": "BX1",
    "address": "610 Melrose Ave, Bronx, NY 10455, USA",
    "rating": 4,
    "user_ratings_total": 222,
    "phone_number": "(718) 993-9988",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYU5IbHRVbHB2VGt3dFYxQXhWSGc0YmxGaFpIYxAB",
            "text": "I wanted to like this place because I was told it was good but I ordered a beef and broccoli and the beef was so hard and chewy, and I had an after taste after like soap"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMVpqZzBiVEZTT1hnMlYwTXdjR2s1YVRaNVJHYxAB",
            "text": "Tardan mucho en contestar muy mal servicio"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNVExOTJMV0pQTTJWSlVWaFRhVGRZWmpVdFJrRRAB",
            "text": "I called ahead and waited 45 minutes before arriving and they cooked the food for two seconds and tried to charge me for half the food I ordered as if I didn’t know what I said . I did not even waste my time giving them the cash. Walked out."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMV9IR1NBEAE",
            "text": "I had the General Tso’s Chicken — and it was great. Just $10 for lunch with plenty of chicken, super crispy with a sweet, tangy sauce. Came with a generous wonton soup on the side too.\n\nPretty decent overall — and delivered for just $1. I liked it 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTFQwcks1dE9tWE9REAE",
            "text": "Great food people and environment"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdVVpZGE5bTd6cFF3EAE",
            "text": "This is my favorite place too as well they have great customer service The prices is right."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRa2RMTmVBEAE",
            "text": "Ordered a roast pork with broccoli.  Barely any pork."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcXJPVzlnRRAB",
            "text": "My family often goes here over the closer Chinese spot because the food is way better and the service is very friendly.  It's also cheaper than my closet spot so that's obviously a win in this economy.  I'm surprised I haven't reviewed them before given how often we order from here.  We usually get some combination of Sesame, General Tso's, and Honey Chicken,  Chicken Wings, and Lobster Egg Foo Young."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbU1iaWpRRRAB",
            "text": "Best Chinese food around this area"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX3J6VVF3EAE",
            "text": "My number one go to spot if I want Chinese"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3M3NuTkhnEAE",
            "text": "Excellent cuisine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzek0tQTlRRRAB",
            "text": "Fell off completely."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdnFIdGtnRRAB",
            "text": "I love this place great service amazing food for reasonable prices! What more can you ask for💪🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMGFyZXBBRRAB",
            "text": "Horrible food with no taste. I bet that is frozen food. I gave it to my dog !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN19McUtBEAE",
            "text": "They serve the best food in the to8"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcTdDazF3RRAB",
            "text": "Tienen que probar para entender que no se van a arrepentir"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibTZ1V0FREAE",
            "text": "Terrible service, disgusting place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeG9fbUdBEAE",
            "text": "I ordered from here yesterday. It used to be so good, but I’m not sure what happened. I ordered shrimp and broccoli, and the shrimp smelt so fishy and tasted so bad, I couldn’t finish my food. My food was entirely bland. Even the other dishes (the chicken wings and sweet plantains, chicken wings and French fries) were bland, dry, and just overall not good. The only thing that was, was the garlic chicken wings, but that wasn’t enough to save anything.\n\nNot only that, but delivery took over an hour. I was going to end up cancelling (which I should have done), but I wanted to give them a chance. They didn’t want to provide me the delivery persons number despite me asking. I won’t order again from here. Seems like I’ll just be fond of the memories of it being good in the past rather than what transpired last night. 50+ dollars, absolutely wasted."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUM3ZlcXBBRRAB",
            "text": "Food has no taste at all! Broccoli was not done garlic sauce was not good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa19pcEJnEAE",
            "text": "Food always comes hot and on point. I usually order the tofu and rice, but the vegetables soup is just what you need when you’re sick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELWRfZFNBEAE",
            "text": "So love this place great people! Been coming here for over 5 years now maybe more lost track but best spot in the area! Great food always!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbVB1b0pBEAE",
            "text": "Best chinese food in the area.  Kung pao is awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0dklLVmNBEAE",
            "text": "This place is great everything fresh it’s a 100"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0aE1pSFpBEAE",
            "text": "Stingy with pork. Had the black bean and it was nothing but veggies and 5 pieces of pork."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOejZmQzRnRRAB",
            "text": "The sesame chicken was okay but we waited 1 hour and half for our food to arrive and when I called she had an attitude."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNS1lektBEAE",
            "text": "The food and service is great .the atmosphere as far as the settings , it's a small area  . I guess since the pandemic\nTheir was no single seat for me to sit on but there was a bench I could have rest my plate on a table near by put found it more convenient to placed it on my lap.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGNmFHNlZREAE",
            "text": "They don’t come upstairs to deliver they make you come outside. The point of delivery is to not have to come outside . Won’t be ordering  anymore"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1dDlPTWlBRRAB",
            "text": "i just love the food ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaX01Ud1FBEAE",
            "text": "it’s so gooddd"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadUpxMVRnEAE",
            "text": "La comida es exelente tiene un buen zason"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneFliR2dBRRAB",
            "text": "Still one of the best tasting chinese restaurants in the area."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdWJPdnZBRRAB",
            "text": "Clean and great service and good food for the whole family. Definione of my places to go"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dTlmS0lREAE",
            "text": "First time visiting this restaurant and the food is really fresh and delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dTZyd0ZnEAE",
            "text": "good food but i’m always finding something in it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScThXRnNBRRAB",
            "text": "Order my food was in and out with not time great nice and neat place with a great location up in Harlem."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbVp5ZmVREAE",
            "text": "Best Chinese food I've ever had. Them ribs are off the hook!! I love love love this place!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcllMSUl3EAE",
            "text": "They're just great I love to go there because there's not too many real original Chinese spots anymore they're the best"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPenJMY3FnRRAB",
            "text": "Love there food here I always order different foods and the taste is on point. One of my favorite is moo shu pork but you got to get it early there always out. I wish they had the other tacos to go with the moo shu pork as there tacos break easy but it’s still good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNzRQbk9REAE",
            "text": "Its an ok place."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbV9EdHpRRRAB",
            "text": "Es la mejor  comida china que he comido 🤤…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHM2RYeDNRRRAB",
            "text": "Good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2LTRUTlhREAE",
            "text": "Jesus christ lord god amen.†"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OE9UcVJ3EAE",
            "text": "Pricing went up and service when down, last 3 times I've ordered food was extremely late, and wrong and they were nasty when I inquired about it. Really sad"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NXRHQ3lRRRAB",
            "text": "The food was horrible. I ordered sesame chicken It was so hard I couldn’t chew. There was garbage in my bag upon delivery the worst experience ever. I will never order from there again. How do this place even have 4 stars"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2b0xlVjh3RRAB",
            "text": "The WORST \"CHINESE\"TRASH FOOD EVER IF U LOV UR LIFE DON'T ORDER FROM THERE PLEASE DON'T the food looks like 3 days after 🤢🤮…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMXZEMzR3RRAB",
            "text": "Really good service and good food"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhOExUaGZREAE",
            "text": "No a quick service 👎🏾\nI tried to order online. They totally ignore me🤨…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOTVPR1ZnEAE",
            "text": "My first review since the start of COVID-19. Never thought this year will be so much different. Anyway, I was pretty bummed that a lot of places had to close down but I am happy that that this Chinese restaurant will live to tell another…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLczZ5djdRRRAB",
            "text": "I ordered crab sticks and found a piece of plastic inside of the meet people please be careful with your kids ."
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncU5qRkRBEAE",
            "text": "For six dollars, you can get a variety of choices from the lunch special menu, with your choice of rice and drink.  You also get good portions; often, I have leftovers to eat for the next day, or choose to share.  For those who are health conscious, they offer some alternatives.  Most of them are steamed vegetables and meats.  Overall, most of the meals are decent to good.\n\nThe decor is not great.  While there is a place to sit and you get a decent view outside, (which is better than most fast food Chinese restaurants), it is only a few seats by a window with plastic chairs.  It is okay if you must sit down for a second while shopping in the Hub, but don't expect to bring a date or a group of friends here.\n\nFor service, you do not have to wait long for your food for short orders; more complicated meals will take time.  They also deliver in the neighborhood within a reasonable amount of time.  Make sure your order is clear though when ordering over the phone.  While I have not tried it yet, they also offer catering services.\n\nOverall, it is a good place for a quick meal on the go, and the service is good."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnajlTZzZ3RRAB",
            "text": "My favorite Chinese food restaurant in this area. They are one of the few that have brown rice on the menu, delicious food, and delivery is always on point. They don't have a real sitting area, but take out is fine for me."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjaF9URkd3EAE",
            "text": "Ive been a customer for over 15 and have moved 3 times. And still have them deliver food. Always hot and delicious. Only take out chinese place I’ll eat from. Not saying others are bad just as a personal preference for me they’re the best 😊…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNHVtRnpnRRAB",
            "text": "I order food a lot in this place and they give hard a time with a free can of soda, I always order the same food and my total comes to over 15 dollars, this one time I ordered my food over the phone and forgot to add an egg and One time I forgot to put an egg and the man on the phone was complaining about “no can of soda” but when I always order from there I get a free can of soda with anyone else on the phone. I added an egg to make sure my order was over 15$ and he still charged me for the other can of soda so I just left it like that, so don’t ever ask for a free can of soda because they will have problems with you over the phone and u will have to argue just for a dumb soda I do not recommend to get a free soda from them it will cause complications and they will spit in your food just for a can of soda."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBN05lMUpBEAE",
            "text": "I have mixed feelings about this place.  I honestly have a love hate relationship with this establishment.  Kind of like staying at a two star hotel during the Olympics in Sochi.\n\nIt can get pricey.  I don't mind expensive as long as I'm getting quality.  The quality really didn't stand out. To me it seems like you're paying for the ambience and not the quality of the food.  This can be a bummer if you're hard-core foodie.\n\nI won't lie this place is beautiful!  I love the decour.  I would give this place 4.5 stars for the decour alone.  This place gets off the riche vibe like you should be served caviar off a 24 karat gold plate with an ivory spoon. I would give this place 4.5 stars for the decour.  However one cannot survive on ambiance alone.\n\nOkay now the food.  Borscht is one of my favorite dishes.  I will take it above any other dish that is offered.  There borscht was okay, I had higher expectations.  The Chicken Kiev have and the beed stroganoff was ok.\n\nIf my daddy had me up with the trust fund, I had a rich ex-husband,or sugar daddy you can bet I would definitely eat here often !"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aU1pMEFREAE",
            "text": "The food was very good. The delivery was quick and the food was delivered 30 minutes after the initial order was placed. I will definitely order from them again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnczZUTDhBRRAB",
            "text": "Very racist place... I’ve had delivery here many times and now they refuse to deliver to my house which is literally 10 minutes away.  They now swear that they have never delivered to my address. I will be reporting them to the Better Business Bureau."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpczQzZjlBRRAB",
            "text": "Straight trash food is disgusting. The wings tasted like fried soup i don't think they change the oil very often definitely regret eating from there."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX0w3TXZBRRAB",
            "text": "So far so good. Actually their wonton soup is the best i had in years. Thr soup was a nice color lite brown. Not like some some ehen it looks like chicken noodle soup & i got 5 wontons."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTN2Q3SEZBEAE",
            "text": "I call for delivery at 8 pm, about 9 pm I call to see what is going on and they told me it was in the way... At 9:50pm I a call again and they said that I never ordered or call them. I work in a parking garage and I can't go for food,…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMzh5SFZnEAE",
            "text": "The food was good however my issue was going in I never saw the freezer until recently it is beyond filthy it looks like the ones from the hoarders show. Totally unsanitary."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cV9IczFRRRAB",
            "text": "I love the service they are so friendly but sometimes just sometimes the rice is a little under cook , but everything taste great"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMmJyUUVBEAE",
            "text": "I’ve been ordering here for years, great service and food is always on point. 732 😊…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMmJiaGdRRRAB",
            "text": "The food is good and the lady love me there"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwemZueFFBEAE",
            "text": "The food was a mazing but it took over 20 mins to make just one egg roll."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbzYyRmZ3EAE",
            "text": "Love the food, the taste is good, when the wife dont want to cook, this is the place i turn to, to eat"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBM3FtRWtBRRAB",
            "text": "The meal is absolutely delicious. I would recommend you to my family and friends"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbm9qT3F3RRAB",
            "text": "It’s a pretty good place, I always order from here. Great CService 👏🏼😉…"
        }
    ],
    "reviews_count": 67
}