{
    "name": "El Justine",
    "place_id": "ChIJ4a2DiDr0wokRwodI5zgIhIk",
    "grid": "BX4",
    "address": "40 E 167th St, Bronx, NY 10452, USA",
    "rating": 3.8,
    "user_ratings_total": 568,
    "phone_number": "(718) 538-2100",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaExVMVhVMVI0UW10cldFMWZlVlZ2VEY5SmNYYxAB",
            "text": "I used to love this place as a kid. Ordering and dining in from here was a regular thing for me. They still hold up but sometimes their portions can be small or their chicken is not good. But majority of the time, their food is really good and I would recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUVFreERRbVpHT0c5NFJHNHRSVFoxVlY4eU9FRRAB",
            "text": "Delicious 😋 😋"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaFVXc3labU56WldKSGQxOW9XVXhmVGpsaE5uYxAB",
            "text": "Es mi primera vez comprando aki Acabo de comprar pastel en hoja de pollo y plátano y me vendieron de ahuyama ellos le venden lo que ellos quieran no los que el cliente desea la verdad que muy mal el servicio ala compra ustedes tienen que mandar lo que el cliente pida no lo que ustedes quieran porque no es ustedes que se lo van a comer y el pastel todo aguado con trozo de ahuyama la verdad que muy mal waooo la comida es horrible aki y lo siento por esa palabra pero es la verdad tienen que tener más higiene acabo de ver los review y la verdad que si hubiera sabido no compro ni una agua lo siento bye no compren aki oh compre y que le caiga mal la comida bendiciones"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbmFpMDJOakpLWTNoSFEwWk9WRWxuVFY5MFVuYxAB",
            "text": "Food a little spensive compare to other restaurant sometimes there no space to sit down"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU1VITlJZVU55V0d0aVFWSkRhbE40U2xWRVNXYxAB",
            "text": "A lot of rice, the meat was burned. Wasn't worth the money"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadkxWRnhkalEyU0RCV1RscGZZemc0ZEhoMExYYxAB",
            "text": "Set at the very « spiritual » heart of the Bronx, going to El Justine will make you feel like being part of a 70’s B-list blockbuster. Reaching the restaurant requires a stroll on Jerome street, right under the tram’s rail, as sparks are shooting off when trains pass over in a tremendous chaos. Don’t mind the very noticeable smell of magic tobaco from unofficial vendors laying their merch on improvised displays or the locals firing up unapologetically a Bob Marley as you make your way. Once you finally reach El Justine, the interior feels like an oasis, giving a well deserve break to patrons that dared brave the experience of Jerome street. Food is home made, honest and tastefull. A choice of daily soups and several Dominican dishes are available. You can either order take out (and run out of the neighborhood !) or sit comfortably in the dining room, enjoying the action outside through the large windows. Jokes apart, the place deserves several stars for its authenticity, great service, good food and great prices. If you wanna say you visited New York, go to the Bronx ! Then it’ll be true."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdGIwY3RaRXBvVm1FNVVXSmFZekpVWVhaVmJVRRAB",
            "text": "😔😔 No saben cocinar ellos tienen el peor mofongo de New York, hacen el mofongo con el desperdicio de todos lo que frien en el aceite  y te enviar grasa del guiso para darle sabor porque Tampoco tiene saber su comida perdi mi dinero 😔😔"
        },
        {
            "date": "수정일: 2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJX2VYLTd3RRAB",
            "text": "Lieu convivial et nourriture top les portions sont généreuses et le personnel sympa."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1QxWXhObWxqV2t0TU5EaG9jMVZyTmpReVlXYxAB",
            "text": "Fui con mi amigo a comer allí y toda la comida menos el arroz estaba totalmente desagradable tenía sabor a comida del día anterior no volvieras a comer allí"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVWFYRTBNRTh5U1RFME5UUndaR1p2Wm5OcVFWRRAB",
            "text": "So amazing food, mi primera vez probando comida dominicana, delicioso todo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMWIzVmxPVVZtWDBOR1FrVlpiRlJDWjFCNGRtYxAB",
            "text": "The rice, beans , and salad was good, but when it came down to the whole chicken, it was overcooked, smelled a bit burnt, and parts of the chicken were hard to bite into and chew."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scE5FRXdjVlpKUVhaT1pUUk1OM1ptUWpBMFRWRRAB",
            "text": "I have to agree with the previous comment.\n\nDon't spend your money here because they'll just serve you two sides as a main course and the main course as the side.\n\nI'm extremely upset that I didn't check the food I was buying and I ended up buying what I didn't bargain for.\n\nThe lady just smirked at me like she finessed someone from SharkTank or something....\n\nAnd then they say LUNCH is the same price."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMWDVvYkdubHMtTTdBRRAB",
            "text": "Don't waste your money on this restaurant. A molsilla that is just rice and tastes terrible"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNZkNyYnlGa051UUl3EAE",
            "text": "great food . especially the soups . good and clean atmosphere.  the service was great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaGQzN2pnRRAB",
            "text": "The food was dry over cooked"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNnJPb3NnRRAB",
            "text": "I ordered Chicharron de pollo con hueso with white rice and beans. Like 6 little pieces of chicken actually had meat on them and like 15 pieces of just fried skin . They got me good 😤"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRczl2MEl3EAE",
            "text": "Service was good, but food was overpriced (even by New York standards). $21.50 for lots of rice, a few beans, two small and very dried out pieces of chicken, water and flan."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROE9mMXdRRRAB",
            "text": "Wanted something quick and easy and avoiding fast food options.  I received a warm welcome and very friendly service.  The chicken linguine in red sauce was very tasty."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbjdfcV93RRAB",
            "text": "The food definitely fell off ! I ordered white rice & beans with baked chicken and it was absolutely nasty !! Two bites and to the trash it went . The costumer service was absolutely terrible. I ordered then went to pay and had to wait like 15 minutes for my food because I asked the guy that originally took my order for two pastelles he decided to ask a different guy who had a nasty attitude and didn’t want to open my pastelles . Now I’m on the toilet 🤢 that food was very disgusting. Don’t deal with my food if you have an attitude. I won’t be coming here ever again !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNFk2X3ZRRRAB",
            "text": "Good food"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcExTRlVBEAE",
            "text": "La sopa de marisco 🤦‍♀️lo peor de todo el bronx , yo no sé cómo van a ese lugar no saben hacer nada…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MXVhYm5RRRAB",
            "text": "Horrible Food & Staff I had a plastic piece of wrap inside my soup horrible I wil not recommend @ All save your Money"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaXBlaW1nRRAB",
            "text": "Good  food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ01Xd3h3RRAB",
            "text": "I just ordered a chicharronnde pollo, taste it like fish not crispy at all. The potatoes salad is more like a carrot salad. I just waisted $34.00 dollars."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaDlIYk9REAE",
            "text": "Es una basura de comida compré una y fue un desatre muy recomendable no comer hay. La comida es muy mala aquerosa"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdGQ3dkZREAE",
            "text": "That baked chicken was the saltiest burnt chicken I have ever had. I couldn’t eat it. I threw it in the trash. Waste of money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNV9YeEVREAE",
            "text": "What kind of Latino food can't I get (easily) in Poughkeepsie? Dominican tripe soup! The beany tomato base was accented perfectly w/ squeezes of lime juice. A nice nibble & sip for a trip to a part of the Bronx that I usually don't visit."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbjZXbWJBEAE",
            "text": "El restaurante de mi barrio muy buena comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNjdXYVlnEAE",
            "text": "I have been eating at El Justine for many years, before the fire and after.  The quality of food has declined.  I keep going back hoping they were having a bad day.  I'm done.  The mofongo is dry, and old.  Even the yellow rice is soggy and lacks flavor.  I won't be going back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudEtDYXNBRRAB",
            "text": "Muy bueno, me dejaron usar el baño, el\nBaño estaba bien limpio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucmRpak53EAE",
            "text": "Honestly the food was not great . I ordered the bake chicken with rice and beans and it was definitely lacking seasoning ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcHRtVTNBRRAB",
            "text": "excelente comida me gusto"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM0xfRlhBEAE",
            "text": "The food was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidl9PWUJ3EAE",
            "text": "I don't know what happened but the boneless chicken chunks do not taste as good as they used to. now they seem to have no flavor. what happened? who was the person seasoning them 4 years ago when i use to order from here during the pandemic in 2020. the flavor was on point then. now it just tastes bland. and the white rice is always very oily. the worst is when i ordered a meal of boneless chicken chunks and it wasn't from breast meat. since when? the boneless chicken chunks were always from breast meat. if you're going to change it up and use thigh meat, let people know. or give them the choice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaGFyQWVREAE",
            "text": "Great Food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidk9LVUlnEAE",
            "text": "dry rice dey chicken not good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydFk3TWJREAE",
            "text": "Delicious food and very affordable"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyX3REY1ZnEAE",
            "text": "Buen ambiente buena comida cervezas frias atención muy amable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN0p1SThBRRAB",
            "text": "Chicken was dry"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNmJidTJBRRAB",
            "text": "Buenos"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNm8tUXhnRRAB",
            "text": "Son uno estafadores y te cobran lo que quieren,  ni los dominicanos tendrían que ir , manchan a los latinos , y después nos ven mal a nosotros cuidado en la carta un precio, después te cobran otro"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MGJiWU5nEAE",
            "text": "If you’re not Dominican they treat you as if your money isn’t good enough and Jack up prices 5-10$ and will offer you side dishes pretending to be a part of your meal but charge you separately for them and they Ofcourse don’t mention it. so BEWARE. It’s a waste of money. Never again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcXFLX2JnEAE",
            "text": "Right on the corner of my block, this is a dangerously close great restaurant. The food is great, with large portions, and the service is good and nice to see."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dEpUcGpnRRAB",
            "text": "Topical  Latin  food  !👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MUx6NUpnEAE",
            "text": "El Justine has been a staple in my life since I was 16. Great food & service has always been good to me. Glad they were able to reopen across from where they originally were. Ever in the Yankee Stadium area, I definitely recommend you stop by."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MWF5SlNREAE",
            "text": "The food is nasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6a2EzVVNnEAE",
            "text": "Eating good food."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c3ZhYUJ3EAE",
            "text": "Compré 2 arequipes guardados llenos de grasa y es comida vieja , 2 pastelitos y casi me rompo un diente fatal !! Lo único bueno los jugos ! Y estaba en las nubes gracias a la azúcar que tenían . Nunca más gracias"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNnRhWGV3EAE",
            "text": "This was my first time ever ordering from this place I will never get food from here again so nasty amd a waste of 40$ I ordered mozzarella sticks amd these people have the audacity to give me this mess with no cheese and it’s burnt up and hard I’m disappointed it looks very old ! I’m beyond pissed ima report this !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENC1fckl3EAE",
            "text": "This place is very clean and organized. We women are very respectful and nice. They do not pressure you into ordering like most Spanish restaurants . Jacinta wash was very attentive and detail oriented with the order. I have to have the card minimum to make purchase s she happens to give it to me instead."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNeE4tZ2J3EAE",
            "text": "역 바로옆이라 위치도 좋고 음식도 괜찮은 편입니다. 이 곳 사는 사람한테 추천받은 곳중에 하나에요"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNX3Jtb1hREAE",
            "text": "The food was excellent no complaints every thing we got tasted as we expected.  The portions were large and plentiful. We ordered a  family meal that also had a 2 liter soda included.  A great deal the other deals on the menu all looked…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd3RHakx3EAE",
            "text": "For a family meal that is little pernil( roast pork). You're just paying for a huge portion of rice and little meat that can't even feed a family of four. I now have to ration to make sure everyone gets some meat, at least. I just hope it taste good for 34.00 dollars but I don't think I'll buy from here again 😕 😔"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dk96RlBREAE",
            "text": "Excellent, dominican cuisine with a Caribbean twist,many familiar items, a delicious array of appetizers,  pastellios pasteles, Pernil asado, arroz blanco  habichuelas guisado, cabrá guisados y mucho  más, el ambiente es bien informal..uno tiene que ordenar y pagar, después te entregan el comida, La comida estaba deliciosa. Yo si volveré.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMTZpTDlBRRAB",
            "text": "One of my coworkers invited me for lunch because she usually visited it and it did not dissapoint!\n\nHad a very very good pernil with rice & peas, avocado and maduritos 🔥\n\nI wouldnt mind going back during work hours if into having some tasty spanish food - the place is very clean and well kept and the service is pretty fast and good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMlBIV3h3RRAB",
            "text": "Absolutely amazing! Stopped for dinner and it was such a hearty meal. Will definitely come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbnFxd0h3EAE",
            "text": "This food is way under priced. Amazing and it taste just the same if not better than when their restaurant was next door. It was an amazing feeling tasting that childhood memory ❤️❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeXBPSTF3RRAB",
            "text": "Was a regular customer.Dining in as well as getting food delivered at the old location across the street. Had good deliveries as well as Having issues with cold food, missing items, food getting delivered and spilled in the bag, missing…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMllYdHhBRRAB",
            "text": "y'all fell OFF idk if it's the same owners before the fire but i has a really bad experience..the food all dry like y'all gave me the end of day scraps and then my order was WRONG and my driver got lost and had me standing outside for 20 mins in the rain"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkc2NIV21RRRAB",
            "text": "I ordered tres golpe & it came with one piece of salam & one piece of fried cheese & no onions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OF9hdTBnRRAB",
            "text": "First time in Bronx and this was a place with great reviews, so we stopped by to try Dominican food. We were pretty disappointed with the food. Mine tasted like it had just been reheated in the mricrowave (parts of the carne with salsa were still cold). We asked for orchata which we’re told they had, and ended up with “jugo de ajonjolí”, which is not the same! The tostones were also cold and lacking salt/flavor.\n\nService was sub par. We told the staff we were new and asked for recommendations and she was not interested in helping out, simply pointed us back to the menu.\n\nOne of the bathrooms was so unkept it was not usable.\n\nOverall we paid $62 for a family of 4, and sad to know this was our first experience of Dominican food and service. We hope we have better luck at another place during our trip!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd3ZpZGN3EAE",
            "text": "Ordered for delivery, the person who picks up the phone is rude. Rice came under cooked and beef stew was a rock. This place was my go to but now service is just terrible. I recommend you go to other Dominican restaurants in the area and AVOID this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5a3Fya1F3EAE",
            "text": "The food had a true Caribbean flavor. Service was attentive and the atmosphere was pleasant.  The food actually gets 3.25 stars. It could have been served hotter, however. Would go again and I recommend for anyone looking for a nice, authentic Puerto Rican meal. Mofongo was excellent. The red beans were 80% broth. The pernil was tasty and tender."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd2R6Mjd3RRAB",
            "text": "I hate to leave bad reviews. Good service BUT!! The food sucked. Smeared with food coloring. Everything looked orange. We tried 2 different types of meat and both tasted old, like if it was reheated from days. The dessert was rancid. The only good thing we had was the rice and beans, oh and the coffee."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbl9yX0hBEAE",
            "text": "I recently had the pleasure of dining at El Justine, and I must say, it was a truly remarkable experience. From the moment I stepped foot into the restaurant, was greeted with warmth and hospitality. The elegant decor and soft lighting created an amazing atmosphere. Highly recommend dinning here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoLUl1ZzdRRRAB",
            "text": "I did not like the food at all. Their nachos was made with American slice cheese and dry steak, no authentic toppings at all. Their quesadilla was extremely dry. Their chicken cordon blue was undercooked. I will not be spending my money in this restaurant ever again. I’m sorry but their reviews are probably posted by people they know, cus it was not good at all."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeDQyU0JnEAE",
            "text": "GARBAGE! cheese isnt even fried right & they forgot the onions. 3 golpes comes with onions. Just terrible"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleGRLSHFRRRAB",
            "text": "So we started out walking & ended up at 161st Street at another place to eat (wont mention place) but after taking a look at the dried up food which was not appetizing at all we quickly paid for the coffee & walked to Justines. We had eaten 2x earlier in the week and was very satisfied both times. So we knew that tonight's meal would hit the spot which it did!! Food was fresh, alive & tasty. Our waitress was on point & kind. And the 3 brothers are so nice. Hope to eat there soon. No photo are too fast3😳😁😜"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybDRfOUxBEAE",
            "text": "Compre una bola de papa y a sacarla de la funds me di cuenta que habia una mosca adentro que ascooo, tengo anoo comprando aqui y hasta hoy sere cliente de ustedes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd3MtLTFBRRAB",
            "text": "Food was not good and the guy was so annoyed ,forgot give me everything. Pernil white rice beans were bland\nChicharrón de pollo was bland no taste over fried,tostones were tasteless I remember back in days food was great !!! Now it’s more like really basic trash Spanish food !!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRN1BpQXJBRRAB",
            "text": "Its your typical Dominican restaurant. I never sat down & ate here but I always you to order their combo meals to take out. The food is nothing to complain about. The meats are fresh & juicy. I always get the boneless chicken chunks or pork…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNnZtQXBRRRAB",
            "text": "Went to this spot to sober up after the game. The food was on point with the flavor.  The pernil was tender and juicy, the chicharron was crispy. But the rice and red bean was on an popping! I Recommend."
        }
    ],
    "reviews_count": 72
}