{
    "name": "Eating Tree",
    "place_id": "ChIJidlufy30wokRj886sDVQxhs",
    "grid": "BX4",
    "address": "892 Gerard Ave, Bronx, NY 10452, USA",
    "rating": 4,
    "user_ratings_total": 385,
    "phone_number": "(718) 293-5025",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlUzSmhSSGxmVmtwS2FtWTNVVEY1YmxoUGVIYxAB",
            "text": "Food is excellent and so is there service."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac00xaEdNR1Z3WVVwQmFIazNSMnhxZDFZM1FtYxAB",
            "text": "Best Jamaican food in our cozy neighborhood bu Yankee Stadium and in my humble opinion, the best Jamaican food ever 🙏🫶"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T2FqZFRPUzFIYkhaTFJYSk9TREp1VldaZmJsRRAB",
            "text": "Food was so nasty I don't know why the reviews are so good for this place. Maybe they changed the chefs here. It was supposed to be a nostalgic moment for my family coming back to the old neighborhood and seeing this place still standing even after covid happened. Sad that the quality, taste and prices are not worth revisiting. Flavas is worse. They used to both be good but we always chose here. Never again! Gotta go uptown and hit the real authentic spots #iykyk"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veGNGcHdjbGgzU2pWd1kzQkphbmx3VFV0RmVuYxAB",
            "text": "To sum it up, lack of FLAVOR. I came here for the first time with my out of state friend. We ordered rice, cabbage, sweet plantains, oxtail, and jerk chicken. The only things that they did not mess up in was the white and cabbage. The jerk chicken had the spice but no flavor. The oxtail was tender but again, the flavor. The Mac n Cheese, no flavor. They must’ve used the mildest cheese because absolutely not. I am honestly confused about the 5 and 4 stars because it was not good.  Maybe theres new cooks..Anyways, do what you do with this information."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM1FqRm5YMjFJZGtzeFR6UXlPV2M0WVdjdFZGRRAB",
            "text": "The food at Eating Tree is the Bomb 💣🤤🤤🤤🤤 and very tasty.... This is the best place to buy your food to take out ...."
        },
        {
            "date": "3달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BdFJrUkNkM05XV1RRNWIzaHhkbGxIU1VOWlpYYxAB",
            "text": "洋基球馆附近的牙买加餐厅，第一次尝试。炖牛尾骨好吃，汤汁配米饭非常下饭！另外一个烧烤酱烧鸡是一如既往的美式口味，不推荐，不适合亚洲胃。"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bFoyOTNlR1pMU0d4cVVESnBVVlF5Wld3NGRHYxAB",
            "text": "Great"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcV8zWkt3EAE",
            "text": "6/27/25 stopped in for a quick grab-n-go lunch. Chicken patty $4 and Mac n cheese $4.75.\nBoth really good!\n\n6/9/23\nStill the best meal in the BX!\n\nAlways good and fresh food made for you :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcWMycDNhV3hPV2pkb01sUnRWMmhVYzNwcVVVRRAB",
            "text": "Called to place a catering order and the guy was VERY RUDE! Told me I have to come in for pricing and to place an order for catering then hung up!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQZXhtYW5Fc1p1dUpnEAE",
            "text": "the food here is DISGUSTING . The chicken had NO seasoning and tasted very bland - the texture of the skin was soggy like it was boiled and just threw on a plate .Then to top it off the chicken was visibly pink inside . DONT waste your money"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMRzg4c3lEOHJtY2tBRRAB",
            "text": "I went a couple weeks ago. The food wasn’t worth the price. The ox tail was salty, not seasoned. Huge difference. The Mac and cheese was bland. Wont recommend this spot at all."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxX2JiNHBRRRAB",
            "text": "the food good mi nah lie, affi come bck"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYjV3TXl6bzRHSlFBEAE",
            "text": "5 stars service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJeXJ3dWZ0dHBLQXRBRRAB",
            "text": "Jerk chicken this weekend was great. Time before this was terrible. I have been here several times and it is seemingly hit or miss. Depends on who cooked the food. Jerk chicken, cabbage and plantains. All delicious this time. Hopefully it can remain consistent as its a treat when its good.\nTheir plantains are always good.\nPatties most times good…had a couple of misses. Too mushy on the misses. They actually don’t do too bad with mac n cheese which is a first for me from a WI restaurant. Its not great but its not at all bad.\nOverall, we will continue to support. The cashiers are always very pleasant as well…especially the young man…he is refreshingly delightful. IYKYK when it comes to the Jamaican spots…."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdjdmc0FREAE",
            "text": "Listen it’s worth the drive and money guys the customer service is top tier Daniel was so nice even over the phone he has such a nice aura and the servers are just as good not to mention the chef because the food is amazing good quality and quantity we ended up buying more then we wanted just because and didn’t regret it 10/10"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdDZ1dGVREAE",
            "text": "I had curry goat rice and peas vegetables my wife had ricin peas and steamed vegetables the  Food was very good I have been going here for years And we'll continue to I had the opportunity to meet the proprietor On my last visit It was very clear that he and his staff Take great pride in providing delicious food To the community  I highly recommend this place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2N3M3b1V3EAE",
            "text": "Don't eat here.. 2 oxtails.. no flavor.. 20$.. won't return"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN1BqaXp3RRAB",
            "text": "The Food and Service is top tier I recommend the chicken any kind of chicken the juices are amazing. 🤩 Also always amazing customer service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNnZ5U2ZBEAE",
            "text": "The food was great, and the owner was very friendly. It's a family business, and it had a family meal feeling and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bExPZGtRRRAB",
            "text": "I had water down non season curry. Worse than Golden crust. Food was not hot and I ended up with a stomach ache. Close the store. I don't trust it. Curry No Roti. Run!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXJxOENREAE",
            "text": "Honestly, below mid. The worst I've ever had.\n\nUsually with Jamaican restaurants, the terrible customer service is offset by great food. In this case, it's lose lose. Only thing worse than the service is the food. Literally gave me the runs. It's as if it were made in the gutter behind the restaurant.\n\nDefinitely would NOT recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaVBHaUZnEAE",
            "text": "Ordered curry chicken, white rice, cabbage. It was way too expensive in there, i’ve went to cheaper places with better quality food. The only thing that taste good on that plate was the plantain . the rice was hard and everything tasted watery . Didn’t even taste like jamaican food . Big no for me ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc3VYMWhnRRAB",
            "text": "This is my 2nd time order food was delicious!!!! I ordered for my 2nd time and found hair in my food. Instead of trying to find a solution they attacked me like I put the hair there .. it’s this and black almost like hair weave and my hair is thin and Real … I’m disappointed in how rude they was smh lost if 20$ and they did not care!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcW9LODd3RRAB",
            "text": "For Old School Classics, Like The Mom & Pops Flavor & Style..\nThe Flavor and Texture,  Perfectly Blended and Cooked!\nThanks You 🙏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MDYzQUl3EAE",
            "text": "The food looks tasty, everytime I order from them the customer service is excellent. People are friendly. My only critique is that the size of the protein is too small. The chicken pieces are so tiny, as a hungry growing boy, I need more protein. One piece of chicken is done in 1 bite.\nOther than that, I recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aHJTY0JBEAE",
            "text": "Didn’t taste authentic, wanted down Jamaican food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdzVMN1d3EAE",
            "text": "Writing this review because I just had too after an occurrence but will start off on a positive note. The food is excellent, well seasoned and tasty. I got the ox, rice and peas with cabbage, Mac and cheese and a beef patty. Everything tasted really good and well cooked. Only thing I’d say is that I wish they cut the fat off the ox, but that is personal preference so that does not affect my rating. The reason behind the 3-star rating and what made me write this review is because the next day trips to the bathroom obviously caused by food poisoning. Lack of condition in quality of food. I don’t know if y’all leave the food sitting or put yesterday food for next day but c’mon. I am only for sure because I had not eaten all day other than this food and on top of that, someone wrote a similar review about them having to use the restroom after eating here. Probably not cleaning the meat properly because another review she states that the fish don’t taste clean. Y’all got to soak ya meats in vinegar, lime and salt like ya ancestors taught you. I will not low ball y’all with a 1 star because the food overall was tasty but something ain’t right if this situation happen more than once on occasion with different people. Won’t comment on service or atmosphere because I had delivery which was done in a timely matter. Will still recommend this spot but maybe a different meal, could had been just the ox. Who knows but Good luck"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NWRxeENREAE",
            "text": "I have not had a dull moment buying from this restaurant satisfaction everytime and am very picky"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNmRtMkFREAE",
            "text": "The oxtail was absolutely delicious! We loved the porridge also. Customer service was great, food was fairly priced!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbVBPT3VBRRAB",
            "text": "This is the most horrible Jamaican restaurant you can ever have the displeasure from eating from. The food is barely worth the money they are charging. To the excruciatingly Bad Bowel Movement I had after eating their food at 12 midnight. The food at this establishment, is made with Contempt and Served with Disappointment. The owners of this restaurant will never have to worry about me, purchasing anything from them ever again!!!!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1ektDNXBnRRAB",
            "text": "Love this place food is great. You have got to try this Jamaican food. Both the Curried and Jerk chicken were tender and full of flavor. Brown stew chicken and curry goat saucy and really spicy. So cheap, so good, such great service! Must try!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMktXb3pnRRAB",
            "text": "My favorite place to get Jamaican food. The jerk pork and jerk chicken is amazing, portion size and prices are good. You won't regret going here."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLXR6UHRnRRAB",
            "text": "Really good food with great customer service. Ox tail was delicious, and the fruit punch was very refreshing as well. Great choice for lunch and you get a decent amount of food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab0w2dU5BEAE",
            "text": "Food very delicious and staff knowledgeable in their menu. Definitely recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ1l6dlh3EAE",
            "text": "Honestly the foods either salty or it don’t have flavor to be so dam expensive 30$ for a medium plate Smfh never again….. stay out of there the food an service is bad when they walk to take your order they act like they know the food nasty don’t buy it service shows the most if the service is bad the food will come out bad my moms a Chef an when u put in will come out …."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndk1PS3JBRRAB",
            "text": "This the spot for jerk chicken. Good prices, big portions and just delicious food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNS1qMUxREAE",
            "text": "Solid three... Ordered the most popular plater and it was Bland ... Price is better than the one up the road... May return if in the neighborhood+ but if the owner doesn't get back in + then my next Review will stay the same"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwLUlMNHh3RRAB",
            "text": "The food is freaking amazing here and the service is great too. They have a delicious menu selection and their price are pretty great too. Check them out if you're in a mood for some really good cooking."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKanEyRFlnEAE",
            "text": "I ordered oxtails white rice plantains and fried dumplings. My oxtails was very bland ! Only thing about them was they were soft it had no type of flavor to it not even a bit spiciness !! I was disappointed with that I tried to enjoy my whole meal and only took two bites I don’t see how they can even have the Jamaican flag on their establishment . I was serviced by a older man probably in his 60s who had a attitude every time I asked a question I felt like he was rushing me to order  my meal and he also did the same to the person behind me .My fried dumplings were ok nothing special here at all I suggest you save your money and try another restaurant with FLAVOR definitely not here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdHIzbGJREAE",
            "text": "Nothing special."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOE9UVkZBEAE",
            "text": "Went here once and the food was delicious I would recommend the oxtials and macaroni pie."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aEl5Y0JnEAE",
            "text": "I really like they oxtails and normally order it but with the new prices I decided to get two vegetables patties. Unfortunately it was like having a savory apple pie, it was extremely wet and very sweet inside. Never again but other then that I will still continue to order their oxtails"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTRQV2FREAE",
            "text": "Racist Jamaican staff that let a friend start trouble with their customers and kicked us out I will never buy from them again on God and the food regular not worth the freestyle price I will tell whoever I know go to Flavas up the block"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobUptSXlBRRAB",
            "text": "Best time to go is when they open up. The food is fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoa3BTc3pRRRAB",
            "text": "Love the curry goat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCazVLU3d3RRAB",
            "text": "Bad service,not respect......"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdnZ1Vk9REAE",
            "text": "First order but not the last!  Delicious oxtails and yams!   (Cabbage was so-so). Generous serving - enough for 2.  Fastdelivery of hot food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCczhtSGp3RRAB",
            "text": "Great food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcmJLQlB3EAE",
            "text": "One of, If not the best Caribbean restaurants in NYC"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbWNqOEJnEAE",
            "text": "Please just go to flavas.  The only thing good here is the chicken patty. The peanut punch is a disgrace."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnXzc3NnhRRRAB",
            "text": "I just recently found out about the Feeding Tree and I am glad I did... better late than never. Let me start of by saying that the food is amazing here and so are the drinks.\n\nLast time I ordered the jerk chicken lunch special with rice and peas and they threw in a free piece of corn bread. Im not used to that at caribbean restaurants but it was a good combo with my food. The ginger fruit punch is absolutely tasty! My girlfriend and I shared one and finished it in about 2 minutes. We went back for a refill before leaving the street the restaurant is on haha.\n\nSome things I'm not too fond of are the small patties. They are really delicious but I finish them in about 5 bites so I would like if they made them bigger especially for the $2.25 price tag. Whenever I go here, the meat sections look empty and it throws me off, but they get so much business that the food is constantly getting depleted. Lastly, when you order a size up, you're supposed to get more of everything, but they gave me 3 pieces of meat with the lunch special and the medium...\n\nOther than that, this spot is the go to for a delicious Caribbean meal."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndTVUaTR3RRAB",
            "text": "The food really good! Everything! My partner and I love to come here for chicken patties, its deliciously made. We also love the jerk chicken and rice peas ya know. Also, make sure you give our favorite drink from here a try! Which is…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNN0tuamFnEAE",
            "text": "Best Jamaican food in the area, food it's always fresh and on point. Delicious refreshments specially the sorrel drink. Big size serving. Prices are ok, but service it's slow."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5d1Byd1hBEAE",
            "text": "Please don’t bother with this restaurant save your self from high blood pressure and sugar diabetes. They are all about a dollar. They don’t care and they always mess up your order especially when ordering online. They food salty home made juices are very very sweet"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNb2RhMDhnRRAB",
            "text": "This place is hit or miss. It's good depending on the time of day and whoever is at the register.\n\nEdit: January 2022. No longer a hit or miss. It's a straight miss as the food is now disgusting. This is not authentic and the chefs should be ashamed. They only get business because the locals don't know any better. My advice to anyone looking for good west Indian food nearby get on the d train and go to Harlem where there are a few good spots."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1OEpMdGFREAE",
            "text": "I ordered oxtail and turkey wings. Food was extremely unpleasantly spicy. I had to dump the entire $40 worth of food. That is not how you cook. Spice can’t over take flavor. My daughter is 4 and couldn’t eat any. This is horrible. I will…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZeUpfS3dnRRAB",
            "text": "The food in this place is amazing. The cashier was friendly. The food is authentic and the restaurant is clean. My kids loved the  Mac n cheese. The restaurant has an old school island vibe and it reminds me of a mom and pop shop. The salmon was delicious. I will visit again soon"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNF9hZHd3RRAB",
            "text": "5 star for the taste. The curried goat was good but the color was off. It could have had a lot more color, it was too white. The fritters was awesome but way too greasy. I tried a natural juice they had called reggae sensation but i think they should minus the beets. Good job guys!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdi12ZXdRRRAB",
            "text": "So delicious. I am American but I feel like I Jamaican everytime I come here. The first time I came here I was just looking for a quick place to get a good meal while on jury duty. That day payoff I have been a faithful customer every…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRellxOWl3RRAB",
            "text": "Now this is a classic Bronx eatery.  Its small, only a few people run it, but the food is awesome.  I came here because I went to a Yankee game, and didn't feel like paying $10 for a $4 hamburger.  I got medium-sized order of jerk chicken, and it took awhile to get anything although I saw the kitchen working, so it was obviously made fresh.  I got a fair size container stuffed with food, including rice and beans, some veggies, and also some cornbread on the side.  However, they gave me oxtails.  Now I'm not an expert on Jamaican food, but I can tell an oxtail from a piece of  chicken.  I wanted something spicy, so I gave it back--but not after trying a bite.  It was really tender and flavorful, but again just not what I order.  I dug into my chicken as soon as I got it, as I was running a bit late at this point.  I got a few breast pieces as well as a wing.  It could've been a bit more spicy, but it was juicy and very flavorful.  The veggies were a perfect complement, as they were sweet and cooling.  The rice and beans were good as well, the cornbread was good but not the best (I'm very critical of cornbread), but the best part was that this was a very sizable meal that kept me full until the end of the day--no easy task.  If you're going to a Yankees game, do yourself a favor and come early so you can get some reasonably priced food here.  The staff is very friendly as are the patrons; one couple even started singing that song \"have I told you lately that I love you\" in front of the whole place when it came on the radio.  I wouldn't classify this as a can't miss necessarily, but its definitely solid, soulful home cooking."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneW9YWmJBEAE",
            "text": "Was just talking to a co-worker about this place so I had to write a review.  Best jerk chicken!  Jerk shrimp is delicious also.  The rice & peas plus the cabbage rounds off a great meal.  Lunch portions will fill you up.....dinner portions, well, you better make sure you're hungry.  Good prices too!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBX3RQNl9RRRAB",
            "text": "Their food tastes really good. They're stewed oxtail is perfect every time. It's so tender you can practically take the meat off the bone with a plastic fork. And they're generous with their portions and their prices are good too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjcElLLUlnEAE",
            "text": "My boyfriend and I recently started eating from here. The food is AMAZING. the prices are reasonable. Thomas is the man💪🏾. Very humble nice young man and gives the BEST CUSTOMER SERVICE!! He definitely handle's your food with care.. highly recommend 😊…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOGViMVNBEAE",
            "text": "Not worth the money. Since when does a medium curried chicken cost $10??? I've tasted better Jamaican food than this and cost way less. Won't be going back. Nice staff though."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdTd1ZUlnEAE",
            "text": "I ordered the steamed snapper for my boyfriend and after a few bites he threw up. The fish even had the scales on it...so I believed they never cleaned it. I had the jerk chicken and one bite of the chicken...I couldn't eat anymore of it.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzbkszN21RRRAB",
            "text": "I don't really care for the flavor of the oxtails but my husband likes it so it will do until I just start making it myself at home\nThey are a bit better than Flava up the street. They are never ready in the…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVOVlySFNBEAE",
            "text": "Great when it's freshly pulled off the stove, right off the stove. They don't always have the bbq chicken though,  it's so good. Yummy sweet potatoes. Macaroni needs to be changed more frequently, that's what is hit or miss."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMF9TdFF3EAE",
            "text": "Spent almost $20 on a stew chicken meal & only\nGot one piece of chicken!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtc29LWWJBEAE",
            "text": "This place fell off big time the Mac and cheese was obviously refrigerated overnight you tell for from the taste which they’ve denied and the they didn’t even take the skin off of the chicken in the curry. Who stews chicken wings. Awful experience. Such a shame this was my favorite Jamaican spot too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjdUlDV3RBRRAB",
            "text": "Food is nasty. The Mac and cheese has no cheese and yams are nasty. The fried chicken was hard as if it was old. The oxtail has no flavor at all just brown coloring. My oxtails had some white substance on it I’m just so disgusted. Never had such bad Jamaican food in my life waste of money couldn’t even eat it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhM3NXV2hnRRAB",
            "text": "Didn't have mac-n-chz when I went. That was a bit disappointing. However, we just doubled up on our rice. The jerk chicken was great and the portions are definitely worth the money spent. This place is easy on the wallet."
        }
    ],
    "reviews_count": 71
}