{
    "name": "Kumasi Restaurant",
    "place_id": "ChIJNdofSuz1wokRZlN81qZZtzo",
    "grid": "BX4",
    "address": "239 E 165th St, Bronx, NY 10456, USA",
    "rating": 4.2,
    "user_ratings_total": 33,
    "phone_number": "(718) 676-0345",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reE5sSTBMVEpPVUZKT2NHdHdOVVpHT0d4WGRsRRAB",
            "text": "Serene, neat and clean environment.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wclVIQjFXRWQ2YVRCSFVIWm1hVkJxWjFacWRtYxAB",
            "text": "Best and fast delivery Pizza Man"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aWNra3pSblpvZVhRemJ6TmZhVzFpYldScWIwRRAB",
            "text": "Best food in the BX"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKU2VFWkNURjl4VG1Sd2J6TldNVGhYVm14RVdWRRAB",
            "text": "Amazing Ghanaian food! The folks are hospitable and it definitely felt like I am back in Kumasi."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKV0V5Zl9Jb3ZuMmVnEAE",
            "text": "IMPORTANT NOTICE TO THE RESTAURANT OWNER\n\nPlease be very careful with the staff member she’s Hajia who sells food at this restaurant. I am writing this because I care about your business and want to see it succeed, but there is a serious issue that needs your attention.\n\nHajia does not show respect to customers. Seven of my friends have complained to me about her rude attitude and poor customer service. They all promised never to buy food from your restaurant again because of their bad experiences with her.\n\nToday, I experienced the same problem myself. When I came to buy food, Hajia was wearing AirPods and not paying attention to me. I tried to tell her what I wanted, but she just gave me whatever she liked instead. When I told her I didn’t want certain meats, she ignored me completely.\n\nThis kind of behavior is unacceptable, especially in a business that depends on good customer service. If this continues, I am afraid you will lose many more customers, and your reputation will suffer.\n\nI strongly urge you to either talk to Hajia about her attitude and customer service or consider replacing her. Please take this feedback seriously for the good of your business. Thank you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc19ISVBREAE",
            "text": "Be my guest, but this restaurant is disgusting. When you order online and pick what you want, they don’t even include your selections—just whatever they feel like giving you. It’s unacceptable and complete BS. It’s like Accra Restaurant—no…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMVpLXzd3RRAB",
            "text": "Their food is okay but their waakye is like 98% beans and 2% rice these days. I don’t know why anyone would want to eat that. Even if rice is expensive these days, that’s not how to retain or attract customers."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBLTl2ZGd3RRAB",
            "text": "Excellent"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNTZHb0tBEAE",
            "text": "Ordered fufu with palm nut soup and received peanut soup instead .It also came with just 3 pieces of protein for a large size.please do better as a new restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdTl1eDVnRRAB",
            "text": "I’m definitely coming back with my family. The food is nice and the customer service is on point. The place is clean. Nice place to eat with your family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXFQY0pnEAE",
            "text": "Came here with my sisters and we really enjoyed thier Tuo Zaafi. My friend Anita recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueXMzUXhRRRAB",
            "text": "I ordered tuo zaafi with goat meat and cow meat and it was amazing! I devoured it and can’t wait to come again 😇."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINTd1SHlRRRAB",
            "text": "Love the jollof rice with stew and plantain and spaghetti.the fried yam is also amazing. My problem is please learn how to package the item well. Several times I would order a take out and when I get home my food would spill on the floor because of poor packaging."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMmJyWk13EAE",
            "text": "As someone who has tried several different African restaurants, I can categorically say this is the best food I’ve tried! So many options that come in great portions. Lovely staff as well. If a proper Ghanaian/West African/Caribbean food is what you’re after, there’s no better place!\n\nThey also have vegetarian, gluten free and halal option!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibU5XQ0ZREAE",
            "text": "Delicious food and fabulous service. Palm soup and peanut butter stew is my favorite. I absolutely recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMmJyRHh3RRAB",
            "text": "We’ve ordered takeout several times from this wonderful place and the food is amazing! It was my first time trying Ghanaian food - a close friend recommended this place. So far, I’ve tried Jollof Rice, Wakye, Banku, Fufu, and Red red with plantains — all great! I’ve been hooked!! Delicious, so much flavor, large portions (the sides are enormous) and extremely satisfying. I plan to continue ordering and coming to this restaurant in the future. Highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ0xiaVhREAE",
            "text": "Best place for any african food\nKumasi restaurant the best in new york"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMTRqSE1BEAE",
            "text": "Nice food and a good place, they are always friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMck4taHVnRRAB",
            "text": "I had a great time eating delicious food at your restaurant today. The staff were committed to great service and were very friendly. The atmosphere was awesome. Most importantly, the food is amazing. I will definitely recommend kumasi Restaurant at any time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNllhVkx3EAE",
            "text": "Very nice place,good customer service,and the food was super delicious"
        }
    ],
    "reviews_count": 20
}