{
    "name": "Bodega City",
    "place_id": "ChIJL30sYSz1wokRJzEKsLJWmf4",
    "grid": "BX4",
    "address": "1091 Ogden Ave, Bronx, NY 10452, USA",
    "rating": 4.5,
    "user_ratings_total": 34,
    "phone_number": "(347) 734-3787",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWVluaENWa1pIZFRONU1YaEthVlJPZFV0NU5IYxAB",
            "text": "This place is AWSOME!! The menu is simple, what makes this place is the staff and service they provide. Courtesy and professionalism abounds. They treat you like you really matter. Thumbs up all day."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRGNXMHljMlJOYVUxc01ra3haVkpVYldSa1VuYxAB",
            "text": "The best in the city and really makes you feel like you eating at the homies house ! Good service good food and fire atmosphere please slide by any means necessary when you in the city !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac2QydERiR1I2V210QmIzWmhiMG8yUVRCZlgyYxAB",
            "text": "Since you started making stop at 99th street and Madison Avenue to your shop in the BX. Gotta go to the one in BK one of these days. Dope spot my all time fave still el Dominicano. Keep on striving for more."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclJFaG5OakpXT0VSNVpHMU9lVU5DVDBScFZHYxAB",
            "text": "Owner’s always super attentive ! I’ve tried multiple items on their menu and haven’t been disappointed yet ! I struggle to find a spot that accommodates me as much as this spot does ! Well worth the travel & the food is always on point !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cE5EZDZSekIxYkdwM1FWZGliemRsV2tzeVRsRRAB",
            "text": "This restaurant deserves 5 Stars! From hospitality, to service, and the food.....best chop cheese in NYC! I had the pleasure of having it when he was also just a food truck! Never disappoints! Don't get me started on the wings! Never cheap with sauces and so juicy! Can't wait to go to the bklyn spot! Plus giving free items with your orders adds the bang for your buck! Where else will you find water for a dollar in shops?! OVERALL 5/5 ALWAYS COMING BACK!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZlRFTldSMDQwYTNScGNFVldjMjVVTmpaS2NIYxAB",
            "text": "Incredible food and hospitality. Definitely recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaVoyNTRVMWc0TXpGM04wNHRNeTB0UVVjek9IYxAB",
            "text": "This place definitely deserves 5 stars! The food is incredible the chopped cheese in particular is one of the best you’ll find anywhere. Everything is always fresh, flavorful, and served with care. The owner is a very humble and cool guy who truly takes pride in what he does, and he always delivers when it comes to service.\n\nWhat makes it even better is that I’ve been a continuous client since the days when he was just working out of his truck. To see him grow and now have not just one, but two stores is truly amazing. You can tell he put extreme effort and love into the design of the place the decorations and details on the walls really make it stand out and give it such a welcoming vibe.\n\nI highly recommend this place 100%. It’s inspiring to see someone build something so special from the ground up, and the food and experience never disappoint."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcE5DMVRjbk5uUVRoNFYzTkhOWEZwUTJ4dE9YYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nBodega City in the Bronx is amazing! The food is always fresh and flavorful. Their chopped cheese is unmatched—truly the best you’ll find anywhere. The wings are delicious too. Great spot with NY vibes, highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUlRXbHVTRkZJYTBkQmFsVlNlamRNVm1GSE5tYxAB",
            "text": "Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aWRWZHlTVzVuYTE5TlJFOUNhR2xvZERsU1VGRRAB",
            "text": "My brother bought me a chopped cheese yesterday and it was dry, mozzarella sticks tasted like freezer burn but the chicken tender wrap was amazing."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeWFXOVhiSEUwV0VJNGJuVklkMVI0VFUxNlRGRRAB",
            "text": "Google made me edit this post. The art on the wall is Cool the chopped cheese didn’t taste like nothing special but they were better than the wings and by the owner thinks he’s gods gift to woman  and acts like he’s all that. Somebody tell him he’s not Aventura. Happy  Google?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNVkxWmphemR0YzNWMVpUQmxTbkJsVFRocFVtYxAB",
            "text": "Best Chop-Cheese On land🏔️ or Sea 🚢"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SWRXeFhhWHBYVjB0NlVWRlVXVWRYZGxsS2ExRRAB",
            "text": "This place is only take out. Call ahead of time for pick up because the hours can change."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYVF2NW1vaHRDcVhREAE",
            "text": "Food made with perfection."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNHBQUlZ3EAE",
            "text": "The store was hard to find because it’s inside of another store. I ordered the classic chop cheese and to be honest I’ve had better in Harlem, for a lesser price tag. I also ordered the loaded fries. They were okay. No need to go back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNW92Rm5nRRAB",
            "text": "Been following dude since he was rolling around on the food truck. Boy was I surprised when he set up shop right up the block from me. The food is still great as always and happy to have this gem in the heart of Highbridge."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaU03Q3B3RRAB",
            "text": "I came to try the chopped cheese I heard so much about online, and was pleasantly impressed. I was expecting something heavier, but that wasn’t the case. The sandwiches are not overwhelming, they are perfectly balanced and at an incredible price. In this economy I am always looking for a deal!\n\nI got the Mac, the OG, and el Dominicano.\nThe Mac tasted sooo much like what a Big Mac should be( think 2000’s Big Mac). The OG was solid and the Dominicano was absolutely delicious.\n\nJeremy was took our order and was so kind. He gave us some curly fries and a couple of drinks and candy with our order.\n\nThis is located inside the Ogden market, it’s super clean and they even have restrooms available."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajhYcEp3EAE",
            "text": "The Fries are Fireeeeeee !! However I had the OG chop cheese it was nothing spectacular or to go out of my way for not a wow factor for me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdzh2NUVnEAE",
            "text": "FROM THE TRUCK TO THE STORE ! BEST CHOP CHEESE IN THIS CITY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJenMtZm9BRRAB",
            "text": "It’s pretty basic any deli is way better, the Ke lo ke fries was the best thing we got!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcXBXeUtREAE",
            "text": "I tried the OG chopped cheese and the adobo 🍟. Both were delicious. I had to come out and support this business. I highly recommend this restaurant to friends and family."
        }
    ],
    "reviews_count": 21
}