{
    "name": "Zero Otto Nove",
    "place_id": "ChIJ4aiyUYf0wokRl3irR6IrNfM",
    "grid": "BX4",
    "address": "2357 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.5,
    "user_ratings_total": 1496,
    "phone_number": "(718) 220-1027",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFgyZGxNMU13YjJsMlMyazNkVTlaZWxNeFRVRRAB",
            "text": "Great place.  Delicious food.   Good service.   Only thing server didnt tell me specials.  ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MmMxTklUVE5QVDJOSWFqaERSekJ5T1dGWlVWRRAB",
            "text": "This place has very good food the waiters are very pleasant  and the service is excellent  the food takes awhile  but it's  worth the wait"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TFptMW9SM1JvUmpBMmVrWTRlamhaTFZwSVVuYxAB",
            "text": "An absolutely amazing experience!  Not only is the food delicious, but the atmosphere and staff make for an all around perfect night!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURValBUT2JREAE",
            "text": "Excellent Italian food,ambiance and service.Among the best of Arthur Ave restaurants.Ask for Limo,great waiter"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMVdsOXpkWFE1VmtOSE9VcDBSMFpyVjBOUFUyYxAB",
            "text": "Loved the food! The service felt a bit rushed. However, the atmosphere is pleasant."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Uk9UWXlVRXhMWW1ZNVFURk9TMkZGVW5wbVVrRRAB",
            "text": "The receptionist was rude so we cancelled and went elsewhere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabFNFbzNPUzA1TjNKQ1FWTXpRM1JEVW1kVVRWRRAB",
            "text": "What a lovely Italian Restaurant. Food was totally delicious. Service was attentive, and the atmosphere was family friendly!  We ate:Fava, Carciofi and Cacio; Zuppa di Cocozza and Pollo Francese all perfectly prepared and tasty.   Enjoy!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210blMzSTBOVUZOWW5aSU1IVk1iSGhZYkRGalFWRRAB",
            "text": "Great place. We went for work lunch and it was amazing. I'm definitely gonna do a date night with my wife.  Highly recommended"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSVdHdHpPV05oUTFVdFVrVlpVVkUxYzBSUldHYxAB",
            "text": "We dined here quite a few times, as ambiance is lovely and food pretty descent .. service was quite disappointing.. we had a waiter who acted like he did not want us to be there, had to ask for specials and cheese after the food came out … sure did not expect that .. :(("
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoa2FHSjZPV1J1UzNCbVZIbzVlVGM1UlVKaFVGRRAB",
            "text": "High quality in every way and consistently excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUGRGSjNPVTFUTUVkbFZFRjJjbk5UUXpsemEzYxAB",
            "text": "Staff are great but pizza is not that good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVWR6ZGllRVZIYURGc2VIazFjblZ0YjBRMlpXYxAB",
            "text": "This place is wonderful! The ambiance is cozy, the service is fantastic, and the food is truly chef’s kiss—especially the pasta, which I learned the owner always makes himself. It reminds me of a charming little restaurant we visited in Tuscany that I absolutely loved. I’m so glad to have found a similar spot here in NYC."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SVExUTJRME0wTUZaSlQxbHlRVGhRVFVWUFRrRRAB",
            "text": "No tuvimos el\nPlacer de probar su comida por la razon de los precios hay una opcion de happy hour pero no llegamos al tiempo de los especiales, la opcion del menu regular es muy costoso, volveremos al happy hour para desgutar su comida,"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMmRXY3pTM0ZUVERZM1EzcG5lVlZZWjIxblZGRRAB",
            "text": "Enjoyed a nice mean in the Bronx Little Italy.   The food at Zero Otto Nove was very good, just not great.   Service was amazing and the atmosphere in thier \"piazza\" was very nice.  The Bronzino was good, but the sauce was just a tad on the oily side.  I would have preferred a grilled or baked bronzino with just some fresh tomatoes, olives and drizzle of olive oil.  The Chicken Francese was quite good and the roasted potatoes were excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdmExbG5kRFpNT0dSbVVIWnlNa3RNVWxwWWVuYxAB",
            "text": "I went some people on trip for Ferragosto Italian festival.\nIt was my time at Zero Otto Nove. The people I was with eat here every year.\nI liked the ambiance of the restaurant.\nThe food was sort of a disappointment.  I ordered the Cacio Pepe, a dish I've always wanted to try. Someone else at the table ordered it also. It was missing the black pepper that's supposed to be part of the dish,  we had to ask for pepper to be put on the dish.  Of the two wait staff we had only one had a smile on his face.\nFor dessert I tried the Profiterole. Which had nice sweet taste, filled with a nice tasting custard.\nI don't know if I would return to this restaurant,  if I did I would try it when there isn't a festival going on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trd1NURlJkMGxLTkRGNFdtczRWREJNTUcxQk5sRRAB",
            "text": "A gem on Arthur Ave Bronx\nHighly recommended. Can't go wrong\nFind yourself in the Italian piazza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1gyVnNZWGhsU1hWSWIwdzNSMWhHWDA1WGJYYxAB",
            "text": "The pizza, fried calamari, salad were all very good.  Chardonnay by the glass was very good. The chicken parm look alike dish and pasta dish served at the table were not that good, but the chicken tasted better when at home. I need to go back and give it a 2nd look."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaVgwZEhXRGxUWTB0cU5tNU5jRmhFUTNCc1NWRRAB",
            "text": "Zero Otto Nove, in the Bronx, was a pretty fantastic experience! The food was wonderful, the staff were friendly and knowledgeable and there was a real family feel to the place. Ever have potatoes on pizza? Make sure you come here to try it, it was amazing! From the bread before the meal to the left over chocolate sauce on the dessert plate, Zero Otto Nove is a great place to eat! Absolutely would recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQmJITXhUek5wYXkxT1oyOHhRV05DT0RaRVQyYxAB",
            "text": "Exquisite food & inviting desserts. Perfect for a dinner, including birthday dinners. In my experience dining here, the restaurant is big yet intimate. Great service & atmosphere!👏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMWRFeGlTelkxWTJabVdqaHVlV1pSVWpCVWRIYxAB",
            "text": "We had a really good experience at this place. We called to book a table and the staff was very friendly. Our food was delicious and the service was super efficient. The place is also quiet, they play music in the background but it’s not loud."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFkzUkxOMjVaVVdNeFFWOVhNRWxwUW5wYWVrRRAB",
            "text": "Beautiful spot with a great atmosphere. Loved it and can’t wait to make it a regular spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kU1VXVnFaek0wV0hoRVUwMTVWRXBqUVdSMGFrRRAB",
            "text": "The place is great but I had a bad experience with the bread and the rissoto. Bread was burned and rice wad hard."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlJqWmtORVJZZEV0eVF6a3pla1E1ZWpKbFZYYxAB",
            "text": "Authentic Bronx Italian eatery"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZmNqVmtVblZYTURJeFJsRnJXRkYwVlZNM1pVRRAB",
            "text": "My risotto was a bit hard to my taste. Great taste, but a small portion in comparison to the price. The pasta mafalda had great pesto taste and cooked to perfection."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1lUSTFTMHhrUlcwMWRHOUZTRkJYY1ZaeWVXYxAB",
            "text": "Came with my family .\n\nService was a bit overwhelmed as we had kids… the kids loved the food. I came for the view ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaU5uRmFSRUkwVTFacFRqUjRiV1pOT0c5d2EwRRAB",
            "text": "Went there for Saint Anthony\nFell in love with the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb2MxSjNRMjFIWkc1ZmRrbFFTMDFyVTJZelIyYxAB",
            "text": "Terrific Napolitano pizza.  The six of us were lucky enough to be positioned in the alcove in the back room… Very nice atmosphere.\n\nPizzas were amazing, had the broccoli-rob, Diavola and margarita.   They were all terrific, especially the broccoli Rob."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJM1NWWXhORWhaYkhwNlgyTnplWFpYY1d4dmJrRRAB",
            "text": "El lugar es bien tranquilo elegante la comida es excelente es italiano clásico pero mi familia salió muy feliz de los sabores que habían el menú es un poco complicado pero con ayuda de el mesero pudimos pedir lo que cada uno quería el servicio es poco despistado pero son muy amables"
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScGRUVnVkVFJSTjFCMlJqSTNOVUptY1ZSeGMwRRAB",
            "text": "Linguini alla Puttanesca 😍 And Mozzarella Caprese app…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMVkzRkViV2hzUjBGYUxXZHJNa0ZDUkU5M1kwRRAB",
            "text": "Been going to this place for lunch since it was opened. Everything is good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWVFuQTBTWEp6ZVhCdk5HVlJlbk5TTjFaMGJXYxAB",
            "text": "Super dreamy restaurant and great service from all the staff, food is fresh and although it was really warm we were comfortable. We got the chicken breast,broccoli rabe and broccoli rabe pasta, the meatballs and the steak! All of it was delicious and worth the price. The super fruit cosmo martini was delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0alRtOVlZazlYTTNKdFpsTkhjVFZFUWtwM1puYxAB",
            "text": "Honestly, I was blown away! Next time you go to the Botanical gardens you have to come here for dinner! We started with the mozzarella caprese which had delicious roasted red peppers. Followed by some of the best pizza I have had in the city! La Vincenzo was covered in porcini mushrooms, Gorgonzola, mozzarella, and cherry tomatoes. Then we had some stellar pasta, a dish called Mafalde in Cartoccio, bathed in fresh pesto, burrata, with tomato that they make in a tin foil pocket. Lastly, the side of broccoli rabe was perfectly tender with garlic and butter. I can’t wait to go back one day!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scWJtVnhZbTgwVFVsd1JHeGxiVTVIY21SYU5IYxAB",
            "text": "Food: watered down olive oil, weird old bread, a insalata tonno that was was just tuna and very little salad, baked clams that tasted like breading only, pasta putanesca that was so salty it was inedible and service that was without any smiles or friendliness. Never coming back here for sure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa2NsVlBaWFJGVjBGWFVIazNhek5zTmxwTUxXYxAB",
            "text": "Pizzas here are delicious - a little more expensive for a pizza but it’s very good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cGRFMHpSbXRxUkhoSE5tbHRhR2R6ZGtobk5WRRAB",
            "text": "When we entered Zero Otto we had no clue what we are going to experience, it was magical walking through a brick alley leading to a spacious dining hall , with an old rustic charm. Old posters on the wall, decor everything was adding to the charm."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1FtRlJPRzgyT1c4eVoxUkJTSFpuZG14SGNFRRAB",
            "text": "Delicious dinner. I would definitely go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdkpvTTJRM18zYUpnEAE",
            "text": "Walked in for dinner around 6:30p with no reservation and was seated immediately. Everything was quick to come out and was exceptional. The squash/mozz/mushroom/truffle oil pizza was killer. Clams, risotto, and broccoli rabe was great as well."
        },
        {
            "date": "4달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZlpWbGlOMGd3TFVGcmEwVmZOMU5SU1VONE9WRRAB",
            "text": "週六晚上生意很好，原以為店裡位子不多沒想到往內走別有洞天，空間設計很復古，天井含有烤披薩的窯，滿滿的歐洲風情。\n我們兩個人用餐，點了一個前菜、一個披薩和一個燉飯。餐點份量不像之前吃過其他義式餐廳這麼大，比較小而精緻，吃完不會太飽。\n最早上桌的是披薩，一大片切成了四塊，披薩皮薄卻富有嚼勁，搭配充足的起司和芝麻葉非常清爽。開胃菜點的是燉牛肉，小小一盤份量不多，但牛肉軟嫩入味。海鮮燉飯雖然是茄汁基底但蕃茄味並不重，反而有濃濃的海鮮香氣，海鮮配料滿滿甚至感覺比飯還多。"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYnB5YXVoOS0yRzZBRRAB",
            "text": "I love it here! I came here with my sister. They didn't have penne Ala vodka on the menu but the waited said they can make it for me! Very catering and attentive to me. Great service and I will be back."
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLUY1Skw5OUtyQWdnRRAB",
            "text": "Posto nel cuore della Little Italy nel Bronx, questo locale ti permette di tornare per un po’ in Italia mangiando piatti della tradizione seppure leggermente rivisitati. Noi ad esempio abbiamo ordinato una pasta al forno (con polpette, salame, ricotta e uova sode poste sopra la pasta) ed una cacio e pepe (con l’aggiunta di carciofi), entrambe squisite. Dulcis in fundo, abbiamo finalmente bevuto un espresso come Cristo comanda. Bella anche la location con una grande sala di fronte al forno per le pizze che dalla vista appaiono davvero ben fatte. Consigliatissimo!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPTGJ0cUhSc2ZhZDFBRRAB",
            "text": "I ordered takeout directly with the hostess \"Endrit\". First I ordered the eggplant parm app, then ordered the marinara pizza that has anchovies, garlic, olives and I wanted mozzarelle on top, of course, I had to pay extra for that.\n\n$50 for an 1 App & 1 personal pizza!!\n\nAfter a 30min drive, I had to double park on Arthur Avenue to collect my order. Of course, I had to hurry because being double-parked angers the Italians.  Once I got home, I realized (after a few bites, I'm like, where are my anchovies?) I did not get the marinara, but instead, I got a margarita and paid for the extras that I didn't get. How could they make a mistake like that? I called the restaurant and had to wait on hold five long minutes to complain about Endrit's inexcusable mistake.\n\nLet this be a lesson. Just check all your food products before you take anything home if you're doing takeout. You just can't trust anyone that's under 21yrs old nowadays because of their stupidity and laziness in doing anything correct and take responsibility.\n\nRemember this Zero Otto Nove... next time I'm there, I will mention this catastrophic event and maybe I will change my rating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM1h1X0daM0tLZ1RBEAE",
            "text": "Perfection! food, service, atmosphere!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaVFucGlFNk5HZzVBRRAB",
            "text": "The freshly baked wood oven pizzas and the pesto were worth drooling! Service is good and they explain things nicely as we all were vegetarians we had one of the most amazing vegetarian pizza🤤"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVEdpN1hsLU51VVJ3EAE",
            "text": "Took the family out for lunch here and we were really happy with the service and atmosphere inside the restaurant. We ordered the baked ziti and I was feeling brave and always wanted to try the pasta with squid ink sauce and so this place finally had it! I’m happy to say I tried it, but honestly I think I prefer the red. The calamari in the pasta was good though!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeGJTV3p3RRAB",
            "text": "Wonderful lunch after going to the Botanical gardens. Early Sunday afternoon just before it got busy. The menu was great, where you cannot decide which of a number of potential choices to select. Very attentive service at a good price point for the quality of the food. I'll be back, thank you"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvODYyaVB3EAE",
            "text": "Excelente de principio a fin"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2NMZ2h3RRAB",
            "text": "Absolut zu empfehlen. Da hat sich sogar der Weg aus New Jersey gelohnt. Beste Pizza die ich jemals gegessen habe, und ich hatte schon viele. Vielen Dank auch für die super Bewirtung 👍❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvamJXQmx3RRAB",
            "text": "Mid."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvanZ2aE5nEAE",
            "text": "A fun, casual and delicious lunch. The place was full for a Thursday afternoon and the waitstaff were fantastic! Attentive without being overbearing.  The food was good. Not the best I have had, but tasty pasta and good and simple arugula salad. The broccoli rabe had all the great taste, but was more well-cooked than I prefer. Tiramisu was lovely.\n\nI'm a lifelong New Yorker, but it was my first time on Arthur Avenue, but definitely not my last. I would definitely come back to try out their pizza."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTZMekJBEAE",
            "text": "Stick to pasta and pizza if you come. Pasta was delicious but chicken was so overcooked and flavorless. Not a cheap dish either. Pretty disappointed. Nice ambience though."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLVk2ZHZnRRAB",
            "text": "The restaurant has a spacious interior with brick walls and very high ceilings in one room, giving it a rustic, industrial charm. The design makes it feel like a converted factory, adding to its unique character.\n\nThe portions were generous, and the flavors were rich. However, our dishes had more oil than we preferred—hopefully, it was olive oil rather than canola oil. Despite this, the dishes were still enjoyable. The service was friendly, though we had to wait about 20 minutes for a table."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMHVHc0p3EAE",
            "text": "We had to wait around 10 minutes to get our table. Staff was friendly but we were waiting 10 minutes on the table for the waiter to attend us. So it’s 20 minutes in and haven’t even ordered. I ordered the Aperol Spritz and I liked the flavor that it had so much ice that the cup was more ice than the drink. The food was well. I wouldn’t say it’s the best thing but if I come back it would be for any pizza, not the pasta that I ordered."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eTd2ZF9nRRAB",
            "text": "Pizza was very good, the pasta too. The potatoes were terrible.\nThe place is spacious making it suitable for a family outing. The ambience was very nice.\nBig selection of wines, fairly priced."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NU1lQ29RRRAB",
            "text": "Got the meatballs and polenta as an appetizer, it was delicious! I had the chicken with tomatoes, pesto, and mozzarella, it was very good, but I wouldn’t get it again. My husband also got an appetizer for dinner, some type of seafood mélange. It was really good! The lightly breaded cauliflower side was excellent! Beautiful back room to eat dinner in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdzR1blBnEAE",
            "text": "Old school Italian restaurant serving Neapolitan-style pizza, some pastas, and a few other dishes. Since everyone raved about the pizza, that’s the only thing I got, and it lived up to the hype. The margherita pizza had a simple sauce, no flop, perfect cheetah-spot bottom, and a cheese stretch literally 2 feet long. The cheese itself was kinda rubbery and chewy, maximizing the flavor output."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeTlMWFBREAE",
            "text": "SO GOOD! Everything here was absolutely delicious- We ordered the La Cirilo and Rigatoni e Zucca. I’ve never had butternut squash based pizza nor pasta and it was amazing. It was really creamy and had a slight sweet taste but with the…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd19hbThRRRAB",
            "text": "Amazing food and drinks! Service is perfect. The back area of this restaurant is beautiful, like you are in a different place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNy1tRzhBRRAB",
            "text": "A very nice restaurant and nice dining experience. Decor of the place tries to replicate a small restaurant you’d find in Italy, which I appreciate. You can almost feel like you’re on vacation if you’re willing.\n\nFood was excellent across the board.\n- Pizza diavolo was delicious\n- we ordered a side of meatballs (5 meatballs) which was also tasty. The red sauce was perfect. Not too sweet or tart\n- the calamari linguine with black squid ink was delicious\n- octopus with capers appetizer was delicious\n\nI wish I had more things to say about the food but it was really just good all around! Staff was also very kind all around. I would definitely come back. Also a nice restaurant to go to after you finish your day at the Bronx Zoo!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbjdieDVRRRAB",
            "text": "Awesome authentic Italian restaurant. Everything dish we had was amazing.  Brick oven in back corner and you can watch this craft, ambiance was great.  Server attentive, atmosphere friendly. They don't take reservations so for dinner on a busy Saturday night get there when they open bc there is already a Line forming, but worth it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NFBTdnV3RRAB",
            "text": "It was a nice cozy and delicious Italian restaurant! I loved that they were attentive and took allergies seriously. I would definitely come back when I'm in the Bronx."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeUllLWVBEAE",
            "text": "menu is pretty short and simple, and yet they have options for everybody.\n\nVery friendly and attentive service and great vibe. .\nThe anchovy capers pasta was delicious. Not too overpowering fishy taste or smell"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMHRYNGp3RRAB",
            "text": "The linguine vongole was a bit salty for my liking. The clams were fresh and pasta al dente.  Coal fired pizza very good.  With a nice crust."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuclozREtREAE",
            "text": "What a beautiful and delicious meal!! My husband and I split the mussels and the we each ordered our own pizza. I had one with sausage, broccoli rabe and fresh mozzarella. He had one with prosciutto and fresh mozzarella. The crust was so crunchy and the sauce was perfection. We can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqanNYTG5RRRAB",
            "text": "Zero Otto Nove is truly one of the finest pizza establishments I've had the pleasure of visiting in NYC. In a city renowned for its pizza, this place still manages to stand out. The pizza dough is impeccably thin yet wonderfully juicy, perfectly complemented by the rich flavors of the toppings. Their liberal use of cheese takes the gastronomic experience to new heights.\n\nI ordered the La Cirlio pizza, and it was phenomenal. Topped with creamy butternut squash puree and fresh mozzarella, it strikes a delightful balance between richness and lightness. Despite the seemingly heavy ingredients, the pizza isn't overwhelmingly greasy; rather, the fresh, chewy texture of the dough provides a perfect counterpoint to the sumptuous toppings. It was love at first bite.\n\nThe ambiance of the restaurant is reminiscent of a classic Italian trattoria. Stepping inside, I felt as though I had been transported to Italy. The waitstaff, dressed in crisp white shirts and black pants, exuded an air of old-world elegance. The dining room, bathed in natural light filtering through ceiling windows, is adorned with charming Italian touches, such as religious paintings, intricate prints, and even a charming facade door. It's like stepping into a historical site in Italy, surrounded by culture and art.\n\nOverall, my dining experience at Zero Otto Nove was exceptional. I can't wait to return and explore more of their enticing menu offerings"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NE56U2VREAE",
            "text": "Stopped by for lunch and was seated fairly quickly . I tried\n- mafalde in cartaccio: served warm and had delicious pesto sauce with burrata\n- Quattro formaggio pizza : all the cheese were delicious and the base was crispy\n- tiramisu\n-aperol spritz\nThe interior was lovely and feels like you’re in a little town in Italy. Food was incredible and authentic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajlQMV9BRRAB",
            "text": "My first visit to this restaurant was disappointing. Despite being seated promptly within 10 minutes, the initial impression went downhill from there. The bread was brought to our table, but there was no butter or oil provided, which was a bit disappointing. To make matters worse, the table next to us, which had the same server, received exceptional attention while we were completely ignored.\n\nWe had to actively flag down staff members to take our order, which was frustrating. Even after finishing our appetizer, the server continued to prioritize the table next to us, leaving us with our empty dishes piling up on the table. Finally, when our pasta arrived, it was served cold, further adding to our disappointment.\n\nThroughout the entire meal, we had to repeatedly call the server's attention to get drinks and even to request our check. This lack of attentiveness and poor service made for an overall unpleasant experience. I'm sorry to say that our visit to this restaurant was just not up to par."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNmZiNFh3EAE",
            "text": "I really enjoyed the Neapolitan food at this resto for lunch recently after visiting the New York Botanical Garden. The quality and taste are well above average and the service is top-notch. Wish I lived closer to this place for regular visits."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWJPc0JBEAE",
            "text": "Non riesco a capacitarmi come si possa dire che in questo ristorante si mangi bene. Oggi ho pranzato lì data la miriade di recensioni positive. Abbiamo preso un antipasto freddo (misto di salumi al sapore di sottovuoto) e un piatto di polpette e polenta inzuppate nell’olio e la polenta aveva ancora i segni della busta del sottovuoto. Subito dopo siamo passati alle pizze: una capricciosa ed una Cirillo consigliata dal cameriere. Erano cookies! L’unico sapore in contrastante era quello dei funghi! Come bevande due bottiglie di acqua frizzante. Conto per due persone per due pizze e due antipasti $ 110,00. Unica nota armoniosa, il personale di sala è molto cortese ed attento a tutto quello che succede in sala."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLThyVnh3RRAB",
            "text": "The food at the Bronx location for Zero Otto Nove is amazing. Their pizzas have an amazing thing crust with just the right amount of chew and salt. They have a large variety of personal pie pizzas with plenty of vegetarian options (although perhaps no vegan options?). Their pastas are also amazing with a chewy, bite to them. Their seafood in particular has a very fresh, clean taste and I would highly recommend their seafood salad.\n\nThe restaurant itself is beautiful with exposed brick, archways, sky lights, and an airy feel. Eating indoors almost feels you're your eating outdoors at times with the ample amount of natural light.\n\nThe servers here are both very friendly and very knowledgeable. They are happy to give you suggestions on what to have and will help you pronounce all the Italian dish names on case you aren't familiar. They always have a smile on their face and treat you like family!\n\nWhile the servers are dressed up, the atmosphere of the restaurant is casual enough where you won't have to dress up to attend. My family wore sun dresses or shorts & a nice t-shirt for a lunchtime meal and we didn't feel out of place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN1oyZ2x3RRAB",
            "text": "The pizzas are made with fresh, high-quality ingredients and cooked to perfection in the wood-fired oven.\nThe pasta dishes are hearty and flavorful, and the seafood is always fresh.\nThe service is excellent, and the staff is always happy to make recommendations.\nThe atmosphere is warm and inviting, and the restaurant is a great place to celebrate a special occasion.\n\nGreat place to go for Italian food in the Bronx. The pizzas, pasta dishes, and seafood are all excellent, and the service is top-notch. If you're looking for a delicious and authentic Italian meal, Zero Otto Nove is the place to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN3RiRW9nRRAB",
            "text": "Classic Italian-American food on the famous Arthur Ave. ~30 min wait on a Saturday night. I wasn’t expecting mind blowing food so the expectations were just right.\n\nThe food was to be expected, just normal Italian food, with an emphasis on Italian American, along with a few twists on the menu (eg: cacio e pepe w/ artichoke hearts). The pizza tasted like a standard neopolitan pie, the puttanesca was okay, and the eggplant parmesan was quite good. The puttanesca was w/ gluten free noodles that were cooked well, but the sauce was just fine. The olives were definitely low quality canned black olives.\n\nI would say if the pasta dishes don’t look to appealing just get a pizza and call it a day.\n\nThe interior definitely gives off Cheesecake Factory vibes so definitely more of a family group friendly place than a date night spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeXZ1Mmx3RRAB",
            "text": "We where very impressed with the food. The gluten free pasta had a good consistency. The waiter was very knowledgeable and knew the risotto was cooked in the same water as the pasta, so we are grateful for a knowledgeable wait staff. The house wine was excellent, I had the Malbec."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bTh1YUVREAE",
            "text": "Rewelacyjna, włoska restauracja! Bardzo dobrej jakości autentyczne składniki, pyszne wino w dobrej cenie. Dwie wizyty, za każdym razem obsługa kelnerska na wysokim poziomie, nikt tutaj nie udaje włoskiego stylu, tutaj po prostu jest jak we Włoszech (i to w najlepszych miejscach we Włoszech!)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM05PSVl3EAE",
            "text": "I went to get dinner with my girl friend. We ordered a Margarita and calamari ink pasta. My friend does not eat a lot but we finished all. The pizza is really light and fresh. And the pasta was also really good."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMExhQXZBRRAB",
            "text": "Muito agradável, ótimo atendimento e excelente comida . Pizzas no forno saem a toda hora . Cardápio de comida italiana atende a todos os paladares . Ótimo custo benefício ."
        }
    ],
    "reviews_count": 75
}