{
    "name": "El Nuevo Valle",
    "place_id": "ChIJr_0yWEP1wokRohrfP83PS0w",
    "grid": "BX4",
    "address": "268 E 167th St, Bronx, NY 10456, USA",
    "rating": 3.7,
    "user_ratings_total": 169,
    "phone_number": "(917) 801-0086",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWVVrdG9PVmgzYVZFM1pGRkRSalU0ZVdGS1kwRRAB",
            "text": "I made an order for delivery and never got the order, smh. Such a waste of time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeGRWODFMVUZuWVd0U1NWSnpOMlpHV2toVVJsRRAB",
            "text": "They have the worse customer service. The food was bad as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwak5IQlhkbXRZWm5WNWQzWkdTakJSY1dSNVJWRRAB",
            "text": "I placed an $20 order on Grubhub for a chicken combo. I received one thigh and rice and beans. When I called to let them know they maybe made a mistake (very politely) I was met with “oh I don’t know what to tell you the boss is not here. Call back in 10 minutes” . I called back multiple times and they continued to decline my call."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb1ZuQnBVRlpDTTNGZlIzTkNWMVEyZUVOR1VIYxAB",
            "text": "This used to be my Spanish spot but now they hired anyone. Lady kept rush my order when I normally order $50 or up because it's for my entire family. Yet she rushed me, didn't get any of my orders right and gave me beans when I kept telling her no beans, highly allergic."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdFJESkNaVVZJU25CalMwUXlkVTF4ZDBSNFIxRRAB",
            "text": "Staff very rude"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc01qbE1kMjVPVEdKS1UwMXllbEpQYzFGbWJWRRAB",
            "text": "Needs improvement"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQLXI5cnY5bzk3WXN3RRAB",
            "text": "Pedi un mondongo y un morir soñando, el mondongo olía horrible y el morir soñando tenia sabor rancio, ultima vez que ordeno en este lugar, deberian de cerrarlo por insalubridad me dejó un malestar estomacal su comida"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJamNubk9BEAE",
            "text": "Tremendo lugar servicio1"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNkxDYS1nRRAB",
            "text": "Servicio horible. No ponen atencion a enviar la orden corecta despues duran una eternidad para enviar el resto de la orden y todavia no corecta"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLThLSFp3EAE",
            "text": "Although the food was good the customer service by one of the women in the front was disrespectful and disgusting. Out of the 15+ years I’ve been ordering from this place I was truly disappointed in how my father and I were treated. I understand that she might’ve been busy on the phone but to say that we think they’re in the back “playing around” is truly unprofessional to say to a customer especially if we’ve been waiting more than 10 minutes to be attended. After such words were exchanged, the attitude continued. El Valle Restaurant management needs to do better when hiring people because I would hateee for them to lose a loyal customer and more to come because of such disgusting customer service their employees have."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNmIzTTR3RRAB",
            "text": "Servicio amable, comida deliciosa"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN2VyVmdBRRAB",
            "text": "La comida muy bien y la atención excelente"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MFk3b0pnEAE",
            "text": "Thieves, bad attitude and took forever to attend. They give good options to then over charge you. $20 for a lunch."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNmVINkt3EAE",
            "text": "The pork chops, baked chicken, fried pork is really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaGZIQkN3EAE",
            "text": "I love their food, specific their beef steak."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaWNUcWp3RRAB",
            "text": "Great customer service.\nBut the food was a disappointment. Like the rice and the meat was there for more than 2 days. Please don't give left over food like fresh food.\nThank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdS1xc3VnRRAB",
            "text": "It's a hit or miss, food is not consistent in flavor. It's incredibly loud and I am not fond of yelling to place my order."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeTc3QmR3EAE",
            "text": "When I’m in The Bronx this is the Dominican restaurant I eat from. The food is too good. My fiancé and I are always surprised at the price like it’s our first time eating there😂😂 definitely affordable and well made. The white rice is amazing with chicken gravy and grilled chicken. If you like the yellow rice or the rice and peas, get it with some chicken gravy and if available get fish with it or the fried chicken. Their chicken is so delicious and taste clean. Might seem weird but I can actually differentiate clean chicken and unclean chicken. Their chicken is packed with flavors and everything nice. Tastes like they parboil the chicken which is also common in African cuisine. I love that. Siempre vendré aquí cualquier día y hora❗️❗️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ3RlQ3Z3RRAB",
            "text": "They feed their own kind first I stood there in a line waiting  to be called next a Dominican man came through the door and started to speak  Spanish the lady started to make his food when I asked are you really serving his food after I’ve been here waiting she replied yes i walked out after wasting 10 mins of my break with no food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ekxPbFpnEAE",
            "text": "Absolutely horrible customer service. Came for a pickup stood there for 10+ minutes. When I got home my food was cold. They didn’t put the soda that comes with with the combo also didn’t give the option of salad or totone as combos usually come.  Came here only because I didn’t feel like driving to my usual spot and it’ll be my last time. I’ve went in twice and the women do not have proper manners."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cHZEOHR3RRAB",
            "text": "Muy bueno volveré siempre que pueda estar con mi familia y amigos.. gracias"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMUpyS1R3EAE",
            "text": "the waitress was very friendly and the food was on point with creo cuisine"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbmVTbjZBRRAB",
            "text": "La comida está mmmm\nPero lo peor de este lugar es que TE COBRAN  5.00$ POR COMER AHÍ ES RIDICULO QUE TE COBRARTE !!!!\nLe pregunté ala mesera cuando vi que tenías un cobro de 5.00$ en mi recibo. Su respuesta fue que cobran por comer ahí hahaha\nLos pagué pero nunca regresaré a ese lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOElXbElREAE",
            "text": "This restaurant is RACIST. if they deem you as not being Hispanic, you will be left standing there looking stupid. I have worked across the street for a decade. Any time I have ever eaten their bland, dry, food has been because I had a “translator” there. The issue is not that they have no English speaking staff, because I encountered workers who do, in fact, understand me. Before they even SPEAK to you to determine if there’s a language barrier, they determine if they want to serve you or not. Go to any other restaurant on this block. Not here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dy1hd253RRAB",
            "text": "Absolute worst establishment. I am domican my girlfriend is black.. she went in first and they immediately make her feel unwelcome.. With many tables available they said the tables were reserved. Which was a lie because as soon as i walked in me and my girlfriend got a table.. They said they didn’t understand what she was asking for yet knew to tell her the tables were reserved.. BLATANT RACISM.. Add that to the fact that the food was Terrible besides the chicken that was fresh the rice was hard and cold, the beans taste more line vinegar and salt than anything else… Besides the waiter being cool (Maybe bwcause  she saw our reaction) this is a no go zone! Dark skin people being racist against dark skin people is out of this world!!! Shame on the You!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OUxEdGNREAE",
            "text": "La Comida es deliciosa!!!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5M2FydXBBRRAB",
            "text": "Très content"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMVpTNVdREAE",
            "text": "THEY ARE RUDE ! Customer service is horrible as if they don’t have patience ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaHZxOGxBRRAB",
            "text": "Went to eat their today staff is super unfriendly . Lady looked at me like I was stupid when ordering as if I have to known Spanish to order smh which I do but not the point rice is un seasoned and the penne was old she gave us all fat disgusting will never eat here again  mad I spent $40 on food that was so nasty smh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcWVYendRRRAB",
            "text": "Food and service was great will be going back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOGZTMVBREAE",
            "text": "DO NOT !!! DO NOT ORDER FROM THIS RESTAURANT THE DELIVERY DRIVERS AND WAITRESSES ARE VERY PREJUDICE AND NASTY PEOPLE !!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWXzZyWU5BEAE",
            "text": "Comida regular buen lugar servicio regular"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLXZYS3dRRRAB",
            "text": "This location is great for last minute meals... On the nights where you're just too tired to cook, pass by and pick an order to go. They do have seating available. Food is always hot and ready. Be prepared to wait if you're ordering cook-to-order meals. Ready to go meals like chiccarron de pollo are constantly being made and they are ready to service you."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWNUozcWdBRRAB",
            "text": "Servicio malo pero la comida esta bunea deberad"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMWV1S1NnEAE",
            "text": "Best mangu in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwclkzSi1nRRAB",
            "text": "Took pretty long for the food but other then that good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaXQtSUFnEAE",
            "text": "This restaurant got me tired, what is wrong with them, they always take more than an hour to sent your order, if they do, and the restaurant is literally like 7 minutes away from my house, they don’t deserve not even one star, this is not the first time !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbzVmRG5nRRAB",
            "text": "Got breakfast it was good."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdEp2MTZnRRAB",
            "text": "La amabilidad la higiene i el sabor de la comida"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcUx2RmVBEAE",
            "text": "The people that work here act like they can’t see you waiting on line to order food very bias service wouldn’t recommend this place to happy person that wants to have a quick grub"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM19QVnVRRRAB",
            "text": "A lot of the waitresses have a very bad attitude towards the customer especially the female the male waitress are much more friendly and much more likable"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcDdHbnRRRRAB",
            "text": "I love their food!! I used to live around the corner and was frequenting this place before the renovations. Everything is good here. The chicken soup, macaroni/potato salad, chicken, rice and beans, everything. When I am back in the neighborhood I will visit again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OWVLZXhBRRAB",
            "text": "Forgot my cake and gave me a rare steak. I had to google if it is even safe to eat a rare steak. They said they will deliver my cake that they forgot but 30 mins in of waiting, I hope they dont come here because, he will hear my complaint. Waist of money"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteXNITnZ3RRAB",
            "text": "The place was great. The people were very nice and helpful. Love this place. The food was tasty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNllISkhnEAE",
            "text": "The experience was extraordinary. The staff treated us like family. I will come back with more people when I get back to N.Y."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOWFfUWJBEAE",
            "text": "Buen lugar ambiente perfecto buen servicio y todo muy rico lo recomiendo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbl9xWGx3RRAB",
            "text": "Very Good Food\nBest Latin Food In The Area\nThis Was A lasagna W Stuffed Chicken\nTried To Overcharge\nThey Make Up Prices"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxanByUUFREAE",
            "text": "I asked for turkey white rice and I wanted three pieces of pineapple. The manager complained that she needed to save some pineapple for the next customer. I was the only one in the place. The service is horrible and the beans are the most…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNnFYS0tREAE",
            "text": "I am only leaving a one star review because zero stars are not an option. I used to come to this restaurant weekly. After tonight's interaction, not only did the restaurant lose out on my initial purchase (due to staff negligence and confrontational behavior) but also my future dollars as well. I was ignored by employees and made to wait for 10 minutes to order my food, while a female employee was flirting with another patron (who already ordered). When the staff finally acknowledged me, they then told me they wouldnt complete my order even though what I asked for was clearly on display and ready to be served. Even though this store is located in a Latinx neighborhood, as a Black patron I am highly concerned with the optics of the service I just received. I hope other people who look like aren't being treated in the same manner."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM01MRW5nRRAB",
            "text": "⚠️ This restaurant is not clean. First of all they use the same meat board to cut all different meats on it and don’t clean it after cutting. They just scrap the bits of meat off. What about people who don’t eat certain type of meat??? this…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTaTlPZ0RBEAE",
            "text": "1 star simply because the staff serving the food don’t know how to wear their masks properly. On multiple occasions, I have come to this  restaurant to order food on behalf of someone else and have seen the staff speaking over the food while on the phone or while talking to other staff members. Considering that we are still amidst a pandemic this isn’t something to take lightly. Also, at one point I saw a staff member touching the chickens being cut with the same gloves she was using to handle her mobile phone and the money.\n\nThe food may be alright, but this is something to take into consideration."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycVotbG9BRRAB",
            "text": "Order scheduled delivery from ubereats, great promo buy one get one chicken mini combo, amazing right????? Employee, a lady calls me directly to my cell and lets me know that delivery will not be made because there are no delivery drivers, excuse me!!! Delivery drivers get automatically get notified through ubereats of pending or ready to pickup orders. I told her she makes no sense, delivery people work for ubereats and her excuse was that I’m too far away. I’m like I have ordered here before and I have ordered as far as 4 miles away from my house. She forced me to cancel order because she said order will not be delivered and there will be no delivery people available."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc2QtVHBnRRAB",
            "text": "Firstly, this restaurant has the WORST customer service. For a restaurant that typically isn’t busy at the time I ordered food they sure don’t know how to answer their phone. I ordered through Grubhub and my order ended up being 30+ minutes…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTaU9ydUNnEAE",
            "text": "La comida es buena pero la atención y amabilidad al cliente no es la mejor. Las que sirven no tienen paciencia a la hora del cliente seleccionar su comida, tampoco conversan aún ya siendo un cliente frecuente. Sólo es pide rápido y vete al igual cuando se ordena por teléfono."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdFpiU2JnEAE",
            "text": "I’ve ordered like 6 times from here and always the chicken is moist and pork is juicy everything is super tasty I don’t know about the other reviews I see here man I saw and was like what at least until now everything has been good I like…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZ3ZUakJnEAE",
            "text": "Food was good, waitresses were very attentive and friendly,  but the kitchen was very slow to bring the food even though the place was empty."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodHJHNUhnEAE",
            "text": "Primera vez en este lugar, tanto el desayuno como comida excelente calidad vs precio. Realmente no puedo confirmar nada negativo. Lo recomiendo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNnBtUWtRRRAB",
            "text": "HORRIBLE SERVICE, they  gave me the wrong order and didn’t care to change it!!  Chicken isn’t cleaned properly and doesn’t taste fresh"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDOTlXeG53RRAB",
            "text": "Staff is very rude. Food is always cold! I asked to speak with a manager and they had me on hold for 20 mins and still no manager. Don’t even waste your time!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybVotUF9RRRAB",
            "text": "Order a baked chicken breast lunch today with white rice and beans received by delivery 2 hours later and it was the wrong chicken piece call they said they will send the chicken breast had to wait another hour when my chicken finally…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aXB6VF9BRRAB",
            "text": "Literally the worst service ever. Walked in for a lunch meal to go and left 40 minutes later can’t imagine delivery .SMH"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2djdDZmpRRRAB",
            "text": "Great food, great personality, I travel every two weeks from Connecticut for the best Spanish food.. .😋😋😋"
        }
    ],
    "reviews_count": 62
}