{
    "name": "Aminas Cafe",
    "place_id": "ChIJbfbnmDT0wokRpM-uZkcOZU4",
    "grid": "BX4",
    "address": "890 Morris Ave, Bronx, NY 10451, USA",
    "rating": 4.5,
    "user_ratings_total": 161,
    "phone_number": "(917) 631-9203",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWFVXbEVVa2w1WnkxUVpURjNUVEZwVHpRdGRIYxAB",
            "text": "Amazing Mexican restaurant! The food was absolutely delicious with authentic homemade flavors and generous portions. The staff was super friendly and the atmosphere was warm and inviting. Definitely coming back! 🌮"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb1FrcHhVVEpuY1ZsZlIybHVRVU5WYm5sYVRIYxAB",
            "text": "I love coming to Amina’s cafe and frequent the restaurant often. I’m usually greeted by a nice woman whose cat roams the backyard area but my last experience she wasn’t there. It was a different woman and a man in the kitchen instead. Everything was fine until I went to pay and and was charged $10.99 for a SINGLE waffle. The menu stated $7.00 so I communicated that to the cashier who then called over the man in the kitchen. They went back and fourth and the man looks at me and goes “it’s $7.99” 😐 no apologies for the confusion or even accountability for the mistake on their end.\n\nIt is not my fault you have not updated the prices on your menus! It also says $7 on the menu, not $7.99. The way he spoke to me was with such attitude I really didn’t appreciate it especially considering I come here quite often. I’m going to give Amina’s cafe a break until they can figure out the prices on their menus and the attitude they give the people that are supporting their restaurant."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFZuRmZWWFZYVm5ad1VtcGZja3h6UWxKQ1ozYxAB",
            "text": "The staff's service and the food were delicious. I would like to go again if I have the opportunity."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MU4xQlRZa05pV0dnd1J6bG5TbGc0VDB0UFNWRRAB",
            "text": "First time customers. Family run. Great vibe. Food was tasty. A Grade from DOH."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa1dVSkpXR1pMV0hJd2FrNUthMDlPV21WWFMxRRAB",
            "text": "They renovated a few things inside the cities are great. They also have an outside city, and the food is up to par. It's amazing, authentic homemade with me.I'm messaging food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdWMxVlNOMlp5UVdVeVlYWTNRemxYZFdkRlduYxAB",
            "text": "What a wonderful find in an unlikely place.\nI am mentoring a young girl whose name happens to be the same as the shop.  She saw it and got all excited when we drove by.  I decided to bring her there today and it was a delight.\n\nWe both enjoyed the food, the atmosphere on the outdoor patio, the service was spectacular, and the lemonade was delicious.  We will be back.  Thank you, Diego"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KemNFUkVOWG94ZDBOWVIyTldRa0ZTU0ZsU1RIYxAB",
            "text": "Went today got the chilakiles breakfast was soo good my daughter got a waffle and got chocolate I got mocha it was delicious prices are reasonable for the home made food will come back again also the server was very nice polite it was a bit busy would recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLaWQxNnk2c01Xb0d3EAE",
            "text": "I used to love coming here - I was a customer for almost 2 years. I came in today and there was completely new ownership. Rosie and her family no longer own it.\n\nI got shrimp tacos and the rice and beans. The rice and beans were very very bland, and the tacos were okay but not as good as they used to be. Also, the prices went up. Worse food, higher prices. I miss the old Amina's."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ3N2ZDNZX29tYXBnRRAB",
            "text": "the birria was really good. it was a birria quesadilla if i remember correctly. the consomme was so flavorful.\n\nhmmmm...what else?\n\noh the flautas. HIDEOUS TASTING. too much flour/bread/tortilla and not enough meat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWFA2dl80bHBEVFVBEAE",
            "text": "Ordered chicken torta, steak sope and churro waffle. Very yummy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aE5xckdnEAE",
            "text": "The food was incredible, the establishment was clean and gave off a really cozy feeling. Would highly recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBemY3WFBBEAE",
            "text": "Nice, clean and friendly. The food is decent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZzZlNUVnEAE",
            "text": "Great customer service and food, made a mistake and placed a order for pickup instead of delivery, when I called to cxl, they offed and brought to me with out hesitation. She did not have to do it! This felt so good as a customer! Thank you again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmb2FpTHNBRRAB",
            "text": "Terrible value for the money. This is just a small, regular spot—nothing fancy—and they charged me $14.12 for 3 tiny tacos. No special ingredients, no extra effort in flavor, just basic and overpriced. For that price, I expected way more. Definitely not worth it, and I won’t be coming back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpLXJ5bHpRRRAB",
            "text": "Love the chicken and the atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMzl1b3dRRRAB",
            "text": "Very welcoming"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaXYyenBRRRAB",
            "text": "Aminas is always great! I have been coming for more than 4 years and I just can't have enough of her \"Bistec Encebollado\"(Grill steak with Grill Onions). My child loves her Chicken Quesadilla! Their food is authentic, fresh, delicious and always hot! Ms. Rosy is always kind and always delivers food with a smile! Come and enjoy Real Home Made Authentic Mexican food, you will keep coming back. And do not leave without having a hot brewed cup of coffee or cappuccino!! 😋😋😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMHJ2b0NnEAE",
            "text": "Nice Family Place"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0eUtfSUt3EAE",
            "text": "It is a very cute small and friendly space. It is on grubhub and uber eats. I love this small place. It is american and mexican food. I also get a create your own breakfast wrap. I give it 5 stars because it is very friendly place and the service was pretty great. I recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMc3VHZGZREAE",
            "text": "Enjoyed a deliciously seasoned chicken quesadilla in their cute and shaded backyard!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6LTRMekxnEAE",
            "text": "Fantastic personal service, good food, cool digs"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dklDb2hBRRAB",
            "text": "Great service, great atmosphere, big menu with variety of food. The outdoor area is very nice and everyone was super nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbWVPb1F3EAE",
            "text": "I love going to amina's Cafe because it's like a family setting and the food is excellent and fresh and the staff is very friendly and you feel like family eating at Amanda's Cafe I enjoy going there for breakfast and lunch I'm very quiet and clean try it out don't miss out it's in the Bronx so Morris between 16th morning 162 delicious Mexican food have a nice day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqc3BEdGFBEAE",
            "text": "Place is great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaU5faW93RRAB",
            "text": "The ambiance was surprisingly pleasant, featuring a tranquil backyard dining area that exuded a relaxing atmosphere. The culinary offerings showcased a delightful array of freshly prepared, homemade dishes that tantalized the taste buds with their savory flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbTU3LXd3RRAB",
            "text": "Good food 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeXZ6QklnEAE",
            "text": "I was in the neighborhood and wanted to eat something different so I figured I’d walk into this little shop to eat Mexican food. I immediately noticed that the prices are either not on the items or the price is written over painters tape and is hard to read. A few public defenders from the courthouse were taking a long time paying their tab so I just left. When I came back into the shop I noticed that the same two older Mexican women were sitting down, comfortably chatting away by the register, the cashier lady was taking an order and there was a child doing homework in the dining room. Needless to say but I will not be going back to this spot. This is one of the poorest, most run-down neighborhoods in The Bronx and this little Mexican spot epitomizes the disdain I have for supporting independent eateries. My advice to the owners is please do better.  I walked in there twice and it felt hostile and inhospitable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NGEyNUhREAE",
            "text": "So even though my experience was not the best with the delivery,  I want to make clear that I believe the store was not to blame for this and it was the delivery guy swinging the bag on the floor and as soon as he opened it he cursed and said omg. The coffee and hot chocolate was spilled everywhere. I received most of my money back but the fees, taxes and tip were not returned.\nWhat I loved about the person I spoke to on the phone, was that she was very apologetic for what occurred. She also ended up calling me back and leaving a very nice message apologizing again. This action made this experience an easy pill to swallow today. And yes I will give it another try. The food looked like it would have been great and my brother said the coffee was great and the hot chocolate, well what was left of it was great too.\nHints to why the restaurant gets a four. It wasn’t there fault, the little I could taste that was soaked was decent and they way they recovered. ✊🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cTc2V0x3EAE",
            "text": "Stopped here on a work trip and had a wonderful breakfast to start my day. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N052NTh3RRAB",
            "text": "the food is great ! the tacos and the breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMnJPTGd3RRAB",
            "text": "Food is SO AMAZING! Came in for the first time and the staff treated me like family, ordered a quesadilla/ guacamole after seeing It was highly rated in other reviews. Highly recommend! 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcF9TLUlBEAE",
            "text": "Great hole-in-the-wall spot for delicious Mexican food!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBejhIbHd3RRAB",
            "text": "Everything here is made with love and passion for the food they also wheelchair accessible, an backyard to enjoy the out doors and eat I have no complaints about Aminas I'm craving a quesadilla now lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aG9mWnd3RRAB",
            "text": "I ordered a torta de milanesa de pollo (breaded chicken) which is my all time favorite. The torta they served me was nice and packed with the ingredients needed and fresh. The hospitality was amazing not only to me as a fellow mexican but to the rest of the patrons of the establishment while I stayed there for the short time. Definitely left a great impression on me and will return when I am in the area. Muchas gracias!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaODR1U1FnEAE",
            "text": "The food is delicious. The staff were amazingly friendly. The backyard is very spacious and cozy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwLTVHTXBRRRAB",
            "text": "Great food and ambiance, three times in a row. Best place for a great brunch with friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cEszVHZnRRAB",
            "text": "Tried this local spot for the first time with high hopes and was not disappointed! The staff greeted us warmly and the service was great.  The food was fresh and delicious.  We sat in the cute patio and had a great time.  Green juice, mango smoothie, Cuban sandwich, chicken quesadilla, fries and fresh pico and guacamole, all wonderful! Just when I thought we had enough, the sweet aroma of cinnamon sprinkled cappuccino wafted over. BEST CAPPUCCINO I’ve had in YEARS! I forgot to take a picture of our food because it smelled so good, but you can see the results here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbnBPcFh3EAE",
            "text": "Ordered catering for my organization's board meeting. Highly reccommend the chicken parm or the eggplant parm. So delicious, came on time, and very professional."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCei1qQ1BnEAE",
            "text": "Paid $10 for a croissant sandwich that was completely unseasoned (not even salt and pepper!) and there wasnt even cheese on it... it was like 5 bites total, of bland nothingness. Onion rings were also clearly old/ stale, and soggy. Gross."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtekxxRnNRRRAB",
            "text": "Excelente comida , excelente servicio 👏 gracias aminas café"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNDUybDhRRRAB",
            "text": "Fantastic food and wonderful environment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM0xldXNBRRAB",
            "text": "I give it a three because it looks good and I'm sure most people would find the food very good I think but I'm a nachos girl and theirs  just didn't make it for me\nIt was dry, not very tasty . didn't want any meat so thay kind of threw things off balance.I suggested a little more beans.\nService was excellent\nClean\nI did take out, waiting was pleasant. Nice decor, looks good. still for me, not authentic enough .\nit's a lovely place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaUxTU2F3EAE",
            "text": "Their food is so delicious. Very authentic. Idk how people go to Chipotle over them."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydDdpbnpnRRAB",
            "text": "I'm only giving this a one star because the prices they have hanging in the store is not the same price you are going to be charged.. the food item I ordered the Mexican Toast is shown as $7.50 but I was actually charged $10.87 and the girl…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaDV1enhnRRAB",
            "text": "Very welcoming and delicious food !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXN3JHSHR3RRAB",
            "text": "Authentic, delicious, just like grandma would make it! My family ,friends and I eat every bite with a smile.\nMy favorite dishes are Hand Made Steak Quesadilla, Enchiladas De Mole, Chimichanga.. The list goes on!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNmVUazlRRRAB",
            "text": "The service is always impeccable in this authentic Mexican cafe that also has America food and the best smoothies.  They notice you right away with a smile, and point out special menu items. Food is delicious, perfectly seasoned. They make…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeVkyYTNRRRAB",
            "text": "This place is a great place to eat."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcWFfYzlRRRAB",
            "text": "Food is great & employees are friendly 😁"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdmRQNmt3RRAB",
            "text": "The woman behind the counter is so kind and polite, and the food was amazing!! I definitely recommend going here"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwN016TGlnRRAB",
            "text": "It was my first time there. The service was great. The Tocas was delicious.  So was the chicken noodle soup. I love the outdoor seating in the back. Very relaxing."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDN05lT0h3EAE",
            "text": "Love this place ever since it opened it's our go to for lots of different yummy foods especial the flan 😉…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBd1BxYnZnRRAB",
            "text": "The torta de pollo was fresh and tasty. the service was friendly but a bit slow. The chicken noodle soup needed more chicken and more vegetables to match the picture shown on the menu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxX2U3djlRRRAB",
            "text": "Great owner! Great staff! The food is always great! Great price! I visit frequently and i am always happy to eat here. Her Tacos are the best. Try her natural juices as well! And her coffee fresh and on point! Best place to eat in this area, you will not regret it!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDemE3Mmp3RRAB",
            "text": "Amina's Cafe is an extraordinary place with amazing food and very kind people who work there.\nSeriously some of the nicest people you will ever meet!\n\nMy wife and our son really enjoy the food here. We order quite a bit from here whether it's breakfast or lunch. Sometimes we even eat in the restaurant.\n\nThey have a lovely back space as well!\nGreat for children's parties.\n\nThis place is a jewel in the South Bronx!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBb0szNFpnEAE",
            "text": "I got a typical breakfast. Blueberry pancakes, bacon, scrambled eggs, and sausage. With orange juice and a smoothie. Everything was cooked and seasoned perfectly.\n\nMy issues are that there isn't a syrup container, just very small syrup packets. I only had one egg. The bacon was far too crispy for my taste, but didn't choke me. It was borderline burnt. The smoothie was supposed to be to go. But I guess not. I got a container of Orange juice\n\nThere is a constant chill in the air. Like I'm standing under a fan. As a result my food is cold within minutes of ordering. The tables are tiny. I don't recommend eating in unless absolutely necessary."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMktUY0pnEAE",
            "text": "After in the courts and lunch break looking for a hour a place with tables and bingo. Place clean the owner cute little mexican lady. First thing she said your face look worried.  I was not sure what to eat. She recommended the chixken plus…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDc19HejhRRRAB",
            "text": "The food is delicious and inexpensive. They have a outdoor dining in the back. Only thing missing is alcohol drinks. If they had that i would of gave them 5 stars"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHa05pakNnEAE",
            "text": "When my daughter asked for pancakes with bananas, chocolate chips and strawberries, we thought they would slice the fruit over the pancakes but instead they made one pancake with strawberries, one pancake with bananas and one pancake with…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbWJqMzJRRRAB",
            "text": "Very good chorizos!! Very good tostadas!! Very good Gorditas (highly recommended)!! Also reasonably priced. Better than Chipotle's in my opinion. Will be coming by more often!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbl9HWUZBEAE",
            "text": "Geat an cozy little Mexican restaurant that treats you warm and caters to your enjoyment.  Excellent food choice and flavor.  Also very healthy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwaU1qLVN3EAE",
            "text": "Really good food and they have a great variety. if you are close to the courthouse and need something quick and tasty, go and try for yourself"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMHY2SFZREAE",
            "text": "Ordered from here this morning through Seamless & was beyond disappointed! The food taste as if it were dropped on the floor and after eating half I had food poisoning! Never again!"
        }
    ],
    "reviews_count": 63
}