{
    "name": "Hibachi Grill & Supreme Buffet",
    "place_id": "ChIJz1bWKzP0wokR_jPvzp24RE0",
    "grid": "BX4",
    "address": "200 E 161st St, Bronx, NY 10451, USA",
    "rating": 4.3,
    "user_ratings_total": 4927,
    "phone_number": "(718) 590-1627",
    "reviews": [
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldW9pdlRREAE",
            "text": "The food is great. The only issue is that  sometimes the waiters will ignore when you try to ask for a refill. After everything is good."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMVRtOVBNVlY1VUZoa1MwTkdXSGQxVFhsc1NIYxAB",
            "text": "The food here deserves some strong language of approval. The flavors are extraordinary. They charge fairly, provide good service, and cook wonderful food. Workers here provide excellent service overall. The experience here satisfies fully."
        },
        {
            "date": "4일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd2MyVm5UVnB6VFRSaU5VMUZlRjlzVm5WRFdFRRAB",
            "text": "Muy buena opción para comer bién y económico en Nueva York"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPamZhMGZREAE",
            "text": "They have an area for bigger groups, the food is great, the same variety every time. The female bathroom is always dirty. The workers do hang around the table while you are eating causing you to feel a bit rushed. But they also do a good job at refilling drinks and removing dirty plates. Overall a good buffet for the bronx."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ob1VXUlRkRFZSUWtKUVRWQkViR2xLY0drNGRVRRAB",
            "text": "If I could give zero ratings I would. FOOD WAS HORRIBLE.  MANAGER WAS NASTY AND RUDE.. I should have known something with them having a grade pending...Very unsanitary"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOclMzcHlVbEZaUVZsa09HWlZSeTFvUVZoTGNuYxAB",
            "text": "This place is great. The food is delicious. My rating might be a little contradictory because of what I’m about to say to stay away from the raw oyster lol.. maybe I shouldn’t be eating oysters at buffets lol.. I got very bad food poisoning from eating a single oyster here. The reason I know it was because of the raw oyster is because I have came many times before and never ate the raw\noyster and never got sick.. Apart from that everything else is great. There’s so many options from sushi, to fried chicken to lasagna. Honestly a lot to eat here.Also wanted to mention the soda is great and doesn’t taste flat. The employees here work so hard and so fast. I will come back, just not to eat the oysters lol"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTFUyaFVRemRITFhWVlNFZG1iVkJEWldGRVgzYxAB",
            "text": "When it’s your birthday and you bring a cake and give it to them they bring it out with sparkers and play happy birthday over the speakers and other people around you join in really cool…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUVoxTlRZblZxWXpoSkxVUXlSSHB6YzFsQmRuYxAB",
            "text": "Great place for lunch or dinner 😋. Price is very fair for the amount of food you can eat👍."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veWVXUm9PVEUxTkdOSE9HcE9NMjlvUmpSMlFWRRAB",
            "text": "Great experience! Friendly staff and a very cozy vibe."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SblUyaHVPRmRxWWs1RWJrbHFVR0ZwZVhrek4yYxAB",
            "text": "I love this place; best place for crabs which are so addictive. I'm thankful for this place as it is very affordable and comfortable. The atmosphere is welcoming and even feels like an upscale restaurant. I 💯% recommend"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaUlMQ09nEAE",
            "text": "If you love sushi, this is definitely the best place to go"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR2NWRk9YMjVRZW5aeldYTTVWa3htVm5jdFZWRRAB",
            "text": "Perfect place for a family dinner. Everyone enjoyed their meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVmFtdG1TRXBaTURkVVJGRnRlRnBWUnpkTFRHYxAB",
            "text": "It's great"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdVZuUnFlVXRsVkRkM1ZHTk1Ua1JvWkhwSGFtYxAB",
            "text": "Fuego🔥"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeVRIZGFiVFpRVkc5dFIxUlFlR3RXZDJoUU1rRRAB",
            "text": "Best buffet in the area. Food is always good with lots of varieties."
        },
        {
            "date": "3주 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scmRIbDRXV1pTU1VSTGJHUlJWVEJQUWs4eldFRRAB",
            "text": "Excelente restaurante com buffet liberado no Bronx. Como meu filho é super seletivo pra comida e em Nova York acaba sendo difícil encontrar pratos em restaurantes parecidos com o que comemos no Brasil com salada, arroz sem pimenta, legumes, etc, esse restaurante foi uma ótima opção com um ótimo preço comparado a outros restaurantes.\nTem de japonês a chinês, frutos do mar, salada, sorvete, doces, peixes e carnes, opções não faltam."
        },
        {
            "date": "4주 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1JqVlRWVkZvTmtKQ1MyUkpaV2xHV0hWMFVWRRAB",
            "text": "Alles top. Schönes Buffet. Waren Mittags dort. Guter Preis. Hatte Bauchschmerzen danach. So viel gegessen."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweU1IcGxiWGhaUVdoaU5XTmlSekJIYld0b1FtYxAB",
            "text": "Visiting NYC from Singapore. Chance upon this buffet as staying at Super 8 hotel nearby. For the price of $18.99 and the variety even Vegas buffet doesn’t have that much variety and doesn’t taste this good. This is much way better. You can even get flower crab and OYSTER, even salmon sushi. No doubt the Chinese food tastes way better than Panda Express for a similar pricing. Did I also mention there’s no tipping and service is much better than restaurant where I had to tip! RECOMMEND! Have to try a least once!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1JEWjFkblpCUjJvMVNUVm5UemczYWxsMFdWRRAB",
            "text": "Excelente comida y precio. Puedes comer todo lo que desees en el bufete por bajo costo"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaE4yRmxPRFE0UVVwdU5WTlJkbXhhTlZsNFlVRRAB",
            "text": "I love the place, amazing food, a huge variety, my favorite place, but last month I guess to early, goth there like at 1:30, the food was cold, and the bathroom smells very bad, they should clean that bathroom daily, and use bleach, then I go last week, same thing, this time, I went at 2:00, I took string beans, cold, I took fried fish cold, I understand the food be from the day before, but please get it hot, I got so sick, I couldn’t work the next day, and the bathroom, worse, it smell so nasty, dirty floor, the floor wet, and paper everywhere, to me this is the best place, but it has those issues, also I noticed, when is 3, all the steam is to their highest, they need to heat the food hot, so people doesn’t get sick!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aFptMXRVR0l3VUhkdlJUQm9hVlYxT0ZsTFdGRRAB",
            "text": "This place here is so good I went for my 20 birthday with my boyfriend and we had the time of our life eating talking omg we was bing a big back everything nice the food the people and also the bathroom lol very clean"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMllsTk5RMUY1VlU5NVkxQm5RMk5UYjI1RkxXYxAB",
            "text": "First and foremost, I enjoy visiting your location. It is the closest all you can eat buffet near me and the food there is really good. The restrooms though can use a little bit more maintenance.\n\nLast night, I experienced something uncalled for. One of your staff members asked me to leave a tip. First of all, leaving a tip is optional and should be at all dining locations but I understand some restaurants include it in the bill which in my opinion is aggressive. Restaurants that DO do that should pay their staff a better wage.\n\nAnyways, please teach your staff manner and proper customer service etiquette. It is actually a deterrent to force someone to leave a tip and I am sure your establishment would hate to start losing customers especially after seeing reviews that are honest and transparent such as mine."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWWFIZ3RWSGhYV2pkT2JsZE9hM0o1WW5Kdk1WRRAB",
            "text": "Primera vez en Hibachi Grill y la verdad quedé encantada con la gran variedad de platos y lo exquisito que estaba todo.\nProbé varias opciones y todo superó mis expectativas.\nTienen de todo para cada gusto, gran variedad de pescados, mariscos, carnes, postres y hasta helados.\n\nRecomiendo mucho el camarón empanizado y el pollo teriyaki.\n\nAl momento de llegar no tuve que esperar por una mesa, pero en cuestión de minutos ya no habían mesas disponibles, recomiendo hacer reserva porque se hizo una gran fila.\n\nEl servicio es excelente, los camareros siempre están al pendiente.\n\nEl precio es bien razonable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUGMzRkVabEJKVjJsNmRFZGZTSHBSV2tGdlVWRRAB",
            "text": "A waiter telling my aunt on her birthday \"I'm waiting for my tip\" is rude and unprofessional!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd1MwbFZXRWxITmxGNmVYWklTbVJmZEdKamRrRRAB",
            "text": "Horrible!! Services they are very rude"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveFIxVndORFpxVGtnek1HcFBWa3hpV0dKTFQyYxAB",
            "text": "This is the number #1 buffet in the Bronx. There are many options to chose from like the sushi bar,\nThe hibachi grill station where you can chose what you want to put on the grill, vegan options for those who don’t eat meat, and etc.\n\nThe charge extra for any fountain drink but the water is free, and it’s sometimes challenging to signal a waiter for a refill but they come back.\n\nAlso this buffet is above  of a regal cinema theater  so it’s perfect for a night out to eat good and watch a movie ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcmQyOVdibGxDVWtReVRYcDViazExUjB0UFkwRRAB",
            "text": "My new favorite spot just stay away from oysters."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcGVsaEhObFowZG1neVJFbFZMVEIwT1hoSVUyYxAB",
            "text": "I had a good time here with my family. I was just wondering if they had any dishes that contain halal chicken/ meat?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV2RXUkRZa1JIVGxKQ05VRkNVbFZ3VmxaS2FGRRAB",
            "text": "Food is not good at all. The chicken wings and fruits were the only edible things. For your as well as everyone else’s safety stay as far away as you can from the Mac n cheese. Literally thought I was in the show fear factor! Still waiting for the cameras to pop out."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSFZqbHpNRzR4VWpsaWRHNXpRMFpEUzNCWE1VRRAB",
            "text": "comida china buena a bajo precio y mucha"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU1VEbGtUbmRDY2xwM1RIQktUMHBFT0doUmFIYxAB",
            "text": "Wow🤗🥰…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT0xUTnpORU5YY1RsVVMzTkpNekI1TjJoU01uYxAB",
            "text": "Its cheap as hell with lots of options. Was pleasantly surprised how good the sushi was. Fried chicken was really really good. Super busy on a saturday night but easy to get sat as a 2 top. Server was very attentive. Only issue is the bathrooms are pretty crazy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWemIxWlhRVXBKVVRSbU5XOXhkR1IwV25OM01sRRAB",
            "text": "I visited this place today. It was decent for the price. However, as I was leaving, a male staff member directly asked me for a tip. I had already paid an amount that included a service charge before entering, so I don’t understand why I was being asked to tip again. It made me feel uncomfortable. I was never even served by him — all the service, including clearing the dishes, was done by female staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMlVFaEtkREF4WjFFd09UQlVNRzA1YzJzMVpIYxAB",
            "text": "The only problem i had it's the way the waiters are i saw a waiter removed food from the table accross cause it was dinner time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q1dVRmZaMGh0UlRsNFpVRTVjbVIwZVRKRmFIYxAB",
            "text": "My friend told me not to come here because she got sick after, i should have listened, i threw up all night and had like i was having a fever. The food is very questionable. I would NOT recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVd2NrWXRaMVZMTW1zelZWSlRTVEEyTjJKU1JWRRAB",
            "text": "First time there.The food was great self service buffet.They have a variety of food Asian & American as well as sushi & fruit selections also dessert bar"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd2VrUkdNWGg2ZDFnM1VUQnlWa2sxZWpWSWJIYxAB",
            "text": "Good for tourists"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORlNYTk1VMTlNT1ZOeGVHSXhNREZ4UzB4NFNuYxAB",
            "text": "Es prácticamente el buffet de los hispanos y más de los dominicanos"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1lXUkdSRzlWWVd0T1prVTJWMU53U1RsM05uYxAB",
            "text": "No había amos terminado de comer y los meseros dejándonos saber que la propina no estaba incluida y a pesar de que el restaurante estaba con pocos comensales nos insinuaban que nos levantáramos de la mesa. Éramos un grupo de 4 adultos y dos niños de 4 y 6 años ."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb1ZIYzJWMWs1U1U1Sk4xWXhkSEZRYjJWcldFRRAB",
            "text": "My Family(19) and I recently visited and everyone enjoyed themselves.  It was my Aunts favorite spot and we were honoring her that day.  We'll definitely be coming back.  Thank you for accommodating us in a timely fashion.  🙏🏼 Be blessed. 🙌🏼"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYnVpWS1raXFUOTdnRRAB",
            "text": "Amazing and affordable ($20 + tax) buffet place. They offer an abundance of seating, but when I went here on a Sunday evening during dinner service it was PACKED.\n\nFrom standard Chinese buffet item, to sushi, to hibachi, to salad, to fruit, to dessert, and to ice cream they offer a great and delicious selection. All the food that I tried were delicious with the exception of the hibachi (too salty).\n\nThe waiter serving our table was very attentive in removing dirty plates and refilling the napkin."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS1Zrd3RkVkF3ZUhCRlptWjNUWE5MTlRGNk9XYxAB",
            "text": "This place was recommended by s friend so today I decided to bring my mom. As you as you enter staff is there to greet you. They will validate your parking just make sure to ask before you leave as long ia within 2 hrs. There's plenty of seating the ambiance is cool low lighting no loud music playing. You get a big container so you can take plenty of food. Definitely worth checking out after shopping, court course, movies or just looking for a place for lunch or dinner. Since its located in a mall you csn get other shopping done."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcWNfcG0wbk9LRjlnRRAB",
            "text": "ALL YOU CAN EAT @ a great price. We go at least 1 once a month and my in laws go there every weekend for the crab. My wife she gets hibachi style from the booth they have in the back. Options for all ages, and a lot of dessert options that are great snacks for the kids. Staff have their days but for the most part they cool. We went for Mother’s Day and this is what they had as a special occasion meal. We didn’t really like it might have been over cooked but it was a jammed packed day at this restaurant. Do recommend getting there early because it does get packed and there’s always a line after 11:45am."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUFVrZE1MVTVJU2xaNGNYWXhjMUYzWTBScU9IYxAB",
            "text": "Just eat from the hibachi station, forget about the rest. All food are either dry, tough and not even fresh. Try the general tsao chicken, then compare else where, you will believe what I said. Chicken wing has feathers on it, this is disgusting! The management needs to wake up, it has degraded, no worth going there any more."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMFJ6VnpSbUZGTlU5R1dqVk5PRFJqYmpsbk5YYxAB",
            "text": "Dirty sticky floors.\nLeft a tip and then were asked for a tip before leaving.\nThe food was non tasteful\nOverall location is awful, food was awful, service was awful! I wish I could have left a better review but there was literally nothing good about this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNdmhnNWZ2OTQtSGJnEAE",
            "text": "Customer service SUCKEDDDD !!! These workers were beyond rude and unprofessional, when I asked to speak to a manager they told me there was no manager on duty and they had no way in getting in contact with the manager. Plates were greasy, “chef” on hibachi grill didn’t use gloves. He was touching the shrimp with his bare hands and then the steak with bare hands, evidentially they’ve never heard of cross contamination or food allergies. I worked in many different restaurants even managed restaurants in my 12 years working in the food industry. I’ve never witnessed such a nasty place filled with nasty workers as 8 I did in this establishment. 0 out of 10 definitely wouldn’t recommend wasting your time or money!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid0tiNGx3RRAB",
            "text": "The food is acceptable, not really delicious but worth it for being AYCE. There is too much variety, I was surprised with so many options to eat that I couldn't try everything. There is everything from American, Asian, Japanese food. Etc. Also an important variety of desserts (acceptable as well).\nThe atmosphere is clean, a very spacious place and you usually don't have to wait long. The front desk staff is friendly but the staff who clean not much. When I got up from the table to go to the bathroom, a man who cleans demanded a tip from me (I hadn't even finished my stay). I tipped him and he thanked him in an angry way as if I should give him $100 as a tip. Anyway, I'll probably go another time with friends or family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aV9lSWlRRRAB",
            "text": "I loved loved this place. Took my kids here to try a different type of eating they actually loved it, never seen my daughter eat so much. It was her birthday. The only thing is it's kinda expensive but not for all u can eat. For 3 of us it was 62 dollars which was also for drinks. You can take out but they charge you by the weight.  Not gonna lie some of the food was a bit cold like the spring rolls but other then that everything was cooked good, tasted good and we will be going back! It's located in the concourse plaza  so plenty of parking. It gets crowded but still was a good experience they even have sushi, and hibachi as part of the buffet, ice cream, desserts omg so good. 100 recommend."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd0xuekNREAE",
            "text": "La comida es muy buena, siempre están rellenando, hay mucha variedad de carnes, mariscos, frutas y postres, para los que les gusta el suchi hay una sección de diferentes tipos de suchi, también si gustas puedes elegir tus ingredientes y un cocinero te lo prepara ahí mismo ya que cuenta con grill, las frutas están frescas y los postres son buenos, tienen helado para los niños, siempre esta lleno pero eso no es un problema porque el restaurante es realmente grande y hay mesas para todo tamaño de familias, los baños regularmente están limpios, si vas en carro ellos te facilitan un ticket para el parqueo, lo visitamos regularmente 1 vez al mes y no decepciona ni aburre, recomiendado"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOWUyU0h3EAE",
            "text": "If you’re hungry and want to eat delicious, definitely this is the place that you have to visit. When you enter you’ll pay for each person you’re going with, and after that they guide you to your table and give you the drinks. Then you take your plates, and serves all what you want. The ribs are awesome, the bittersweet chicken and beef are awesome, they also have different preparation’s with shrimp. I’ll come back for sure."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPbnZnXzNEdE5MRXdBRRAB",
            "text": "El pasado sábado 26 de abril fui a este lugar con mi hija y todo iba bien hasta que sentí un pedazo de metal enredado en mis dientes y alcanzó a lastimarme, cuando reclamé me dijeron que no me preocupara que eso no era nada que era un hecho aislado y que siguiera disfrutando la comida , lo cual ya no fue posible realmente tenía miedo que sucediera de nuevo, el gerente autorizó un reembolso de una de las entradas pero hasta el día de hoy nunca llegó, pésimo manejo de la situación y horrible forma de minimizar algo que pudo ser grave si me lo trago 😒"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscW9DQlN3EAE",
            "text": "Both my director and mentor kept telling me about this mysterious mall by 161st street. We were driving to a luxury suite where my mentor was heading. She told me that the mall had nice restaurants. After the director dropped us off, I walked my mentor to her suite, leading me to a sign that displayed a Hibachi place. I totally love Hibachi. And it’s a buffet. I got in a massive mall, and there was the restaurant. It was huge, well decorated, and gorgeous. Paid about 20 for a single person, got the food I wanted, and enjoyed every bite of it. The employees were well dressed, took me to a spot to eat in, and it was a day with less crowd. I can see that Wednesdays like most weekdays seem to have a less populated area, unless it is a holiday. The food was delicious, with food almost familiar to people who ate at local Chinese restaurant, but the preparation is better. I tipped the employee just before leaving. She said thank you very much. Would invite my friends here. There is a theater right next to this Hibachi. Enjoy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R1EwODJOM05MWHpJd1MxRTFhalJGVDNwWGJFRRAB",
            "text": "Honestly I can’t complain at all. It’s affordable, has tons of space, very clean and quick service. And the food is pretty darn good. Great for big parties or just by yourself. Tons of selections like poultry, red meats, seafood, fruits, salads, vegetables, and of course desserts. If you can make the trip up here you won’t be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkZ0lQSkxnEAE",
            "text": "It wasn't to bad, Food was actually pretty good and the service was on point because you serve your self and the people come to clean up and make sure you keep your Fork. And don't forget to Double up on your plates people. Great spot gets Super Packed but everyone is there to enjoy food and family and friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d2RGQlFSRVZKV0dWclVrNVRaSEZ0V2tseWJGRRAB",
            "text": "If you're looking for an all-you-can-eat experience that combines variety, quality, and great flavor, Hibachi Grill & Supreme Buffet is the place to be. This buffet-style restaurant offers a vast selection of dishes from various cuisines, ensuring there's something for everyone. Whether you're in the mood for sushi, fresh seafood, or traditional hibachi grill dishes, you'll find it all here.\n\nThe hibachi grill section is a standout. Watching the chefs cook your meal right in front of you is an experience in itself. The food is cooked fresh to order, and the flavors are bold and satisfying. The grill offers a wide range of meats, vegetables, and sauces that come together perfectly. You can also enjoy a variety of other Asian-inspired dishes, including stir-fries, noodle dishes, and dumplings.\n\nWhat sets this place apart is the sheer variety. There are also plenty of desserts and fruit options to top off your meal. The atmosphere is lively, and the service is attentive, making for an enjoyable dining experience.\n\nWhether you're coming for a casual meal or a big celebration, Hibachi Grill & Supreme Buffet offers endless delicious options that never disappoint."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVWRIRXlTMXBJVG1WTmVHczJkVGxJVW5obU5uYxAB",
            "text": "This place seemed like a great addition for 161st Street but I was wrong. The food unflavored, undercooked, and taste like mass production. $85 for 4 people is not bad but I could have spend less at my local Chinese restaurant and the food would have actually been good. The service were nice and kept the table clear but never again."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHM1lhN3VBRRAB",
            "text": "Great buffet. Plenty of selections. They offer hibachi. Lunch buffet is $13 for adults till 3pm. Dinner buffet is $18 dining for adults weekdays. $1 more on weekends. $2.50 refillable drinks. No lunch specials on Saturdays or Sundays."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaalBqTUpREAE",
            "text": "🍗🍤🥗🍰🍪🥮🍓🍊🍍🍇🥤💧me gusto mucho este hibachi grill, el lugar estaba limpio, el personal es atento desde que uno pasa sus puertas, la atención cuando estamos en la mesa es muy buena, están pendiente desde que desocupamos los platos para retirarlos , tienen gran variedad de platos, mariscos , carnes blancas, rojas, vegetales , frutas, pasta, postres, gelatinas de varios colores me encantaron pude degustar varios platos , y muchos me gustaron, quede satisfecha🍇🍪🥮🥤🍓🍰🍍🍊🥗🍗🍤💕💕💕💕💕"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWWRtdHhhWGxuWW5sbFRHTk5NbVZFUzNOV1VWRRAB",
            "text": "Food and service was good. Parking available in the lot but once you leave you have to pay to exit. One hour of eating, $42 charge for parking not known to us. Can't exit parking until paid. Do not recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX0x1MWxRRRAB",
            "text": "Expectations met! Came at 11:15am and there was a large selection of fresh food. Very good quality. Seemed pretty clean and sanitary as well. Large group of school children made it kind of loud but overall was a good experience and am happy. Perfect or you’re in the area to catch a Yankee game… short walk to stadium."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzhhcG5BRRAB",
            "text": "Comida muy buena. La atención de los meseros excelentes. Asistí el día de hoy al establecimiento y había muchísima fila. Recomiendo ir temprano para evitar aglomeraciones"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5clNucHlhbE0zVGpkclpERk5kMWhKVG1FNFVIYxAB",
            "text": "Worst buffet experience ever. Don’t waste your time or money.\n\nI came to Hibachi Grill Buffet expecting a good experience because of all the TikTok ads and positive reviews but honestly, it was disgusting.\n\nThe food tasted old and not fresh at all, especially the fried items. The crab almost made me vomit. Everything had a weird, off taste, and some things had a crunchy texture that shouldn’t have been there absolutely gross. We were supposed to stay for two hours, but we left after 45 minutes because we just couldn’t eat any more.\n\nThe place is big when it comes to seating, but there are not many food options, and none of them were worth it. On top of that, the floor was super dirty lots of food all over and they took forever to clean it. When we got to our table, it was sticky and wet. We had to clean it ourselves, and yet they still had the nerve to ask for tips when we were leaving and seemed upset when we didn’t leave any.\n\nAlso, the restaurant has a B grade, which says a lot about the cleanliness in the kitchen. I’m not surprised though, given how everything looked and tasted.\n\nWe traveled a long way from Queens just to be completely disappointed. I feel so dumb for trusting TikTok and giving this place a chance. It was packed on a Sunday, and even the other customers were messy. I’ve been to 4 different buffets before, and this is the only one where I saw this level of dirt and food on the floor.\n\nNever again. Worst buffet I’ve ever been to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MmUyYnV3RRAB",
            "text": "A good $20 AYCE buffet with large variety of meat, seafood, veggie, sushi and dessert options. Clean location though very crowded during dinner. Fast staff clearing tables and refulling trays.\n\nSaw one major issue while getting Hibachi, was very busy with multiple orders cooking. The cook flipped a new half raw order, then used the same utensils plated a cooked order right after. Also the sliced steak and meat was overcooked bone dry then splashed with chosed sauce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSb2ZIZERBEAE",
            "text": "Sushi is amazing. Wow I’ll definitely be back. They have lots of options for all family members. Pizza, fried food, rice, fresh healthy food, seafood, etc. but for me the sushi bar was the best."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbU5URndRazlpZWt3NE5VTlNaMGRwU1ZNeVVXYxAB",
            "text": "Long story short, go somewhere else. A staff member , MALE, tall, slim proceeded to follow me to the cash register to make sure I would pay extra for taking some food from the dinner section. I told him I would pay, he stared at me the ENTIRE TIME I ATE, then proceeded to walk me to the register acting as if he was doing something else. He followed me like I was stealing for $5. The manager’s name is LEE and I hope he is able to speak to staff about this. That was very unprofessional and unnecessary. I’ve been coming here for years, and that was my last time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLWG1vNG1IcTRhVGxnRRAB",
            "text": "The food is good and the interior is well maintained, the problem is the plaza is so too dirty, with lots and lots of garbage flying everywhere, one would just lose the appetite going there to eat! The restaurant should invest in cleaning the outside plaza of the restaurant, maybe together with the other stores there, it wouldn’t take much, just have it cleaned outside collecting the garbage in the morning and evening, if the restaurants want more people come to eat. Too bad, I would visit more often since I enjoyed especially the seafood dishes, but the outside of the mall is really off-putting because of the garbage and not for anticipating good food and nice time eating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZlEzUEdwMU1MUldnEAE",
            "text": "Every time I came here, I got so full that I didn’t even need to release the kraken In the toilets. The food here is diverse, more diverse than a Manhattan high school. You get what you pay for, and more with the addition of seeing your meat grilled in front of you. If you got 5 kids and all of them have birthdays back to back, come here, great food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMDhyaTZBRRAB",
            "text": "Affordable and appealing for everybody to definitely come here. So many different options and foods keeps on coming 😋 I highly recommend coming with your family or friends because food is so good but the service is even better. I can't wait to go back and stuff my face."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLS1mYUR3EAE",
            "text": "The food was great. They have a lot of food to choose. Once you get there you pay first and you eat all you want 🤗"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbU5HSEFnEAE",
            "text": "First time ever eating in a buffet in the Bronx. I was a bit hesitant but once my boyfriend said they were good and usually always packed I knew that it was gonna be good. Food was great, I went back for seconds and I had their fruit for dessert. I could have fallen asleep from a food coma there that’s how full I got lol. Although there was only one waitress for the section I was in I was treated well and she was attentive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnFENUJ3EAE",
            "text": "The people at the register when you come in very pleasant the servers need customer service training he waved us off when we called for him to the table.\nThe food the fried chicken is great recommend don't get the seafood no flavor at all. Their attempt to do a boil ultimate fail. The place is budget friendly. Suggestions add season butter some garlic as a side option or use it when making the seafood. Season flour on the fried shrimp or season the shrimp. I understand you have to be mindful of sodium"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MS1pcGlnRRAB",
            "text": "Great food and regular service but they need to pay more attention to the bathroom and cleanliness."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bVl6bHJBRRAB",
            "text": "Excellent place for a date night out or with family where it’s inexpensive good quality food. I especially love the honey chicken wings, fried fish, lo mein, and General tso’s chicken."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcVdFRjRhVUZwVmpSZlVGTnZhRVJQVkZSV1drRRAB",
            "text": "From the moment we stepped into this establishment, I was hit with the overwhelming stench of what can only be described as old, dirty mop water lingering in the air. That should have been our first red flag. Just past the entrance, I noticed their B health rating clearly posted, and in hindsight, we absolutely should have walked out right then and there. Unfortunately, since we were there for a class field trip, we stayed, and I sincerely regret that decision.\n\nThe trouble began immediately with the front staff trying to charge us adult prices for children. To make matters worse, they attempted to bill us for dinner prices during lunch hours. I had to directly tell them my children were, in fact, children in order to be charged correctly. Another teacher had to argue just to get fair pricing for her group. Completely unacceptable.\n\nWhen we finally sat down and went to the buffet, things only got worse. The food was cold. Yes, cold. At a buffet. Chicken and broccoli should never be served at room temperature. You can’t enjoy food that’s meant to be hot when it’s sitting out cold and lifeless on a buffet line.\n\nThe lack of basic customer service continued when one of the teachers asked where the ketchup was. She was brushed off with a vague “with the condiments,” and when she asked for clarification, she was met with attitude. Eventually, someone did show her, but the dismissiveness and tone were uncalled for.\n\nThe only bright spot in the entire experience was our waiter. He was polite, attentive, and did his best to clean and serve despite everything else falling apart around him.\n\nTo top it all off, one of the teachers tried the cheese rangoon and said it tasted spoiled. Again, her food was also cold. Between the poor customer service, questionable food quality, and the already concerning B rating, this place left a terrible impression.\n\nI don’t know if we caught them on a bad day or if this is just their standard. Either way, I would never return and absolutely do not recommend this restaurant to anyone. Proceed at your own risk, but if you value quality and cleanliness, that B rating says it all."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoLThHdmJREAE",
            "text": "The food is delicious, I mainly go for the baby squid salad, but everything else is just as delicious. Service is good, they are always packed so be patient. And the spot in general is nice and easy, relaxing, great spot to chill with friends and family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ05qMzNRRRAB",
            "text": "Food was good , wish they had more options . Bathrooms could be cleaner . Chicken wings are amazing !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGIxQTFhVzk2UXpsUldUUmtaR3hwU1hGM1pXYxAB",
            "text": "PLEASE DONT GO HERE. The service that I recieved with my family was crazy. There assume the first thing you’ll do is steal. I have strollers with me and because I couldn’t hold my to go box they approach me with rudeness like” take it out I want it now” the funny part was that in order to pay you have to go out the front door. Which is the only way to leave like. They approached me while at my table while with my children and husband. Like if you want to get into problems this the place for you. Good Luck"
        }
    ],
    "reviews_count": 77
}