{
    "name": "Yankee Tavern",
    "place_id": "ChIJKcWnby30wokRFHtS0LZzoF8",
    "grid": "BX4",
    "address": "72 E 161st St, Bronx, NY 10451, USA",
    "rating": 4.3,
    "user_ratings_total": 619,
    "phone_number": "(718) 292-6130",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeFNHZE1VMGxrYTBKS1ZsVnJjMXB0YTIxdVRuYxAB",
            "text": "Been coming here almost 20 years. Even when ive been sober 13 yrs I still come for comradery & friendliness. The food is awesome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbmVGZENZMlZXZUZFeFVsUnZXVTFTYTB0Zk4zYxAB",
            "text": "Busy busy busy on match days.  Love the karaoke and females behind the bar"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQ2QyczFiR3RUYlVkTmNHWnVSMlpMZDBZMlozYxAB",
            "text": "The best part about this place is the atmosphere. It had cool memorabilia on the walls, and a nice looking bar. The food was mediocre at best. Regular fries were terrible. Burger was garbage, chicken sliders were full of cartilage and connective tissue, wraps were fine, salad was gross. The sweet potatoes fries were actually very good. Plastic cups, plastic cutlery. Coke and sprite tasted odd. Maybe they were Pepsi products and didn't bothered to tell us when we ordered. They left us without drinks for most of the meal. Food did come out quickly after ordering though.\nIf you want beer and wings stop here. If you want anything else go anywhere else."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMGNtSTFTRlZxTm5nMlFXeERTRVUxUkZCTk1uYxAB",
            "text": "First of all....Thank You Phil...the bartender...for showing my buddy and I a great time....Beers were cold...wings were great....great service...and great patrons....Place was busy but not nuts like the other few bars under the :L:.... will be back again when i'm back to watch the Yankees"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UU9HWktia3BHU0dZNVkxTjRjRzVtY2tGT1NtYxAB",
            "text": "Great place to pre game!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QkxUSlRaM1ZETlZkVGJVWldURzFCU0c5ck5rRRAB",
            "text": "If you're looking for a good genuine time then this is the spot.  Nothing fancy just straight up NYC, BX, and Yankee vibes."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNzVyeGhBRRAB",
            "text": "Great old bar. Atmosphere is out of this world. So much memories there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSlpFOUhlR015TFZaa1IyWkVUbEpZWW1KTVRIYxAB",
            "text": "A must stop for any Yankee fan. Great food, great people. Go Yanks!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMFZWaFNTMWgxVkV0SmN6TXdTMFZuYWxWeGFtYxAB",
            "text": "Ordered folded before the game and bartender never put it in. Went to pay and she said “oh, I never put in your food order” welp money list from us.  Should re-evaluate your servers at the bar. Losing you money Yankees Tavern. SMH"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VemNuRjVkbEJITVRJelVHMVBjVlJuTW1sVFpGRRAB",
            "text": "This is spot is lit . Joseph is the best bartender, I've ever experienced. Cracking jokes and having a good time. Order the white tea."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSVEyNWZOVzlTYm05YWVIbHZSa05vUmxCeWNuYxAB",
            "text": "Vegan Brushetta was phenomenal, Nicki even helpedgetting 3 million dollars to do a Feasability study for the 20 acre thousand storeys in da area, see immortal towers on Facebook, the tomatoes straight from the garden behind the sports bar, non gmo a$ well… thank you very much Nicki and fam"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXJXUWxBRRAB",
            "text": "Perfect place for a Yankee fan!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOLWo5TUtTOXNEZ3RRRRAB",
            "text": "Awesome vibe, terrible service that screams obscenities at you when you don't tip for their terrible service. Willing to recognize my error in being too non confrontational to explain why I chose not to tip (legitimately my bad) if the Yankee Tavern is willing to accept that it's not ok for their bartenders to scream obscenities at paying customers given how incredibly unprofessional it is to get in people's faces about tips to begin with. Will take the bartender's advice and never come back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX3BtZUtQNk0zZUFREAE",
            "text": "Great wings and service if you have or know who is the right bartender"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaS0zTDhnRRAB",
            "text": "Always stop by when I am in the area,always have good lunch specials"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReGEtUGRnEAE",
            "text": "Always nice to come to."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cWYzQmVREAE",
            "text": "Food was really great, we were here outside of peak hours."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X0xXeWpnRRAB",
            "text": "Best lunch special in the area BY FAR (try the penne a la vodka- tell em I sent you). Best service in the area BY FAR. Tony, Tony, Ashley, June- all grade A people and grade A businesspeople."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b05ieVNnEAE",
            "text": "If you are a true Yankees fan; then you must come to Yankee Tavern! The memorabilia is one of a kind! They have a phenomenal selection of draft beers, and cocktails. To a selective choice of menu of classics (finger food) and great entrees!\n\nDuring game days the atmosphere is like no other even on off days can be quite extraordinary as well!\n\nIt is truly a One-Stop shop for baseball fans, and all sports fans alike."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLUxySVpBEAE",
            "text": "Food was yummy, service was good, we really enjoyed it. Reminded us of places we’ve eaten at in VA"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYem9HSGp3RRAB",
            "text": "Wings with sauce are good . The fried chicken is horrible. The meat loaf is better cooked at home. The drinks are OK if coming from bottle or tap. It can get busy especially when the Yankees are playing at home. The service is a little slow then.  The baked chicken is okay but can be a little dry. They err on the side of less seasoning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeG9UYm9BRRAB",
            "text": "Nice place to meet with friends and have drinks before and after the game."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaHJpWnVnRRAB",
            "text": "Great place if you are going to the stadium with your kids."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudGRQdzJnRRAB",
            "text": "Great spot, not as crowded as other spots in the area , highly recommend stopping in before catching a game at yankees stadium."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaS1hTkVnEAE",
            "text": "We went before the the Yankees game it was very packed  but we still had very quick bar service the reason why we didn't have food we ran out of time before the Game but definitely a great place to get some drinks before a yankees game"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIem9UTVJ3EAE",
            "text": "When coming off the D line. Good spot to meet friends for the Yankees game."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcUpHNjR3RRAB",
            "text": "I love this place.\n\nI keep forgetting to get the 2 gentlemen I usually see there but they are great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOTc3X3dnRRAB",
            "text": "Good beer selection and atmosphere before a game. No food this time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieDVERjR3RRAB",
            "text": "We planned to attend a game but discovered, upon arrival, that it was postponed because there was going to be rain.  We decided to explore the area and landed here. We’re so glad we did! The bartender (I’m sorry I don’t remember your name) was fantastic offering advice on the beer selections and a fun, dry sense of humor. The food was amazing- the bartender helped with suggestions on that, too!!   Overall, it was a great tavern and I’d go back in a heartbeat if it were only closer to home!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiek9PaUpnEAE",
            "text": "Accueil sympathique. Ambiance SportBar assurée à deux pas du Yankee Stadium."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidjdDMC1nRRAB",
            "text": "Food was pretty meh, you'd think the cheesesteak with their name on it would be great but it was very dry and unappetizing. Beer and service were fine - they mixed up our receipts which was annoying but as friends it wasn't the biggest deal. There was plenty of space when we went. Some of the taps were not available which is strange right before a Yankees game"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNieE9rSBAB",
            "text": "Horrible treatment by who we later learned was an off duty employee of the bar. Brought a friend here after the Yankee game, to give him the full experience of what was his first baseball game ever. Had a cordial exchange with security and walked into the bar. As we were deciding on what beer to order, two guys get up and leave. A lady had her back to one of the bar stools, so we couldn't tell if she was going to sit, leaving us with only 1 stool available. After we looked closer, the friend she was facing was sitting on a stool and there was an empty stool between them. We then asked the lady if she was using the stool that her back was facing. She turned to us, sat on the stool and said yes. Her friend jokingly said we could grab the empty stool that was in between them, if we bought her a beer. My friend and I laughed and I told him that I was okay standing, so let's just use the one stool. As we focused back on what beer to get, I asked him which draft beer he was thinking and he told. This is when the female with her back towards us turned to my friend and screamed, \"what did you call me?\" I thought she was joking, so I continued to look at the beer options, until I saw her neck moving,  her hand raising pointing in his face and her voice getting louder. I leaned over and said, \"Queen we were talking about the beer options\". Thinking she misheard something. She proceeded to get louder, scream at us both and claim, my friend called her a derogatory name (the C-word). After a few seconds of trying to explain and seeing that she clearly had been drinking, I said bro just turn back, so we are not facing her and let's order the beer. In between still screaming at us, she calls the security guard by name and a bartender and says we need to be kicked out. Now causing a scene where many are now looking, we get more confused. So now we are back to explaining that I literally asked what beer was my boy thinking about and he named the beer, so we are clueless as to what she was talking about. Now the bartender tells us, \"you got to go\". Now I'm looking at him, and start asking, \"for what\" and he just repeats \"you got to go\". Outside we learned that the lady, when on duty, works there. I feel bad that my boy had this experience for his first baseball game, but was okay to spend my money elsewhere. It was only once I thought more about her actually being a bartender there that I got irked and thought to write this. My thought was, although you are off duty and drinking, why would you pretended that you were using the stool, when we as customers first asked. So between you and your friend, you wanted to take up 3 stools.  To be fair, I normally hit up this spot after a Yankees game and this worker is a poor ambassador of the bar. Her actions and the bartender's response were ridiculous! We didn't and had no reason to call her anything. After she refused to give us the extra stool our only conversation had been the joking exchange with her friend about buying her a beer, to get the extra stool."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMb082alZ3EAE",
            "text": "This place was great! Great music! Great atmosphere, amazing crowd there, the beer was ice cold! Their chilli Nachos were great and hit the spot!\n\nIt was my first time there, I can't tell you how many times I've passed through there and wanted to go in, I'm glad that I did.\n\nVery cool place for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOFotV0lnEAE",
            "text": "Great tavern. Great atmosphere. Carolyn, the owners wife,:is very friendly and welcoming."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeXVuRF93RRAB",
            "text": "Visiting from Seattle and we stopped in before the Yankees game. We had such a good time that we came back after the game and ended our night here. The bartender Nick was awesome and made us feel at home, as did a number of the regulars who…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbDVyVHd3RRAB",
            "text": "Didn't eat here just drank."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbzlIZFRnEAE",
            "text": "Me and my sister stopped in here for a proper hotdog, dogs were amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NU1udnpRRRAB",
            "text": "Excellent World Famous Tavern"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cElhcHhnRRAB",
            "text": "Old-School sports bar. Updated decor and TVs; food is still meh. Right next to Yankee stadium, and that's probably the most notable feature.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURackxPSHB3RRAB",
            "text": "The service is always GREAT!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWM04yei1nRRAB",
            "text": "The bar tender Nick is a real gem. I had a great time !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaXNteFhnEAE",
            "text": "I've been here quite a few times. It's a pretty nice local place with great appetizers and cold beer as well as other alcoholic beverages. The bartender is cool and the crowd is usually pretty mixed. This place does get busy whenever there's a game."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURraFlIbEZBEAE",
            "text": "Had the best grilled chicken sandwich EVER! It was from their lunch menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMXVfVEhBEAE",
            "text": "Good food and drinks. Very welcoming atmosphere. Reasonably priced and welcoming staff. Comfortable atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaGJQeERREAE",
            "text": "Pay $28 for a chicken cheese steak sandwich and a draft beer thought that might have been a little much for a bar should have checked out prices before I went in"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURBN0lNRxAB",
            "text": "Great service,super nice bartenders,always enjoy watching sports here,and the food also Great. They remodel also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabk9uVURREAE",
            "text": "5 🌟 all day. Great time and amazing Philly and cheese sand."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaajZ1dGV3EAE",
            "text": "Before our Yankees Game experience - trip to NYC - we decided to sample a nearby sports bar for a late lunch.  It was everything a Yankees sports bar should be.  I had a very good pastrami on rye.  One thing I did not like was the bread.  Rye bread needs to be firm, not doughy.  But it tasted ok.  Also had their onion rings and my husband had the Cubano Sandwich Hero, which was very generously sized."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX2R5N1pnEAE",
            "text": "Great space, appropriate decoration with some memories of the best time Yankees. Food is mediocre you can get better Burgers from MD, beer assortment it's ok nothing new or fresh. Overall place is neat to be an old bar. Service fantastic."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNlBPdWFnEAE",
            "text": "This is my spot ( only on certain days ) I love the food and atmosphere here around 7pm. If you’re a POC, come in the evening so you can use the jukebox at your leisure without them turning down your songs. The older bartender doesn’t like when you play urban music 😐\n\nBesides that, the food is phenomenal! The drinks are strong and delicious! The other bartenders like the young man with the black hair is soooo nice. They keep me coming and the food.\n\nStop being biased toward paying customers music. It is wrong and not right"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NU1qeENREAE",
            "text": "Cool place to stop in before a Yankee game. Lots of memorabilia on the wall. We went before they played the A's on a Tuesday evening and it wasn't very busy. Can imagine it gets busy during big weekend games."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdnRlaVVBEAE",
            "text": "Great customer service, good food, & nice environment, can’t complain. If you’re hungry and thirsty as you arrive to the yankee stadium, you should definitely stop here first."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdG9XTk5nEAE",
            "text": "Nice bar close to everything food is perfect for the area love their wings"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadUpyMjBBRRAB",
            "text": "Good food and fun place to hang out before a Yankees game."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaEpMM3RnRRAB",
            "text": "You can't eat atmosphere, but you can't beat it either at this Yankee Stadium neighborhood bar. It's loud and boisterous on game day and that's exactly as it should be. The beer and mixed beverages flow almost as much as the baseball chatter."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSenZia3pnRRAB",
            "text": "Great place to go yo before or after the Yankees game. It's one block up from the stadium.  Good food and atmosphere!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdXVydUp3EAE",
            "text": "In from out of town with the old lady. Went to Billy’s around the corner which was great. Tabbed out and headed for the Yanks game but found out there was a rain delay. I’d already searched for a second destination if Billy’s didn’t pan out (genius)\nso we came to The Yankee Tavern. The walls are covered with Yanks memorabilia from old bats and balls to pics of Yankee legends like the Babe. Bar staff is super friendly and plays just about as good of air guitar as myself. Good drinks, good prices (for New York I guess (a $6 pitcher of Coors Light at Ednas is my gold standard)). They have the fancy digital jukebox thing on the wall and someone played Keep on Rockin’ in the Free World so we were kinda sold at that point. Anyways, great spot for some drinks before a Yanks game."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMk11eXJ3RRAB",
            "text": "This bar is a little off the main path, but a hidden Yankee gem with the most reasonable alcohol prices near the stadium."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnNIMXNRRRAB",
            "text": "Visited on a game day from out of town. This was my shot pour hahahaha! Regulars preferred. Stan’s treated us much better."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeXAycVdREAE",
            "text": "Great service great food great crowd as well wide Selections of beers"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dHRHbkNREAE",
            "text": "We were in from AZ for a Yankees game and made this our go to shoot every day of our stay.  Everyone was amazing(Tony, John, Nick, Phil & Joseph treated us like we were regulars from the start). The regular patrons we met were so nice as…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbDVyVkF3EAE",
            "text": "I've only been here a few times, but each time I have stepped foot in this establishment, I felt welcome. I appreciate the fact that they have music playing, a mix of r&b as well as old school jams, and the bartenders are very attentive. My…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdmFLc1ZBEAE",
            "text": "Great place! Especially after the game. Great atmosphere! The service was great. The stuff and management were so welcoming. Amazing chicken, mozzarella, and broccoli rabe sandwich. Oh so good!\nAnd they the Yankees won so Wooooooooooo!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtLWRESmZBEAE",
            "text": "I’m done here\n\nBazaar and sad scene took place here on Saturday. As I have been accustomed to doing 2-3 times a month I stopped here to get a few drinks and chat with friends. When a guy everyone who frequents here know as ‘smooth’ stopped in. Now I have been coming here for no less than 6 years and smooth was here before me so he would be what I call a regular. He sat at the table to my right and not counting I would estimate he had 2-3 drinks with friends. Overhearing one tell smooth the bartender overcharges people, I see him go over to “Phil’ the self appointed ‘Mayor’ of then Tavern. Not able to hear their conversation I can only assume it was in reference to the overcharging female bartender.  He came back down and finished his drink and later went to pay his tab. When smooth was told the amount of his tab he again went straight to Mayor Phil, at this time the bartender feeling offended started screaming out insults to smooth about paying his bill he being broke and used the “N” word. After 6 insults or so Smooth understandably, threw the money at her. She still insulting him as though no one had the right to question a bill went to have him escorted from bar. Meanwhile Mayor Phil did absolutely nothing he didn’t speak on smooths behalf of being a regular patron here or anything he sat quietly. Two guys came over and tried to respectfully get smooth to calm down by now he was yelling his government name out to those who were in the bar I guess to remind them of who he was in comparison to the new bartender. I’m big on fairness and loyalty and how they treated this guy was unfair and mean, all because he questioned his tab ? Keep the Tavern and Mayor Phil horrible experience all around. No loyalty here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MnJxbzFRRRAB",
            "text": "I wasn’t going to write a review because the bartender who served us was absolutely stellar. She went above and beyond to rectify the situation. Problem came first when I ordered a Long Island Iced Tea. I sipped a significant amount and once the foam cleared i noticed something in my drink mixed with the foam. I took it out with the end of my straw and it was a roach and a nice sized one at that. I quietly let her know what was going on and she was in disbelief herself. She quickly disposed of it and made me a new one but I was a bit leery. My husband had already ordered a few appetizers so I was very skeptical but it was mussels, fried calamari, and bruschetta. Figured it was a safe choice so I sampled each thing. We then left because I no longer was interested in eating anything. My husband started to feel sick maybe twenty minutes later so we heard home and about 2am we were BOTH awaken from our sleep with sharp pains in our stomachs. I ended up vomiting violently and and diarrhea ensued next. It was so tiring and painful and we knew it was what we ate earlier because that was all we had and stopped there while doing errands because we frequented this establishment in the past and never had a problem. This was a first but the way I felt last night into the middle of today was a feeling I don’t EVER want again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJZ2JPdlVnEAE",
            "text": "Fun place while we had to wait to get into Yankee Stadium.  Great prices!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNS16R0V3EAE",
            "text": "The Yankee Tavern is an historical establishment that has recently remodeled and upgraded it's Sports' Bar reputation with more Big Screens & sports channel selections in it's front bar and back room dining areas. The cocktails & food are delicious & \"generous\"! You will Love the staff!! ENJOY!!! I SURELY DO!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb3FqbGhnRRAB",
            "text": "Rough and tumble kinda place...so perfect for gameday."
        }
    ],
    "reviews_count": 68
}