{
    "name": "G Bar",
    "place_id": "ChIJD-Plp9H1wokRwW27nqMryc8",
    "grid": "BX4",
    "address": "579 Grand Concourse, Bronx, NY 10451, USA",
    "rating": 4.1,
    "user_ratings_total": 606,
    "phone_number": "(718) 402-6996",
    "reviews": [
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeXBTY21nRRAB",
            "text": "Poor service."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTVyanp3RRAB",
            "text": "Muy mala atención por parte de una de sus meseras, primero viendo que éramos cuatro personas me dice que si mesa para dos lo que denota una falta de atención, por otra parte al ver que éramos 4 no nos asignó una mesa sino que nos dijo en…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMF9XaGx3RRAB",
            "text": "Great food. Pizza amazing. The Buffalo chicken was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNy1xMUVBEAE",
            "text": "Good place to vibe and have a drink"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbE4zMThRRRAB",
            "text": "Food was good. Same recipe for years which is great. Service was sub par. Young and inexperienced waitresses. Atmosphere was boring and depressing. Nothing live about the place and the decor looks like 1999."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OVpTUGVnEAE",
            "text": "The bar staff is amazing. But the restaurant waitress has a horrible attitude, she is very rude, and will try to talk down to customers that don't speak Spanish, she also waited 20 minutes to take the drink orders and than about another 15-20 to take food orders. I will forever stay in the bar area they are great take your orders quick."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJanFQelpBEAE",
            "text": "The food is outstanding. But the pricing is high for the value. If they reduced the price a bit more people will come, a fun night for kareoke with Drew."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcjZlWXdRRRAB",
            "text": "Love the vibe 🔥…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdTQzd3BBRRAB",
            "text": "Bar area is really nice, dining area is really dated looking.  Service was attentive and considerate. Food is decent but the prices are unjustifiably expensive. Average price for salad is 23/25 dollars... I can find just as good places if not better in Manhattan with better prices. Somehow this place doubles the prices of Manhattan across the board pretty much.  These owners really need to adjust their prices unless this is a front for other things going on. For a 10 piece chicken wings and one glass of wine, $41.24 (with tip)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNF9XTzlRRRAB",
            "text": "Too expensive for what's being served and for the average median income of people in the neighborhood! What the heck happened to this place? Used to be jumping!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoczZINWxnRRAB",
            "text": "This place is awesome"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbzZPMk53EAE",
            "text": "Whay HAPPENED to the Gbar?!?! This place used to be AMAAAZING.  Been coming here regularly since 2008...mainly for happy hour bcuz that's where a lot of teachers went.  They USED to have to best sangria but I went there on Friday 2/17/23 after not coming here for about 4 years... and it was blah.  The sangria had ICE in it and hardly any fruit🤯 and it did NOT have that signature taste that it once did.  The zucchini sticks were almost burnt and the calamari just tasted funny.  It was really thick pieces and I like the smaller more crunchy calamari.  I did order the chicken marsala to take home and that was good but that's it.  The only good thing was the waiter.  His name was Kevin and he was such a sweetie pie!! Very attentive!! Kevin gets 5 stars but....that's not how this whole review thing works 🤣🤣🤣🍾\n\nAlso, it waa really empty for a Friday. It used to be packed!  And what happened to the Friday DJ? It's like a shell of It's former self...🥺 RIP Gbar...That place used to be one of my favorite spots.  It'll be a very long time before I return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOGRmQnJnRRAB",
            "text": "Food absolutely slaps. Service rocks. Kinda hard to find, doors are solid black. If you DO find it, you should order the lasagna and cheese steak!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtekppbWh3RRAB",
            "text": "My spot for over 15  yrs sangria is just delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcVB2LVdREAE",
            "text": "Right off the bat these guys are ridiculously expensive ! The food quality , service and  the interior do not match the price points for what these folks deliver. I would suggest another restaurant for sure, i only stopped here with friends one day between classes because sadly there's not many places in the vicinity and i wont be doing it again. The crab cakes were ok but a bill close to $200 for mediocre food is crazy to me ... you live and you learn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb19pZEp3EAE",
            "text": "They were nice they could of pay more attention when we was trying to tell them we needed something. It was empty i could imagine how much worst it would've been if there was other ppl there"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN3MtQTFnRRAB",
            "text": "Good food good drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1Ni1YOXR3RRAB",
            "text": "Roxanne’s rude!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0d0lPMGpRRRAB",
            "text": "Go to this place for happy hour"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOGJYNlBnEAE",
            "text": "Very expensive but the pizza is delicious"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeWJESGRBEAE",
            "text": "This place fell off. The food drinks and music was always good. Tonight it was not good. Music was horrible and too loud. After a $370 check you'd think they'd get out order of shots right. Instead they took our order several times and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydExpYkt3EAE",
            "text": "Had a few drinks in this place and I was feeling real nice. The atmosphere is clean the employees are very friendly and the vicinity of this place is located in a perfect place to reach all major transportation."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyLXFuTDR3RRAB",
            "text": "Great food and friendly staff.  Highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNE96Y3d3RRAB",
            "text": "Drinks are okay, food was good."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdktINGNnEAE",
            "text": "Amazing food, ambiance and simply a great place to go enjoy yourself."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaEpmMGt3RRAB",
            "text": "I been coming here since 2007..food was great then & still is.. 💋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMnZ6cDRnRRAB",
            "text": "The waiter Oscar was excellent,  sorry to say the food not good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2enItRUR3EAE",
            "text": "One of the best Italian bars/ restaurants in the Bronx"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheTlYUVRBEAE",
            "text": "This place had possibly the worst food and prices I have ever seen. If youre hungry youre better off going to McDonald's next door."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdjZucmZnEAE",
            "text": "Awesome Food Next Price"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbDV2ZFd3EAE",
            "text": "Great waitress, ran back & forth to make us comfortable despite short-staffed. Food was tasty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaktIVi1RRRAB",
            "text": "Great spot"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcTlub0tREAE",
            "text": "My grandson loves it here. Have been eating here for about 20+years. Its my go to place whenever im in the mood for watching a game and having some wings. Adult crowd exceptional service great atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxODhXVWJBEAE",
            "text": "This is great Italian food , great pizza and seafood.. a lil pricey but worth it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeXVYT1FREAE",
            "text": "An Italian restaurant with a delicious variety of choices. Daily specials including entertainment at night. Relaxing atmosphere and free parking."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLLTdPdUhREAE",
            "text": "Arrived for dinner and the minute we sat down service was horrible waitress took long to ask what we wanted then our drinks took 45min and the appetizers came before the drinks. Order Baby Back Ribs and they were horrible smothered in BBQ…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLLS1PQ29RRRAB",
            "text": "Food was disgusting! The baby back ribs were precut and looked like it came from a supermarket pack. Then they were smothered in BBQ sauce. Waitress barely came to the table and we waited super long for a pair of drinks."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLemZhaVRREAE",
            "text": "Excellent food and atmosphere!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNzhTVzV3RRAB",
            "text": "It was really Good, The Food is amazing , The drinks could use a little help but go with what you know. Sangria is very very good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLX2NXV0l3EAE",
            "text": "Food good. Service was selective, nothing unusual"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLc2RxQ1p3EAE",
            "text": "I’ve been to this restaurant almost ten times in the past three months. The food is delicious, but the service leaves a lot to be desired. Whether it be the waiter that continually walks around the restaurant with his face mask down to the unkept bathroom on the lower leave and to the wait time, things could definitely be better. There is one manager that does his absolute best to be on the staff but he can only do but so much. I ordered a Pepsi and it took nearly twenty minutes to get it. Mind you, the bar was right across from my table. The waitstaff usually only comes to drop the food off and the only other time you might see them is when they are dropping off the bill. The workers on the main level seem more concerned about lolligagging and having lunch at the exact same time, thus putting extra pressure on the remainder of the staff, than actually doing much work.\n\nThis is a beautiful establishment, and on the surface it seems like a professional and elegant setting. They just need to train their staff to reflect that."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcHVxRGpRRRAB",
            "text": "Love this place. Classic for me and my family"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnak9HVnpBRRAB",
            "text": "A little pricey but great atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5a1AzZWV3EAE",
            "text": "Good ole Italian food  ! Fresh and hot !"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRZ3FMM0JREAE",
            "text": "Always great food and great service. I come here often.  I love their chicken parmesan hero's.  Highly recommend it"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMm9lZGV3EAE",
            "text": "Good place many good nights here."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpM0xQbzdRRRAB",
            "text": "Love the ambience and the attention given to the customers.Food is delicious..😊👍💗…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZNktldVJnEAE",
            "text": "We walked in and there was no hostess. Not typical. I had to ask a runner who was standing around could we get a table. We were seated. After 10 min someone asked for our drink order. Tropical punch and summer punch, both delicious and strong. I ordered Crab stuffed shrimp my date ordered shrimp and broccoli. The stuffing was more filler than crab, but cooked and seasoned really well. The salad could of been more visually appealing but was good and served with house dressing. Garlic knots were on the stale side. But spicy tomato garlic & oil accompaniment, amazing.\nI love Giovanni's, if you're in the bronx you must stop by. At least for a slice."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdnJTTmJ3EAE",
            "text": "It's a small intimate place to hang out after work and to let go. They have great drinks and appetizers. The prices are very reasonable, especially during happy hour. The decor is on point. Great customer service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjNFpYMWpBRRAB",
            "text": "Had a good time fir my birthday during happy hour.  The atmosphere was good,  food ok hot wings 2 was cold, people nice, music ok.....had a good Monday's vibe"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJenRlN0V3EAE",
            "text": "Food is always good, drinks are yummy. Nice ambiance.  Wednesdays are usually quiet, but some nights not a place for a conversation, you go for more of a party atmosphere with karaoke or a DJ spinning their hearts out."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcV8tM3Z3RRAB",
            "text": "Service was trash. Girl got so many drink orders wrong. She was sweet, but sweet don't run this review game. We asked for someone faster and they got someone faster. Food was ok. Butterfly fried shrimp were good. Cheesecake was good. Besides that.."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrel82NFdBEAE",
            "text": "Their happy hours sucks, the food is hit or miss and it's usually miss. Everytime I come to this place I've vaguely enjoy my experience. weather it's the not very welcoming bartenders, or the clique-ish regulars that hold seats by the bar.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnazdEbEVnEAE",
            "text": "I love this place, but more than anything I love the waitress, Joanna. She’s absolutely stunning. Joanna is always alert and pays very close attention to her customers. I dropped a fork and before I can pick it up she was there with another…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVOGZTMnlRRRAB",
            "text": "I genuinely love this spot but the back bar service is horrific!!!!!!!! I came with my girlfriends for happy hour after work and the bartender had us waiting for 20 mins before we could even order our drinks. Another 15 mins after that to…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbHN1c3hBRRAB",
            "text": "A fantastic dive for good food, drinks when meeting up with family and friends for a few hours. The service is on point and will tend to you quick. Stop by and enjoy a good meal or drink and you'll find yourself becoming a regular patron. Enjoy."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNk5tVUlREAE",
            "text": "The place has a nice mood and the servers are really nice. We ordered a steak, which was cooked to perfection, and stuffed shrimp, which exceeded our expectations. If you're around the Yankee Stadium area, and want to wind down your day, this is the place."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaFBEcFhnEAE",
            "text": "The SERVICE SUCKS I went to get dinner with my girlfriend we were seated and waited 15 min for menus which never came after I asked the waitress and bartender. I would understand if it was packed and busy but that was not the case I will…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHRHQjh3RRAB",
            "text": "I've  been here 4 or 5 times  over the past 5 or 6 years. The brunch is ok, their happy hour sucks, and the staff is not friendly. It's one of the cutest bars in my local area, but I dread going there."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOHFQMVNREAE",
            "text": "Ehh G bar is way over priced. I remember when I used to order from them years ago & their prices were better.  They're in the south Bronx and not that great for the prices. When you order delivery they always get things wrong & the drivers…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBZzhfel93RRAB",
            "text": "Initially the waiter I had, had to be replaced.  He held my glass by the brim, when i commented on it, he responded very sarcastically saying \"we have straws  Would you likea straw\"?. He was replaced immediately.  2 thumbs up to Michael. Pleasant attitude, good  conversation and great service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJc3REVXNBRRAB",
            "text": "I am very very disappointed in Giovanni I placed an order at 3:22 p.m. they said it would take 45 minutes to an hour for delivery it took two hours I called every time I called they talk about he just left he just left and then when he…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRXy0yNTdRRRAB",
            "text": "Just 1 block away from where I live. This is one of the most successful and organized restaurants in The Bronx.Great food, colorful and authentic, beautiful decor.The staff is very friendly and provide great service. But Saturday night , at…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaDRIMi1RRRAB",
            "text": "Definitely a grown and sexy spot. Business/ working crowd. Food is a little pricey, but really delicious. 2 bars. Drinks are like Manhattan process that's why the 3 stars..Dj after 10pm I believe. You won't feel like your in the South Bronx until go back outside. Lol"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJaVk2ZnJnRRAB",
            "text": "This place has changed a whole lot...! The service is not as good as it used to be....Last time I was here the waitress only brought one of the drinks( when we have ordered 2 drinks)....but he didn't bring mine....I kept waiting and after 45 minutes later I realized he completed forgot about my drink...keep calling him and let him know what happened ...he took another 20 minutes to get my drink....I was so disappointed of this place...cause that was not the only thing that happened on this visit....( and this used to be one of my favorite places in the neighbordhood) but I don't think I\nwould comeback here in a very long time...!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvckxxb0tREAE",
            "text": "This is the second time I came here and the waiter forgot my order the first time I came with a date and the waiter never put my order in and I was waiting over a hour for my food. Now this time he messed up my order again this is ridiculous I love the food but this right here might make me stop coming. This is a update so last night I put in two orders Through postmates 9:45 I called the restaurant to see if they got it and the young lady on the phone was oblivious to my order, (which is weird because On  the postmate site my food was being prepared). So I called again after she hung up on me then she hung up on me again, called three more times she would answer then hang up or put me on hold!!!! This is extremely unprofessional I eat here a lot I don’t appreciate this at all!!!! I even asked to speak to a manager she put me on hold then hung up. Wow I wasn’t expecting this from a classy restaurant like Giovanni’s. It’s very disappointing because I really enjoy the food but this level of disrespect I can’t deal with I’m not sure I’m coming back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOC1MT2h3RRAB",
            "text": "Sadly I have given this spot 3 chances to get it right but they continue to disappoint! I took my film covered lobster home to try to give it some love but I'm not encouraged. Service was horrible and my waiter only remembered me when it…"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndzdHc053EAE",
            "text": "I almost had a good time. We booked a medium-sized reservation for our wedding reception. We got there a little early since things wrapped up pretty quick, but we were seated in a timely manner.\n\nOur server seemed to be upset with us for being there, but we didn't let that bother us. Our drinks & food came in a timely manner, so that was good. Everything tasted ok, not the best but whatever. That's not what this night is about.\n\nAs things got later in the evening and were winding down, we were conversing and what not. It looked like ALL OF THE STAFF was staring waiting for us to leave. I could see if we took up all of their space, but this wasn't the case. They kinda paced back and forth by the bar looking watching and waiting, as if we were all going to dine and dash.\n\nOnce we paid and left the place I had noticed that I left a gift behind in the restaurant. I called them to hear that they found nothing. I'm gonna call BS on this. One of their staff, probably one of the many who was giving us the stink eye, STOLE one our wedding gifts. It breaks my heart how a sub-par wait staff can ruin a good looking place with ok food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3eHFpZ05nEAE",
            "text": "The drinks are great when you actually get to enjoy them. However the manager is horrible, he allows people to be overly intoxicated and harass other patrons. The picture below is a display of him engaging with a group of “regulars” who were so disruptive that other patrons left. Then the guys continued to be boisterous and try to speak with my group in a sexual manner. Despite our lack of interest and engagement the manager did nothing to stop this. Even after asking for help he said it looked like you like it, this made the men in the group comfortable enough to berate us. The manager again did nothing and continued to serve them alcohol despite them being too intoxicated to be able to drive."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcS1QTmt3RRAB",
            "text": "They fixed My Mothers Day!.  And topped it with a lemon drop Martini!!! All food was taken care of by one of the general managers Jimmy.  Polite and kind gentleman.  He exemplified why I always eat here in the first place.  I am sure Manny…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnanAyckl3EAE",
            "text": "Love this place, I've been going here for over 10 years, at one point they started limiting the brunch cocktails which I didn't like but now it's back to unlimited and I'm back to happy, a little bit of everything food wise a great selection, nice for a romantic brunch or even a day out with friends. Highly recommend"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMXZTaEdREAE",
            "text": "Usually i have a great time at the G Bar. Today Victor the bartender was very rude. About a month ago i had a disagreement with him because he tried to over charge me. He refused to serve me because he was still upset. He also refused to…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0LU5pem1BRRAB",
            "text": "I specifically got off the train on my way home in Manhattan to have dinner here because the drinks and food are great! Tonight was no different food and drink wise but the service was ridiculous! I waited almost 45mins for just my drink!…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMGFLMDdBRRAB",
            "text": "Horrible!!!!! When u walk in its really nice, the customer service is not friendly at all and even worse, the food is nasty. They can't cook, I ordered chicken cutlet parmesan with spaghetti; the chicken is NoT cooked, when u cut through…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnazV2SXZnRRAB",
            "text": "Went for happy hour after work and the food and drinks were great.  Really a nice place to go to with friends.  Need to improve the music that they play though."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBc3FYVkJBEAE",
            "text": "Great service (very friendly) and solid Italian fare. This is a great pre and post Yankee game spot, and very reasonably priced. Way better than any tired old ball park food. 😉…"
        },
        {
            "date": "15년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ODVMWHFnRRAB",
            "text": "Do not come late.  Tables at the bars section are waiting line only.  Plenty of bar seats.  Sports on TV not distracting to conversation.  Yes to the grilled calamari.  Enough to share."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLS1uak9REAE",
            "text": "Excellent Italian food. My favorite dish that I ordered a lot was chicken francese. The salads are also really great. My favorite was the seafood salad. Brunch is also really good. The pizza is fine. Italian food is better."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNna0t2RDZBRRAB",
            "text": "Good is great! Service was alright.... A lot of servers moving around me and not being attentive, even though there weren't a lot of patrons in the restaurant. It got king of annoying to keep asking for stuff when they really weren't that busy."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaXFXeHNnRRAB",
            "text": "Had an awesome experience. The food and drinks here are somewhat expensive, but definitely worth it. They keep the place clean at all times. The staff are beyond friendly and patient."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNzVmN3JRRRAB",
            "text": "I was at G Bar on July 13th with my friend and the bartender named Victor refused to serve me a drink because he had an argument with my friend the last time she was there. I had nothing to do with their argument and felt it was extremely…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvci1UWlNnEAE",
            "text": "Relaxed setting and good food. Great place for an intimate date or group outing. They also have a take-out section, making it extremely convenient to order your food on the go."
        }
    ],
    "reviews_count": 82
}