{
    "name": "161 Bar & Grill Restaurant",
    "place_id": "ChIJ80ed1v31wokR6pkOZRYRkSA",
    "grid": "BX4",
    "address": "101 E 161st St, Bronx, NY 10451, USA",
    "rating": 4.2,
    "user_ratings_total": 106,
    "phone_number": "(718) 992-3120",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UlUwUkRSMmhOTVhkU0xXVlRNMmhvWTFWMVNYYxAB",
            "text": "My friends and I love it here! Rene is amazing ! Great drinks, great food, awesome music and vibes!!!❤️"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcGVFSkxkREY0TkV4aldWZDNlVTh0ZDFOUVZHYxAB",
            "text": "This place is an amazing happy hour spot!! Shaminae and the owner and great people!!!!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNVEyODRla2RCZVdJMGVEa3pibVJhZFUxTGFtYxAB",
            "text": "Best place for drinks after work !!!!! The food is amazing! The vibes are always lit !"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZlZEaEtaRkZOZFdOUWJsOWlPVTlwYmw5UGJtYxAB",
            "text": "One of my favorite places in the Bronx"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac05uaERhazl4ZGxRMWVuUnBVaTF5VFZadVFYYxAB",
            "text": "Un ambiente bien agradable, buena comida , música, y lo mas importante los tragos que me gustan ,OPCIÓN AGRADABLE ANTES DE IR AL YANKEE STADIUM Y DESPUÉS DE SALIR ,\nPUEDES VER LOS JUEGOS EN PANTALLA GIGANTE AQUÍ TAMBIÉN"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YVRWOWpkVEpuYjFGdlUxSk9UV2hpZHpWb1NFRRAB",
            "text": "This is NOT a restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeVNXcFdNMkpOTTBkM01rMHRla3R3ZEc4eVQxRRAB",
            "text": "This past Monday, my friend and went to 161 Bar and Grille a few hours before a Yankee game. This was was the first I had been to the place, and everything was great. The food was amazing and our waitress Joanna was very knowledgeable about the food and had a great sense of humor and also had a great personality, she made what was already a great experience dining here even better. I hope to return to eat here when I see another Yankee game."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR2JtWnBlV3BGYTNacE5VOVdTbVp5UjNvdE4yYxAB",
            "text": "I’ve been here a few times. The food tastes authentic and made with love. The ambience is great, music was fantastic. Happy hour has nice options. This latest time I had lunch with my fiancé, and our server “Celly” was knowledgeable, very charismatic and guided us perfectly with our menu choices. If you want flavorful Latin cuisine with exemplary service and a dope vibe, check this place out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaVRtTmxZMnhUV2kxd1lURkRaSEZmVlZoamQyYxAB",
            "text": "This bar is hands down one of the best bars around Yankee stadium. The atmosphere , the Dominican food, and music keeps you entertained."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTU1GUTRNVEoyWTBzMVFVTktPSEZEVVVkWlMzYxAB",
            "text": "Atmosphere was great. Great service and food..Frozen margaritas."
        },
        {
            "date": "3달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSFlWbDJXREJJVG5ZM2NFSnZRMnRVVWtGWE1GRRAB",
            "text": "지나가면서 가볍게 한잔 했는데 언제 다시 올수 있을지 모르지만 즐거운 해피아워타임"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ1lWVlZWM0pJTmpBMmFEaHVkRGRpV20wdFVIYxAB",
            "text": "Fried Pork Needs To Be Fried Longer Rice & Beans Was Best Part Of My Meal With A Frozen Pina Colado"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybk5YdDRBRRAB",
            "text": "Watered down drinks and all the food tasted like it was from the freezer at a supermarket. Staff is very rude too. Do not come here if you want to have a nice time. Yucky little Dump"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUGRqbExZek16YkRCVVN6UnFMVEp1U1RkZlIyYxAB",
            "text": "Amazing food!!! Where we are from you can’t get fried plantains. We came to the Bronx early for breakfast before the Yankees game. Great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbExYWnBUSHBOVUVVM1VsZFdjRlJqVFd0d1EyYxAB",
            "text": "Very nice. Service excellent, food right! Next to Yankee Stadium, very good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGV1JVSkpOV2hWWW14NmNEbHhiWGx2TldaSmRsRRAB",
            "text": "Order mondongo soup! It was like potato soup with no meat! Reheated soup! Nasty!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLTl2Tno2dFlTa0VREAE",
            "text": "Excellent customer service and the food was amazing. A little bit pricey but definitely the food and their mojitos are really good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPVGo0dUhFOWZIZ0VBEAE",
            "text": "The appetizer was terrific. But if you’re thirsty this ain’t the place for you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1dVbEJhRVpyWVVablpuRmhNVk5WTWsxa2FIYxAB",
            "text": "The food here is really gross. I ordered a chicken quesadilla and it had bones in it. There was no salsa. No jalapeños. Nothing but chicken and cheese. So boring. Really disappointing since the vibe of the place seemed like it was going to have good bar food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcWNvNFNscy15NlB3EAE",
            "text": "Great happy hour and service was good time"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUEc0ZVQzeUw3bm5RRRAB",
            "text": "Muy rico probé un Mofongo de chicharrón y una margarita, visite el lugar con mi familia es un ambiente muy agradable 👍🏻"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdnNnT2Zfb3ZhNHZRRRAB",
            "text": "El mejor restaurante en el Bronx\nTienen el mejor tipo the bebida\nTenemos diferentes platos de comida\nMuchas gracias Dioni se te quiere de gratis."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLTU3djZudlAybzdRRRAB",
            "text": "I When this place at the first time I ignored  the bad reviews what I saw  still walking in this place  have the best servers.\nFood 10/10\nGreat place  highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbXdtWUh3emNlU1dREAE",
            "text": "Amazing fast service went during my lunch break and it was very good I had the rice and beans which were great it reminded me of the food back home in republica dominicana"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVHUwdmlHek5mRllREAE",
            "text": "The food quality and service are superb.  Yoanny and the rest of the staff are excellent at what they do and contribute to the overall experience when you dine in.  I would definitely recommend this restaurant and continue to be a regular here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLUE01WkRnaXR5UkRnEAE",
            "text": "Stopped in after a Yankee game. The mofongo was awesome and the service was super fast and friendly. I will definitely be coming back whenever I go to a game. Fun atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZjF6OVdPbE9PTzV3RRAB",
            "text": "A very nice time and great customer services !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd2ZlbHFnRRAB",
            "text": "Over priced. Under whelming. Overly expected greatness. Will never come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2RlVmNnEAE",
            "text": "Horrible experience, the food was quite possibly the worst I’ve had in the city. I wanted to dine and dash."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd2RmYWhRRRAB",
            "text": "Bad food but good music"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd1pmZmVnEAE",
            "text": "Terrible. Dry. Disappointing"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2VlcFNBEAE",
            "text": "Overcooked and overpriced meals. Extremely disappointed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNnFYc2NREAE",
            "text": "The food is good. The price is reasonable. But the music was way too loud. We were unable to talk to each other. And even unable to communicate properly with the waiters. “It is quiet noisy here”, without turning the music lower is quiet strange. Especially when you are showing ads on the screens that are saying “give your ears a rest”."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHRhWGVBEAE",
            "text": "La pasta Alfredo está rebosada de aceite parece una pasta en aceite no en salsa Alfredo fue para votarla"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMy1MaW93RRAB",
            "text": "Amazing Service, Great Food, Portions Are Great, and Pricing Is Very Good. I’ve been coming here regularly since I moved Miami in the last three years. Definitely an excellent restaurant and to try!!! Dine In, Take, & Delivery. Great Staff, very welcoming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX01UbTl3RRAB",
            "text": "After the NYCFC game, my crew and I needed a spot to keep the good times rolling. Enter this gem. We were immediately greeted and welcomed in like VIPs by the hostess.\n\nFrom the outside, it looks cozy, but once inside—boom! Spacious, classy, and with a touch of upscale elegance that makes you feel like you should’ve dressed fancier…but nah, vibes were chill.\n\nNow, let’s talk about the star of the night—Julian, the bartender. This man was a legend! Friendly, hilarious, and a fellow whiskey lover. He gave solid recommendations and kept the drinks flowing. We had El Jefe, which packed a punch, and, of course, rounds of Mama Juana shots—because why not?\n\nFor food, we got a few orders of empanadas. These weren’t your average sad, bread-heavy empanadas. These were crispy, flaky, and loaded with filling. Cheese, beef, chicken—you name it. Absolute perfection.\n\nHighly recommend this spot! Whether you’re out with friends or on a date, it’s a win. Only downside? Parking is a bit of a sport itself, but after 7 PM, free street parking is your best bet.\n\nWould 100% come back for Julian, the empanadas, and another round of Mama Juana. Cheers!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOEx5cFBREAE",
            "text": "Julian the bartender is what keeps bringing me back!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOGFEV3dnRRAB",
            "text": "Found was great so as the drinks. Service was excellent"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbHFQUjhBRRAB",
            "text": "Unreal happy hour specials! Julian is the man and will take care of you!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2d2FYbXRBRRAB",
            "text": "Great vibes\nGood 👍 DJ Alex\nService and the dj because he's play all types of music nice people play  they don't rush u great they make me feel great all the music he plays good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNVoya0dREAE",
            "text": "Came in here to kill some time before an appointment. The prices are pocket friendly. The food was amazing, and the service was superb. Their happy hour prices are budget friendly and drinks delicious. Highly recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHRhS2d3RRAB",
            "text": "Best food ever! Went to the Nebraska football game and came here to wait out the rush! They took excellent  care of my family and were incredibly kind and courteous!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2di1TOGNnEAE",
            "text": "The food was bland (pork chops) the moscow mule wasn't good the music is ALWAYS entirely too loud and way overpriced. $47 for pork chops, rice and beans tostones. And one drink."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2d2FMQktnEAE",
            "text": "Excelente lugar y ambiente"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NGU2bTZnRRAB",
            "text": "I came in for happy hour and their drinks were amazing! Definitely recommend their lychee martini and mojitos 😋😋"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcXUyS3pBRRAB",
            "text": "Food is so good, love it! Nice service"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdE1pR0hBEAE",
            "text": "Un lugar sin duda alguna para repetir , buen ambiente , cerveza bien fría y camareros super amables"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdzVUSmVnEAE",
            "text": "Place is way over priced for what they servce.\nI spend 75 dollars. Tip included just on a plate of food if you can call it food. A sheet of paper is thicker than the steak they serve. If you appreciate your money. Or good food. Please don't go there\nThe girls are nice but the food is horrible..\nI don't know why. It was a yankee game day and place was dead . I had the bistec encebollado.  Rice and beans. First and last time. I walk in this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMy0yV1VBEAE",
            "text": "Marcely was amazing! The HH is a steal and the vibe is 10/10 food was great. The drinks have drastically improved since Julian is behind the bar!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuMzgzUzVRRRAB",
            "text": "Pull up for the happy hour and some good food and vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud3UtU1RBEAE",
            "text": "First time at this restaurant. The waitress was very nice, courteous and attentive with a smile. The drinks were absolutely delicious and the presentation was very pretty. Try the Lychee Martini, coconut mojito and the Dominican Power drinks. We had the Cuban sandwich and this sandwich was amazing. Absolutely a great experience. Will definitely return! Thank You for the excellent service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHZ1NDJBRRAB",
            "text": "I live in the area but never sat in to eat. Usually tried take out in the pass but they seem to be under new management, which was nice. Now the environment seems inviting to all. Prior owners treated people that were not Spanish different and you felt the thickness as you walked in. Under the new management the atmosphere was kind and warm and the served up smiles which was a great addition to the delicious food and I love the presentation. My food have to look good. The price was reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINm9Yc3VBRRAB",
            "text": "I just started working in the area I gave it a shot since the lady handing out flyers was polite. I first had the Bacon Cheeseburger deluxe plate. I had take out the burger was really dry and bland. I’m an optimistic person I gave it another shot heading into work, ordered a grilled chicken sandwich now the sandwich was 13.52$ I was told the fries would be a separate order which was strange cause the sandwich above on the menu comes with fries. I waited 20 minutes for the chicken sandwich, which just like the cheeseburger bland and was badly presented in aluminum foil. Not even a sprinkle of seasoning just a few chunks of chicken and dry bread. Very disappointed was looking forward to seeing games there while on break, not going to lie the place is clean just the food service need to spice it up to keep potential customers returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucDhlQWJnEAE",
            "text": "How am I just finding this place now!?! Came in on a Thursday evening after a fairly disappointing small claims court appearance (story for another day). Literally did a google maps search for bars nearby and this one came up with rave reviews, especially about Julian. And talk about accurate! I got one drink before I had to catch my train but it was probably the best 20 minutes of my day. Julian made an awesome lemon drop martini and was so welcoming. Not too crowded for a Thursday, very welcoming vibe. I'll make the trip from Westchester just to come here. Looking forward to trying the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaTVYQk5nEAE",
            "text": "Came in to check out the new spot. Waitress was attentive throughout my visit there. I ordered their 161 chicken mofongo which had a delicious creamy sauce that smothered the grilled chicken. I enjoyed my meal and will come back for more"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOGNQR0VnEAE",
            "text": "I hardly ever leave reviews, but this place has AMAZING! food. Although they Changed business’s name and moved things around, the steam table’s food options remains the same!!!\n\nThe bar is such an amazing spot to watch Sport games while enjoying amazing drinks with their Daily happy hour! Their Piña colada & Margaritas? 😮‍💨 the bests I've ever had!\n\nI Would recommend this place Eyes closed. Go try it for yourself you wont regret!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5X1lIYzd3RRAB",
            "text": "I order the Bacalao with Moro for $15.50 and received a whole load of old rice, and you could count the cod fish pieces or if I begged for the food. Super cheap with  quantity. When calling the restaurant  to make them aware, the response waa, “thats fhe measured amount” Ok smarty pants, here goes your 1 star review for trying to be cheap but charge $15.50 for scabs of cod fish. Smh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MUlPRmJ3EAE",
            "text": "161 Bar and Grill exceeded all my expectations with its inviting atmosphere, exceptional service, and mouthwatering menu. From the moment I walked in, I was welcomed by a warm and friendly staff who made me feel right at home.\n\nThe food was nothing short of spectacular. Each dish was expertly prepared with fresh ingredients, and the flavors were rich and satisfying. I particularly loved the cajun shrimp and mashed potatoes —it was cooked to perfection and bursting with flavor. The drink selection is equally impressive, offering a variety of cocktails.\n\nWhat truly sets 161 Bar and Grill apart is the attention to detail and the genuine care the staff puts into ensuring every guest has a memorable experience. Whether you’re stopping in for a quick bite, a full meal, or just drinks with friends, this place delivers on every front. I can't recommend 161 Bar and Grill enough—definitely a must-visit!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNmR6b3RRRRAB",
            "text": "\"La comida estaba deliciosa y bien presentada. Cada plato era una obra de arte culinaria.\"\n\"El servicio fue excepcional; el personal era amable, atento y muy profesional.\"\n\"El ambiente era acogedor y elegante, perfecto para una cena especial.\"\nRelación calidad-precio: \"Excelente relación calidad-precio. Los platos eran abundantes y valían cada centavo.\"\nEl restaurante estaba impecablemente limpio, lo que hizo que la experiencia fuera aún más agradable.\""
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMThQdjZnRRAB",
            "text": "Pedí una Margarita de mando pero llla lo tienen preparado y la verdad el jugo de mango que le pusieron se ve partícula del mango extraño mal los trago se supone estar en un bar restaurante se supone que el bartender te aga un trago fresco porque para esta basura lo conpro en el supermercado que lla los venden preparado 👎👎👎👎👎👎👎👎😡😡😡😡🤬🤬🤬…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweG9qRzFBRRAB",
            "text": "El sancocho de gusto muy bueno! Pedí una picada de carne y pollo tostones en verdad la carne era como comer cochino refrito casi quemado! La atención de la chica ósea la mesonera muy buena ! Al no querer comer la carne que nos trajeron no las cambio sin ningún tipo de pretexto! El ambiente muy musical 🎵 es un ambiente latino  de comida estilo dominicana !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3b3VET29RRRAB",
            "text": "We went there after the AV Milan game at Yankee stadium. We did not eat but the food being served looked really good. We had drinks and the service and atmosphere was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXJqRGZ3EAE",
            "text": "The service is really good.   When you come in here you feel like they know what you want.  Especially Keren who goes above and beyond to get your food out on time and the presentation is great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX2VueDRnRRAB",
            "text": "The recent rebranding made me curious to stop in! In its prior glory, this establishment had been a favorite of mine for years whether it had been for pre/after game drinks, family dinner, or just a quick lunch. I was delighted to see that it was still all the same familiar faces, and I can appreciate the new direction the owners have decided to take. The vibe is more sophisticated, so if you’re trying to find a cuchifrito, that isn’t here.\n\nGenerous portion size, not stingy with drinks and the same friendly service. 161 Bar and Grill is in its elevated era."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcHRxMDZ3RRAB",
            "text": "Just came here 5 stars great food waitress and service"
        }
    ],
    "reviews_count": 65
}