{
    "name": "NYY Steak",
    "place_id": "ChIJcWnnWiz0wokRHYvelzf2It0",
    "grid": "BX4",
    "address": "1 E 161st St, Bronx, NY 10451, USA",
    "rating": 4.5,
    "user_ratings_total": 306,
    "phone_number": "(646) 977-8325",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMWNHc3RSbWx6WW5Od2RGODRhbk5uYzBwRGFrRRAB",
            "text": "My friends and I took advantage of a fantastic offer from the NY YANKEES. Lunch at the NY YANKEES STEAKHOUSE and tickets to the game. In making my booking I had the pleasure of dealing with Elise Rivera. She answered all my questions and confirmed the exact arrangements. Thank you Elise.\nEveryone enjoyed the food and the atmosphere in the restaurant. What really made lunch special was our waitress Melissa. She was absolutely amazing. You've got a real gem there. Thank you so much for \"enhancing\" the entire experience Melissa. You made our day!!!\nTim"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGJsOTRTMWhUZWxGdmNGRlJUMUZCVGpGZmNVRRAB",
            "text": "Thanks, Frank, and NYY Steakhouse, for a fabulous pre-game dining experience in true NY fashion! Everything about the dinner was iconic, including the view of the #4 subway, the jersey-numbered China - I had Lou Gehrig's #4, and Junior's cheesecake. The steaks rivaled any of those from other storied NY steakhouses. Overall, though, it was Frank, and Luis, who made the day! Frank was accommodating, knowledgeable, funny, genuine, a true ambassador of the grit and grace of NY! Helluva good time before the game!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveU9WcEZUMlJ3TTJnd2IzRlNlbHB5YzBKU2FIYxAB",
            "text": "Honestly absolutely not worth it. Everything was overcooked. My 40 dollar porkchop was so dry I had to choke down every bite with water. I absolutely should have sent it back. The lobster was overcooked. The steak was overcooked. The only thing that wasnt overcooked was the raw seafood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMemkwWTZjd0piZHlBRRAB",
            "text": "Bone in rib for $90 was underwhelming. Creamed spinach was the worst  I have ever had. Service mid. Would have been better if exterior view was towards the game instead of the train/street."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQU2dpNUtXMk0yYTNRRRAB",
            "text": "Had dinner just before the game. At the elevator we got stopped by a woman asking if we had a reservation and we did not. She gave us attitude and said we needed to wait so she could check if they take walks in. After she lets us go up the elevator we saw the restaurant empty! They gave us a table and we thought that was the only hiccup. The waiter gave us attitude when we asked if a friend could join us last minute. He rolled his eyes and asked us to move at the end of the table. They put a chair right on the hallway where waiters and people were passing through. Mind you, we had at least 2 tables on the other side where our friend could’ve sat. Food was ok. Lobster Mac and cheese was cold but service was not good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGRIZ3ZnRRAB",
            "text": "Service and food were perfect. Shout out to Stephanie for making our first time perfect. We will definitely be back because of her."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaW9lZkZBEAE",
            "text": "I stick with the appetizers. Steak is okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNTUzLUVnEAE",
            "text": "Great experience all around. Showed up without a reservation about 10 minutes before the start of a division series game and was able to get a table. the Hostess was very polite and ensured we got a table near a TV. The waiter was very knowledgeable of the menu and efficient with getting us in and out to get to the game. The Bison meatball appetizer was very tasty and the 20 oz ribeye was cooked perfectly. I particularly liked how it had a dark crunchy crust on the outside which gave it that extra flavor. Looking forward to coming back to try some other appetizers and desserts. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucV9EdUh3EAE",
            "text": "I want to thank Stephanie my waiter for making our dinner more than pleasant, she was amazing and very attentive. Also wanted to thank Jayson for checking in on us every so often making sure everything was alright in our table, and I notice he does it with all the guests as well. I mention this because it’s those little details that often go unnoticed that makes the entire dinning experience a pleasant one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOUxEMnlRRRAB",
            "text": "The steak was cooked perfectly! Shrimp cocktail was delicious. 10/10 recommend coming here with your family before the game. Great memories were made."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidks3Z0tREAE",
            "text": "Stopped in during the rain delay, ate some steak. It was good. In fact, it was best part of the night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZ1BUUDdRRRAB",
            "text": "Overcooked steak, at a steakhouse is cardinal sin. Not even overcooked. It was charred and burnt. For $80. Definitely not worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMb00zMGhnRRAB",
            "text": "So, the food & drinks were GREAT. The atmosphere was wonderful and a lot of the workers there were very pleasant. My issue was with our server. She was very inattentive, never offered to fill our drinks, never checked on us during our meal, we were sitting there with empty cocktails, hoping to receive a dessert menu which I had to ask the bartender for. When she took our order she was very dry “what can I get you” sort of attitude as if this isn’t a fine dining establishment. My sister & I that were dining here are both servers so we know how it can be if the restaurant was busy or something, but it was not. There were maybe 3-4 other tables seated in the whole place. And our server was just laughing & giggling in the back with other workers while we sat there. Then we got our card out and waved her down, she grabbed our card without a word, then dropped the bill off without a word. We were fuming. We came 5 hours to watch the Yankee game and to eat here afterward. After a Yankee game loss, we were excited to still have a wonderful meal, we wanted to love it. And it’s sad because the food was wonderful, the man who served us our waters was wonderful, but our server was God awful. For how much the bill was, we were VERY disappointed with the service from her. We’re not the type to not tip because we’re servers ourselves, and usually tip at least 20% but only tipped her 10% hoping the tips were pooled with the other waitstaff. Oh - and it was our birthday (we’re twins) which we specified on our reservation when asked if we’re celebrating anything special and that was not acknowledged."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NFlqcUJBEAE",
            "text": "This is a go to restaurant. Located at Yankee stadium the food was excellent+ we had an appetizer of the thick cut maple bacon. Followed by a wedge salad and a Caesar.  Dinner was fillet and lobster and classic bone in steak that had the ny Yankees logo branded on the bone. We had a side of creamed spinach. We were way to stuffed for dessert but the offerings were very tempting. Service was spot on and exceptional. Even though we were at the stadium,the atmosphere was that of an exceptional NYC steakhouse. One of the best meals I've had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbVl5Z19RRRAB",
            "text": "Five stars for the great atmosphere and speedy service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5M3YzelFBEAE",
            "text": "Amazing !!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMXRlUnR3RRAB",
            "text": "Didn't go to the Steak place !!!!!  Went to the Yankees Team Store !!!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2eGREXzlnRRAB",
            "text": "The service and food were outstanding had a great steak dinner and the seafood lobster appetizers was amazing. Great day with a good dinner and winning game, a perfect day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dHFEVlFnEAE",
            "text": "What a great service and the stake was the best I had ever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaekpPOHNRRRAB",
            "text": "Had the dry aged strip steak.  Cooked perfectly(although med rare might be slightly more well cooked than most like).  Food arrived quickly.  The garlic butter on top of the steak made an incredible welcome difference.  Excellent flavor, great seasonings, and a great mouth feel in terms of tenderness.  The only place in Yankee Stadium where I did not feel ripped off.  A decent beer is over 20 bucks and this was $57.  Don't sleep on this spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad3JPQUJ3EAE",
            "text": "Frank, our server was excellent . I can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbWNxYlJnEAE",
            "text": "Went before day game, walked right in. Food was delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbTltYlNBEAE",
            "text": "A good place to ear before the game. Good service, steak was good but not great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOGJ1QnFBRRAB",
            "text": "Excellent food Excellent service"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbl9Ua2Z3EAE",
            "text": "Amazing stand alone steakhouse. Competitive prices. Excellent food. The stadium itself is disappointing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNktMTG5BRRAB",
            "text": "A legitimate high end steak house inside of Yankee Stadium.  In NYC you can do better food wise but to be able to have a meal at this caliber directly before watching a Yankee game is an unforgettable experience that I keep coming back to do. Service is always great and the atmosphere is fun, well as long as you are into the Yanks lol."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNEppbUh3EAE",
            "text": "Had a great waiter, chris,  he was very attentive ,we were a party of 4. We had great steaks and lobster tails....excellent food.....\nOn 11am openings you should offer Eggs Benedict"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdC1ER0ZBEAE",
            "text": "Straight up steak house!\nCeasar salad, clams casino, shrimp cocktail very good.\nNy stripe,  filet  migion and lobster tail cooked perfect.\nAll the sides where wonderful!\n\nServer was very knowledgeable"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNDlqUXZBRRAB",
            "text": "Easy to get to right inside yankee stadium, sat at the bar, atmosphere was nice, bartender pleasant and knowledgeable. Cocktails were well made, apps were great, salmon and ribeye cooked accordingly, was actually very impressed by this place. Price is up there but thats to be expected in the city and we never mind paying for quality. Will definitely re visit in the future"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbGV2QTlBRRAB",
            "text": "Had the petite filet mignon,  cooked okay, maybe a little overdone to my liking, but still good. Regular French fries are also good, and there are plenty to share, even for 3 people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dTlXVnZ3RRAB",
            "text": "Make reservations,  it's a great place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dk5qVWlBRRAB",
            "text": "Amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dDhLd1BBEAE",
            "text": "If you are a Yankee fan and like a good steakhouse, then this place is for you. Remember, it's a steakhouse so you really can worry about the cost of the meal. Ask your server to brand your steak with number 7 or even 42. When you leave, take the elevator up one level to an awesome museum filled with memorabilia and ever world series ring won in history on display.\n\nGo yanks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MjhqYWdRRRAB",
            "text": "Very good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eGZ6SER3EAE",
            "text": "Lunch menu is very limited. Service was a little slow but we were also a large group. The  food was exceptional."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbS12ZThnRRAB",
            "text": "Excelente para disfrutar con familia y amigos"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MElyRGR3EAE",
            "text": "Kitchen was slow.\nSteak came was ultra salty. I think I'm going to just Uber eats to my seat next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeHREZG1nRRAB",
            "text": "Went there and was assured that the kitchen understood what having a gluten allergy such as celiac disease is. Had an overly confident waiter claim to know what was prepared without gluten. Low and behold ordered an overpriced iceberg…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNEstdUh3EAE",
            "text": "Amazing steak inside the ballpark, prices are comparable to any good steak house. Shrimp cocktail was excellent as was the side of sautéed mushrooms. A big platter of wild mushrooms. Fast service too. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScl82S3VBRRAB",
            "text": "Service was amazing, just went there with my mom a few days ago and we requested our favorite server."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScHJDV1NREAE",
            "text": "Fabulous food, friendly staff, and you’re at Yankees Stadium!!! You gotta love it!!! The Steakhouse is our go to place to eat at the Stadium. My husband loves the steaks, the seafood is awesome, and they even have some delicious vegetarian options. The staff will make you feel so welcome and the atmosphere is super fun. Grab a high top by the bar and people watch before the game or pop in there during the game for a drink and something to eat. Elegant, yet not pretentious at all. We just love everyone there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMl9QYmZREAE",
            "text": "The food here was AMAZING! One of the best meals of my life. The manager Jonathan was incredibly welcoming and extremely knowledgeable about everything on the menu. Made our visit one to remember. Definitely will be going back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCak9QWVd3EAE",
            "text": "Food and drinks were delish! Service was outstanding. Manager jumped in helped his staff with orders because they were so busy. Very classy place! Would absolutely recommend and will be going back 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbk1ISUhBEAE",
            "text": "Duckedotdid"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldjlxMU5BEAE",
            "text": "Me and three friends were there last night before the game. The service was excellent and the lobster mac & cheese was delicious.  The steaks however, not so great.  we all ordered medium rare. Mine was the only one that came in with a good temperature. The rest of the steaks were medium to medium well they made up with a piece of cheesecake but for $600 plus tip was not worth it.  The service however, was great and our waiter was awesome and unfortunately I had to tell him we are very big tippers but he got a flat 20% and that's the kitchen's fault."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZ2IzT3pBRRAB",
            "text": "Excelente lugar\nMuy buena atención\nBuenos precios"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbElpckdnEAE",
            "text": "The staff and managers were absolutely lovely and the steak was one of the best I have had. Thank you for helping cap off a wonderful weekend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMkxuZXpRRRAB",
            "text": "It’s just so cool to eat in a steak house in Yankee Stadium. The food was pretty solid and the cocktails were well made. I’ll be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM196ODJBRRAB",
            "text": "Seated 2  immediately, without a reservation, attended to quickly and served perfectly cooked MR Strips promptly.  Oh, and this was 45 minutes prior to game time of a Yanks/sox game.  Awesome."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPX0lfX3hBRRAB",
            "text": "Booked for my husband's birthday..staff so friendly and the food is amazing and definitely have the Cherry Pie red wine."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjcU11SmpRRRAB",
            "text": "If you want to feel like a million dollar VIP make sure you eat dinner here.  The food OMG unbelievable & 2nd to none.  Everything from the taste to even the personalization down to my steak (see my pictures).  But wait, the VIP tour in the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2czliN1lBEAE",
            "text": "The food was great especially the steak🥩. NYY Steak was better than what I thought. They have a good staff that's friendly, helpful & on point. 🥖🍽🥗🥩🥔🧅🍰🍷🍾🍺🏟📸…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURveVB2RWZREAE",
            "text": "Was a little unsure about going after all they do have a security  check with metal detectors  before you could go in but as I walk in those my whole insecurity left i was amazed  by the detail of the decoration  places look awesome  they also had live music and I must say the were really good and pleasant to hear while dining  the food was also really good in kinda underestimated  my food portion  I look kinda small but when I was done I knew I was wrong drink were really good  an cheap for 10.99 you could take cup home as a soveniour they also give a nice bag and case for it who doesnt like taking memory home the staff was also really nice and welcoming  over all a little pricey but worth the experienced"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVaE1pM0ZBEAE",
            "text": "Everything was 5 star. Hot hand towels to wipe your hand before eating. My caesar salad was to die for. I ordered the filet mignon,  the waitress asked me to cut into it to check if it was cooked right before leaving my table side.\nGreat service, great food and spotless. Plus, you're in the stadium , what could be better? I guess if it were free! You may think the prices are a lityle high if you're not use to high end steak houses.\nIf you're going to see a game , treat yourself!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVNDlLMnJ3RRAB",
            "text": "The Steak and Drinks at New York Yankee Steak are worth it. It was great to experience the game from a different area of the ballpark. No reservation required to order from the bar. They have an awesome drink menu, and very good service. I tried the Lobster Mac and Cheese...it was ok.\nLet's Go Yanks!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNkpYNG1BRRAB",
            "text": "So disappointed. New Management needs to step it up. We've been coming here for years and while I realize a post covid world is different,  it should not be the customer who has to sacrifice quality. At a recent special 11:35 am game, you have to ask for lunch menu. Sometimes they have said no. Who wants a giant steak for breakfast or on a 90 degree day. They say they have new management when I asked for cheese on a plain chicken sandwich.  Cheese they said they were not sure they had. This time,  my chicken sandwich was missing the avocado and served on giant bread which I left.. Same with my husband's steak sandwich, which also had the bottoms of my chicken sandwich. Guess they combined 2 sandwiches accidentally? His at least had chimmichuri , mine dry. How about some su dried tomato mayo or garlic aoili. They had great truffle fries and now just plain. People keep asking, so give them what they miss about old NYY steak.\nBring back the burger and cheese and other lunch options if going to pay that much. Guess next time, we will head to City winery for food options besides a hotdog or a plain chicken breast with a giant loaf of bread."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOVBLOW13RRAB",
            "text": "The entire experience was tremendous!  Loved the atmosphere, the service and especially the food!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ZzdxalZ3EAE",
            "text": "Awesome night at the Yankees. This is a great bar to arrive early. $15 cocktails,  great calamari,  salad. Get here by 5, sit at the bar. Special team."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbWFQcnBnRRAB",
            "text": "The service and the food was terrific!!! Great place to go before or after the game!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZLXI3MHJBRRAB",
            "text": "This is a top notch NY steakhouse equal to the bigger names in midtown.   Reservations can be tough to get on game days, but there are always plenty of seats in the bar area."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMklldUVnEAE",
            "text": "This was my first time at NYY Steak. It was an ok experience, definitely not worth the price. We were sat at our table on time. We only waited 10 minutes to order our drinks and food. We were given our drinks and 10 minutes later received our appetizers. It then took over 50 minutes after our appetizers to get our dinners. In between our appetizers and dinner they filled our water glasses but never asked if we wanted anything else to drink. Then after we received our meals it took 30 minutes for our server to ask about our meal and he didn't even ask if we wanted a drink. I had to flag down a manager to get a glass of water. The service was not great. When I received my steak it was good, but not worth the 80 dollars and my 12 dollar asparagus was so over cooked and limp. There were two managers, one was nice, but the other one with the cane, couldn't be bothered by anyone and showed it on his face. I can say I did this once, but I wouldn't come back. It wasn't worth it. I have been to many restaurants in many countries and I don't mind spending money on a meal if the service is good and the food is great. This place doesn't have either. I would save your money and go somewhere else."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNHJHSm5nRRAB",
            "text": "Start off with a great dinner before game. Watch the pre game show and get ready with some cocktails"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NXZEaHlBRRAB",
            "text": "Great Filet and all before the first pitch with no reservations."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdGNtM1JREAE",
            "text": "Only been here about 3 times but service was always consistent as was the food. One of the best places for steak lovers in The Bronx. Everything always came out to perfection.\n\nWhen I order a steak, it's always medium rare and it's good to know that they know what that means. Often times at other restaurants you order medium rare and end up with medium well.\n\nDrinks aren't too shabby either. The place is very nicely done and a romantic and upscale place right inside Yankee Stadium."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcDRiNndnRRAB",
            "text": "My favorite restaurant and I'm not biased since I'm a Yankees fan. I go about once a year, but it's always a time to remember.  Such good food and excellent staff. The decor is a must see"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRZ0lLUlhnEAE",
            "text": "One of the best steak houses I've been to.  Great food, excellent service and it's right at Yankee Stadium.  Prices are high, but you get what you pay for.  Just a note of caution;  there is another NYY Steak in Manhattan so if you make a reservation be sure you have the right one."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndGR2dFJnEAE",
            "text": "Great steakhouse by any standards. This location has a special charm to it even without views of the pitch.\n\nVery novel concept to open a steakhouse inside of Yankee Stadium but hey it's the Yankees.\n\nThe food has never disappointed as I've been going for six years now."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZcU1xZl93RRAB",
            "text": "Steak was excellent, Lobster tails were a bit dry. Overall a nice place to eat if not a bit pricey before a Yankees game. Me and my brother found a nice spot before an opening day Yankees win."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeGZTdXVBRRAB",
            "text": "Can’t get Kobe A5 anywhere, and the food and service were perfect. TV’s with the Yankee game, but not sports bar vibe. Classy, and fun. Highly recommend."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRZ1pLR2RnEAE",
            "text": "Waiter entered the wrong meal order.  I sat and watched the rest of my party eat their meals from start to finish.  It took the manager coming over to see why I had no food to get my order filled.\n\nThe waited didn't acknowledge the error until the check came where he comped my beer.\n\nThere are tons of ways to spend your money in Yankee stadium.  Skip this one."
        }
    ],
    "reviews_count": 70
}