{
    "name": "Giovanni's",
    "place_id": "ChIJZdK7p9H1wokRXtG1oueAShI",
    "grid": "BX4",
    "address": "579 Grand Concourse, Bronx, NY 10451, USA",
    "rating": 3.9,
    "user_ratings_total": 1834,
    "phone_number": "(718) 402-6996",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVEzWmZNa2QyVkRSTWJYSTVMVmxLWmxwamRtYxAB",
            "text": "Miguel was amazing he was very attentive and even on the passing always made sure my family and I were taken care of, when you come ask for Miguel and I promise his as your waiter will enhance your Giovanni’s experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUmJrdEpWR3QwV1hsSVFsWlJjV05QWjBkU1ZIYxAB",
            "text": "I bought a pepperoni slice and it was extremely greasy. The price of the pizza didn't match the quality of it. Overrated"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUGVtaDNTelEzU0RaNWRYWXROQzFyYkdST2RHYxAB",
            "text": "If I could give it ZERO STARS , I would. My firm orders from them all the time spending more than $200 dollars on each order throughout the year. However today we placed another HUGE order only to have items missing and RAW FOOD sent. When we called to speak to the manager to complain they kept us on hold for over half an hour and when the manager did come on the phone he refused to accept responsibility for the RAW FOOD and missing items essentially speaking to us rude and cussing us out and hung up the phone on us. DO NOT EAT FROM THIS PLACE. THEY DO NOT CARE ABOUT CUSTOMER SERVICE OR YOUR HEALTH BY SENDING RAW UNCOOKED FOOD AND THEY ACCEPT ZERO RESPONSIBILTY. Save your money and health and order from somewhere else."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMVprbFNVMEp5VjJobWREaDVNaTFDZWpKNGVVRRAB",
            "text": "I've been a customer for years and as of late, the slices are over cooked/ burnt, and are much smaller than a few months ago. It's definitely not currently worth over $4"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNVQzQnNSRkpTUjNkaVdHWlZWMDVZZFd4WWNrRRAB",
            "text": "They recently made the slices much smaller and thought we wouldn’t notice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VWFYa3RiV1JrZDJSMlJtRlBiRFZrZGxaVmNtYxAB",
            "text": "Food was very good could have been better but no because of the food it self, the server we had was a bit distracted ask for a chicken cutlet hero with lettuce and tomato and got it without. Two people in my party ordered one chicken cutlet wrap and one grilled chicken wrap and she brought them both grilled and when asked about it got the response they are the same both chicken... but overall food was good!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFQwaFNNMnhMTmpKeWNHMW5iMTlZVkZkSU9HYxAB",
            "text": "Great place for a cheap slice when you’re in the area"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTGFqbE5YMkUxUkU5WVYwOWlhekIzZVhKUVRVRRAB",
            "text": "I hadn't been here in a long time and it was as great as I remember. The penne a la vodka was delicious and plentiful, enough to share with me friend and take home for her hubby. Service was very good and the ambiance pleasant. Must go again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsblJrbzFNVXhWVjBjeVRIQkJRbEZuZDBsNE5XYxAB",
            "text": "It was a business lunch. It was a nice place. Good food and service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMldtOUROak5EYkhkcVNsQTJhbUZSVlUxb1UzYxAB",
            "text": "I remember coming here the silverware was filthy the food was okay , had a peculiar smell was not pleasant overall bad experience. Trash 🚮 Can Garbage food , Atmosphere & service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kbk56ZGhNR3BSY1VwWVZuSlBia1JHTnpGa1VIYxAB",
            "text": "The service here is hit or miss. I keep coming back because the food is good but the prices are high and the staff 😒. I order before I come, my name and number is on file and the service is mid to low most times.  I've said a few times I'm not coming but the food is good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSmVuWTNOWHBJTFhCdFF6SlBSM1oyT1ZBeVNWRRAB",
            "text": "Saw a cockroach,also known as a water bug and the workers didn't seem concerned by it. Won't be eating there again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVlXWkhUR2hpT0dKbGVXUnpXWE42T1ZCU2MwRRAB",
            "text": "Excellent food.. great staff!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodlptaFFRVVE1ZGtWSFVYTXpRM1ZHTm1KVFNWRRAB",
            "text": "food was not that good but what got me is that they charge for large party $89 . plus they add the tip there selfs $31 . I don't my to give 20 % tip but I dont think is okay the way they charge for lage party . Im not coming back to this place for sure ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbGEyODRNRXRrWDNObk9EZ3lZazFCVHpGbU5XYxAB",
            "text": "Pizza is great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T05Fa3pha3BFVERaV1JFcGZZWE5uWjJndFVVRRAB",
            "text": "The fam and I are staying in the area and came upon this place by chance. Very comfortable, staff was kind, and pizza was delicious!  🤤"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJMk8xWnFDcWRucmdnRRAB",
            "text": "They almost ruined my Dad’s Father’s Day !"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcEtpVmh3RRAB",
            "text": "Update 2025 June 8\nI called to order a large pie and a 10 piece wings the girl I spoke with seemed nice and all I told her I wanted mild wings she said it’s like bbq sauce I said ok I want the spicy buffalo ones I hate bbq sauce she said ok I repeat the order 4 times to make sure she got it she repeated it 2 times I said ok total was 46$ husband went to pick it up and came home I opened the bag and I could smell the bbq sauce I looked at the wings color was burgundy because it was not the buffalo wings I ordered I called 5 times no one picked up my call husband called 4 times later nothing we did not eat them horrible I even repeated the order because I did not want her to mess it up I worked in a restaurant so I know I won’t be ordering again also the pizza sauce was very salty not sure why I like better the Giovanni’s in 167 pizza was 23$ wings 20$\n\n2018 Love going to this place well sometimes the drinks are great sometimes too strong sometimes not good the problem is that they change their bartenders all the time and not sure if they don’t know the measurements for the ounces of liquor or champagne I love their champagne cosmopolitan their food is always good love their cannolis very tasty also one time I went with my sister and they told us the sitting downstairs was close because of a family reunion from one of the managers we sat up next to the pizzeria and there was only one waiter there he was completely going crazy he had a full house and the lower part of the restaurant had all the other waiters which was crazy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQZW9qXzNueVlpZ21nRRAB",
            "text": "Would give zero stars if possible. Came for lunch.We waited over 1.5 hours and never received the food we ordered. Same for the tables around us.  One table got up and left.  They also tried to charge a mandatory 20% tip on the salad even though the food never came. Mind you we ordered 1 slice of pizza and two sandwiches.  1.5 hours and nothing.  Also no apology from anyone.  The waitress was irritated we didn’t give her a tip even though she never checked that the food never came even though we flagged her 3 times to please check.  She also never brought our drinks.  Crazy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKX3I3Nk9ELWFyajRnRRAB",
            "text": "This eatery is no good . The staff is rude, and food is no good. Thumbs down"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMall3S3V2NHUtN1BREAE",
            "text": "The food is excellent. Always! They close earlier than average pizzerias so get there early and grab a pie for yourself."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM1QzUGZkODZLb0V3EAE",
            "text": "Ordered on Grubhub and wow food is so good we have decided to go in and dine soon. I had trouble ordering and called in, the host was super nice and walked me through. We ordered the Farfalle Alla Pesto, Penne Alla Vodka, broiled salmon,  chicken parm, calamari, mozzarella sticks. Everything was 10/10 so good. We even got bread with the order which was a nice surprise. Can’t wait to dine in!! Portions are huge so welll worthy the price."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJaWd5Y0dlbVp6R1Z3EAE",
            "text": "G-bar is not the same anymore. Need upgrades."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJdU90TXlSb3N2cDN3RRAB",
            "text": "Would like to go inside and eat"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc01XRUxnEAE",
            "text": "The food here is great, highly recommended."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndUpYSURREAE",
            "text": "1st time here restaurant was clean, empty, employees polite, friendly. They don't have any ice tea but they do have sodas along with 2 bars.\nI had the mixed green salad and vegetables milestone soup both were good but too much for 1 person.\nBut for large parties and small groups excellent choice.\nI definitely recommend this location"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbGJlQVZREAE",
            "text": "I’ve been going to this place for years specifically 2007 for my fifth grade graduation at Hostos Community college and it was the bomb then I’m 28 and it’s the bomb now"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWJ5cDVnRRAB",
            "text": "I wish I could leave a 0 star review."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbi02VkFnEAE",
            "text": "Since general manager Frank is gone place is a disaster.  You need to get better staff."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaHZ5bzdBRRAB",
            "text": "It was crowded when I entered but the staff was moving fast and very attentive. They knew exactly who was next and was engaging with customers. I hit two pepperoni slices it was great although a little pricey $11.15. They have tap pay available now which I love. The only thing that I didn’t like about my experience here is that the person walked away with my receipt. Didn’t ask me if I want it. Just took it and walked away…very off putting. I don’t like this new culture of not giving people their receipt!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOTlmalFBEAE",
            "text": "Placed order online. Paid $9 delivery fee and tip on $40 meal. Half the meal didn't arrive. When we called to remind them, we had to wait another 60 minutes before the food arrived without any apologies or reimbursement. From initial order placed, took 120 minutes."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aEpieUxnEAE",
            "text": "La comida está muy rica la atención es muy buena, tienen un menú muy variado"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeS1PRnRnRRAB",
            "text": "2 very small slices and 2 can sodas 14 cash\nAnd the pizza was burnt and the sauce was gassy"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbzZHQURnEAE",
            "text": "Love it ill keep going there"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzemFXbERBEAE",
            "text": "I’ve been to Giovanni’s numerous times in the past but not since the pandemic. Unfortunately the food has declined."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta09tblpnEAE",
            "text": "Decent traditional Italian American food. All the food is good but nothing great. Every entree is large enough for two people. Otherwise the prices are insane. $30 for chicken parmigiana? Seems too high but it’s big enough to share."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYanNIaU9BEAE",
            "text": "I enjoyed the drinks and food. Nice decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNnZtLWRBEAE",
            "text": "Good Food and atmosphere 👌…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNFo2SUl3EAE",
            "text": "Chicken Parm margarita pepperoni pizza and alla Vodka all amazing 😁👌"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeDRmYnF3RRAB",
            "text": "Trash pizza.. not cooked. I ordered from Uber eats, and I requested crispy.  It was the driest and most undercooked pizza I ever had. The worst.  Go to best Italian pizza. That's the best around here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOW8yVWhBRRAB",
            "text": "This used to be one of my favorite places when I was a child.  I have great memories of dining on the eggplant parm here with my dad, but we recently took my niece and the food was ok at best. Nothing like how I remember and the prices were too high for the quality."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdHFhcnV3RRAB",
            "text": "Prices is outrage.  You can not order from a kid meal unless you have a child present. They do not allow can soda in the dining area only fountain sodas. If you would like a can soda you will have to drink it at the take out area. Please bring back the old Gio staffs 9/1/24. Couldn’t eat my food in peace due to flies were flying over the meal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidV9MUmFnEAE",
            "text": "Eggplant Parmesan"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiamV5M0JREAE",
            "text": "On a random Wednesday night myself and a couple friends decided to stop in to Giovanni’s , I have eaten here a few years back so we decide to get dinner. We walk in there was nobody around. We had to walk to the back of the restaurant where the waitress was seated on her phone. After realizing that she actually had patrons she removed herself from the phone and sat us down.  The restaurant is on the older side and smells of mildew. We should have left at that point but we like to support local businesses so we continued to order. The food was basic at best. We asked to order sangria and the waitress told us she didn’t have the ingredients to make it. Fine,we eat our high priced mediocre food. Another couple finally arrive and we see she served them a glasses of SANGRIA!! After noticing we asked the waitress why she told us she didn’t have sangria at that point you can tell she’s defensive. It honestly felt like she just didn’t want to make it for us because it was close to closing and it would have been more work for her on an easy night(we came in 2 hrs before they closed). For the prices you want your customers pay you should offer more ,GIOVANNIS! Now I understand why the whole restaurant was EMPTY, not a soul other than the loafing waitress!! The service was blah and you can make what they serve at home! Save your money !!! We should have went to Zona de Cuba across the street. 😕"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJc01YN1hnEAE",
            "text": "Less than one star. I was served RAW chicken. Manager requested he never came.  This place stays empty during week because the neighborhood patrons know. If you want to close don't decrease the quality just sell it. You have to order through one of the food apps now, WACK!!!! The act like they are the only place in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyM09USGV3EAE",
            "text": "Female who answered the phone is very rude and she stay saying there is no drivers or delivery in my area when I have delivered from this company for years guess they will be losing me as a customer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNktLcnJnRRAB",
            "text": "The pizzeria part of this place is just how you would expect it to be. I have to say it looks clean and well kept. The staff is friendly enough. However the food is where I have an issue with it. The flavors weren’t the best, the portions are decent sized. The price are high for a pizzeria. They charging 19.00 for an appetizer of fried calamari seems a little high. If they at least were good I wouldn’t mind. But they were bland. Marinera sauce taste as if it was from a bottle of a brand that is not even good. Also I ordered a beer they charge me 7.00 a little expensive. My coworker asked for a can Pepsi and she was charged 3.00. This place is not affordable at all. Everything on their menu is in double digits, except for a slice of pizza. Not a place I would want to go for an affordable lunch. 30 plus dollar for an appetizer and a drink is not affordable. Overall not a place that I would recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLWJfaThnRRAB",
            "text": "Italian food is another one of my favorites.   Whenever I’m in the area I at least stop by for a slice of pizza.  Their pizza is really delicious along with their pasta.  Be careful when the pizza comes out of the oven as it is extremely hot.  Most time I ask them not to make it so hot because I can’t wait to eat it.  There is a seating area to consume your food.  There is also seating for indoor dining.  The service is fast and again the food is delicious.   The staff are professional and friendly.  There is a bar located downstairs where they play music, nice vibe to the place.  The restaurant accepts cash and card for payment.  They even deliver.  There are restrooms located upstairs and downstairs.  Give this place a try I’m sure you’ll like it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcWI3aU1REAE",
            "text": "I have passed this restaurant so many times before a friend invited me to lunch. I loved the food and the atmosphere. They have a great bar area and an upstairs sitting area. They have a generous parking lot across the street from the restaurant on 150th Street. Just as a note of interest, the restaurant is ten minutes from Yankee Stadium, if you are looking for a great restaurant before the game."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodVBDdjVnRRAB",
            "text": "First time ordering from this restaurant and I enjoyed it! My boyfriend who has ate from this restaurant raves about their food. Very rare to find good pizza in the Bronx. We decided to go with pasta and chicken for our delivery. I ordered a dish I never had tried the\nChicken Francese…it was delicious! The pasta was cooked and seasoned so well and the chicken was fluffy and very juicy! My boyfriend chose to get chicken parmesan and asked to get penne pasta and instead got spaghetti. Unfortunately he didn’t like the pasta and only ate the chicken :/ also I love when Italian bread is given but sadly ours was partially drenched in oil and wasn’t edible anymore. I would still like to order pizza from here one day though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkZzVxLXVBRRAB",
            "text": "Amanda was such a good server but I use to come here years ago a lot has changed the sangria isn’t the same there was no happy hour when I went the only good thing was the food and the service I was looking for some of the drinks they previously had and they switched up there whole menu I don’t think I will ever be returning here again"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZZ3IzR3V3RRAB",
            "text": "This is a place I've been before.  Where I been to the brunch a few times. And it was good. This time came for a bite to eat after the movies. Was seated right away. Next to the G Bar. Music was playing which was fine with me. I really…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeE1Qc1BREAE",
            "text": "Fabulous service and chefs are rock! Food is delicious. Delivery is amazing!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcmVfZlVREAE",
            "text": "I liked it, I ordered the shrimp & mushroom wrap. Very tasty. My coworker ordered the chicken & mozzarella wrap, she said it was soggy but mine was fine. The fries were a little soggy but that happens everywhere. Overall, liked it and will…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMUthdkh3EAE",
            "text": "I love Giovanni's/ G-Bar!!! It has been one of my faves to go too if I'm just trying to stay local in The Bronx. Atmosphere is nice, DJ and Karaoke on some nights, service is usually always good and precise, food and drinks is always good 🤌🏾. Can't go wrong. And on Saturday and Sunday's they have Brunch Specials where you pay one set price and eat what you want from a set menu buffet. It's very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb2JyVWtnRRAB",
            "text": "Loved this place. I walked in for a quick Sicilian slice and it was delicious. The whole staff was friendly and the restaurant had great decor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcjlfYzlnRRAB",
            "text": "So freaking good! I always get the same thing, chicken Alfredo, lasagna, and chicken parmigiana with penne and every time it’s just mouth watering! It’s expensive yes, but who cares with portions like this! Luv it!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBM3F2bVNREAE",
            "text": "My sister took me here for my pre- birthday which is actually on today November 7! It was Spectacular.  I love the food and people at this restaurant in the bronx on the grandconcourse especially when they have love jazz on Thursdays the first of the month!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDazZlajZnRRAB",
            "text": "Been coming here for years and the it's like the food is getting downgraded. Today the pizza was a little dry. And I ordered a gyro, which was $15 and that's ridiculous. Then to top it off it wasn't even close to a gyro. More like a chicken wrap."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndTlfNHp3RRAB",
            "text": "Well let me start off, when I entered the restaurant the host was very rude didn’t even say a word where we can sit or anything,then the waiter was like in a bad mood I felted not wanted in this restaurant will come onlii to order out not…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobDZmQ3Z3RRAB",
            "text": "DO NOT ORDER PIZZA  from here. It’s over $4 a slice and is okay at best. The plain slice was good but not $4 good. The slices are skinny as well.\n\nDon’t bother here at all. The interior is messy and old and is not inviting.\n\nGO TO LOUIE & EARNIE’S pizza instead. I paid $20 for 4 slices at Giovanni’s. You can get a small pie at Louie & Earnie’s for the same price and it taste miles better"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTaDlfbXpnRRAB",
            "text": "Haven't been to Giovanni's in a while, but when I do come, I am never disappointed. The food is always good. The Alfredo Fettuccine is a good selection. I didn't get it this time, but the Lobster Ravioli is one of my favorites there."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1Z0xhZ2VREAE",
            "text": "Giovanni's has the absolute 💯 best penne alvoka with chicken in the world.  The service is A+ and the atmosphere is 2nd to none."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNkpDSWxRRRAB",
            "text": "Mmmm mmmm mmmmmmmm. Yummy. I do love a goooood pizza. The staff definitely nailed it and there are several variations to choose from. I chose chicken and plain and the slices were beautiful and delectable to eat. The restrooms were clean,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cGMySWt3RRAB",
            "text": "I used to love coming to this place. Mainly for their minestrone soup However when I ordered the soup from there today, there was a bug in it! Super grossed out. The only reason I am not leaving a one star is because when I called to make…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNXUyVXpRRRAB",
            "text": "Never a bad meal. The bread basket alone, which includes garlic knots, is worth the trip there. The pasta has consistently been great. The meat dishes. Brunch is also the best. Such a huge variety of food! Love when they have the stuffed pork chops as the daily special."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZemVyMWpnRRAB",
            "text": "A review is overdue\n\nJuan is not manager material and Young lady who taken my order sadly doesn’t have any phone etiquette. I thought I called the wrong number for a second. She had a whole lots of silence in between taking my order. I had to ask her to confirm order back to me twice.  Poor girl didn’t know what expiration date July 2020  she literally asked what’s the expiration number for July.   Didn’t say Thank you or any empathy for her unprofessionalism and just hung up.\nThat Placed me in a awkward position so I called back to confirm my order was correct since I had experienced my order coming incorrect before and same girl put me on hold without any warning. Just silence for a good 5 mins. Called back and finally Manager Juan.  Unlucky me, he place me on hold 4 times 1-2 min holds asking me what’s my phone number ONLY, after I already provided 4 times! I honestly had to tell him to stop n get a pen n paper.\nHis tone then became agitated and dismissive. I expressed how unprofessional this whole experience is and he just disregard. Blamed me for not being able to help me since I now am annoyed Owner needs to reevaluate his employees, ESPECIALLY WHEN MANAGEMENT CARELESS about Losing a loyal customer.   I used to love ordering from here.  prices went up with no superior customer services\n\nGot my order. Thanks for the not fresh burnt looking chicken"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNDlfcy13RRAB",
            "text": "Ordered a chicken salad for a quick lunch. Place was relatively slow. The salad was good. Service was good. I will update my review on a future visit once I’ve tasted more of the menu."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNE1yaXh3RRAB",
            "text": "Good food, very nice waiters except one rude older waitress. Superb entréé. Had a meal of baked ziti."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbG9ERTVRRRAB",
            "text": "I would give them less than one star if I could. I ask for extra sauce and extra cheese and pepperoni and they give me a dry pizza with very little cheese and charge me $30. I call back for a refund or a replacement and they offer me a $10…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdkltRjB3RRAB",
            "text": "They are very accommodating. Our friends were late & they were so patient with us. The staff was attentive & helpful. I had the lasagna, it was a huge portion & delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaFl6RDN3RRAB",
            "text": "Love this Italian restaurant, pizza was delicious,  slice of pizza had chicken cutlet, mushrooms and green pepper toppings.  You want a good crisp slice, come here as it was worth it."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMDVuOHl3RRAB",
            "text": "I really want to give this place a 5-star review, but the middle of my calzone was cold, the presentation was terrible (see photo), they gave me 1/2 as many garlic knots as I saw the server carry to another table, and it didn't taste that good. I'm not even sure why I'm giving it 2-stars, maybe because the bathroom was clean?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc1lUdTZnRRAB",
            "text": "It's a dimly lit gem in the Bronx.  Prices are on the reasonable side. We ordered mussels in white sauce, which were excellent. Attention was taken with the order as I have food allergies. Also had a large pizza pie with prosciutto, artichokes, and ricotta cheese. We enjoyed every bit of it. I have returned since that first visit to have drinks and pasta, which did not disappoint. I will continue to visit this spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Mlo2MXRRRRAB",
            "text": "Good service. Food was good. Didn't have to want long for the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4b3Zibmx3RRAB",
            "text": "Great spot for fresh and hot slices. Right amount of crunch, cheese and oil. Sauce is on point. Highly recommend"
        }
    ],
    "reviews_count": 76
}