{
    "name": "Molino Rojo Restaurant",
    "place_id": "ChIJudTVfC30wokRRGCBX88J7BI",
    "grid": "BX4",
    "address": "101 E 161st St, Bronx, NY 10451, USA",
    "rating": 3.8,
    "user_ratings_total": 775,
    "phone_number": "(718) 538-9642",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlQybHJVRkJDUW05QlgwTnJZMWQwVGpnME0zYxAB",
            "text": "My only complaint of my most recent visit is that the sancocho soup that I paid $15 for only had 2 small pieces of meat in it. Other than that the flavor of the food is great and the atmosphere is nice A+"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NFdIQTVhRU5mTTNsVWJtaFZZM0ZpZFU1aFUxRRAB",
            "text": "Very good service and attention"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSmJuTk9XRzF2T0hGV09GUnhiWGh5YURoVVptYxAB",
            "text": "Found in my soup and almost choked. Calling the BBB immediately"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWWVWRndOSFpSWlZkSGF6SlNWMUp6UVVkT1NIYxAB",
            "text": "Me encanto"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMFlqSm1aRTlwZG5CSE1tUmhUVFpVVFhwS2MyYxAB",
            "text": "Great service"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeXp2b1cyeWRyUUlREAE",
            "text": "Comida espectacular y servicio excelente. 100% recomendado 🎊🎉🔥💣"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKX3Z6S0xFZ3ZycUtnEAE",
            "text": "⭐☆☆☆☆\nWhat Happened to Molino Rojo? Disappointing Return Visit\n\nIt’s been a while since I wrote a review—and I hate that it has to be about a Bronx restaurant I used to love. I moved out of the Bronx over a year ago, but today I was back in the neighborhood where I used to work and had to stop by Molino Rojo. This place was once a go-to for me—great Latin food, reliable lunch specials, and solid portions.\n\nBut WOW—what a letdown.\nI ordered the lunch special: Pernil with rice and beans. It cost $17.00 (yes, seventeen dollars!), and what I got was basically a scoop of disappointment. Three mouthfuls of pernil, drenched in sauce, about ten sad beans, and a mountain of rice packed into a tiny aluminum takeout container. I wouldn’t have paid more than $7 for what they served me.\n\nIt honestly felt like a slap in the face—not just as a customer, but as someone who genuinely wanted to support a local business I used to love. If things are that bad financially that you're shorting people and charging premium prices, maybe it’s time to rethink the business model. This felt more like a hustle than hospitality.\n\nMolino Rojo, what happened?!\nY’all used to be solid. Now it feels like you're ripping people off, and that’s a shame. I wanted to show love, but this experience made it clear: I won’t be coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLRzE2YjN5cXNydFFBEAE",
            "text": "This is a good local restaurant offering Latino food.  The service is excellent.   They have a good bar.  The music is too loud to hear your partner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2R5VktREAE",
            "text": "This is a local spot I had never been to before, but I decided to stop in last minute with my kids—and let me just say, this place is now going to be my go-to. The food was delicious, the customer service was super kind and accommodating, and the overall vibe was just great. Good music, good energy, and a welcoming atmosphere. I would 100% recommend Molino Rojo to anyone looking for a solid meal and a good experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMzRuT05REAE",
            "text": "Had a great time here before the game."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NnZULW13RRAB",
            "text": "I love this place. Their food is great, the drinks are perfect, and Gustabo, the bar attendant, is the best of the best in the Bronx."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdTR5UUlnEAE",
            "text": "Food is horrendous 😫.  I asked for a steak with onions (bistec encebollado)  so what they call it, rice and beans.\nA sheet of paper is thicker than the piece of steak they gave me. And it was 26 dollars.  I go to Texas road house and I get a 16 oz steak for 22 dollars. Omg is horrible.  I went inther once ans I will never step a foot in this place again.  But if you like to talk to the waitresses  then you visit this place. But for food.  Go elsewhere.  To manager- I'm sorry. You need ot work on your food... ASAP"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbk51UzlBRRAB",
            "text": "Very good food. Everything was good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNnYtUGN3EAE",
            "text": "Pork chops are bland"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNnMtN1B3EAE",
            "text": "Very good quality food and the service is like a family with the treatment that is given to the client. I have a very satisfactory experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeXZIdTlRRRAB",
            "text": "Molino Rojo is a great Dominican/Puerto Rican spot to eat at right before a Yankees Game. The hostess and server were excellent and the menu is big and the prices are very reasonable. The empanada trio which comes with chicken, beef and cheese was fried to perfection with a delicious chipotle mayo. The Cuban sandwich had really good pork and was toasted really well however they put a lot of mustard on it. They have a bar if you want drinks but it was early in the day so I didn’t. Overall I would highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX3FEbEtBEAE",
            "text": "I visited here July 26 2024 to get Alcapurria they stopped selling it 2 years ago, so I ordered Chicharon Morongo which was horrible for the price I paid the pork was so hard I couldn't eat it so I ate only the Mofongo d I didn't give enough gravy for monfongo. Dexis is very friendly and customer friendly,  professional and an asset to restaurant.  But what had to eat not good won't eat here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiekl5ekVREAE",
            "text": "We stop for lunch. Place is nice and clean. Staff very attentive. Our food was delicious.  We order a mofongo to go but that was not the greatest.  It was very hard and they only put 4 small pieces of chicharrón.  It's a bit pricey."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyODd5VGtRRRAB",
            "text": "Empanadas were delicious! Not gresy, and stuffed. Do not recommend the calamari. They taste frozen and sauce was sour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbFBfdDhRRRAB",
            "text": "Was working in the area for the day and discovered this delicious location.\n\nThe service is friendly and efficient. The waitress who seemed to be training was attentive and respectful, with great eye contact, which makes sense because the server training her must be setting a great example. They both took care of me like a super tag team, without being overbearing.\n\nI ordered the pollo guisa’o lunch special. It comes with a choice of white rice or yellow rice, and black beans or red beans. I also ordered a side of potato salad. The lunch special looked like a small amount of food because the plate it was served on was so big. But half way through I was so full I had to take half of it all to go. As a Dominican- American born and raised in NYC, this meal made me feel right at home! The flavors were savory, the textures moist and fresh.\n\nI came in during happy hour. Ordered the perfect coconut frozen margarita.\n\nThe atmosphere is chill and clean.\n\nI’ll definitely come back next time I’m in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbFk3c3B3RRAB",
            "text": "Great arroz con gandules and chicken stew"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdWUyai1nRRAB",
            "text": "Went to watch the canello fight on 5 de mayo had such a good time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeE56YlNBEAE",
            "text": "No more traditional food on windows. Got in with some friends to drink a few beers and the female server was terrible. Nasty attitude toward one of us who was a regular customer. Wanted to scam us with the bill. Always check the drink prices with the manager and keep count."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbnVPQ0NBEAE",
            "text": "Our server K did an amazing job. As a server myself I tip my hat off to her. GO YANKEES!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dEp6NVJ3EAE",
            "text": "Great food and great service 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkX28ta0N3EAE",
            "text": "Good food and drinks"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseTVER0dREAE",
            "text": "Not what it used to be. More for drinks than dining."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMkxXbGlRRRAB",
            "text": "Great Dominican food\nTHEY CLOSED DOWN"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOLXRhR2xnRRAB",
            "text": "Great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWb3ZEZVZBEAE",
            "text": "This restaurant has been a family favorite for decades. Regardless of the changes made over the years, the food is amazing and the staff do what they are supposed to do. People don't realize the difficulties faced by small restaurants and the support that is needed from the communities so that restaurants can thrive and survive for more years to come. Working in the food industry is hard enough and harder post pandemic. We will always frequent this restaurant and don't expect things to be perfect every time. Always check your food before you leave and if something is off just let the restaurant know so they can fix it. Instead of leaving a bad review, talk to a manager or owner. Let's go back to the days where restaurants are supported and not criticized for everything that is done wrong.\n\nLove and support small businesses\nChef's Cafe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGanY3VnBBRRAB",
            "text": "I've gone to this place multiple times, even through several name changes over the years. One thing that remains the same (but gets better!) is the authentic flavor of Spanish food. Tonight I came in craving some soup, so I ordered sancocho. I wasn't even aware of the specials that have now for late night festivities; now that I'm much older than I was decades ago, I can indulge in a nice drink 🍷 The sancocho was delicious, nice and warm and hearty. The 5 for $7 chicken wings were nicely fried and proved to be a nice appetizer. My waitress was a lovely young lady by the name of Marcely whom I tipped nicely 😊 If you do decide to dine in, be prepared for loud music in the genres of Reggaeton and pop (which had me dancing in my seat 🎶). I came in with a crampy stomach and allergies a-blazing, and left feeling full and satiated 💕"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaanBXYlBBEAE",
            "text": "Fuimos hoy en la tarde  y ordenamos la sopa de mondongo k d moldings no tenia ni las huellas  saladicima y eso era sopa de pasta de tomato."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac01ibTNnRRAB",
            "text": "Wonderful local Dominican food. Close to Yankees stadium..."
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeG9XNFRnEAE",
            "text": "Lugar agradable donde puedes pasar un rato amena con buena compañía o familiares."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNS1TWlFBEAE",
            "text": "Just wow"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNXRiYWdRRRAB",
            "text": "If ur ever goin in2 the Bronx on a Saturday afternoon after a Yankees home game Molino Rojo Restaurant or on a weekend that the Yankees are away this Mexican spot is a must the location, service, cleaness y food is just absolutely amazing, fresh y very delicious Have been here quite a few times with a friend, or with a group of friends we always have enjoyed ourselves my friend y I always start with an appetizer we always get the Seafood Panella 4 2 people, Shrimp in Coconut sauce, Grilled Shrimp y my orders are usually Grilled or Steamed Red Snapper with rice y beans, Octopus with either Cassava, green bananas, rice y beans,y sirloin steak with shrimp y 4 our drinks we always get either Chandon y Moet wine y a bottle of corona with a lime Mexican food is 1 of my all-time favorites 4 food, Molino Rojo is a definite must can't let this restaurant pass it's a must Danny S Seattle Washington"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNXRLRmdRRRAB",
            "text": "Buenas atenciones y la comida es muy buena, elegimos pasta y mofongo todo estaba excelente"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKa3JfNWF3EAE",
            "text": "Nice place. Food was OK. Not great."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcVB2bEZ3EAE",
            "text": "Es un ambiente muy bueno. Su atención de primera todo el personal. Lugar aseado. Cerca del estadio de los Yankees. Comidas buena y en su punto. El chef acepta sugerencia en sus platos. Que se sirven para uno. Su camarera un diez. Tienes que ir. Los precios baratos. A si fian"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ME9TQUNnEAE",
            "text": "They closed it down."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dnNha3hnRRAB",
            "text": "WHERE IS THE REST OF MY FOOD? 5 pieces of chicharrone with mofongo. 5… for $17. Great service and wonderful atmosphere however, very skimp on the portions. You would think the portions would be better. I am very disappointed. The CHICKEN MOFONGO was even worse. McDonald’s gives you more nuggets."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bjVyWWpRRRAB",
            "text": "Good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aTVTTl9nRRAB",
            "text": "Nice atmosphere. Friendly staff. Strong drinks 🍸 💪🏼 😌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c0pIRVRREAE",
            "text": "New owner, better service and food.  Love the happy hour. It's a little pricier than before, but everything is better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSajVfbUZREAE",
            "text": "Awful! The food was all white rice over cooked beans and sour pernil. Very expensive for a pound of rice!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMDdpNTlnRRAB",
            "text": "Bad Customer service and Food not worth the price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOGRHeTNnRRAB",
            "text": "This place was horrible, the food is ohk but the service is horrible and don't bother ordering a drink... our \" bartender\" had to call another person to come help her make the drinks, the Googled how to make the drinks and still made them wrong.. it was a complete waste of a lunch break and I should've went across the street to Yankee Tavern instead"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwN3ZXTGZnEAE",
            "text": "Expensive as hell . One time last time  . Food taste good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSemFPSWlRRRAB",
            "text": "Food definitely not worth the price. Watery beans and overall not satisfying. You’re better off going to a fast food chain. It’s a bar now. Focus on the alcohol and cross your fingers."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0LWZLbGRREAE",
            "text": "The food was tasty, service was ok. First impressions were that a lot of locals patronize this business as we were unfamiliar with how to order, where to sit, nor did anyone step up to make sure we were welcomed and taken care of. First impressions are EVERYTHING."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMk5LcVN3EAE",
            "text": "I've been coming here for many years but in the recent times, since the last two remodelings... It's not better.\nI had half a chicken w/rice and beans.\nThe chicken was very dry - overcooked.\nRice and beans were fine.\nService was good.\nPrices have gone way up, I know everything has gone up but some of the prices are wild.\nI miss the days of $5.75 for the same meal....\n\nI'll be back, Because it's usually good.\n\nI know I've written reviews here before but I guess they got wiped out due to one of the business changes?"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMExHc1RBEAE",
            "text": "I was so looking forward to eat at this restaurant  as my friend has been going here for many years since the time she lived in BX until now - years after moving to the DC area. She has always raved about their food so we knew it was a must to stop by there last night to get our plates of food to take with us back home. We bought rez guisado con arroz y habichuelas. She also bought a small portion of chicken guisado because she noticed the portion of the rez guisado they served was small. Everyone’s demeanor seemed as though they were just ready to just close shop and be on their way. Granted it was late when we arrived (around closing) but there was still food available and rendering proper customer service and good food is a must at any hour for a food establishment. One particular lady was not very pleasant and when I tried to carry a short conversation with her about how we were taking the food back home to show how excited we were, she didn’t say a word to me until I repeated the comment to her in Spanish twice - more loudly the second time (although politely) so she could tell I knew she was being rude. Her reaction when she did respond was “ah ok” and then she proceeded to serve the rest of my order. Also my portion of red beans/habichuelas were served in a small plastic container and when I opened it today to reheat my plate of food at home there was literally no beans and nothing but the sauce in the container (check the pictures). The rez guisado was basically three chunks of meat with three potatoes and barely any sauce was added. The yellow rice was very dry as well. Overall the taste of the food was mediocre and so was the service. My friend says the quality of the food has definitely changed and for my first experience it will definitely be the last."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1M012Rnl3RRAB",
            "text": "I got 1 order of mofongo w/ chicken & cheese and another with longaniza & cheese….. the pics speaks for themselves. Where’s the CHEESE? The CHICKEN OR LONGANIZA? 👀. Out here giving a pound of mofongo sin golpe. 7/10 probably will order again.The mofongo itself was good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwd01Hdk53EAE",
            "text": "The service  was very nice 👐🏾 The Food was Hot  and fresh 👌🏾  Muy Buena Comida 🇩🇴.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdXRpRWxnRRAB",
            "text": "I come here before most Yankee games! Eat like a Puerto Rican king for next to nothing! Love, love, love this place!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDN05lUmxnRRAB",
            "text": "So tired of getting burnt food when ordering to go or getting delivery, like come on chef if you know you burnt the food and it smells and looks burnt most likely its gonna taste burnt Just DONT SEND IT OUT, yes they apologize and remake it…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2a1pXR3FRRRAB",
            "text": "Pedí un Lunch de pollo con arroz y habichuelas,según pollo rostizado..seco sin sabor parece que tiene semanas en el Caunter 😡pedí una sopa de pollo pequeña ..me dieron un caldo con pedazos de grasa de pollo y tres hilos de pollo 3 zanahorias y dos pedazos de papá..el fideo nunca lo vi..creo que fue el sobrante 😓pague casi 15 dlls y esa comida es un asco 🤮..que arrepentida estoy..dinero perdido.lo siento no le puedo dar ni una sola estrella..y no es el dinero..es que me imaginaba que tendría una rica cena ..y realmente estoy molesta..nunca me había tocado probar  comida dominicana tan  pésima ..usualmente los restaurantes dominicanos tienen un delicioso sabor..desgraciadamente aquí no es el caso..👎🏼 NO LO RECOMIENDO..😓"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbzhQT3lBRRAB",
            "text": "I love their soup 🍲 and rice ☺️🌾…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OTdqUmlRRRAB",
            "text": "I’m very sick so i decided to order chicken soup. As a Jamaican i only eat Jamaican soup really but i know Hispanics and Jamaicans make it the exact same way so i ordered from here. I got a large chicken soup. It’s amazing!!!! Taste as if i made it myself. And they are NOT stingy with the chicken at all. Nor noodles. The soup was around $15 but no other Jamaican restaurant or Spanish restaurant can make it like this so it’s worth it. I ordered it and it came in about 30 minutes earlier than it was supposed too. Still hot and they gave me some extras. I HIGHLY RECOMMEND!! Delivery and flavor is a 10/10 and i feel better already. If you’re sick and too lazy i recommend ordering soup from here too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ051a1BREAE",
            "text": "5 Stars earned🔥! I had a blast at this place! The food was excellent, the drinks were delish, and the staff was very warm and welcoming, especially the bartender Gustavo! The atmosphere was inviting and cozy, and the prices are reasonable…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjdzdlei1RRRAB",
            "text": "i was pleasantly surprise. i have lived in this neighborhood for 44 years and i used to buy food here but the food was not great. i stopped going for years and i went a month or so ago and its under new management and the food was…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXX1o3VGl3RRAB",
            "text": "Today 10/14 after the game my dad & Walked to see if we could grab a bite. but the food was dried up & had the  appearance of sitting for days. The Roast pork was empty & dead looking nothing was appetizing! So we paid for the coffee & walked hungrily to Justine where the food was alive hot just prepared the Roast pork, stewed, oxtails was all fresh especially the baked chicken. Enjoyed our meal"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPd0xmeHRnRRAB",
            "text": "My first time ordering. The food was delicious and the delivery was quick but communication between the delivery person and business needs to improve. The business receptionist needs to inform the customer about the delivery guy’s effort to…"
        },
        {
            "date": "3년 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaktxZ1lREAE",
            "text": "Sulla strada per visitare il museo di arte moderna del Bronx ci siamo fermati per consumare un rapido pranzo.\nLa cucina è molto semplice ma propone piatti interessanti e confezionati con cura.\nIl personale è molto simpatico e disponibile. Consigliabilissimo per il rapporto qualità/prezzo."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVd083Wkl3EAE",
            "text": "Excellent restaurant on the foot of Yankee Stadium. The food is excellent and in great variety. After spending all afternoon in the heat of Yankees stadium and paying $41 for three beers...the same three beers at this restaurant was $16 and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaktxN3VBRRAB",
            "text": "Loved it. The guy made 4 fresh empanadas for me 10 minutes before closing. The restaurant was spotless and smelled clean. Very chill vibe inside. Definitely a place to come before or after a Yankee game !! 👊🏽…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0MGQzQWh3RRAB",
            "text": "The food is good,  but customer services for take out is the worst. There is a woman, she has the worst attitude, she wasn’t polite.  Also, this issue it is not the first time. Additional to that, she wasn’t wearing gloves while she was…"
        },
        {
            "date": "8년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa0lTcGp3RRAB",
            "text": "La comida muy buena deliciosa y muy recomendable.  pero hoy no me atendieron cómo deberían atender a otros clientes,  sería por ser un centroamericano o suramericano o tal vez la apariencia,  le pedí un vaso  con agua de la casa me dijo que NO TENGO,  luego me dio una botella pero sin un vaso con hielo,  pero a otros clientes vi q si ofrecían agua de casa, el hecho no es q uno no quiera gastar 1 dólar por dios, pero deberíamos ser más amables con todos,  lo mismo hice yo NO dejé propina imagino q se molestó. No soy acostumbrado hacer ésto al público,  PERO TODOS SOMOS HIJOS DE DIOS Y SOMOS IGUALES NADIE ES MÁS O MENOS.  gracias."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNN0xIdHl3RRAB",
            "text": "Después de varias veces de venir aquí he visto un cambio y mejoría en todos los aspectos, la comida sigue siendo la misma, comida casera a precios módicos para la zona (todo alrededor es caro ). Sin embargo hay desorganización en la…"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReWNTMk13EAE",
            "text": "It was really nice to be able to try out this place when I was in the area recently.\n\nLocated very close to the train station, it looks like a take out spot from outside. They serve all the staple dominican food delights. As one enters there is a hot bar with the food on display. As we wanted to sit down and eat, we went to the dining area at the back. They have a decent size dining room.\n\nOur server was friendly, we went with Rice, beans ,a whole chicken and plantains. I must say though the place is not fancy but the food was really nice. I had the yellow rice and my friend white rice with beans. The chicken was cooked perfectly. Our plaintains were also good.\n\nI would definitely come back here to try more food. We spent $20 on all of our food and we were stuffed at the end."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMXR6V2dRRRAB",
            "text": "Local neighborhood restaurant selling Hispanic food. You can get take out or eat in. They have about 12 tables or so. There was only one waitress that night and she was good, considering that she was the only one. They have a bar, so you can get drinks. The main negative for me was that the music was so loud, you could barely hold a conversation. Even the waitress had to lean in to hear us. The food was ok. Latins usually cook with plenty of flavor, which this food was lacking. Drinks were ok.  We waited a while, which was strange because the food is already prepared and sitting in steamer pans, which are visible as you walk in. Prices were common for today's market. The manager came over to speak with us, which was a nice touch. They accept cards or cash."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBM3ZUb3dBRRAB",
            "text": "This place is a great breakfast lunch or dinner spot. Latin American dishes are delicious. The waitresses are good and serve you fast. They are polite and constantly make sure you are satisfied. I highly recommend it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVczRiLXJ3RRAB",
            "text": "I went in on Saturday or a lunch and this amazing girl named ana took my order.. I was very pleased with her customer service she did an amazing job she was quick and my food was so hot and delicious . She was always smiling. I will continue to keep coming back on her work hours!! Thank you for your service Ana!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3bTlMcnB3RRAB",
            "text": "Usually its very good , but this time my food was just warm, and I asked the waitress if she can heat it up she became bothered by my request. My husbands food was also warm and it was seafood. I was not a happy camper."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MXFIb1JBEAE",
            "text": "Awful experience. Food was barely warm, close to cold. I was charged $11 for a tiny tiny portion of Carne guisada with only white rice. Never going back to this place. To expensive for the poor quality served."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheHBybnhBRRAB",
            "text": "I was in the mood for sanchocho  and a side if roasted chicken and rice. It was very good. If you want authentic Dominican food this is the place to be . The white rice was a little smoky but it was ok after pouring the bean on top."
        }
    ],
    "reviews_count": 76
}