{
    "name": "San Jose Restaurant",
    "place_id": "ChIJFY5vBtP1wokRKiSifF0do3U",
    "grid": "BX4",
    "address": "109 E 153rd St, Bronx, NY 10451, USA",
    "rating": 4.4,
    "user_ratings_total": 705,
    "phone_number": "(917) 631-9253",
    "reviews": [
        {
            "date": "3시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd1h6bHBaMkV3TTNGcFdIaHNSSEJSWmtZMFFrRRAB",
            "text": "Buena comida en un área tranquila y el servicio muy eficiente y amable. 😊"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSmJuQlhSSEJ3UTFwVFpqVmliRVZtWlVwVkxYYxAB",
            "text": ". .le falta un toque de sabor a la comida  🥺🥺"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZlEyRllhbVExY1RaM2NuaHFZVFZCZUZaa1ZrRRAB",
            "text": "Excelente servicio de las meseras , silvia,anel,tere,arely,,luiza ,laura,,\nLa comida Excelente los cantantes, Sergio, Jaime..... 100 % recomendado"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNFMyOUxTbEZUVTBGM05FOUpSVlYwWjFZMlRXYxAB",
            "text": "Siempre me gusta venir a San Jose porque tienen muy buena comida, buena porcion y buen precio, mi favorito el Rib-eye San jose♥️ las meseras son muy amables y atentas y lo mejor es los fines de semana por el karaoke 🎤"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wR1FuWmplblo1YzFGZllYSk1PVlkxWjJONVUyYxAB",
            "text": "I paid $21 for 2 orders of 2 tacos and only received 1 order…I called and they said that I only paid for 1 order but I paid for 2 PLEASE RESOLVE"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRE1EUlFUWEYzTm5SSFZUZHRRV1l4WlhobWVHYxAB",
            "text": "Very bad margaritas too sweet and too expensive. Food is ok."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OemJtUnBjVUpKU2t0QmQwOVFRbFZsZGpCcFVVRRAB",
            "text": "Excelente restaurante  , atención muy amable de Ana y precios justos."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaFlUaElPR2xMZW01dVprbFhSRVZxZGpsalptYxAB",
            "text": "Lowkey the food was so good the chips the salads the flautas everything was amazing the vibe here is welcoming for people and affordable prices"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WFRGTnVVbTFrY1RKbFNXWTVjbVZUYkc5V1ZsRRAB",
            "text": "Great food and service! Very affordable prices!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTldtaGhTVU5PTjA5clFtOVdjVGxDTW5CdVpFRRAB",
            "text": "First of all, I want to apologize for sharing a picture of a plate I had already touched—but the flavor was soooo good I just had to share it! This is honestly one of the best places I’ve tried so far. Authentic Mexican food at its finest. I had the Ribeye San Jose and my wife had the mixed fajitas. Everything was A+!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNVlrUTJiVVExYm1sUVJFb3hZVU5qTTNoNFluYxAB",
            "text": "Todo esta muy bien el personal y la música la comida bien caliente me encanta lo recomiendo 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSFUxZG5NREJ3TkZGU2IxOUVjSFZ6U2xONVNrRRAB",
            "text": "We had an Amazing dinner at San José!\nThe staff Where fantastic. Warm and welcoming. The food was impeccable, delicious and gorgeously presented. The music was fun and playful and the almotphere was convivial."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaVJuRmtiWGcyVDJnNWJYWXdlRE56ZUhoTVpWRRAB",
            "text": "Excelente en todo.👍😸"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObFdrSnpla2hQZW5OcFgweERVV1JVZUhKMmNrRRAB",
            "text": "Great food and attentive service! A great time with karaoke on the weekends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMFRuUTJUVkZET0MxMFZUQk9NalZrVW5KaE4wRRAB",
            "text": "What I liked about this  restaurant was the friendliness of the employee, the service was  excellent, atmosphere was amazing. The food was amazing. I would recommend this place no no I"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVgxSkdTMDB6TmpOdmVUQnJXVE5XYTBKeFFVRRAB",
            "text": "Eduardo (the Owner) as well as his employees (especially Silvia and Laura) were AMAZING with me and my colleagues/friends. I came with a large group and they were extremely welcoming and accommodating. The food was very delicious, tasty, and the portions were big. Additionally, Maria, the singer was very entertaining and welcoming as well.\n\nI humbly encourage any person to eat/drink/sing at this family owned place. An amazing gem and couldn't ask for a better host and service. We will definetly be back. THANK YOU!\n\nTHANK YOU once again! ❤️\n\nEduardo, estaremos de vuelta. Bendiciones :)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dGFsUnhkRlEwWTFZMVNreFRVMmMwUlRCdFRtYxAB",
            "text": "The food, service, and overall vibe of this restaurant are all 10/10. Tacos were delicious, drinks were so tasty, and everyone was so nice! I went with a pretty large group and several people mentioned the nachos being the “best they ever had”. Truly a hidden gem. We can’t wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJYnluN1c4eGFLR1JBEAE",
            "text": "Extremely slow and not very polite service. Food was good."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwa2RuU1ZnEAE",
            "text": "I have returned multiple times since my first review. The place has been tastfuly updated and food prices are great. The staff is very friendly. Always fun after a Yankee game. My family loves it here also.\nAlready looking forward to my next visit!\nOrdered some chicken Sopes. The corn masa was on point love the bodega feel to this place. Will be back Muchas Gracias"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMU9EZE5WSGQwVmtKUUxWVnBZekJxTTBOTmRtYxAB",
            "text": "HANDS DOWN THE BEST!!!\n\n10/10 service\n10/10 food- so authentic and fresh\n10/10 ambiance\n\nI will definitely make a trip from manhattan just to eat here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU2VqTVR4aUxmVk13EAE",
            "text": "San Jose Taqueria is an awesome hidden gem just steps from the stadium. This place delivers big on flavor and atmosphere—authentic taqueria vibes with a fun, laid-back energy.\n\nThe tacos are healthy in size (don’t expect tiny street tacos here), and absolutely packed with flavor. Highly recommend the Carne Enchilada tacos—they’re fire. Pair them with an ice-cold Victoria and you’re in for a great time.\n\nBonus: there’s karaoke, so don’t be surprised if your taco run turns into a full-on party. Whether you’re pregaming for a game or just craving great food, this place is 100% worth a stop."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYWh0N090cmV5YzRRRRAB",
            "text": "Bello lugar con muy buena atención comida y bebidas on point.  Lo recomiendo al 100 💯😍✌️…"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNblB2YnJDbHE3UUxREAE",
            "text": "Muy bien el servicio..y la comical riquisima"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVEotLVBuNUxqa0RREAE",
            "text": "Good Great Amazing 👏 👍 👌 🙌"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUEtpUHE4NWNub093EAE",
            "text": "Me encanta porque las meseras muy amables gracias"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLVM0OHJpM2EtbVdnEAE",
            "text": "Best quesadilla I ever had. The tacos were very good too. I had the chicken quesadilla and a chicken taco and a steak taco after the Yankees won thanks to Jasson Dominguez’s walk off home run"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNXzdxSV9qeTgzVlFnEAE",
            "text": "Muy bonito y acogedor."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOekg1dGk1aFoyMGV3EAE",
            "text": "Yo pedí mi pozole pero me trajeron casi puras aguas no hay maíz"
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla1BUaXpBRRAB",
            "text": "Excelente comida mexicana!\nBuen servicio.\nMúsica en vivo."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcml3Y0x1bTl5YjJ3RRAB",
            "text": "The staff was sooo amazing. Love the foood. That lady can sing❤️🔥🥰. Thank u for taking care of us"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcXRMTC1RRRAB",
            "text": "I experience the worst service here I’m not sure how do you mix up the word fish and steak but I ordered a fish burrito and received     a steak burrito. I haven’t had meat in over 10 years this was totally unprofessional and unacceptable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3czlmTTVRRRAB",
            "text": "\"If you're looking for authentic Mexican cuisine in the Bronx, look no further than San Jose Restaurant! From the moment you walk in, you're greeted by friendly staff and a warm, welcoming atmosphere. The menu offers a wide variety of dishes, from classic tacos and enchiladas to more unique options like chilaquiles and sopes. Everything is made with fresh, high-quality ingredients and bursting with flavor. And the best part? The prices are incredibly reasonable, making it the perfect spot for a casual lunch or dinner with friends and family. Don't miss out on this hidden gem!\""
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3X2VfUENBEAE",
            "text": "Excellent food and service. Also, love their playlist. Happy mexican vibe for friends , family or solo date. I ordered veg and fish tacos. It came in hot and so bloody good!\n\nCame in on a Thursday afternoon between work and everything was top notch . All for a very affordable price. South Bronx at its best!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OUxQanFBRRAB",
            "text": "San Jose doesn’t miss"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNU5iV1FnEAE",
            "text": "Delicious food! Just wish they had elotes ❤️"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdUxMbFZ3EAE",
            "text": "los tacos de birria muy picosos, decentes. Las flautas de pollo buenas y bien servidas, todo a buen precio. Las meseras muy amables, te sientes como en México"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbFp2WmlRRRAB",
            "text": "Always do a quick stop when me or the wife goes to the dentist. Taco always make any day better.\nFood is always on point coming here is a pleasure."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMXNLa293RRAB",
            "text": "primera vez que voy comprar comida aya ese restauran y cuando boy comiendo la mitad de mi torta encontre un pedaso de guante negro en mi torta entre el pollo que asco de verdad eso va hir al departamento de salud..."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbWJUSjJ3RRAB",
            "text": "Delicious food, When I come by, I have to always finish my plate when I'm here. I love their food, and I've been coming here more often than not. The people are lovely and kind, if your looking for a Mexican restaurant this is the place to go. They have karaoke at times, singing all types of Spanish music, and it's just overall wonderful experience"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNUplaVhREAE",
            "text": "Muy buena la comida, el servicio, el ambiente\nMe encantó"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbm9IT1hnEAE",
            "text": "Excelente Servicio, buena comida.\nPara mi es como una parte de México\nMúsica de calidad 👌."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNzZhSHJBRRAB",
            "text": "Muy buena la comida y buena atencion me gusta mucho ir a ese lugar la recomiendo ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuck83cHJnRRAB",
            "text": "Don't eat here. Trust me. Rats 🐀 all around the kitchen and back rooms. They store food in the basement of the building, very dirty. The owner is a bad host, no parking. If we have a yankee game, definitely no parking unless you paid for one across the street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubzUzQXBnRRAB",
            "text": "The quesabirria was divine. I felt like home. Gracias!! Cant wait to come back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIODdXUTVnRRAB",
            "text": "Excelente trato muy familiar 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbXFtbFFREAE",
            "text": "We had such a good time here !! Karaoke was so much fun! We came after the Yankee game and it was great!! Everyone was great to us !! Food and drinks were great!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbEs3cjBBRRAB",
            "text": "Demasiado costoso, por una orden de birria y una Coca-Cola de botella me cobraron casi 23 dl, y los tacos no son nada del otro mundo. Muy decepcionado pensé que por la puntuación que tenia era algo bueno y no lo es realmente."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cHZ6R2h3RRAB",
            "text": "Los tacos de birria son muy buenos pero no les recomiendo pedir el New York steak la carne no es de buena calidad sin sabor el servicio de las meseras es buena son muy  amables"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidUx1Vm93RRAB",
            "text": "The food is not season properly and came cool to my table aster 30m waiting"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOXRxT1lREAE",
            "text": "Took to long to serve me and the sun went down before I got served"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdmJxSlRBEAE",
            "text": "Me encantó tanto la atención como la comida , y los domingos tiene karaokes apartir de las 4 y la señora canta muy bien el tiempo se te hace rápido y no te aburres y la comida muy buena  mucha variedad"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNUx2UE9BEAE",
            "text": "I ate here yesterday September 23rd, 2023 between 10:30pm 11:15pm\n\nSo I need to address the ELEPHANT in the room…..Was I served JOLLOF RICE?!! Because when I had seen my plate come out the kitchen… I won’t lie i literally thought it was JOLLOF RICE… but after tasting it, I immediately knew it wasn’t. But LET IT BE KNOWN SAN JOSE’s RICE AND BEANS WAS PHENOMENAL! Perfectly cooked fluffy rice; beans was cooked amazingly!\n\nMy chips and salsa tasted fresh and homemade so that was enjoyable!\n\nNow for the MAIN EVENT….\n\nAfter a long day of mailman business and dropping off supplies at my family’s spot. I was craving A WRAP OR SOMETHING SIMILAR WITH EXTRA CONDIMENTS(y’all know how I do). So I had to dig deep and remember I’ve eaten at this establishment before but never reviewed this place yet.\n\nI ordered the chicken and chorizo quesadilla (homemade corn tortilla)… FLAWLESS. The chicken was seasoned well balanced. Chorizo didn’t taste like it was cheap packaged meat. Everything to my point of view was fresh and good quality. But I must say I’d wish the ratio of bread to meat. I would of preferred a bit more meat…but there is an option for that. Bathroom was decent.. overall the night was ended beautifully with a live performance from some local artist who was singing karaoke which was also beautiful. Yeah I was mostly paying attention to my late dinner but anyway. It was goood. It’s all good. The staff were good. Food high quality made to order.\n\nPlease support the locals !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnBmN0p3EAE",
            "text": "I didn't expect alot from here since I randomly went there but omg I really really enjoyed my meal.\nOur dishes were all quite good and the owner was really nice to us.\nOh. If you dont like silantro, please let them know when you order the food. It is all over the plate including the sauce, toppings and decoration lol"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKemYtQW93RRAB",
            "text": "Este lugar es el mas cercano a mi y la primera vez que fui probe las gorditas y me encantaron...regularmente ordeno mi comida  aqui pero últimamente  la señorita que atiende  me deja esperando mas de 5 minutos en linea para despues tomar mi pedido y para despues mandarlo\n* sin salsa o me cambia mi tipo de comida.\nPero lo ultimo sucedido  es esto al dia de hoy que no se me hace justo si bien es un negocio pero antes que nada ofrece comida y creo debe de mejorar el servicio, como es posible mandar un guacamole pasado y para colmo trae pedazos de la semilla, el chicharron de las gorditas no es comestible por lo duro que estan los pedazos. Uno como cliente tambien conoce los productos mexicanos. Espero mejoren"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaUxqbW93RRAB",
            "text": "We found this amazing place while walking to see a game on Yankee stadium! And I have to say it is a little peace of paradise for AUTHENTIC  Mexican food lovers! I definitely can say that I had THE best soup in my live, and the most delicious guacamole in the city.  Every detail in their food presentation was exceptional. Our kids( who are usually very picky ) cleaned their plates within few minutes.\nStaff were very friendly and attentive.\nThis is our new Must-go-place now. Believe me it is worthy to come and try it from any neighborhood in NYC. They have amazing variety of food for the price that is going to surprise you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlci1DRHN3RRAB",
            "text": "Incredible food & service. The BEST! Authentic, lots of flavor and beautifully presented. Get the Tacos Birria - amazing!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNjQtaWZBEAE",
            "text": "Food was so good. The tacos were fresh with plenty of meat. The salsas were spicy and tangy. I would recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVaTdQd19BRRAB",
            "text": "Real, authentic, delicious! The meat was fresh and juicy. My hero sandwich was top notch. Numerous authentic dishes you don't find in many restaurants. Close to Yankee stadium. Prices are fair and the portions are filling."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNN0puVVRREAE",
            "text": "La comida es rica y autentica mexicana. El servicio es bueno y los meseros amables lamentablemente hay platos a la carta que se demoran mucho en ser servidos más de cuarenta minutos esperando."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLXFuTlRnEAE",
            "text": "Ordered Fajitas de pollo after a Yankees game. Their price is very fair among the restaurants near Yankee Stadium. But my fajitas is not up to par. There's too much juice and oil at the bottom of my plate (see picture). As a result nothing is browned or charred, instead, it feels more like boiled chicken strips with vegetables. For the same reason the dish tastes quite bland though it can be saved by their hot sauces.\n\nAnother thing that bothers me is their live performance is extremely loud and the loud speaker is very close to customers. Our experience was very uncomfortable as we had to shout to our waitress to place an order. And the singer was not even a good one and went out of tune frequently :("
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtX1pLaG9nRRAB",
            "text": "Really good Hurrache San Jose. Has very Good authentic flavors with green and red salsa traditional Nopal on top and fresh avocado, has quesillo beans and sour cream as well. Amazing !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwai1uaHlBRRAB",
            "text": "I know I should order something but the nachos but they're so good! On the rare occasion I do order something else it's always been fantastic. An easy recommendation is to try the enchiladas too. If you're into watching Mexican soccer it's always playing here too."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcUpldGp3RRAB",
            "text": "Es un lugar agradable la comida es buena y a buen precio sólo que no hay estacionamiento cuánto están jugando los yankees así que ese día es un lugar muy con currido sólo pediría que el que pica la cebolla la picara más pequeño jaja ya casi le pone la cebolla entera"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbGFfVWd3RRAB",
            "text": "The chicken burrito was one of the best I've ever eaten!  You must check this place out, if you are out near Yankee stadium."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOUx1RFpREAE",
            "text": "A gem! We started off with amazing salsa. The server was sooo kind and asked about my spice level and made sure I was all set"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpM3Z1Z1Z3EAE",
            "text": "Food was delicious and prices were reasonable.  Staff was courteous and friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteFBPb1RREAE",
            "text": "Very nice and tasty restaurant. The service was great. I had flautas and their tres leches cheese cake"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eUpxeUlREAE",
            "text": "The food was amazing and the staff was super nice! I should have ordered more food for sure!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0a04zYUxnEAE",
            "text": "I oder for the first time at this place and I thought because of the views it was going to be great I was wrong not the best Mexican food bad tortillas and meat don’t order here"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMmF2UjNBRRAB",
            "text": "Siempre que visito NY , tengo que pasar por aqui a comerme un huarache a la diabla de churrasco y una michelada, exélentisimo sabor y calidad!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcThDaTRRRRAB",
            "text": "This place is amazing. The food was fresh and delicious. I love this place."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOFp5SmRREAE",
            "text": "Authentic Mexican cuisine, with the traditional slow service. I don’t really worry about you attitude. Rancheras ahoy and true Mexican flare .."
        }
    ],
    "reviews_count": 72
}