{
    "name": "Hard Rock Cafe",
    "place_id": "ChIJcWnnWiz0wokR44AqFhzCJe4",
    "grid": "BX4",
    "address": "1 E 161st St, Bronx, NY 10451, USA",
    "rating": 4.4,
    "user_ratings_total": 1282,
    "phone_number": "(646) 977-8888",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaVduTnBhR05YWVV4UmRISnVXRzV6U210bFZVRRAB",
            "text": "If I could rate it 0/5 I would whole experience shocking. I have visited many Hard Rocks and this is by far the worse one staff have no customer service skills. We got the deal which included the tour when the food arrived the chicken burger was under cooked when mentioning it to the staff it seemed like it was our problem they were making excuses which is unbelievable as we were the only ones eating so can’t say they were understaffed - avoid at all costs!! I think the fact we were the only ones eating a peak time speaks volumes!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUVJVMVRablJXWHpkYVVEZFBabGxCUlVSVVpGRRAB",
            "text": "Anna is the BEST!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFkxUlNlV0ZpTFZwUlRqSlhhVkZtWVZSTmVYYxAB",
            "text": "This is an amazing place I love it so much, the food is very tasty especially the burgers. The drinks are very big so it’s very good. I love Anna and she is so kind and funny!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relpFd3dibkpVYTJWbk1GTjVjVVE0UVdOM2QxRRAB",
            "text": "We had a great time. The staff were very friendly, especially Anna who really looked after us."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeE5YWkhTMVpUVkhoSVJXaEpkRGRhYVZJNU4yYxAB",
            "text": "Great experience with Anna! Excellent service and great atmosphere. We toured the stadium and then have a relaxing late lunch at Hard Rock. Beer was cold, food was good, and atmosphere is always fun, the kids loved it!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd1dWcEpRVlp6TlVkM05HWldjVlUwZERWTlZHYxAB",
            "text": "Won't come back here. After being immediately seated. (It was empty) we waited over 15 minutes for service.  Asked the hostess if someone was going to take care of us. She said shortly.  When waitress came over she had nasty attitude.  We got up and walked out"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdmNrbFdSSEU0Wlhwbk1reElka1pJTkVKbFVHYxAB",
            "text": "We've been to a lot of Hard Rock Cafes in our time but that was the absolute best experience, the staff couldn't have been nicer! They treated us like family and were the highlight of our day! Thank you Nina, Anne & O'Neil! 🥰"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc1RXTmtRMlJtVnpWUk9YZzFiRUpGYkU5Qk0yYxAB",
            "text": "Anna and Jermaine made feel real welcomed.thry let us try the new drinks. Just made us feel special as soon as we walked in"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1N6VlJjaTB0WkRReVgycDZkSFZmTjNodmRXYxAB",
            "text": "Comida muy buena!! El servicio inmejorable con el camarero Peter, muy buen tipo!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQlFtVTNTM0puYkVkMlYwVnZVbmt6TVhkck9YYxAB",
            "text": "Amazing food amazing service Anna was the best server took care of my sister and I with the most humble acts of service ever will be back just to see her!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeWQyOVdXbFJmUVdORk5IUlFhRVJEWXpVek0wRRAB",
            "text": "First time at Hard Rock in Yankee stadium and it was a wonderful experience thanks to Anna! She was attentive and exceeded our expectations with her service. We’ll be back just to see her!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMFIzazBRV1J5WTI1TVZIQnlOemhuVlRaa05WRRAB",
            "text": "Bartenders or order takers have no structure or system on how to properly take orders or give them out when coming. A server took my order and gave it to someone else in my face and when i mentioned it they made it seem as though I was lying and that wasn’t the case. Good food horrible service providers.\n\nJust An Update….. Once I Requested A Refund After My Food Not Coming Out Within A 30 Minute Time Frame, The “ Manager “ I’m Assuming Apologized. He Stated He Was Sorry For The Inconvenience Of The Servers & Offered Me A Free Meal. I Came Back After some Time & He Honored The Free Meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KV2FUZE1XRzVuZFY5UWEzUnVNVTlNVTJoUU5HYxAB",
            "text": "Yankee stadium….what else can I say….food was great, server was superb, and basically I was home with my Yankees"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVVkwMDBSbVpDYldOT1dHUmFUMGR6UVRSelFsRRAB",
            "text": "Every time my wife and I go to the Hard Rock at Yankee Stadium we have a great time.  The food, staff and service are always top notch.  The manager is probably the best manager I have ever dealt with at any restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRE0yUkxPVTl0TW5KNmR6SldiRWhtU3pocVdVRRAB",
            "text": "Fun lunch spot. Few vegan options, but there is a Beyond Meat Burger. Lively music and fun decor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsemFtMUtRVTFhUW5SRk1XMUVhMFpzWkdSSFdrRRAB",
            "text": "Wanted to buy a T-shirt from the shop but we weren't allowed to go in because of a game. I find it very sad to have not been able to get the t-shirt or at least a clear information how and when we can visit the shop. Pretty disappointed 😞😞"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRE9YTTVWRWhUVGxneVVFMHdiRUV0TkhSVlJGRRAB",
            "text": "Adoro gli Hard Rock e li visito ogni volta che posso, ma onestamente questo dovrebbe chiamarsi \"NY Yankees Café\" perché di Hard Rock ha solo il menù... Pochissimi gli oggetti dedicati al mondo della musica, la maggior parte riguardano il baseball.\nAbbiamo mangiato bene come sempre, il servizio del \"greco\" Peter è stato rapido e puntuale, ma manca l'atmosfera tipica di un HR Café. E l'aria condizionata è veramente troppo fredda, eravamo praticamente gli unici clienti, insieme a un altro paio di persone, e non c'è proprio necessità di congelare l'ambiente, anche perché poi il cibo si fredda rapidamente."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abmJGaHJMWEIxU25OWWRGSnZOWFJoYm1SWGRIYxAB",
            "text": "Good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMU0za3pZMGxNTlVaWFYwcFdhV2hCZUhFMFRGRRAB",
            "text": "Game day brunch today was great! Hats off to Andrea!!! He was very attentive and provided excellent service. He answered all of our questions with patience. We would highly recommend having a meal at the Hard Rock Cafe at Yankee Stadium before the game. The atmosphere made for a fun pregame experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka1J6SkpNV2N4YVVReWEyMTVRVTVEV1ROWWFrRRAB",
            "text": "The Hard Rock Cafe has a fun, lively vibe that makes it the perfect place to grab a bite before a Yankees game.  The hospitality here really stands out.  From the host desk to the servers and manager, everyone is friendly, attentive, and efficient.  They always make us feel welcome and frequently check-in without being overbearing.  They know exactly how to strike the perfect balance of being efficient but never making you feel rushed.   A special thank you to Barbara who was our amazing server on Thursday.  Whether it was extra napkins, or water refills, she was always one step ahead.  We never had to flag her down, she anticipated what we needed and made sure we were having a great experience.  Barbara went beyond just excellent service, she took the time to chat and made everyone feel right at home.  Many thanks to Christos, the manager, for taking care of us.  He went out of his way to stop by our table during what was clearly a busy time.  He checked-in to make sure everything was going well and that we were enjoying our dining experience.  You can see how hard he works to try and accommodate everyone.  The level of service here really shines and shows how well the entire staff works together as a team.\nWe really enjoy the food at the Hard Rock and appreciate the variety on the menu.  The portion sizes are generous, which is always a plus. Appetizers are easy to share, making it great for our party of 6.   Our go-to appetizers are the flatbreads and the nachos.  They’re always made just right, with the perfect amount of melted cheese and served at just the right temperature, delicious!  Their burgers are fantastic. You can easily customize your order.  They  have the right amount of seasoning and are never dry.  The fried chicken sandwich is another one of our favorites, it’s full of flavor and tender.\nThe perfect combination of great food, friendly people, and a well-run space keeps us coming back.  The Hard Rock really gets it right!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2JrUm9VSFJFV0cwdFdUSldTSGd6TFRWUVYyYxAB",
            "text": "Hard Rock Cafe at Yankee Stadium had excellent service. Staff ensured my burger was made without seasoning perfectly. Friendly and attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoclkzRkVUWEV5V0ZNemIyeHdTazFXZEhFMmFFRRAB",
            "text": "I had the most amazing time at hard rock, today. Our bartender Anna and Jermaine gave us such a good time. . Bubble gum shots for everyone!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SE4wVmpOM3BzWkZkSlRYSTVlbVpSWlZSRk5YYxAB",
            "text": "We came from Indiana and our server Anna was so welcoming and gave us such a great time. . Will be back soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdkxXbGlZVzEzZVVwVllVUlRVVlF0VG5SU1VWRRAB",
            "text": "Anna was amazing! She was friendly and so welcoming! I recommend seating with her!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeFNsOTBPRzAxUzNaSGFYaDNlbXh4WW0xVFNFRRAB",
            "text": "HRC saved me from the insane heat of Yankee stadium. Anna was a gem and made the rest of our day 100/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NFZHUlNhRmhsVVU5VVpEVlNMWFpWVUZwUk5tYxAB",
            "text": "Anna was amazing!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFdGFqWjJWV2xuVGxSaVJWZGpNR3BEYUZKeFFtYxAB",
            "text": "Amazing place, great food and great service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TE0xTnhUbFZ3TVRaMk1rVnNabkpGWDNGWFIwRRAB",
            "text": "Our waitress Erica was amazing! She was easy to talk to and made our dinner a fun experience!  Erica recommended one of the new burgers..The New York Burger and WOW was it fantastic. We frequent the restaurant often before games and the Supervisor Yvette is always friendly and accommodating along with the manager Christos. They are constantly walking the floor making sure your dinning experience is meeting your expectations. If your around the stadium on a game day I highly recommend stopping in for drinks and a bite to eat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweFowRmxPRkZrY0hCNU0xRmpRbnBKZUc5a05uYxAB",
            "text": "Our server was FANTASTIC!! Made our experience 15/10!!\n- try the nachos they were delicious!\n- great atmosphere for a bite to eat before the game!!\n\n- Coke products as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdlEwUlFUM3B5Tkhjd1NXWlZlRFl5VVhaQ1RtYxAB",
            "text": "Amazingly awesome night rocking at Yankee Stadium! ⚾🎸\nFrom the electric energy in the stands to the mouthwatering food (hello loaded fries & steaks and sandwiches 👀🔥), everything was top-tier! But what really made the night unforgettable? The entire staff—from the gates to the vendors to the ushers—every single person was welcoming, professional, and clearly treated each other like family. 💙"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd0xXdGZXRTA0UldaTGMxRTNNUzExVG1kR09VRRAB",
            "text": "I was surprised we were able to get right in prior to the game. From out of town so we're excited. Service  was excellent with our server hustling but also making time for some friendly chat( good luck with school, etc) Food and drink was excellent. We were able to make it to seats in time for first pitch. My wife has been in \"the business\" for 25 years so she is very attentive to restaurant operations and we were quite pleased. When we had one little glitch, that we may have contributed to, Christos and Zoltan were quick to resolve it for us. We'll be back if we get the chance...for sure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNlVWSTBRbEpwTFZrMVRETlFNRmR5V1cxRFMzYxAB",
            "text": "Thanks for an amazing time, visiting the iconic Hard Rock Cafe and a Yankees game was epic!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bd1IwNXFTVGRXVW10cVRsRkZXWGczT1hGblJGRRAB",
            "text": "We came to buy a collector's pin. According to the information, the shop is open until 5 PM. However, upon arrival at 4:45 PM, we weren't allowed in. When we finally asked the manager, we were told the cash registers were already closed. A very unfortunate situation... Especially when you're coming from the other side of the world! How inflexible can they be?! Knowing you'll arrive on time during opening hours."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaGQzRlpORkV3YTFWNVNtWmplWEowWVhKcFJGRRAB",
            "text": "Just got home from a game at Yankee Stadium after having a group of 14 eat at the Hard Rock at the Stadium.  Oneal was our server who took exceptional care that everyone was taken care of.  His service was impeccable and the food was outstanding.  Everyone raved about their Hard Rock experience.  Looking forward to sitting with Oneal in two weeks!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcVVVSkRZbU5JVVVFM2JFd3hWamRqY0ZvellrRRAB",
            "text": "We had a large get together on the patio. Staff was wonderful food was great! They adjusted the set up so we could all fit. Supplied a large water jug as it was 90 degrees. Cant beat the service! So grateful!! Thank you\nFrom Colonie Little League"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kT2JESllSSEJpWVVjNU4wbGFhVFJoY0hGRE1HYxAB",
            "text": "I'm not sure the music qualifies as \"hard rock\", which is annoying because instead of something like Soundgarden you get some very-family-unfriendly rap at ridiculous volume (this applies mostly to the patio outside), but there is no doubt that the food and staff - our waiter Andre especially - are quality at this location.  The menu has been upgraded since last season and is quite improved.  I would only ask for a better beer selection."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1REQm1TM3B5VjNsYWIyWlFOREJhWmxoVGQzYxAB",
            "text": "Cristos, Yvette and staff are always so friendly and caring. They always make our group feel welcomed and loved.  The food is awesome,  and we always have so much fun!  It's like family, always. Great job"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OZlZraEJUVzlGTWpkNWJqVmxSbWxMUWpWU09HYxAB",
            "text": "It was simply awesome. Super friendly and first-class service. The cheesecake tasted absolutely delicious, and I even bought a souvenir T-shirt from the rock shop at the end."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLcm51c0dRanVpQmZREAE",
            "text": "Restaurant is a shared space with Yankee Stadium operations. We were told by Yankees Stadium manager to wait for them in the Hardrock after they escorted us to the Hardrock. After a few minutes the Hardrock employees began to say they have a private event in 2 hours you need to leave. We said no problem the Yankees Stadium mangers told us to wait for them right here for a few minutes. Hardrock people were unable to comprehend basic logical explanation and were rude and disrespectful. It's not my family's fault your two organizations don't communicate effectively in the common spaces you share to conduct business. Hardrock employees have forgotten customer service is their business. I do not recommend this establishment. Spend your hard earned money somewhere else. You'll be happier for it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLREwxSVNrcXR2NGV3EAE",
            "text": "The manager is a complete jerk and should be fired immediately. It was obvious because they were busy they couldn’t be bothered offering us assistance."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLS3R5WjZral9tNFdREAE",
            "text": "The whole experience was awful, they delayed seating us, delayed taking orders and delayed service. We got to-go boxes before we even got our food only to get rushed out the door. Can’t even tell you how the food was as I never got to taste it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZlE4NmlsMTdQU3lRRRAB",
            "text": "The food and service are super great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJbkF2ZU95LXA2WFV3EAE",
            "text": "The worst meal we’ve had since we’ve been in NYC. Went there after Yankees tour. Ordered Bloody Marys, Chicken Sliders, and chicken/ steak Southwest Salad. All terrible. Sat at the bar. Only five total people at the bar but server was so absent. Bloody Marys were watery, chicken on sliders was so dry, steak was super tough and cold, and lettuce was browning. Only ate a few bites but server never asked if it was good/all ok. Would avoid eating here. Spent $107 for three meals. Atmosphere was super cool though!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQzk0WlA2MWEzZnhBRRAB",
            "text": "Just visited the Yankee Stadium Cafe for the 3rd time. Great welcoming and great service. Many thanks to the Manager for looking after us. Roger Uk"
        },
        {
            "date": "5달 전",
            "language": "cs",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcmg2YlBadnJDZldBEAE",
            "text": "Naprosto úžasné místo ❤️❤️❤️"
        },
        {
            "date": "6달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcE1ucC13RRAB",
            "text": "Vriendelijk personeel.\nWe hebben heerlijk gegeten."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMDlHTXdnRRAB",
            "text": "one thing for the staff or Manager one of the staff member (male hispanic) was sticking his finger in the nose and removing his mucus infront of everyone, i literally saw him and he kept going on,  this was antihigenic and unproffesional and disgusting, i can't imaging what they do behind."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXR2WVBREAE",
            "text": "Probabilmente il più brutto degli hard rock che abbia mai visitato.. piccola una raccolta dei cimeli storici appartenuti alle star tifose degli Yankee. Unica teca interessante è stata l’esposizione di tutti gli anelli commemorativi delle vittorie degli Yankee dal 1927 al 2009"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnFYd1pnEAE",
            "text": "Really nice staff, there was a very nice lady who gave to me and my friends free pins"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcjVyVzNRRRAB",
            "text": "Couldn’t fault my experience at Hard Rock Cafe, the atmosphere was good, the waiter was very friendly, the double-decker double cheeseburger I ordered was outstanding and well presented, my girlfriend also loved the details of her bbq pulled pork sandwich. A very pleasant experience finished by watching the Yankees beating the Rays 4-0. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNUlEckRBEAE",
            "text": "양키스타디움 투어 후 화장실가려다가\n얼떨결에 방문했는데\n친절하고 맛도 좋아서 잘 방문했어요~"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOG92RHpnRRAB",
            "text": "햄버거 맛있습니다\n버드라이트 생맥주 맛있어요"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMF9ESFpBEAE",
            "text": "하드랑 핀 컬랙터 라서 들린 곳 친절한 여직원이랑 잼있게 핀 고르고 기분 좋게 구매 한 곳"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaTVtSVB3EAE",
            "text": "We got to the stadium a bit early to have dinner before the game! We had such a great time at the Cafe! The atmosphere was alive and people chatting all over the place! We received the most excellent customer service by Erica! She was so friendly, professional, helpful and had attention to detail! Last but not least, the food was amazingly delicious and plentiful! It was my first time there but not my last!"
        },
        {
            "date": "9달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaWVEbHRBRRAB",
            "text": "Nous avons trouvé ce hard rock café Yankee stadium bien mieux que celui de Times Square ! La serveuse était super sympa, les burgers très bons et la personne qui nous a servi à la boutique était vraiment cool. C'était notre dernier repas avant de repartir à l'aéroport pour rentrer en France alors merci à toute l'équipe du Hard Rock Café stadium, vous êtes super !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cUl2ZDlnRRAB",
            "text": "We’ve been to Hard Rock Cafe’s all over the world and this location might be one of our worst experiences.  Even being empty on a non-game day service was pretty much non-existent.  The seaters and servers seemed like they didn’t want to be there and everything just took forever.  Food wasn’t great - it’s got the Hard Rock menu standards but it felt almost like a knock off restaurant was cooking them.  Even something simple like the chicken on my salad was overcooked to the point of being almost hard.  Drink refills were non-existent and the restrooms were messy even though no one was there.  The uniqueness of the location and the memorabilia make it worth a visit for the die hard hard rock or Yankees fan, but I wouldn’t return again."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBelpLSUxBEAE",
            "text": "We visited the Hard Rock Cafe for the first time yesterday, we checked in with the hostess and she told us the wait would be approximately one hour so we left our number and received a tex message a half hour later, we were seated and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dDVqYjd3RRAB",
            "text": "It's one of the best Hard Rock Cafes I've been to! The manager goes out of his way to help you and take care of you and make sure that you're happy with the food the service. Staff is wonderful! You couldn't ask for a better group of people that wait on you or bartend or just bar backing. All really engaging, thoughtful people!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNjUtaDh3RRAB",
            "text": "Had super fun visiting this Hard Rock Cafe adjoining the Yankee stadium.\nBought a few Pins from the Rock shop. Traded a couple of them with the servers at the cafe.\nIt was an amazing experience visiting the cafe.\nThere were so many memorabilia all around the cafe related to the Yankees and rock music!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLVo2MlpBEAE",
            "text": "All 5 stars, went here on my birthday ( it's been a while since we visted) everything was great not as packed since it was not on a game day. We were greeted as always at the door, visited by the manager I  belive and our waiter was great so lost in conversation I forgot to get his name 😔 since it wasnt busy he was the only server and even did a solo song of happy birthday for me loved it. 🥰 will definitely be back soooooon and I'll make to get his name this time around."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb2JISk9REAE",
            "text": "This was pretty cool experience! I was surprised there wasn't more Yankees decor/memorabilia, as it is inside of Yankee Stadium. The staff was very friendly and the restaurant was definitely clean. The food was good, however, a portion of my chicken sandwich was still pink. The waitress was nice and apologetic and resolved the issue. I will also note that they have a very poor strategy for funneling people into the stadium through the Hard Rock Cafe entrance."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbDdtOHNRRRAB",
            "text": "I came here after the Yankee game with my family for dinner and some drinks. We were seated quickly and the interior was very fun to look at. The server was very nice and fast to take our orders. The menu is a basic burger and salad kind of…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeU5fNlNREAE",
            "text": "Hard Rock Cafe in the Yankees stadium is unique with their ultimatesports and music experience. Walk over to Gate 6 and grab a table. With an immense kitchen and a full bar, they are opened year-round with available limited amount of pre-game reservations available. Great food, great drinks, great staffs, great environment, and a perfect place to watch the game or even grab a bite during game day. Let’s go Yankees and let’s go Hard Rock! Come enjoy.\n\nFollow my link and start using the convenient Fever app: https://glnk.io/x9qvw/feverxitzelenaho\n\nAcoustic Rock 2-Courses $34.50"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZd091dEVREAE",
            "text": "Crowded but fun. Service was pretty good considering how busy opening day was in this place. Yankees won 7-2. GO YANKS! Great place to come after the game. Fun and entertaining. Good for kids. Great 7th inning happy hour too. Cheers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiLUt2bE9nEAE",
            "text": "Food was ok, but they restricted everyone to a 70 min dining period. Since we did their bottomless option, it was pretty short considering they took time to bring out the drinks. Overall good option if you want to eat/drink real food before the game."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMjd5Um9nRRAB",
            "text": "Hard Rock Cafe is one of the best places to eat and drink. They have good service, the food is delicious, and they offer a special drink. If you pay an extra 5 dollars, you get a few souvenir cups when you finish your dinner. I fully recommend it. I don't give 5 stars because the food is very expensive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcHV5aFhnEAE",
            "text": "The staff are friendly, welcoming, and eager to get you everything you need. I enjoyed the chicken and waffle dish, and my friends enjoyed their meals as well. The food was on point, and the atmosphere had a great vibe. Loved the music selection."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dnFqTkR3EAE",
            "text": "Great experience and food was good! Ate at lunchtime and place wasn't packed. Bathrooms weren't super clean but not bad. Bought 2 hurricane glasses and they were put in a box with no protection and then into a paper bag which the bottom busted out of after we left and one of the glasses shattered. Total disappointment there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MGUyUENREAE",
            "text": "My grandpa was being honored as the Veteran of the Game by the NYY and we had the amazing opportunity to dine at the Hard Rock before the game. The manager, Christos, was so accommodating to my family, and made my grandpa feel so special. The ribs were really tender and had good flavor!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXc0lEdjdBRRAB",
            "text": "We visited this Hard Rock Cafe today prior to watching a soccer game at Yankee Stadium. The staff was very friendly and the location was nice, but, much smaller than other HRCs I’ve visited. The Messi burger was their latest featured meal so we ordered it. Although the burger had all of the ingredients listed in the promotion, it was half the size in comparison to the picture of Messi with his burger.  Fortunately the burger with fries was very good!  We had a good and experience and will definitely return for the next game we watch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyakttazhBRRAB",
            "text": "Really good flavor! The hamburger was really good and also the chicken wings, they were bbq chicken wings, very crunchy and enough barbecue.\nThe “disappointed” thing was the Messi burger doesn’t look like in the picture and also not fries included, even they show it with fries.\nI cannot complain about the flavor. ✔️\nThe place is beautiful, the service also good, they are very nice!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbzctSUx3EAE",
            "text": "Stopped here for a quick afternoon snack. We were greeted and seated quickly.  Our waitress was super friendly and nice. Our drink were super weak! For $12.50 per drink I was expecting more. Finding parking around this area is super hard."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0eFBYMnZ3RRAB",
            "text": "I knew we would have some time to kill before the game so I made a reservation in advance. Best decision I could have made because the rest of the fans had the same idea without doing it ahead of time. Needless to say, there was a long wait…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNTg3VjF3RRAB",
            "text": "I've been dining here since the new Yankee Stadium was built. Food is always great, service is exceptional and the atmosphere bis always chill. On this day, I was invited to a business lunch and I normally don't order the steak but I took a chance. Not a great choice. Steak was subpar. I always order my steak medium. It wasn't flavorful. Green Beans and Yukon Mashed Potatoes were ok. The problem was everything came out the kitchen lukewarm and not hot. I've had plenty of steak from different restaurants and this was probably the worst. Outside of this experience, I always enjoy my time there. I hope they see this review."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMi1YVkhBEAE",
            "text": "We received lunch as an upgrade to our New York Yankee Stadium Tour, which came after the tour. The staff was super nice and helpful. The atmosphere was awesome as it was the perfect combo of Hard Rock and Yankees. I ordered a Bacon Cheese Burger with Fries which hit the spot. The burger was juicy and fries were crisp. At the end it came with an ice cream sundae! Recommend adding the lunch to your tour."
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac01UdXJRRRAB",
            "text": "Das Hard Rock Café liegt direkt im Yankee Stadium. Man hat aber keinen Blick vom Café ins Stadium. Essen super, Refill der Getränke erfolgte prompt. Schnelle Bedienung. Kurze und interessante Unterhaltung mit dem netten Manager. Subway direkt vor der Tür. Weniger Hektik als im HRC am Times Square. Zu empfehlen."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeGMyeHRRRRAB",
            "text": "Absolutely love this location! Christos is wonderful. He’s friendly and very attentive to his costumers! The staff is kind and welcoming and always greets you with a smile! The food is delicious! The loaded Mac n Cheese and the burgers are great! Friendly environment! Highly recommend it!"
        }
    ],
    "reviews_count": 77
}