{
    "name": "Billy's Sports Bar",
    "place_id": "ChIJV_gxFi30wokRLTvG_Sh95WI",
    "grid": "BX4",
    "address": "856 River Ave, Bronx, NY 10451, USA",
    "rating": 4.2,
    "user_ratings_total": 1031,
    "phone_number": "(718) 585-9400",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS2NFSlJNMlY0UlZsMGVIbExPR2RDZHpFMWQxRRAB",
            "text": "Someone I know was here during the Yankees playoff game. He was here with a friend until a bouncer knocked him out cold. He is now paralyzed. Avoid this place at all costs. The bouncers are dangerous and you are not safe here. Security should make their guests feel safe, not try to kill the patrons. We come here often with large groups and we will no longer be visiting a place we aren’t safe in."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeFNXOXNXRXM1T1Zwc09FVnplRE42VGtSRVdFRRAB",
            "text": "Security guards have such nasty attitudes. You can’t even ask them a simple question without them getting angry. If you don’t like your job, quit.\nDrinks are way overpriced.\nThe place itself is nice though. Two large floors, clean bathrooms. If they lowered drink prices and hired some better staff, this place could get 5 stars."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRVFYWjFSMVJsVWtrNFh6RTFiakJJU2t3MVRuYxAB",
            "text": "We visited the stadium on tour (no match on) Bartender was on her phone, ignored us even though there were only 2 other tables in the bar. An uncourteous and uncomfortable experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdVRsaHZhRGxCZUVsbGJ6ZzRUWHBJY1ZkclZuYxAB",
            "text": "Cool spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT05FeFljVzl6ZDFwRWNVcDBaelZ1U1VoWFlVRRAB",
            "text": "Great spot to catch a game! Tons of TVs so no matter where you sit you’ll have a good view. The wings were crispy and flavorful,bbq are my personal favorite and the beer selection is solid with both local brews and the classics. Staff was friendly and attentive and the bartenders are 🔥! The atmosphere is lively without being overwhelming—perfect for game day. Definitely my go-to sports bar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM1JFODJWSEpIUm1GWlduZzJNRUZOWTI1eFFtYxAB",
            "text": "I visited Billy’s Sports Bar on 9/11/25 after attending the Yankees game.\n\nThe line was long but manageable, and my friends and I got in without issue. After having a beer, I stepped outside to get some air. When I tried to return, the bouncer refused to let me back in and simply pointed me to the back of the line without explanation. When my friends (who also had open tabs) came out to help me back in, he refused them entry as well.\n\nI questioned the logic of this policy and asked the bouncer why he was acting this way. Shockingly, he responded by punching me in the jaw twice in front of other patrons and staff. I’ve since pressed charges against this individual.\n\nWhat makes this worse is that I’ve tried reaching out to Billy’s directly to resolve the matter, but they have ignored every attempt at communication. Rather than acknowledging and addressing the serious misconduct of their employee, they’ve chosen silence.\n\nI used to be a huge fan of this place, but after this experience, I can’t support an establishment that allows violence from its staff and refuses to take responsibility."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaU4wUm1TVEEwV0d4T1h5MUJOWFpEUVRCVE5YYxAB",
            "text": "Hottest spot after a Yankee game. Wait will be about 20 minutes to get in. It will feel like a day club after a Yankee game. Good vibes and music."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMloyMHdhRUZJY0dGd1MyTk1OV2RSTVhaT2RXYxAB",
            "text": "A lot of room."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMVQxbHRUWEZEU1Vjd2RsRk5kbHBxYURoZlZVRRAB",
            "text": "Horrible experience. Worst pizza i have ever had in my life.  Drinks were not very good. We saw a bartender marrying bottles right in front of us which is illegal in every state. It was game day which might be why they had no bar stools, not sure..I would never go back here. The pic is their version of a Margherita pizza.  I'd rather have a frozen totinos pizza or a hot pocket.  Or even a peanut butter sandwich."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M1YxQkZaMGhTZUMxeGVGaG9kbUkzWm14Q1JWRRAB",
            "text": "Billy's Sports Bar was a great venue to check out before the Yankees, and seemingly just in general. They have a huge downstairs, they sell beers all around the premises, they have an awesome upstairs and outdoor area... and it's super popular! It took no time to get in and the staff were very friendly! Would definitely go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeGVqaFBhR05OUVVOdGVrNU5kbkV5TlRNeGNYYxAB",
            "text": "Cool place to go before the game"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcVRVTXhNMUJWTm5aSlpVUlNYMmRHTjNneWJGRRAB",
            "text": "This isn’t a review of the food, but the absolutely fantastic people who work at this place. I unfortunately came down with heat stroke while on the way to Yankee Stadium. I practically ran into this place to lie down and the staff were beyond welcoming, caring and generally wonderful. I was so embarrassed but they let me stay as long as I needed, giving me cups of water and bags of ice. I still felt a bit unwell upon leaving and so I didn’t say a proper thank you, hence my review. Thank you so so so much."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdFJIWkhNemxyVWs5aFgzZFZSWEI2TlV4MFMyYxAB",
            "text": "Pricey drinks, no drafts. Lively pre game vibes.  No food this time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSWFHRklkM0ZTVUdVMGRWUkVTbnByYWpob2QyYxAB",
            "text": "Jada was the most amazing bartender I’ve ever had she has the sauce. Incredible service."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WVJ6bDJkVU5IWWkxUWNqTjNUbEZaTVU1YWFVRRAB",
            "text": "El lugar está muy agradable y bonito se ve que se pondrá buena la fiesta . Comimos agusto y rico pero el trato de la mesera nos dejó muy decepcionados, estaba molesta o enojada , sentía que nos aventaba los platos y cuando le pedíamos algo parecía que le molestaba ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNVlXZEZRbk53V1hJd2JGcERlazgwVUhOS01HYxAB",
            "text": "Great place before or after Yankee games,"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFFXNXljVTlKUmpSeWVrZDZVRFZrVlRkMGIxRRAB",
            "text": "Nice location to shared with your loves one's ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb1ZFUlFPRGxZUzJGWWNqSmFlV0o1V0RGeFoxRRAB",
            "text": "This place is awesome!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsb2RVMHhSM05uTUhaWFRFdHBSakl3VTNscmRrRRAB",
            "text": "Right before a Yankee game, this is a nice spot. Spacious. Big bar area. Plenty of seats. Music. Great hostess."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSWFuaGxVbW8zU1dWcVQycG1jMHRRZVZnemJGRRAB",
            "text": "If you're looking for a fun, friendly place to catch the game, look no further than Billy’s Sports Bar. This place is everything you want in a sports bar — great atmosphere, plenty of TVs, and an energetic crowd that makes every game feel like a party.\n\nThe service at Billy’s is top-notch. The staff is quick, polite, and always makes you feel welcome. Whether you're just grabbing a drink or settling in for a full meal during the game, they’re attentive without being overbearing.\n\nThe food and drinks are solid too — classic bar favorites with a few standout items that go beyond the usual. The wings are especially good, and the beer is always cold.\n\nOverall, Billy’s Sports Bar is a great spot to relax, cheer on your team, and enjoy great service. Highly recommend it for game day or just a night out"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWFduTkpNRlZsWkZCRFowNHdVMHhIZVhOUFpIYxAB",
            "text": "Terrible music that’s too loud AND $22 tiny vodka lemonade that tasted terrible?"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX3ZIMUVBEAE",
            "text": "In town for the  Pinstripe Bowl!! Great pre game atmosphere...RU Rah!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdkxUQjBSbFJrV2tRMFZXMUZPRWxpYjJ0U2ExRRAB",
            "text": "Friends and I were in town from Michigan.  This bar was recommended and it did not disappoint.   Great atmosphere and cold beers..keep up the great job"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4a09VbENUVFJqUmxCbWFYcGpVMGgyVjBOdGVFRRAB",
            "text": "This is how a NY summer feels like, pre Yankees game. American college vibes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKZllncFNWbUplcE1REAE",
            "text": "The rooftop is nice. the rest is a dirty, old, highly priced local joint, nightmare parking when the game is on  getting  in and out !"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdFRtTmlXbnBWVTJSUE9HRm5MV3B1Y0d0MlJWRRAB",
            "text": "Espectacular ambiente y buena música !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLZjktZl85dVppbk93EAE",
            "text": "Younger/college to late twenties crowd. Can’t hear a word. Club vibes. Great bar staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQQ05tYmVQak15MU9nEAE",
            "text": "Awesome sports bar with reasonably priced drinks, attentive bartenders ( didn’t have to wait longer than 20 seconds to be served) and an amazing environment. Huge kudos to the owners for hiring security during large / popular games I.e. Mets vs Yanks to ensure not only safety for patrons but also to manage bathroom lines and turn those away trying to skip the lines since common sense isn’t so common nowadays."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSGEycVNELUkzMEJnEAE",
            "text": "Michelle was great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNRGFvdF9NcUpyeDd3RRAB",
            "text": "When I went there I feel like they was trying to rob me I bought a bottle and they charged me $580 for a bottle that you could get in the store for $20. I will never go there again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZM3FLRThnRRAB",
            "text": "Amazing Yankees  bar perfect before or after a game . Nowhere else like it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN1pldHN3RRAB",
            "text": "I recently visited Billy’s Sports Bar for a boxing match and was thoroughly impressed. The atmosphere was vibrant yet comfortable, with an energetic crowd that added to the excitement of the evening. The numerous screens ensured an excellent view of the event from every angle, and the staff managed the large turnout with professionalism and efficiency. Located just steps from Yankee Stadium, Billy’s offers a well-organized and welcoming environment for sports fans and event-goers alike. I highly recommend it and look forward to returning for future events."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcnVqLVh3EAE",
            "text": "Went here before the Yankee game with two of my buddies. Walked in and the place was packed to the brim on a Tues night. Absolutely insane. But the outside bar was very nice and drinks were fine. However the bouncers at this bar and straight up disrespectful. When one of my buddies went to the bathroom we followed and waited for him. I took a look around at my surroundings to see what was going on and was accused of looking into the woman’s bathroom which is not true at all. To make matters worse somebody bumped into one of my buddies who was not paying attention and knocked over his drink. The bouncer than made him clean up his drink even though it wasn’t his fault. Save you money and avoid this overpriced shitty bar"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ2ZxaGJREAE",
            "text": "Awesome place to chill"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeUk2UF93RRAB",
            "text": "The drinks were awful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a2VHVjBnRRAB",
            "text": "Do they really open at 9am everyday kus Everytime I pass by they closed they barely answer they phone I just called them 4 or 5 times 6 times the most still no Answer 😒…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMzZuRUlnEAE",
            "text": "Look, I get it… it’s a sports bar AND I went there during Game 1 of the World Series… but WHAT IS WRONG WITH YANKEE FANS?!?!  You have a great location, a HUGE environment to celebrate and watch games with fellow fans - and what do you do?  Celebrate good moments equally to bad ones - by throwing beer and ice and bottles onto your fellow fans?!  I mean it’s one thing if you are losing,  and you’re sharing the venue with an opposing team - BUT YOUR OWN PEERS?!  Just trash behavior by everyone with no exceptions.  I recommend any of the other local sports bars over Billy’s… cause the fans ruin this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMTdyWmpBRRAB",
            "text": "This review is purely to highlight the phenomenal service I received from Vida. She is truly a gem and such a positive light in a crazy place like Billy's. Thank you for your service Vida! We wont forget you and we will be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMk0yWnJ3RRAB",
            "text": "We stopped in here before the Yankee game on Labor Day. Bar downstairs and up on the rooftop. We actually came for breakfast. Our waitress was very nice and on top of everything. Very clean inside and played lots of great music mixes. Reasonably priced for being so close to Yankee Stadium.\n\nThe food was good. I got the western omelette on a roll. It barely filled me. Luckily my kids never finish their food. I got to have some crispy delicious fries. Also had sone bites of the sausage egg and cheese. They make it with links not Pattie’s. The best was the breakfast wrap. Eggs, ham, cheese, peppers, onions, tomatoes. Lots of flavor tasted mixed together nicely. Nice spot to eat. Later on is a fun environment for drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OGRmaHRnRRAB",
            "text": "Being in Billy's pre-Yankees game felt like I had time traveled back into the Lambda Chi Atrium on a USC gameday. Just straight trench work.\n\nThe mid EDM mixes are so loud the only way you can have a conversation is to yell in someone's ear, the youthful crowd all dressed in sports memorabilia starting to get loose after their 2nd white claw, the air tangible with mango flavored vape smoke, etc.\n\nYou can actually get a drink pretty quick which is not the norm at these kinds of places. They got the kinks worked out. Couple $18 tequila sodas high and tight never hurt nobody.\n\nIt's fun to move through life and get little memories of what your life used to be like. Stare at your past and you'll end up staying there, but it's fun to reminisce every now and then and see how far you've come. It's like inspiring yourself.\n\nNew York or Nowhere…\n\nIG @jnov_\nTiktok @jnov_reviews"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbHRxbV9BRRAB",
            "text": "It was my first time there. The staff was very friendly.  The food was good. So was the drinks. I was amazed how big the place was. It seems like it has a great night life there. There is a outdoor bar facing Yankees stadium on the second floor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyci1mSkRBEAE",
            "text": "Solid place to visit before or after a game. Very big sports bar with a roof option. There isn’t much to set up there but at least you can get great air. The music inside is loud but if you are into that type of bar, it fits the mold and does its job. It has multiple bars and bathrooms to host large parties. Definitely worth a stop."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyb0x2cURBEAE",
            "text": "From outside it seems very small, but it is a huge sport bar. Excellent for some drinks and appetizers before watching the game at the Yankee Stadium. It was my first time there and I had such a good time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcWFUeEdnEAE",
            "text": "A huge space Drinks are strong,,, well atleast the 2nd and 3rd one were. It was a black and Gold and Blue ice event. The Legendary DJ Hollywood was in the place to be. Surprise guest INTRO was there. Singing they're classics R&B joints. I love the exposed Brick. Some money went into this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcjZDbml3RRAB",
            "text": "The place is huge !  Spacious.  My friends and I went for a celebrity performance “R.L” .  The drinks were ridiculously priced.   For a 4oz cup of margarita full of ice it was $20.   Buffalo wings were $27.   It was a bit much.   Minus the buying experience.   The place was nice and the space was perfect for the amount of people that showed up.   I would go on a full stomach next time.  The wings were nothing special."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbnMyTERnEAE",
            "text": "Space was great. Service was nice and friendly. Venue was beautiful and clean. My only critique would be drink pricing was too high for the amount of water that was in the alcohol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidGVDTkdBEAE",
            "text": "Excellent place to watch the baseball game and spending time with your friends."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBM2NXV2R3EAE",
            "text": "Cool place to hit up after a yankee game with DJ inside and patio bar on the 2nd floor. Instead of waiting to crowd onto the D train, I I just hung out here a bit. Unfortunately the bar didn't carry any usual scotches like Glenlivet 12 or…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd2FDVW5RRRAB",
            "text": "I wish I had a chair to watch the game but that’s the price of not paying to go to the game. Thank the lord I didn’t stand on the first floor to get splashed with beers. I love a dj to sound out the game. fun fun fun!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcVpTVW9nRRAB",
            "text": "Avoid Billy’s Sports Bar Near Yankee Stadium – Disorganized, Unprofessional, and Unfair\n\nIf you’re planning to catch a big game at Billy’s near Yankee Stadium—especially something like the World Series—be warned: my experience was a complete disappointment.\n\nI waited over two hours outside, unaware for the first hour that I was standing at the exit line. Despite repeatedly asking security for guidance, they never clarified where to stand. People were leaving, so it seemed like a capacity issue—until it became clear that this wasn’t the case at all.\n\nThe real issue? Security guards were accepting cash payments to let people in ahead of everyone waiting. When someone confronted them about this scheme, the guards responded unprofessionally and confrontationally.\n\nTo make matters worse, just as things heated up, they let three people ahead of us in—and then suddenly cut off entry for everyone else.\n\nIf you’re looking for a well-organized, fair, and enjoyable spot to watch a game, Billy’s is not the place. Poor management, shady security practices, and zero respect for fans."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFdV9Tei13RRAB",
            "text": "Truly,  THE BEST place to go to, either before or after the game! Plenty of room, fast quick service, outdoor seating!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdHUzTVN3EAE",
            "text": "This is a great place to go with friends and watch The Yankees and listen to good music. And hang out with the greatest fans in all of Baseball. This is my 2nd night coming back to back and i will be coming back in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcy1xQXpBRRAB",
            "text": "Excellent bar, would recommend, we went last year to the Yankees game but just came for the bars this year an Billy's didn't disappoint, it was a shame to leave, thank you Billy's xxx"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMWNDYm5RRRAB",
            "text": "Nice place but it has more potential than just a sports bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaanE3WnFBRRAB",
            "text": "We went to visit Billy’s across Yankees Stadium after the Yankees game ( that had a rain delay for two hours) Sadly the Yankees lost. I heard about this bar which was one of the oldest  bar next to the stadium. The bar IDs everyone regardless of age at the door. The place is huge ( looks like a prior warehouse) there were several bars- two on the first floor and an additional bar upstairs. Good music and neon lighting. The drinks are limited - not a full bar. Surprised they didn’t have Jack Daniels regular only honey and fire. They had grey goose and Tito’s and beers and hard seltzers. Servings are in 3oz glasses with lots of ice. It tasted watered down. I think sticking to beers would be a better option. Security was everywhere. I liked that there was amble security and the bathrooms had attendants.\nSeems like a lot of younger adults and college vibes. Good for visiting when going to the game. A big negative for me was that the stairs and floors on the upstairs area were sticky and dirty ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdUxDbUJBEAE",
            "text": "There outside deck is great but the alcohol prices are just as expensive as the stadium. $9 for a Coors light bottle is insane."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSblB5RXJnRRAB",
            "text": "The best spot to go before a Yankee game. It’s huge and has plenty of options to grab a drink inside or out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcnNqLXdnRRAB",
            "text": "Stopped for a quick bite before a game. Ordered sliders, tenders and mozzarella sticks. Found mold on one of our buns and the tenders had zero flavor. Pretty pricy in my opinion and the waitress was hard to understand and didn’t offer any discount for the molded food. Seems like a decent place to drink at though. Unfortunately I won’t return with my family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNjhXSWhRRRAB",
            "text": "everyone comes here after the game is over. The music is on point. Great atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiZ195MHVnRRAB",
            "text": "For the South Bronx, it's O.K. I'm sure that when the Yankee fans that do not come to the area unless it is for a game, this place is perfect. However, cleaning the floors during the lunch hour with a very strong chemical ruins the experience for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aTVMSkJBEAE",
            "text": "Bartender clearly doesn’t know math. She told me 34 dollars. I handed her $44 thinking it would be easy math for her but no.. stands at the register for 10 mins contemplating what just happened to her mathematically. Hands me 8 dollars back claiming she said the bill was 35. Which would mean I should have received $9. Not only did she not a-knowledge her error. She assaulted me and threw and object directly at my head and struck me when I told her her math was incorrect. Then she called security to have me removed for an error that she created. I couldn’t have been more peaceful about it, and didn’t yell at anyone. But she clearly had a temper tantrum. Will never return to this place"
        }
    ],
    "reviews_count": 61
}