{
    "name": "Mofongo El Mocano (Mofongo Tipico)",
    "place_id": "ChIJ09SwFTT0wokRAe5kfKwT-_o",
    "grid": "BX4",
    "address": "6108, 985 Morris Ave, Bronx, NY 10456, USA",
    "rating": 4,
    "user_ratings_total": 626,
    "phone_number": "(718) 588-5103",
    "reviews": [
        {
            "date": "1일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NU9IcFRWVTFCVVdSNFlubzNNMmxOWDFWS2NXYxAB",
            "text": "La chica era súper grosera y mala educada el lugar todo aburrido no como muestran en las fotos y la comida era patetica un mofongo con puro ajo y sin sabor horrible lugar"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cGMwdHVZMWs1VG1GR1VIWlBVMFIwVnpGbVVWRRAB",
            "text": "Pase y decidí probar para ser sincero y una comida típica de mi país República Dominicana no vuelvo suena duro pero esa es mi opinión si alguien quiere puede probar"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bGVLaGdnRRAB",
            "text": "Based on the picture of the food and the reviews on Google my friends and l  went to this restaurant it was clean the staff were nice however the dish that I got which was the mofongo with the white sauce and 6 shrimps was disgusting it was dry it was not seasoned the sauce was bland I did enjoy the Pina colada despite me not being able to taste the liquor the waitress was beautiful I waited about 25 years to finally see New York and to finally taste mofongo and honestly I can say as far as as tasting Mofongo gose I was not impressed with this restaurant food I don't know if the reviews are people that are friends and family as far as I can see that restaurant is very overrated l paid  $38 for mofongo and a pina colada I wish I could give them zero Stars for the food"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNjhhU3VBRRAB",
            "text": "Never disappointed.  Brunch is only $21.99 and it's a 3 course with 2hr unlimited."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLWNySElBEAE",
            "text": "I recommend the delicious mofongo, very tasty and juicy, I loved it, very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM0lTeXl3RRAB",
            "text": "I ordered food over the phone. The employees were not listening to me. They sent me the wrong food and when I tried to call them back and explain, they kept hanging up on me."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINnA2bU9BEAE",
            "text": "El servicio es verdaderamente desagradable, la mesera que nos atendió es realmente repugnante, cuando estuvimos ahí, fue muy grosera incluso una pareja que llegó después se fue porque ella los estaba atendiendo muy mal. De verdad que deberían cambiar a este tipo de personas, es un mal para cualquier negocio.\nY sobre el local, nos dimos cuenta que tienen \"grade pending\" en su calificación de restaurante, no es seguro comer aquí."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnBDajl3RRAB",
            "text": "Food is wack. I could make better food at home and the waitress didn't come to check on us after we got our food, didn't give us no salt or refills. Terrible terrible service. She was on her phone the whole time. Don't waste your money here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidzZuV09nEAE",
            "text": "The rice is not good the chicken is dry never again 👎👎👎👎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibnVtR0JnEAE",
            "text": "Good atmosphere amazing service.. average food. Prices a little bit higher than similar places in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicTVUTXNBRRAB",
            "text": "S.O.C.K.S🇩🇴\n1st time, BUT WON'T BE NOT THE LAST TIME!!\n10 Q!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMak9QTU13EAE",
            "text": "I felt like my ex was serving me, the person looks very angry. The service was below a blind man's expectation. I'll never go back, not even UberEats."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeXRYd1FBEAE",
            "text": "No puede ser posible que te cobren por comer dentro del local ya que le estás consumiendo y que te cobren por comer dentro es un abuso no vuelvo más no es el dinero si no el abuso que tiene me dijeron q si comía afuera eran 13 dollar y por comer dentro me cobraron 20 dollar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbWRET3BnRRAB",
            "text": "Great tasting dishes and the people will attend to your needs"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMXVQbndBRRAB",
            "text": "Pesimo servicio pedi una comida me dijiero que llegaba en 40 minutos y nunca llego volvi a llamar y la mujer que me atentio dijo k no anoto bien en numero en fin nunca recibi mi orden no lo recommendo en lo absoluto"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeXZfNXpBRRAB",
            "text": "Buen Ambiente"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcnN6TUVnEAE",
            "text": "Very bad food and they send you rotten food.\nMuy mala comida y te envían comida podrida."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdkpQVkNREAE",
            "text": "La comida y el ambiente buenos. El servicio pésimo.  Me sentí como si estuviera pidiendo."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnczZlX1hnEAE",
            "text": "Un Restaurant bien limpio y una buena atmósfera. La comida extraordinaria."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMjZEd1dREAE",
            "text": "I visited this restaurant this morning. The food was good. Unfortunately, the woman at the counter who said her name was Joana had a very bad attitude. When I asked for sauce on my rice, she made a face and mumbled under her breath. I spoke with her in Spanish to avoid a language barrier. After I ate my food, I was SHOCKED to see that the tip was included in the bill. I have NEVER seen that for a party of one. When I questioned her about it, she blamed it on the owner and said that’s how it’s set in the computer. First, she pointed to the sign indicating the 4% up charge for credit cards. I explained to her that there’s a difference between 4% and 15%. It made me think she just assumed that I wouldn’t tip. I do not plan to return."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcDZlM1VnEAE",
            "text": "Soy Dominicano y he ido a muchos restaurantes a probar el Mofongo, pero sin duda este ha sido el mejor, excelente Lounge también para pasar sábados y Domingos con tu familia."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM2NtLUxnEAE",
            "text": "The lady serving is very nice and professional! The food had no salt whatsoever. When I called and asked why they didn’t add salt I was told they don’t add salt unless customers specify which makes no sense, and if this is what they do they should inform people before serving this way people aren’t highly disappointed like I was"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaU16Y3BnRRAB",
            "text": "El mejor mofongo de Nueva York, igualito que el de RD. Se los dice una catadora de mofongo profesional, les sugiero que pongan más sucursales lo antes posible en ubicaciones mas cercanas."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc3J2OUNREAE",
            "text": "Odered via phone with delivery service.....credit card accepted on phone had to repeat my self many times. The lady taking order was rushing but I had to verbalize my concern that she got my order correctly. The delivery was quick and OMG....Order was Mofongo de chicharon super delicious didn't even use the garlic sauce. Mofongo with chicken....delicious...both came with salad. The chicharon of chicken came with rice and beans and salad, Lemonade and Chinola. All worth it. Thank you I recommended....thumbs up!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdzYzWkNnEAE",
            "text": "Excellent food and services I recommend"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa3FqUFV3EAE",
            "text": "Exelente servicio y un buen ambiente la comida perfecto 👍👍🙏🙏"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaWQ3bkhREAE",
            "text": "Ambiente cómodo, lamentablemente el servicio de una de las meseras deplorable su actitud inestable a su vez muestra su aburrimiento y disgusto por lo que hace, deberían contratar a personas con carisma, empatia y calidad de servicio."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMVo3VnZRRRAB",
            "text": "Mal servicio ni siquiera cubiertos plásticos ni servilletas ni limón ni nada mal servicio un Sancocho 18 dólares  un abuso"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsellPYlBnEAE",
            "text": "Good food and they serve  a lot  food  they have very good prices. Not expensive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbHFqcmR3EAE",
            "text": "The Service Has Been Bad For The Past Few Days Now Today Will Be My Last Time Coming To This Place I've Been Coming Here For 1 Year Now The Customer Service Is Not Well The Workers Have No Pride In The Job Anymore It's Not What I'm Use To I Feel Like They Don't Even Care About The Job Anymore The Lady Up Front Is Always Gossiping and Complaining All The Time And Talking About The Customers Even About Me I'm A Regular Customer I Have Been Treated Poorly I Expained All Of These Things To The Lady Today Working At The Food Station and Register All She Said To Me I'm So Sorry It Was In A Very Sarcastic Manner It wasn't genuine at all this was my favorite place to come to but I will no longer attend here anymore and today the food wasn't good today I only ate it because I was hungry"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGc1kyWURnEAE",
            "text": "Bad costumer service. Do not recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dHBtNnRRRRAB",
            "text": "Food was good lil pricey but ok."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaG9leERBEAE",
            "text": "Their Mofongo is Tasty"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaODVIMTF3RRAB",
            "text": "Muy mal al servicio, esas chicas que están ahí hablan con actitud, dejan a uno hablando solo literal y se olvidan del cliente !! 👎🏼👎🏼👎🏼👎🏼"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaczdYcDB3RRAB",
            "text": "Tengo varios años visitando este negocio, y últimamente es sorpresa tras sorpresa que he tenido con respecto a los precios, y la cara que ponen y la manera como te responden al preguntar... las veces anteriores no había querido opinar al respecto, pero decidí manifestarme, pedí una ración pequeña de pernil, adicional al Lunch, solicité el precio y la srta no me supo contestar, que debía pasarlo primero, reiteré la pregunta, cuanto cuesta el precio por libra y la repuesta fue la misma... me sentí muy incómodo porque, es una repuesta simple, si cuesta 10, 20, 50 por libra, simplemente se responde y ya, tu ves si lo asumes o no..., yo no estoy pidiendo regalado, pero estoy en mi derecho a saber el precio por lo que voy a consumir, y no es la 1ra vez. Espero puedan solventar esta situación"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabGJ6X0JREAE",
            "text": "I ask a simple questions and the manager gave me a horrible attitude.. unbelievable. CEO of this restaurant ya must have bilingual workers how you expect other Americans know ya food culture. If your team can't communicate probably unacceptable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM0lyWHdRRRAB",
            "text": "The cashier thought that I was black but when I spoke spanish she was telling me what to order. Not Accommodating me on what I wanted."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM3BMWDlRRRAB",
            "text": "La comida estuvo muy buena ordenamos mofongos de churrasco y el típico, dos modelos para acompañarlos los precios me parecieron bien. Solo tienen que mejorar el sonido, para la hora estaba un poco alto y no era tan armonioso. Sobre el servicio mi única inquietud es que la chica que me atendió no supo responder mi duda sobre algunas preguntas que le tenía del menú."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM2VySTVRRRAB",
            "text": "Please, try the pork monfongo. You will NOT be disappointed. 👍🏿"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaHVDWlFBEAE",
            "text": "Inrresponsable y ladrones uno paga una cosa no la mandan y tu llama y te dicen que no te lo pueden enviar que tiene que pedir otra cosa , relajan con el dinero de la gente , yo pedía mucho pero última vez que vuelvo a pedir"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cjV6OXF3RRAB",
            "text": "Muy bueno"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4XzlXS0tnEAE",
            "text": "Bueno"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajluSHdBRRAB",
            "text": "Bad customer service, food took forever and the prices on the bill was different than the one on the menu for example the menu said the water is 2 dollars but they charged 3 dollars also the 4 minis mofongo in the menu said 12 dollars but they charged $13.95 I will not recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNXJUODl3RRAB",
            "text": "Food was terrific and the atmosphere was very pleasant. Best Mofongo by far"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMUluSnVnRRAB",
            "text": "Un lugar muy ameno te hacen sentir como en familia precios muy asequibles me encanto"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlajVYZFlnEAE",
            "text": "Had the Mofongo Mocano here and it was delicious! Hands down one of the best Mofongo I've ever had, the cheese definitely kicked it up a notch. The service was also excellent and the outside seating was great. While eating outside it started to downpour and not a drop landed on us! Would definitely recommend to anyone looking for a good Mofongo!"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM1ozVFNBEAE",
            "text": "La comida riquísima, el ambiente es buenísimo, el servicio es lento  los domingos no se los demás dias.\npero me encanto tienen karaoke de jueves a domingo es un ambiente bonito para compartir con los amigos y familiares"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeFBXMWxBRRAB",
            "text": "Food was great. I got a good shrimp Mofongo and I loved it. The flavor and the sauce was delicious. The girl was very kind and the prices are very fair and the menu was ok. I hope to eat there again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOEpyWmlnRRAB",
            "text": "La comida es rica. La propina no es opcional ya esta incluida 15% en la factura, y luego al fimar el recibo de la tarjeta ponian la opcion de agregar propina (gratitud). Sea cuidadoso con eso, para que no de doble propina sin intención."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbzdpRDRnRRAB",
            "text": "I'm not a fan of mofongo but this one was outstanding! I got the madufongo and the rest of the table got \"El Mocano\". They couldn't have been better! The only complain from my friends was that they did not have the meat sauce that's usually…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbHJ5UDZ3RRAB",
            "text": "Pésimo servicio. En mi vida había comido un mofongo tan malo. Pedí dos mofongo  de yuca y me los mandaron de plátano. También me pusieron un caldo de agua de pollo y pusieron una salsa de ketchup con cebolla, tomate y cilantro y me…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwNlBMeXZBRRAB",
            "text": "Cozzy place. Food is OK. Had betters mofongo at other places. Will recommend. Nice music, loud at times but enjoyable."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRLThfWmhBRRAB",
            "text": "Delicious! Mofongo the way you want it to be, crispy, tasty and meaty!  They also have a space downstairs available for events, where we had a blast."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dWY2Qm1BRRAB",
            "text": "They have a new Chef and the food is better.  Good presentation and delicious flavors"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNVlxM3dBRRAB",
            "text": "Delicious food, nice family atmosphere, good music, I always recommend"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNE1qX2ZnEAE",
            "text": "Good location. However, we waited 1 hour to be seated and there were obviously plenty of tables available. We told them we wanted to sit and they just kept saying one minute one minute one hour later we were finally seated and the waiter said he never knew we wanted to sit down when he was told one thousand times. There were three of us and they got all of our order wrong and only Two of our orders because they didn’t know there were three of us. We waited 1 hour for our food and we had to wait another hour for them to give us the correct order. I’m surprised. It looks like a good place just don’t go on special occasions because if they’re busy you’ll have a bad time. The only one who took proper care of us her name is  Ivana great service from her part. She’s the only reason why i didn’t stand up and walked out"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbWFEMkZ3EAE",
            "text": "While I have enjoyed the food, I will not be ordering for delivery again. On the seventeenth of September, 2022, I placed an order via Uber Eats at around 4:40 PM with an estimated delivery time by 5:15. I live less than five blocks away. Upon checking the tracking, the person was traveling the opposite direction, even after giving directions at 5:12. After seeing no movement for more than fifteen minutes, I messaged to inquire concerning the person's general state of being. At 5:43, I phoned the restaurant, was promptly placed on hold, followed by being disconnected when my speech impediment began being noticable. Frustrated, I walked over to the restaurant to address everything. The few positives of this experience is that the host promptly requested a reorder when details of my order were legitimate via their app and presenting the screen from my phone. And I will give a bit of a positive for the person saying sorry on the way out. Otherwise, this was a very lackluster experience of a local establishment. On a side note, at the time of this review (6:27 PM,) I did not see any movement from the delivery person. I sincerely hope he is okay."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNWFmOVpBEAE",
            "text": "Great food and Great prices, i used them for a couple of family events in their downstairs rental hall that went without a hitch. They provided perfect service and were very attentive to my request. On another occasion the owners even provided me catered platters of mini mofongo appetizers for a house party i was attending."
        },
        {
            "date": "3년 전",
            "language": "ceb",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtOVpqZVh3EAE",
            "text": "Excelente evento @granparadadominicana ❤️🙏 DAGITO…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcU1UR0h3EAE",
            "text": "I wish I can give this restaurant ZERO stars for the terrible service I received. I literally walked in the restaurant and it was barely empty and I sat down for the waiter to take my order. The next moment a few people started coming in because of lunch hour but the waiter was no where in site.\n\nI was patiently waiting and a group of 6 came to the restaurant and sat down and out of nowhere the waiter magically appeared after 10-15 minutes of me waiting. He took their order and was attending them even though I and a few other people came ahead of them.\n\nLiterally in 5-10 minutes he had brought out food for the group of 6 while I was still waiting for him to attend me. He messed up their order and he immediately fixes their order literally in two point seconds. While I’m sitting there still waiting for him to take my order.\n\nAt that point I was beyond livid because I waited even longer which became 30 minutes waiting for service. I got their first than everybody else and the group of 6. But the waiter didn’t even look at me or knowledge my presence and the other people that came before the group of 6. He didn’t give us a menu or a glass of water. But was quick to give them their food and drinks.\n\nA couple that was right next to me were just as livid as I because they were experiencing the same crappy service as well and they proceeded to leave the restaurant. After they left I got inspired to leave as well. I told the waiter sarcastically that I enjoyed the service he provided and he had the audacity to tell me he was going to attend to me after I waited 30 minutes. I ignored him and I proceeded on leaving.\n\nDon’t waste your time or breath coming to this establishment. If the staff doesn’t know you personally they aren’t going to attend to you. That neighborhood barely has any decent restaurants in the area but I rather go to a shady pizzeria and eat at a crappy over cooked slice of pizza with no seasonings than to come to this place ever again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJci1DSW9BRRAB",
            "text": "Great mofongo. I just moved to the area and the food is great. The services could be a little better. I went there with my friend and the place was empty the waiter was sitting down with her friend on a table having a conversation while we…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4OTdDMTBBRRAB",
            "text": "Today I decided to order from El Mocano.. Honestly, I love the restaurant and the weekly server but this other lady on weekends is a whole mess.. My girl ordered through phone and she said, 30 minutes... I go after the 30 minutes.. she…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4bmFMOXBRRRAB",
            "text": "Delicious shrimp mofongo. Large will feed 2 to 3 people."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpcm9pS0ZBEAE",
            "text": "If I could give this 0 stars I would. I placed the order at 4:52 and it was supposed to be ready between 5:10 and 5:20. I arrived at 5:18 and was told it would be 5 more minutes. I finally got my order at 6:00, 40 minutes after it was supposed to be ready. Meanwhile half of my order sat on the counter this whole time, the mofongo was cold and dry. I asked about the order various items and was told that they were still working on it. Having to wait 40 for an order is extremely absurd. I would stay as far away from this place as possible. The food may be half decent but the customer service is just horrendous. To top it off, part of the order was wrong."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN2FyLUtnEAE",
            "text": "The worst restaurant I have ever dined in. The service was horrible the waitress had a terrible attitude and no type of experience. Food took forever to come and when the food finally came it was in between cold and warm bottom line not a good place to take the family"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoelpmdnl3RRAB",
            "text": "Live in the area but it was my first time going there.  The food was amazing and the waitress very sociable and friendly. I will definitely be eating there again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDZ3JMUkJ3EAE",
            "text": "I wish I would speak with the owner about a lady that is there in the day time ... Also the maneger .\nI unfortunatly spent way too much money on this place . The food is great and a…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLN2Q2SjF3RRAB",
            "text": "Excelente servio , muy buena comida 😋😋…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcHFpNWlnRRAB",
            "text": "El peor servicio que he recibido en mi vida, la comida muy buena, pero el servicio pésimo y el sonido pésimo. Dure esperando 10 min en la entrada y todos los camareros me veían y nadie me atendía, tuve que ir yo donde ellos, el camarero para nada amable muy apático, no me pregunto el término que quería para la carne no pregunto nada, más nunca pasó por mesa a recoger ni nada, me sirvieron un jugo pésimo el cual devolví y me lo cargaron como quiera. En fin vine a este lugar a desestresarme y pasar un rato agradable y salí peor. LES DOY UNA ESTRELLA POR QUE NO HAY FORMA DE DARLE 0"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpNVpUOUxBEAE",
            "text": "Love the food the workers and the ambience!!!"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcmItTnlBRRAB",
            "text": "Pesimo servicio al cliente cuando pides delivery. La muchacha que te atiende al telefono siempre esta bostezando o atendiendo otros asuntos. El consumo mínimo para delivery depende de quien conteste el telefono. Rara vez te envían lo que…"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnc2NfMFBBEAE",
            "text": "Primeramente muy malo el servicio, pedimos madumofongo y la mesera luego nos dice que los plátanos maduros se terminaron, a falta de eso ordenamos calamares fritos y cuando estamos terminando llego el mofongo que había pedido y el *Madumofongo*, el señor que lo lleva, sin pedir permiso retira los calamares que quedaban y quiere imponernos el Madumofongo, le explico que había pedido otro plato porque el que quería no había, y en fin puso el plato se llevó los calamares, pedimos que lo pusiera para llevar, pues les cuento que cuando intente probarlo en casa estaba muyyyy malo, la piña colada mía y la margarita de mi esposo estaba horrible. La cuenta súper cara, y al salir se supone que si están en la puerta deben de decir buenas noches, le dimos las gracias por cortesía y el señor se quedó mudo. Para mi la peor experiencia que he tenido en un restaurant le doy 0. Si pudiera contactar el dueño le exhortaría que cambiase el personal completo que estaba ayer."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNzZEQkN3EAE",
            "text": "Amazing Place !! I went for a quick Dinner one Weekend after that I go every weekend Their Customer Service is Excellent and Workers Work as a Team LoveThe Food and Environment wish they play alot More Salsa but Its worth your Time Very Nice Staff and Clean."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwemFEZ2JREAE",
            "text": "My friend decided to bring me here to eat for lunch. I later on learned that another woman took him here and that's how he learned about this place. I just thought that was funny so I decided to include it in my review. Thank you girl, whoever you are, because the food was good. Once we walked into the place, I noticed that there was only one table of customers, family of 3 to be exact. So this place isn't so busy on a Saturday between the hours of 2 and 3 p.m. My friend inquired about a specific soup and the waitress seemed to be confused. I think they both were confused at that time because he's African and doesn't know much about their food and I think the waitress is used to Latino people eating at this place. After all, it is considered to be a Dominican restaurant. Nevertheless, I don't discriminate against food just because it's not culturally related to me. Good food is good food!!! I think she was thrown off by his accent because when I repeated the same thing that he was saying, he just wanted to know what the Dominican soup was made of, she had no problems telling him the contents of the soup. She went to fix his food as I still needed time to decide what I wanted to eat. After looking at the menu, I decided on rice and beans without any meat. The waitress was actually a bit surprised because she even questioned me to make sure that maybe I wasn't forgetting to say I wanted meat. I also decided to go along with a drink they call Topical Mango. I really do think that whoever was responsible for producing the look of the menu, I think they meant to write tropical mango. Because for the life of me, I don't know what the hell a topical mango is. Even my phone wouldn't allow me to spell it the way it's spelled on the menu. I had to go behind the autocorrect and change it from tropical mango to topical mango. Haha. I will have you know that the topical mango was absolutely delicious. It was just a tad bit grainy which was just fine with me. I hate for smoothies to be so thick that it's tough to suck it through the straw. The flavor was absolutely perfect and it was so cold that by the time I finished the drink, I was freezing. Our waitress was absolutely gorgeous. Her skin looked as if you can swim in it. I don't know if you're now viewing me as crazy or just weird as hell, but if you have never witnessed someone with beautiful, Flawless skin... Come here. Her eyebrows were heaven-sent and she had a head full of beautiful hair that was slicked back. Her hips were out of this world and I mean that in a good way. It was as if it doesn't matter what this girl wears, just the silhouette of her body is pleasing to the eyes. Everything from head to toe about her was on point. I remember there was Spanish music playing the whole time. I think that when a place caters to a certain type of crowd or type of people, they forget to include \"others\". They had two television sets on, but because the music was drowning the sound out, closed captioning was on. Of course the closed captioning was in Spanish. It's a good thing they had something like baseball on because I don't need to know what the hell they're saying to watch baseball."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOGJYODVBRRAB",
            "text": "The food is great they have many items also have a lunch menu. The restaurant has great sitting area, nice decoration , it's clean the food is delicious, but if it's very crowded you're going to have to wait up to 30 minutes so get your food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdzZ6b2FnEAE",
            "text": "The food flavor, texture, look, and smell are great and attention was excellent. Plus the waiting time was not as much as other restaurants doing a well done an juicy stake."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdXZtUTFRRRAB",
            "text": "The place is awesome.\nGreatest Customer Service.\nFood Excellent.\nStaffs are very, very Courteous.\nPlace is very family friendly.\nWill recommend as a good place to eat."
        }
    ],
    "reviews_count": 77
}