{
    "name": "Flavas International Grill",
    "place_id": "ChIJZcNgby30wokRQ4h79RFfLBA",
    "grid": "BX4",
    "address": "854 Gerard Ave, Bronx, NY 10451, USA",
    "rating": 4.2,
    "user_ratings_total": 1242,
    "phone_number": "(718) 292-2900",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQmQzTTFSRWhKYVVVNFYxWkJhMjFwY0cxeGFtYxAB",
            "text": "I been going here since it’s original location on E163rd and Third Ave (20+ years)when Ms Yvonne would greet you with courtesy BUT NOT TODAY, instead of asking me what I would like to order they yelled out “no candy” because me and my sons had “dia de loa muertos” face paint. 🙄🙄 I d c if I was dressed like Santa, if I was dressed like the Easter bunny, it ain’t none of your bussiness, you there to provide a service to ME and my sons : you ask what dish you want, prepare it package and serve it when I pay,. I KNOW they don’t play with them white folks Comming to buy our food after a Yankee game…@"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbWRuRllVMWd6YUhVeWFqQnNXRTlGZW1Sa2RVRRAB",
            "text": "The greatest eatery ever known to man..food boasts of high standards flavors that make you want to wake you ancestors up and ask them have you had flavas.!the absolute best and don’t be too shy to check out their sister soul food store in mt vernon absolutely wonderful been eating there for years food is always up to standards excellent verity and prices and vegan options i usually bring family and friends i dont know why ive never wrote a comment but you know what they say good news doesn’t travel fast"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dFdtMUVXVzR4VHpWR2IzTkxiazlYZVhFMlVtYxAB",
            "text": "El rabo horrible y El arroz ni se diba  Ayer pedi por Uber su comida,omg mi Dinero perdido tuve  que votar LA comida El arroz parecia para dar pañete"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnelNUSnVVakJxVm5oVFVGUnFTamxoWVc5T1RVRRAB",
            "text": "I just ordered the goat curry and it is FANTASTIC.  Ordered with the butter beans and rice & peas.  Both great. It’s a generous portion:  enough for two.  This is going to be a favorite.  WOW!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twT2FtY3dhbkF6V0dFdFIwUnhjbFpxTlZGT2MwRRAB",
            "text": "We get four plates for two  people each time we order home cooking"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMVltdDBaR1p0WjFFelVHaHBTRk5uVVRKcmVtYxAB",
            "text": "Had better jamaican food.  Vegan patties were the best"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabXR5OHBRRRAB",
            "text": "*2025 UPDATE 2nd review*\nI'M MAD AT MYSELF. I WASN'T PAYING ATTENTION. THIS IS A 2ND REVIEW ON THIS PLACE. MY DAUGHTER ORDERED US SOME FOOD AND I WASN'T PLEASED AFTER EATING IT. I LOOKED UP THE PLACE SHE ORDERED FROM AND TO MY SURPRISE, I HAD THEIR FOOD BEFORE. 🤮 LET ME SHARE THIS EXPERIENCE...\nTHE MAC AND CHEESE HAD A STINCH THAT REMINDS ME OF SEWAGE. NO, I'VE NEVER TASTED THE SEWER BEFORE BUT YOUR SENSE OF TASTE AND SMELL IS CONNECTED. I ALSO TASTED IT IN THEIR HOMADE, GINGER PINEAPPLE DRINK. TO MAKE THINGS WORST, SOMEONE MUST BE HANDLING THE FOOD WITH PERFUME ON BECAUSE THINGS WERE TASTING PERFUMY. I WISH I REALIZED THE ORDER WAS COMING FROM THIS PLACE. IT WOULD HAVE BEEN A HARD NO! THEY NEED TO CHECK THEIR WATER SYSTEM. THE FOOD SHOULDN'T TASTE LIKE TOILET.\nANOTHER $60 WASTED. I HAD TO TRASH IT. BTW THE JERK CHICKEN WAS THE SAME, JUST LESS SAUCE BUT TO SPICY.\n\n*1st review*\nNever again! A $60 waste. My Sister says the food is probably better in the daytime. Freshly made may be best.\nI keep thinking  it's gonna be different. I keep taking chances on these bronx restaurants, and I'm disappointed  most of the time. I'm starting to believe these restaurants just throw food together just to get your money. Nobody cares about good food anymore.\nI had the jerk chicken. It was LOADED with sauce. Way too much sauce. I did not request any extra  sauce. I couldn't even enjoy the chicken. It also was very spicy with a vinegary taste to it. Ugh! The mac and cheese was hot, but the cheese was stiff like it was cold. You would think that since it was hot, the cheese would melt. Just weird! Was it real cheese? The taste was eh. The yams were the only thing I enjoyed. A little too sweet but tolerable.\nI'm tired of spending money and receiving less than what I expect.\nThese restaurants don't have any problems taking your hard earned money, but they have a problem giving you good food. 😏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scFNIVnhOMGh5V0ZVMVNUTnNNVVI1TVdaQ1VHYxAB",
            "text": "10 days later, I am still trying to figure out the high beef patty prices $3.65. Jerk chicken was good though."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSGRGTndUazFETUhCSExWQlZaa0ZCVVhKMlRFRRAB",
            "text": "Even after I left NYC, I've flown back to the Bronx just for Flavas!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNaWFDVU5BEAE",
            "text": "The oxtail dinner was delicious and the sides were extraordinary"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNWRtc3dURU5OYzFwUVVFbHJWRjlKZGxWNlNWRRAB",
            "text": "I love everything, not one thing I can complain about. The curry chicken, the BBQ chicken, jerk chicken all full of flavor. Sweet potatoes, collard greens, fried cabbage Mac n cheese all great. Amazing 5/5 will only go to this spot when I’m in the area"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5QldYTjRWMmhGYzBaSVVWUTRZbVpGVGtSalFYYxAB",
            "text": "I had the best lunch! Pepper steak with coconut rice with cabbage… The steak I didn’t even need a knife for, I cut it with a plastic fork and everything was so yummy. Best of all was the service, everyone was so nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNU9VaFljVmRmZVd0V1ZWWXdNWE51WW1oYU9FRRAB",
            "text": "There is no blasted way that they are tasting the food before they serve it.  Left everything on the table none of the food. None of the dishes were flavorful or tasty. What a shame. The owner should be ashamed of himself that food is…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJZmJ0TEs3c2VMRkVREAE",
            "text": "I got turkey with rice and peas and veggies. I’ve had better. I wouldn’t recommend, wasn’t enough flavor. My favorite part of the dish was the green beans."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJYklwNWlzckkyNEFnEAE",
            "text": "I ordered the 1 slice salmon dinner through door dash with a side of Mac and cheese and a side of rice and peas. Not only did I receive my order more than an hour later while my dasher sat there for 20 mins, it was not all that I ordered. They decided to replace my rice and peas with sweet potatoes without letting me know at all. Also, the sweet potatoes were half sweet and half bland and cold, then the Mac and cheese was cold and hard, the only good thing was the salmon and it wasn’t very well seasoned. I’ve ordered from them plenty of times but today was the last day honestly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNlBLTTlRRRAB",
            "text": "Shrimp Taste Fishy I Almost Threw Up Rice/Peas Hard Oxtail Nasty Waste Of Money"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cElqX2lRRRAB",
            "text": "Nasty food. Go to eating tree before this place or 233rd. Horrible Service and Horrible Food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cDVpMkR3EAE",
            "text": "The most handsome tall brownskinned man with perfect skin served me yesterday in the midst of Yankee stadium madness. He was so polite, gave me a nice portion for lunch (which is rare in other areas), and the food was SLAPPIN. Okra was delightful, curry goat tasted like nana made it, and the mac n cheese had no sugar (why do some of us people put sugar in mac?West indian blasphemy)..anyway. not these guys. Food was amazing.\nThey dont disappoint. Im not a regular but I'll be back..and you should too. 10 out of 10. Def recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aEphRUVnEAE",
            "text": "Extremely tasty & very decently priced!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbl9HVkRREAE",
            "text": "The food is horrible!  I ordered oxtails and they gave me neckbones, not oxtails. They are not selling oxtails. They are selling neckbones in place of oxtail.  Beware!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCa2ZxNEpnEAE",
            "text": "The food here is really good. You get pretty big portions. The place is always clean. The staff is super friendly and very helpful."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfai0taWFBEAE",
            "text": "My child died eating from here she ate ox tails with vegetables and she choked  & died from the vegetables, cause there was a bone in it ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ2VQeUN3EAE",
            "text": "My Go To Restaurant In The Area. Fresh Flavored  Food All The Time"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaXVHSlpnEAE",
            "text": "Difficult to find parking. Friendly service. Amazing food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOV9Uem9nRRAB",
            "text": "This was the worse food somebody ever brought to me the yams garbage Mac garbage oxtails too tough I'm pissed"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbDQ3X3hnRRAB",
            "text": "Food is always good! Veggie and vegan options are a plus."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNDVDV05BEAE",
            "text": "You get to listen to Jamaican music and you can eat there. The food was very fresh and it's not spicy at all. It's great for vegetarians to eat there also. It's just somewhat expensive for the dinner food"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHX1kya2lBRRAB",
            "text": "They are amazing the food is so good wonderful portions the fried chicken is amazing and I don't like everybody's fried chicken but this fried chicken is amazing. You won't regret it. Salmon awesome sides awesome and great customer service 😌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubi1YWV9nRRAB",
            "text": "I placed an order for the oxtail, peas, and rice. The oxtail was tender, and the peas and rice were satisfactory. However, the dish lacked the authentic Jamaican flavor and seemed to be more Americanized in taste. The place has been updated since I was last here. I would give 5 stars if they back the spicy flavor to the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdWFHb0VREAE",
            "text": "Subpar is a understatement under seasoned no real Jamaican flavor just bland even the oxtail had no flavored"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bVlEUkd3EAE",
            "text": "I came here after a  Yankees game couple of times  . Pretty good to me . So far i had was the jerk chicken which is spicy (might be a little too spicy ) but it’s still good and I had the pepper steak which is also great. Go stop by and test them out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d1pPUVpBEAE",
            "text": "Pretty good food and portions. Lunch specials were great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibmVfV0lBEAE",
            "text": "Oxtails was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXV5WnVnRRAB",
            "text": "Always fast service with a great attitude. Try the fried whiting dinner with their candied yams and Collard greens or cabbage, Oh my!....I am hooked"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb083bnp3RRAB",
            "text": "First time here got curry shrimp and Mac & cheese, cabbage...delicious..can't wait going back next couple days try other things that looked 👍 great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ1BETEhREAE",
            "text": "If I was able to give negative five I would. I ordered food (goat and rice peas)for my father and to his surprise he found staples in his food. Food was poorly package. Very irresponsible and huge danger that servers are so careless in preparation.\nThis is pure laziness"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRenQyTFVBEAE",
            "text": "Curry shrimp for the win! It's only served Thursday-Sunday. Food is a bit pricey but pretty good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaWNuMWVnEAE",
            "text": "Great place to eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeWF2OElBEAE",
            "text": "Omg my chicken was RAW"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbG9iZ2d3RRAB",
            "text": "Came here this morning at around 11am the service was very good and the food was delicious. We'll be coming back to try more food. Thank you to the guy serving me and my dad. Allowing me to tell him we're trying a different cultures food and not being rude to us asking questions. We're Puerto Rican trying out something different. We don't got this type of food in our part of the Bronx wish we did!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eHZyRk9BEAE",
            "text": "Food was delicious, and fresh. Service was fast…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dTV2Z3p3RRAB",
            "text": "The food is good but not as it used to be years ago!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NEpEVkR3EAE",
            "text": "The food is really good. Portion sizes are great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeTZTN1lnEAE",
            "text": "Best Jamaican food in the Bronx! This place never disappoints. Only issue is there no parking on this block so be prepared to double park or walk over if ordering in person."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdTVxRVdnEAE",
            "text": "Food was so good it was my first time trying it. I forgot to take a picture.  Staff so pleasant ☺️ 😊 I will go back and send a friend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwZ3RmMDlBRRAB",
            "text": "Rated them 5 stars 4 years ago and this was my review ----> I absolutely love this place amazing customer service and and the food has tons of flavor and they give a very nice amount of food for the price you really cant beat it.\n\nNow i can truly say that the food is not as it used to be serving bland, over cooked food and old food . Please improve otherwise people go check somewhere else."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNExYZ2dRRRAB",
            "text": "Excelente!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMzU2VlBREAE",
            "text": "On 4/26/24 approximately 5:30pm…I ordered a small Cabbage, small yams and fried fish. It cost $15. When I got home and opened it. The cabbage did not have much flavor. It also was a very small portion/amount. In addition, the scope of yams was also limited in my plastic container, not a full scoop. Lastly, the fish looked appetizing, but-had no flavor, and it taste fishy-like it was not rinsed, dried, and then seasoned. I recall a gentleman made my order. I did not watch him closely fix my meal. While, I assumed I would at least get $15 dollars worth of food in my containers. I did not receive what I paid for. The food lacked taste. Doubt love was added either when they made it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbjR6YVFREAE",
            "text": "Food is best when you are there 30 minutes after opening."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaFlYeG53RRAB",
            "text": "Im so disappointed i went here they make you order in 1 spot and then someone makes your plate i clearly ordered 1 chicken and 1 goat and instead i got 2 chickens.  Now normally i wouldn't be so upset but i really wanted that goat (which costs more) and i live an hr away and have no option of getting what i ordered and paid for"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdXVyYTd3RRAB",
            "text": "Excellent experience right near Yankee Stadium. The food is beyond tremendous and you can order ahead to get your order ready to go! The oxtail, the baked chicken and the whiting were off the chain. Licking my fingers and did not use…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNjdEtSdRAB",
            "text": "Soul food is the best! This restaurant is one of the best soul food in NYC!!\n\nLocation: It is located in Gerard Ave, 5 min walk from Bronx Supreme Court which I had my jury duty! The restaurant is small with few seatings inside. There is a huge line and there is a great display of food inside!\n\nService: The 2 ladies runs this restaurant! One in the cashier and one in the food selection. They don’t look stress despite of the long line.\n\nFood: I got the Lunch Special: one main course and 2 sides, the price depends on the meat. I got the OXTAIL: it was so good, and it has meat on it, unlike other oxtails that you eat on the other restaurants that is mostly bones of the oxtail, it sauce is good! MAC and CHEESE: probably the best mac and cheese I ate, does not look good but when you eat it, damn it is soo cheezy and good! GREENS: its good too, but lack of seasoning, I should have got the OKRA.\n\nPrice rating: 6/10, not bad for amount of food and deliciousness you get! I bought a medium container of just the OXTAIL it cost $20 but damn it is a lot!\n\nOMG I will definitely go back here for soul food! TRY the OXTAIL and MAC and CHEESE!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVc04yLVVREAE",
            "text": "Today was my first time visiting this location. I ordered the stew chicken with rasta pasta and cabbage. I brought a side of rice and peas which was very good. (The cabbage was good too!) And I heard a lot of good things about this…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaFA2MGpRRRAB",
            "text": "Coming from Dallas , OMG food was soooo good I had to go back inside and let boss know… I was so pleased. Food is definitely tasty and not over powering which is a PLUS…\n\nBoss lady was patient and allowed to try the jerk chicken which was too spicy for me but it was definitely good… the flavors are really flavoring..\n\nBbq chicken sauce is different and tasty . Tastes like it was made in house which I’m sure it was…."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMWVHaUx3EAE",
            "text": "I really love everything from this restaurant, everything is fresh, they give you generous portions and the prices are reasonable. Being a vegetarian i was also happy that they have a good selection of meatless sides. I would definitely recommend going here."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbE9QV0JnEAE",
            "text": "I love the food here. Everything is always well seasoned and very tasty. The quality of the food is always good. They are consistent and very clean which I like. Real home cooked food, generous portion sizes and affluent price. They are…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnd2FXN1dBEAE",
            "text": "Awesome Jamaican food. Great place just outside Yankee stadium. There is a constant line here but it moves fast. Will come here again next time to try other things but the oxtail is a definite try if you have not had it before."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdU8zMG1BRRAB",
            "text": "The oxtails, baked mac & cheese, and candied yams are really a blessing for your stomach 😩 if you like Caribbean food you must check this spot out. Clean establishment but trying to pay for my food took a long time, im unsure if the cashier was new. But friendly staff!…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMU9tdkNBEAE",
            "text": "I ate some Avas, with vegetables. I am sorry that I forgot to take a picture of the food before, I only took a picture of the plate after, once I was almost done with lunch. Lol. Anyway, delicious lunch. Be open to explore new foods new…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NDgyZzlBRRAB",
            "text": "Would(NOT) order from here again!\n\nMeal looks much better than the actual taste. I did not enjoy eating this meal at all. Compared to all the Jamaican restaurants that I have eaten at and tried, this restaurant ranks near the bottom. The jerk chicken was not spicy nor good (the jerk sauce made it bearable). The rice and peas was mushy and bland. I explicitly asked for oxtail gravy on my rice, and did not receive any. The Mac and cheese was dry and bland.\n\nThe only thing that saved this meal was the sweet plantains and the plenty of water that I had to chase it down!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVa3Y3UnFBRRAB",
            "text": "I will always travel for Flavas!! I always get a large plate with oxtails, rice & peas, mac&cheese, and yams and everytime it’s on point. The food is flavorful, filling , and some of the best oxtails I’ve had in NY. Plus the staff is so nice and they give great portions. Flavas is the place to visit for Caribbean food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwakpyUnd3RRAB",
            "text": "My first time in the Bronx and I was hungry. Decided to use my Uber One deal and chose Flavas International Grill. Fast service and a small plate can feed two people. I enjoyed the Jerk chicken and Rasta Pasta the most. Definitely will be going to their Lounge when I come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeHVUSlFBEAE",
            "text": "Really good Jerk Chicken! Steps from Yankees stadium. $15 for a big platter, way better then other food options near by"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdmMtendnRRAB",
            "text": "I ordered a large jerk chicken rice and peas collard greens and rasta it's the one of the best spots in the bronx when it comes to flavor everything was on point."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteU56RnhnRRAB",
            "text": "They give you a good portion of food and are on top of delivery orders"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdF9uekhnEAE",
            "text": "The portions are so worth the price.  I am a hard critic of yams.  Please take the time to smash them.  The chucks are too big.  Please make a section with nutmeg and cinnamon and another section with no seasoning (I guess they weren't because of people's allergies).  I had a taste for yams but looking at them, I couldn't.  Loved the stew beef and the collard greens were absolutely delicious!  Nice ppl  busy so could be a little friendlier but again, it's a very busy restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dU91dUZREAE",
            "text": "The food was not good I was going to head out to another spot but really wanted the yams something sweet to take home. They were not seasoned very lightly not enuff sweetness. So today Im going to fix them up with my ingredients.  Also same with cabbage no distinctive taste & a slight hard which I like but not hard. The shrimp were fine she had  just  put fresh fried shrimp out. My husband felt the same way taking to many short cuts just add the seasonings to enjoy the food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNek1HOXVBRRAB",
            "text": "LOVE the food here!! Everything is great and the portions are HUGE. Prices are fairly reasonable as well. And the staff are some of the nicest I've encountered since being in NY, it's like I go back to the south when I go there. I will say…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOGV1My13RRAB",
            "text": "I stopped by yesterday, Wednesday April 26th with a coworker who raved about this food. I don’t live in the Bronx and have never had Jamaican food from there before, so I decided to try it.\n\nStew chicken was way too salty. I ordered it with rice and peas and cabbage. There was too much sodium in this food. I couldn’t finish it.\n\nThe oxtails were also too salty. Collard greens were too spicy and bitter because of all the stems. Mac and cheese was just okay. I typically avoid baked Mac and cheese from West Indian restaurants because they don’t know how to properly make it. The oxtail were falling off the bone. Again, flavor was good but too much sodium.\n\nJerk chicken dinner was drenched in sauce and a bit spicy. I’ve never been served jerk chicken covered in so much sauce that way. I had the same sides as the oxtail dinner.\n\nWould I come back? Maybe if I happened to be in the area and was hungry. I wouldn’t leave Brooklyn to come all the way out here for food though.\n\nI’ll say the attitudes here are typical of Caribbean restaurants. Not exactly bad, but just typical."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbTd6Snd3RRAB",
            "text": "I love this place! The food is fantastic and they have vegetarian options for guys like me. Phillip who is the owner is the sweetest guy and greeted me like I’ve been going there my whole life. This is a small, family owned and operated…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMWVITHpnRRAB",
            "text": "Wish I COULD GIVE zero stars, customer service (HORRIBLE) but that should be expected. I didn’t really care about that until it took hours to receive food. After waiting for a while I said mine as well wait a bit longer, If you have a opening time food should be prepared before you open to the public. And to have people wait over a full hour for food and my 11 year old who doesn’t even boil hot dogs could have made a better plate than what we received. There’s tons of Jamaican/Caribbean restaurants  to choose from take your money and time else where."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOWRILWtBRRAB",
            "text": "The portions were nice, as well as the seasonings on the jerk chicken and sweet potatoes. However, the collard greens weren’t cleaned properly and had alot of sand/dirt on them and who really wants to eat crunchy greens? And the mac and cheese was better with the jerk sauce."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOUozdlNnEAE",
            "text": "Excellent food, lines out the door get there early is all I can tell you, and don't miss the great smoothies.  The plates are plentiful, and you get a choice of a meat, and depending upon which price range you pick, 2-3 sides, of course the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdE9TeXVBRRAB",
            "text": "I'm giving a 5-star review to this amazing Caribbean restaurant in the Bronx for its fantastic food and unbeatable prices. I enjoyed everything, from the flavorful curry goat, Rasta pasta and cabbage to the macaroni, yams, and rice and beans. Beyond the delicious taste, the standout feature was the wide array of side options available, providing an exceptional dining experience. I wholeheartedly recommend this restaurant to everyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcDd1NjB3RRAB",
            "text": "Delicious as I remember from years back winder if they still have them lunch specials"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaW9pOTJ3RRAB",
            "text": "Would be 3 stars, but the portions are huge so 4 stars.\nTaste is just A OK.\nA massive portion of ( curry goat, mac and cheese, collard greens, a soda and a desert for $~21. That’s solid price for anywhere and especially NYC."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhZ3MzSXdnRRAB",
            "text": "Great Jamaican take out. Yes, you can sit if you like, but it's not a restaurant for a date.\n\nFood is always fresh, even late at night. Happy to say that the fried fish is never too salty, which happens a lot at take out places. Staff is friendly and not flirting more than serving up food, which seems to happen often at Caribbean spots!\n\nPortions are generous and prices are reasonable. A nice place to stop in before a Yankee game. Breaks up the monotony of the neighborhood McDonald's & pizza shop and more affordable than the Hard Rock Cafe."
        }
    ],
    "reviews_count": 77
}