{
    "name": "Kingsbridge Social Club",
    "place_id": "ChIJL0e13bzzwokRulAKSvMY5rw",
    "grid": "BX4",
    "address": "3625 Kingsbridge Ave, Bronx, NY 10463, USA",
    "rating": 4.7,
    "user_ratings_total": 903,
    "phone_number": "(347) 346-5180",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaGJYZDJkREZQYkdkdGJHd3dMWGxXYjJoMlJrRRAB",
            "text": "It’s crazy to me that within the last 5 years, their fried chicken sandwich remains to be one of my favorite MOST CONSISTENT menu items to order. Absolutely love this place!"
        },
        {
            "date": "3일 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFZtUXdSMXAwWkdsV05YWnhSRmx0YWpkRlVFRRAB",
            "text": "Bring back zucco pasta!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNlEzVXdka2xIVlZwbU9FTXRRVTVVVVRGd1UyYxAB",
            "text": "Best Eggplant stack"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNE9ESlVUelZqTUVONlUyZG1SVGhvYmxjMk4yYxAB",
            "text": "Underwhelming food and arrived almost cold.  Overpriced for the portion.  Delivery was quick but packaging needs improvement. My salad dressing spilled all over the outside."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReVZuRXljR1YyTW1WM0xXSTJOazh0TTJobU1rRRAB",
            "text": "Came in unexpectedly just to kill time ended up having one of the best pizzas I’ve had in the Bronx easily top 5 in the Bronx for me. It was really early and I was their first customer and the treatment was great from start to finish. Service was awesome. Drinks was on point I saw they had the best espresso martini in the Bronx and let’s just say not even close 😆 but it was good had a double IPA also very good and it’s also bring your own bottle and they do charge a cork fee. Not bad if you wanna have your own wine or beer\n\nOverall truly enjoyed myself here definitely will be returning I enjoyed my experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTFpuQkpjVFo0TFZoMVIwSlZTM2RuTUcxRVZtYxAB",
            "text": "Great food and drinks pizza and pasta was excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa2QwaHRaREUxUWpOMWFGWkJabmd4TTJaWFVWRRAB",
            "text": "The chicken from their chicken Parmesan was old and reheated. It was tough and the breading was soggy. The chicken on their pizza was overcooked and hard. Wasted close to fifty dollars."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU2FGcEZTRWhLZUdWc09XNXVlR013VXpCdldVRRAB",
            "text": "Tracy 168, graffiti, great Pizza, appetizers, drinks and vibes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNmJTMVplR2xMYVZKSlJqUnpWazFKUVdKMGRtYxAB",
            "text": "I loved this place. The pizza was perfect, thin crust full of flavor and fresh. The girls were very attempting to our table and very professional. I will definitely return when back in the Bronx. Thank you girls!! Excellent service!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbFpIQjVjMDA1ZEZKb05tUnFWVkJLVURONk5VRRAB",
            "text": "I have to say this places looks very nice inside and outside and they have ample room for groups. The service is excellent and the staff is very friendly. The only bad thing for me personally is that I was a bit disappointed in the food, more was desired for this place to be truly a great place to eat. However for the price the food is different."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaWY3RDJnRRAB",
            "text": "Great spot, great sandwiches  and pizza is made to order ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbWNqWjJSRGc0VVdsaVYydGFVbXgxZVVwUlRsRRAB",
            "text": "Went their for lunch ordered the wrecking Ball pizza. It was so delicious flavorful.  The ingredients are so fresh . The service was excellent Great place Definitely going back. A must try ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM2VGOVVTRFowZDJsdFkwbzNYMFk0V205NFNYYxAB",
            "text": "We were really disappointed. The food quality was poor and everything arrived completely cold, even though the place is just 5 minutes away from our home. For the ratings they have on Google, we definitely expected better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbVVVdG9lbXBaV0hsYWQxZERWMXAyUW5SNlMxRRAB",
            "text": "Always amazing food and top tier service. Local gem"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sbk4zSk1kMjVLVDFVelgxTkxTMlV0VEVWSE0xRRAB",
            "text": "Came by for the happy hour, got the hot wings and eggplant roll with two lagers, all for $25. Organizing a post work HH for here soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRk9EbG9OblIzVFRSWlNFcE9kQzFQWkZScFowRRAB",
            "text": "Great service nice spot to grab a meal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM01tcFRYM05CZEdrMVp6TTFjWHBTY1VOV1JHYxAB",
            "text": "Came here with a friend, and I can safely say I will never come back. The measures taken to maintain clean restaurant are zero to none. Crumbs on tables and floors, dirty menus, I even had crusty cheese on my fork, how is there so much neglect going on???\nI would’ve understood if it was busy but it was a pretty calm day.\nMaybe management doesn’t care or this is a reflection of how they feel about the Bronx.\nIn either case I’m recommending everyone to stay away and explore your options at another restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNU0xZEhkakpoVlRGRGRWQlZkVUZZU1Mxc2VrRRAB",
            "text": "This place is absolutely disgusting. There was no soap in the bathroom, servers using the same dirty rags to wipe all the tables, eating while on the floor and then touching our plates afterwards. Management needs to change, how this place received its health rating is beyond me. Never again, for your own health stay away."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRU16UnpXRlZHTWxNMGVVbDRibVowVjNjME4zYxAB",
            "text": "My dinner was good. Chicken Parm with spaghetti. Definitely fooled me wasn't expecting such a decent meal from a bar? I would go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNV0h5YXpZeU4tcnRBRRAB",
            "text": "Great little neighborhood bar with a good range of draft and craft beers available. Excellent food too, especially direct from their pizza oven. Friendly, helpful staff makes this a winner for me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaFpqaHpOemRFY1UxU2IwNWFkSGxETldwa2JGRRAB",
            "text": "Mozzarella sticks appetizer was excellent. Spaghetti and meatballs entree was delicious; the meatballs had a noticeable garlic flavor. Warning for anyone planning on ordering the tortellini: it's realistically a salad with tortellini on it (the person who ordered it said it was delicious, it's just a little confusing that it's listed in the pasta section of the menu)."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrczRmYkRBEAE",
            "text": "Exactly what Riverdale needs more of, great place to hang out with excellent food and beer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNR084ZUg4X01LMkxBEAE",
            "text": "I visited your restaurant to order a Wrecking Ball pizza with vegan pepperoni. Unfortunately, when I brought it home to share with my family, we were disappointed to discover that it had been made with regular pepperoni instead. As a Muslim, this was not only disheartening but also deeply inconsiderate, as it goes against our dietary restrictions. I hope greater care can be taken in the future to honor such requests."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYjd6OUxibk96elVREAE",
            "text": "Food was amazing and the beer selection great had an great sit-down dinner highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT29nLWJiejR5Y2N3EAE",
            "text": "Eggplant stack 10/10, Brussel sprouts 10/10, pizza 10/10, drinks 10/10, definitely the best spot to pregame at before a night out, or to begin your Sunday funday."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJR2pyY3U1eW9hU253RRAB",
            "text": "I rarely write negative reviews, but my experience at Kingsbridge Social Club was disappointing enough that I feel compelled to share. I had high hopes based on the location and some of the buzz, but unfortunately, the reality didn’t live up to expectations.\n\nThe pizza itself was the biggest letdown. The crust was undercooked and soggy, the sauce was bland, and the toppings tasted like they came straight from a can. I expected much better quality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHJYeTZBRRAB",
            "text": "Hi! You should bring back the Calabrian honey wings or the garlic parmesan 💕 the new ones are spicy and tasteless…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDRhQUNREAE",
            "text": "One my favs, great food, beers and cocktails."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva1lIYWhRRRAB",
            "text": "Good food!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcU5UbXVnRRAB",
            "text": "The food here doesn’t miss. This is such a perfect neighborhood spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbXZxNVZREAE",
            "text": "Best pizza and amazing atmosphere. Love all the staff from KBs"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOHM2ellnEAE",
            "text": "I’ve eaten at Kingsbridge Social Club a few times. The food is good, but the staff has consistently rubbed me the wrong way. Almost every visit, I’ve overheard servers in the back talking negatively about customers—either while waiting for the bathroom or even from my table. I’ve worked in the industry, so I get the frustrations, but at least wait until guests leave. It’s hard to tip 20% knowing we’re being judged.\n\nThe last straw was during a pickup order when I asked the bartender (slender, long black hair woman) how long the food would be, and she responded with an annoyed attitude for no reason.\n\nMe and my friends won’t be back."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NksyS3NRRRAB",
            "text": "Celebrated daughter's 40bday. Love this place but my stomach doesn't. Chicken wings are moist-greasy and sweet. If you overeat them, you will pay later. Several combos of pizza you rarely find elsewhere. Get there early since the neighborhood, train stop and college all intersect in this vicinity."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeXNDMzNnRRAB",
            "text": "I have been to this restaurant quite a few times since moving to the area. Have really enjoyed my meal every time, really delicious pizza, the meatballs are so good. Rocket salad- amazing. Have had a couple of the cocktails (a couple times a beer) and they're very good as well. Only thing I've had a tad of an issue with is, a couple of occasions some charges for items on my bill don't match what was on the menu. For example the menu would say a sangria is $10, and my bill would have a $22 charge for 2 sangrias. Or a pie is $17 on the menu, and the charge be $18 on my bill. These things I've noticed a couple of days after when I'm cleaning out 100 receipts inside my purse. And yes it is a minimal difference in the prices, but why the inconsistency? Just something to be on the lookout for, I suppose if you're a regular there these things would add up with time."
        },
        {
            "date": "7달 전",
            "language": "da",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaTRLRTBnRRAB",
            "text": "A PLYS CUSTOMER SERVICE"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLWJ5bGRnEAE",
            "text": "Server was really rude, hot appetizers came out cold and most of the food was bland."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnc3VPRC1BRRAB",
            "text": "I felt it necessary to share my experience from my visit today that left me feeling quite disappointed.\n\nAround 12:30 pm, I entered your restaurant with my young son and a cake, and we settled at a table meant for four. When the gentleman at the bar inquired if it was just the two of us, I confirmed that it was. He then told us to move to a smaller table. Given that the restaurant was not busy at the time, I believe a more considerate approach—perhaps offering to hold my cake while we switched tables—would have made the transition more agreeable.\n\nAs a regular patron, I was surprised by this interaction and the level of customer service I encountered. Ultimately, I chose to leave, which I believe is not an outcome any establishment aims for."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0s2alF3EAE",
            "text": "Awesome pizza ! Good chicken parm"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNXNpaXBBRRAB",
            "text": "This is a nice local spot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcG9iMjlBRRAB",
            "text": "Best pizza in NYC. The dough is delicious and the toppings are excellent. They have great beers on tap, wine on tap, and even cocktails on tap. Last time was there they had a Boulevardier on tap that was excellent. Get 1 pizza per person and everyone will be comfortably full."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBanVQdFVBEAE",
            "text": "It was my first time coming to this place.  A friend of mine brought me here and I loved it!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMWRmM3hnRRAB",
            "text": "Absolutely, yes!!! Today, I tried this pizza place for the first time, and it was fantastic. I had heard wonderful things about it, and I couldn't wait to give it a shot. I went for their plain pizza, which is a Margherita. The pizza was wonderfully light and fluffy, with fresh and tasty sauce. It had a perfect balance of cheese and sauce. The service was top-notch! Plus, I noticed how incredibly clean the place was, which is definitely a big bonus! 😃😃😃😃"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMFBXejlBRRAB",
            "text": "Me cobraron 32 dolares por una diminuta pizza de 6 pedazos super pequeña y desabrida 🤮 y llego helada no doy segundas oportunidades, porque ahí esta el error"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbXEtVnVnRRAB",
            "text": "Their drinks are pretty good. My favorite pizza is the Cherry Bomb. You have to try their brussel sprouts. The vibes here are awesome."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmLV9Qdmx3RRAB",
            "text": "We had and Amazing experience at this local pizza and beer spot today! The staff were incredible—welcoming, attentive, informative, and genuinely friendly. Every dish was fresh, well-prepared, and bursting with flavor. This place is a must-visit for anyone who loves great food and a welcoming atmosphere. Can’t wait to return!\n\nWe tried a variety of dishes:\n•\tBeef & Pork Meatballs: Perfectly cooked, served with rich sauce, parmesan, and fresh bread.\n•\tMozzarella Sticks: Crispy on the outside, gooey on the inside—classic perfection.\n•\tFried Chicken Sandwich: Juicy chicken with fontina, lettuce, tomato, red onion, and mayo, all on flavorful garlic bread—every bite was packed with flavor. DID I MENTION THEY MAKE THEIR OWN BREAD 🔥\n•\tPepperoni Pizza: The vodka sauce, mozzarella, parmesan, and Calabrian chili oil elevated this to another level—spicy, cheesy, and absolutely delicious. Oh! And they let us add hot honey."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bzV6eUxREAE",
            "text": "Fried chicken sandwich is great"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2N3BPOU9BEAE",
            "text": "Delicious food. I have tried their pizza and chicken parmesan dish. Both were excellent !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibUs2RFB3EAE",
            "text": "I really enjoyed my food today. It's my first time here and I'd definitely go back. Everything had great flavor. Everything was fresh and robust. The drinks were lacking but the food made up for it. The meatballs were so delicious and the pairing of sauce and garlic bread was really good. The rolled up eggplant was also really good. The Sweet Heat pizza was a little heavy on the spice so if you're unable to have spicy food, beware.\n\nBest part of the meal was the service. Armando was great, he really enhanced our dining experience. I know people come to the Bronx and won't expect actually good service but Armando set the bar high for the bars in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaDliUWxnRRAB",
            "text": "Went here on a Sunday to meet my siblings, and it was great!  We were able to sit for as long as we wanted, and Joshua, our server, was AWESOME!! He made great recommendations and was super patient with us..  Will def return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINjhMbFl3EAE",
            "text": "Miguel was an exceptional server and had great recommendations 👏\nI eat Calimari everywhere I can find it, and this place had one of the best 👌🏼\nStone oven pizza was delicious, and the local to NYC soda bottler, Boylan, had a fantastic black cherry soda.\nFinished off with lemon canoli\nHighly recommend dining here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOHNHcGJ3EAE",
            "text": "Wood fired pizza was really good with cold beer. The crust was light and crispy. Fresh onion and garlic on the pizza was unique and special. It made pizza more tasty. Wings and pasta were good also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId2ZmLWl3RRAB",
            "text": "Pizza is delicious, I’ve tried like two different pies from this spot and the meat balls 🤌 so goooood. The bartender was super nice aswell and recommended me what to get based on what I liked which were really good."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzb2VyMjVBRRAB",
            "text": "Good environment to go for a drink with friends or go for a delicious pizza with your family. Its a very small and cozy spot with fun graffiti decor. Overall the pizza is amazing. The mac and cheese was good but Not great. I don’t really like spicy food so I ordered plain wings and they were really nice and crunchy. Took some leftover wings home and after heating them up they were still nice and crunchy.\nOverall a great time with good food at this little hole on the wall that’s quickly picking up popularity. I gave a rating of 4 because there was only one hostess and thought she was amazing, it took a little longer than it should have to get our drinks. Nevertheless, she was a sweetheart and did her absolute best to accommodate the needs of our big group on her own."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKblpUUlJ3EAE",
            "text": "Wow! One more time my favor stop in the Bronx…. HIGHLY RECOMMEND.\nNice place to eat. OMG! Spaghetti with Chicken Parmesan #1 plate of the restaurant. Hot Cherry Pepper Wings delicious. All plates are 100% recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeU5LdUlnEAE",
            "text": "If you are looking for a great place for any occasion, this is it. The pizza is as close to perfect as you can get. That isn't hyperbole, it's literally just about perfect. I had \"The Bronx\" pie. My table also had the Chicken Parm Sandwich and the Spaghetti and Meatballs. We all had to get take home containers because we were stuffed. The staff is amazing, and the ambiance is great. You feel like family the moment you walk in. I plan on dining here EVERY chance I get. Kudos to the owners on a job magnificently done."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdm9IZjR3RRAB",
            "text": "We really wanted to try and find really good NY pizza and this place was suggested. We tried three of their specialty pizzas and the special appetizer of arancini. We loved the white mushroom pizza the most and I also really enjoyed the spicy pepperoni on the other pizza. I loved that you can see them preparing the pizzas while you sit and relax. It’s definitely a cute night out on the town that’s also low key."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dHRHMlRBEAE",
            "text": "I love this spot in the BX: it’s a neighborhood place with a welcoming vibe. Great food, great service, and a place that has been very good about public health in a pandemic—which they should get major props for. Tonight had the Strawberry salad and The Goat pie, with cannoli for dessert. Super great pizza, and a good amount to share between two and feel full and not horrible about yourself. A great experience and a great spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaVlqU1F3EAE",
            "text": "This is a very well kept secret that is hiding in plain view. I had ordered a takeout plate of Spaghetti 🍝 & Meatballs. It was excellent,  sauce was just right an not watery.  Pasta was perfectly cooked. Meatballs were like eating home made…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcE91SnF3RRAB",
            "text": "Every single person in this restaurant was enjoying themselves. The patrons at the bar, at the tables. Everyone working there. Even the the guy delivering beer was laughing and smiling. It's a great location between Manhattan College and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoc2JDYnZ3RRAB",
            "text": "The brick oven pizza was light and crispy, and the sauce had flavor. The eggplant stack appetizer is a must try. It was a little over fried but still delicious, lol\nI will definitely go back to try other menu items."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLalpDVE5nEAE",
            "text": "We got all the today's special. The salad was great, pizza was great. The pasta was ok but others were so good. I especially liked the wrecking ball pizza. I love crispy pepperoni. The pizza bread was good as well. the waiter was prompt and really funny. He pulled out his fan at one point so swiftly. It was awesome. Parking is hard to find but I recommend this place. I would come again when I go to golf at van cortland."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaC1IWTB3RRAB",
            "text": "This is exceptionally delicious pizza in a fun decor. Has a bunch of different styles of pizzas to choose from; and other things you might expect on the menu; such as meatballs, hot wings, salads and pastas. Has a nice selection of beers on tap. Good for large groups and kids. Service is friendly. Would recommend for lunch/dinner."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMHYzOXlRRRAB",
            "text": "I want to give 1 star for myself, but I can’t for two reasons: 1) My companion didn’t have the same unpleasant experience. She said of her Shroom garlic pizza, “I really liked it.” She also ordered the Brussels sprouts, which she found satisfactory but felt they were “slightly burnt” (they were also overcooked on her last visit) and taste-wise were “missing a little something.” 2) This is my companion’s go to neighborhood spot & I did have an enjoyable experience the first time I came (during the day). But this second visit, which will be my last, perturbed me for a few reasons—enough to want to rate 1 star: A) We entered and no one seated us, so we sat ourselves. While looking at menu, the waiter asked us if we would move to a 2-seat table for a party of 4 that came in. This really annoyed me. My facial expression, body language, and non-verbal reply should’ve clearly told waiter it wasn’t “ok”; if not for my companion, I would’ve got up and left. B) We’re moved to the worst table—the bar & heavy foot traffic on one side and a party of 4 on other side. People walking by were literally walking over our food!!! as the pizza is elevated on a table stand. This is the part that really pet peeved me. C) And this is a big part of why I won’t be coming back (although I’m sure my companion will): NO CALAMARI. This was my only reason for even coming. Once the server said they don’t carry calamari anymore, there was no reason for me to even be there anymore. I winded up not ordering anything for myself and just watching my companion eat, while protecting the food on table from people walking by too closely."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5dl9mNnB3RRAB",
            "text": "This is our third time to Kingsbridge Social Club. The pizzas are so delicious. The gorgonzola one is on the top of the list. We are going through all the  appetizers. Service is warm and friendly. Can't wait to go back for the prosecco and taste more of the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M3ZUVWV3EAE",
            "text": "If I had an Italian grandma, I imagine the food  would be as good as the food at Kingsbridge  Social Club.  The delicious pizzas, appetizers and main dishes were all served promptly, were of ample size and well presented.   The beer was cold and the service fabulous.  I highly recommend this place and hope to return some day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaHJEYWlRRRAB",
            "text": "Great beer, amazing service and fantastic pizza. This place is always super consistent with their quality and are so open to your dietary needs. I also like their little outdoors area for the summer."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc2Y3TVR3EAE",
            "text": "Amazing diner feel and ambiance inside and soon to come outside area for a restaurant/bar with food that sweats the details. The Brussels sprouts are roasted to perfection and have a lightness to them that complements the aioli. Don't let…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPajhPQmN3EAE",
            "text": "Kingsbridge social is my go-to spot for pizza and beer. They have a small set menu of pizzas and appetizers. They also have daily specials. I love their meatballs appetizer. They come wading in deliciously seasoned marinara sauce and a side…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cEo2SU5REAE",
            "text": "Honestly this might be one of the best pizza places in the area. This place is a great place for bigger parties. The outdoor patio is too much fun. Great place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX1lQSmFBEAE",
            "text": "Their pies are already top notch (especially the one made with vodka sauce), but I attended the oyster fest and they did not disappoint. Stuffed, fried, raw...all good. Just wish they'd bring back the roasted brussel sprouts. Oh yeah, excuse the one already consumed raw oyster. I was waiting in friends and got a bit overzealous."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMF9DWURREAE",
            "text": "We had another fantastic meal at the Kingsbridge Social Club.\nTheir menu is always creative and changes seasonally. We had the meatball and burrata pizza and the kale and arugula salad. Apples, walnuts, goat cheese and a light truly flavorful dressing!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbVlXQXVnRRAB",
            "text": "This is a hole in the wall place with a small but delicious menu of amazing wood fired pizza and amazing sandwiches. They use fresh ingredients and the music and service was just as great"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbDh5RUFREAE",
            "text": "This place is a hidden gem for sure. You are treated like family from the time you walk in to the time you leave. Fast friendly service, with food that's top notch. If you have the time, try EVERYTHING on the menu. It's well worth it."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneHNqbHpRRRAB",
            "text": "A lil slice of late 50's early 60's West Village in The Bronx. Quaint, dozen or so tables about half at the stick, full craft \"no crap on tap\" as Drew trademarked. Chris & his brother Tom laboring with love at the cast iron rotating stove. Right off the subway. #pizza is incredible, go tip this place now!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocl9IOTdBRRAB",
            "text": "Everything was sooooo good I couldn’t even get an initial picture! The bartender created a drink that was amazing, the food is beyond good, and the staff is wonderful! It’s such a chill vibe! 100/10 recommended!!!! If you haven’t tried it … it’s a must!!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBa2ZxWER3EAE",
            "text": "It's nice to have another comfy neighborhood eatery close to home.\nThe wood fired oven was busy. The pizzas looked great!\nHappy Hour from 3-7 M-F=😊😊\nMy only suggestion for improvement?..... gluten free pizza crust option!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMC16UWF3EAE",
            "text": "With family and friends, a beloved of ours was buried today, we visited KSC, a Great bar and restaurant, we all had a great time shouts out to Armando!, our great waiter and Dave, the owner! Food drinks and dessert were thoroughly  enjoyed by all!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4djhXN0FREAE",
            "text": "Came in late tonight and was so surprised by this little gem. We had the cherry pepper wings to\nstart and they were absolutely perfect.  Next we had the Brussel sprouts  also…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoanVpZU9REAE",
            "text": "Best quality pizza in uptown NYC!!! Second to none. The environment is also very friendly and chill."
        }
    ],
    "reviews_count": 79
}