{
    "name": "Sazón de Mela Restaurant",
    "place_id": "ChIJBU_Um7H1wokRSwyTgEUMKjc",
    "grid": "BX3",
    "address": "1692 Webster Ave, Bronx, NY 10457, USA",
    "rating": 3.7,
    "user_ratings_total": 51,
    "phone_number": "(929) 266-3473",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdmIxQnVNMFZNWlhoUWNFaDRNRkl0YTA1MldVRRAB",
            "text": "The lady was very rude , she was not patient at all. I had some questions and she was getting upset , the food is amazing but the customer service is horrible ."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONmVXeGtjM3BqUzA5RGMwZEdaMDU0WlhoRVZWRRAB",
            "text": "el.pernil muy Malo  pedi un jugo de naranja y me Diero uno de chinola  muy Mal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQYlhoZnpxaElXRGxRRRAB",
            "text": "Terrible service, gave out dirty forks, and spilled a drink all over my phone ! Absolutely disgusting. They didn't even apologize for my phone damage, Absolutely unacceptable."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU3F4UG5TNmQtOXVBRRAB",
            "text": "Me gusto mucho"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NDRQNnNBRRAB",
            "text": "I had white rice and beans and grilled salmon. Delicious! The waitress was so kind"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOTkzSWxnRRAB",
            "text": "La comida muy buena y el servicio fue amable excelentes."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHNESk5nEAE",
            "text": "Compre un almuerzo sencillo con una malta para llevar. Resulta que según el cajero me deja saber la cantidad. Son $18.50. Yo le pregunto pq tanto. Que por la tarjeta que cobran un 4%. Cuando miro el recibo dice $20.39. Como si yo hubiese recibido servicios de meseras o algo por el estilo. El problema es que me dice ante de los 18.50 q es por la tarjeta. Dige ok. Cuando miro el recibo me asaltaron cobrando me 20.39. Y para acabar de completar el restaurante se llama el sazón de mela. Y el recibo dice Rancho Dominicano. Mi gente verifiquen bien antes de irse de los restaurantes. Para mí se quemo. Rogándole un poco a cada uno de los que se paran en ese restaurante."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaHJ2S1VnEAE",
            "text": "Not sure why others were complaining but my experience was wonderful.  The service was great the ladies were all very sweet and attentive. Food was delicious and their natural juices were the best natural juices I've tasted.  Food also looked and tasted very fresh."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOTlYalpBEAE",
            "text": "Me encara todos de hay la comida muy buena con excelente sabor lo recomiendo…❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bVluRnVnRRAB",
            "text": "20 minutes wait after i order to receive my food. a long trip home later i find no salad with my combo, undercooked steak, over cooked chicken and the sorriest excuse for  beans a can ever held. you guys have to do better"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydGJLMkF3EAE",
            "text": "Baked chicken is probably one of the easiest things to make, The chicken looked good. But it was so dry and rubbery And was missing \"sazon\"... Nice people though"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNXJqZ3NnRRAB",
            "text": "Disgusting & the service is even more distasteful. The woman will shout “hey!” to get your attention due to her lack of customer service & then hand you food that tastes like everything else they’ve cooked on the grill. $6.80 for a bacon egg and cheese on a roll when i could’ve just licked their grill & had everything on the menu. Would not recommend. Disgusting."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOHNUZzBBRRAB",
            "text": "Muy buena comida y buen servicio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6amZYMzNnRRAB",
            "text": "Great service and food, Traveled from Ct. With family. Yes I would visit again and recommwnd to friend and family.\nThank you for your servicio Elizabeth."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMWNiT2Z3EAE",
            "text": "La comida mas horrorosa que me he comido es esa y aparte cara. El pollo seco el pernii tambien .no vale la pena"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqXy1Hd2tnRRAB",
            "text": "Service was horrible. We got there when it was empty. I ordered mangu and my friend ordered a bistec with veggies on the side. Other parties got there after us but got their food first. We might’ve waited 45 mins for this food. Our server wasn’t apologetic at all when I finally got her attention to ask about where the food was, nor did she explain why it was taking so long. Will not be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNmVHM19BRRAB",
            "text": "Nice presentation"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdXJiaVVREAE",
            "text": "This place is incredible, i went with a few friends and we have a great moment. The food was so tasty"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdXVMcFl3EAE",
            "text": "Muy buena comida 👍🏻…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cGZEQTF3RRAB",
            "text": "Compré un servicio grande y uno pequeño y me salieron al mismo precio el rabo de res solo era huesos y el servicio pequeño era cerdo con yuca y solo fue un pedazo de carne lo otro era grasa no recomiendo este lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0azdPZDB3RRAB",
            "text": "They pork is dry when you ask for a combo with rice beans they would mix the meat with chicken don’t know why"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLXFYXy1BRRAB",
            "text": "I came here to get a coffee this morning 12/12/23.\nThe lady is nice but speaks very little to no english so I could not explain to her that the milk she put in the coffee is sour and has gone rancid.\nPlease do a smell test on your coffee or make sure to taste it in the store before buying."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGc2RlaS1nRRAB",
            "text": "Muy buena me tomé una sopita de pollo sabrosa 😋😋😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNack1iNjNBRRAB",
            "text": "No, not it' isn't good, prices are too high, I ordered a lunch, 'chofun this is a Chinese style food, mix or scramble old cooked food from day before, all of them with ogly face, they use same teaspoon for all service, and they charged me $ 15.00 dollar for a lunch, no good I will no recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2RtN3p3RRAB",
            "text": "I have visited this restaurant a couple of times The food is good And the price  It's right. I stop there at my lunch\nTime couple of weeks Ago."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbk9uRHpBRRAB",
            "text": "Service, food, & quality were all AMAZING! Just so happened to stumble upon this restaurant this morning and it was the best decision of the day. The breakfast was delicious & fresh! Definitely recommend if you’re looking for a quick bite to eat & I’ll surely be back myself!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOGQteUNREAE",
            "text": "La comida estaba horrible!!! El lugar es muy agradable pero de nada sirve si la comida es pésima, no volvería ni aunque me regalaran la comida."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NzZPb0h3EAE",
            "text": "Cross cotamination at its finest.  They used the same serving utensils for all food. Pork chicken beef everything."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNF96Vjd3RRAB",
            "text": "Siempre me ha gustado la comida, un total 100 % de todo lo bueno."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa3Z6ajZnRRAB",
            "text": "Buen servicio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM3JYNjZRRRAB",
            "text": "The food is not good at all"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycHF6RDhnRRAB",
            "text": "I order two chicken wraps with French fries from this restaurant in early morning.  They had not started cooking yet but the very nice lady still prepared them for me. I really appreciated that and had to give a review.  The ladies working here was very nice and me and my friend enjoyed the food. They have a variety of choices on the menu.  The place is clean. There is also an ATM machine on premises"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcTkyY0pBEAE",
            "text": "Acojedor  barato y mucha atencion"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMVlLeENREAE",
            "text": "They tried but the don't have enough staff to provide a decent service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dHFTUGhnRRAB",
            "text": "Great food and service. You won’t be disappointed. And they deliver with a smile."
        }
    ],
    "reviews_count": 35
}