{
    "name": "Ann Clair's Salumeria",
    "place_id": "ChIJQ56TzKj0wokRQBOREDBn9dA",
    "grid": "BX3",
    "address": "1130 Morris Park Ave, Bronx, NY 10461, USA",
    "rating": 4.6,
    "user_ratings_total": 478,
    "phone_number": "(718) 409-1171",
    "reviews": [
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMWEtLTRnRRAB",
            "text": "Overpriced!!! EVERYTHING  hero ham and cheese. One slice chz, two slices of ham. Tiny dot of mayo and tomato ends, shriveled pieces of shredded lettuce. Asked for seasame bun, got plain. Took 10 mins, employee too busy talking with staff.…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YWFVeHJhM2x3WVhOUGJWUk5OR2hHVFdSUWIxRRAB",
            "text": "The best sandwiches, salads and coffee.  Everything is so fresh and they are generous with the food. Everyone is always pleasant. Happy 😊."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TlYwRjVUVFUxTW5kUVpXZDNZbVU1TjA1alJrRRAB",
            "text": "Paid $13 for breakfast platter w bacon 2 eggs and potatoes, I felt I was cheated out my money. Didn’t finish, soggy and greasy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMVRpMUdXa2RVTlRWaE4yTmhaMkkyZEZaemRtYxAB",
            "text": "Overpriced sandwiches.  24 dollars for two sandwiches on rolls.  Small amount of meat.  Stale bread."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3OGNpMTdBRRAB",
            "text": "Great food, the breakfast egg sandwiches are amazing. The rolls are amazing. Good place for lunch also"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU3A2Nmp0MXJXVGFREAE",
            "text": "ordered food from this place for my son’s birthday, and everything was great! The service was excellent—very responsive and professional. The food arrived right on time, which made everything run smoothly. Everything was fresh, tasty, and a big hit with the guests. I really appreciated how easy the whole process was. Would definitely order from here again for future events!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNkstT3R3RRAB",
            "text": "Best BEC on Morris Park"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d3RmclNBEAE",
            "text": "Just had worst sandwich ever ordered Italian combo no Roasted peppers no oil & vinegar just meat and a bunch of lumped up provolone I was starving and extremely disappointed sandwich was made with no love whatsoever and it cost 15.00"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cHNYMW5BRRAB",
            "text": "Yesterday was the second time I stopped in for the Meatball Hero with a little grated cheese and like the first time I spent the whole day thinking about it. It was possibly the best sandwich I ever ate. Unbelievable! Don't change anything it is perfect."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdzhHcXR3RRAB",
            "text": "The BEST Italian heros and food in general.  We've been going here for over 30 years and have never been disappointed.  Catering is excellent not to mention the staff.  Everyone associated with this establishment is amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dEtHZGhRRRAB",
            "text": "FIVE STAR! ITALIAN HOT PLATES OFF THE MEAT RACK!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OHVTMWFnEAE",
            "text": "I recently had the pleasure of using Ann Clairs Salumeria for an event, and I couldn't be happier with the experience! The cold cuts were fresh, flavorful, and beautifully presented, while the salads were crisp, delicious, and offered a delightful variety. The attention to detail and quality of ingredients truly stood out, making our event a memorable one. The service was top-notch, with prompt delivery and friendly staff who ensured everything was perfect. I highly recommend Ann Clairs Salumeria for any occasion—your guests will be impressed, and you'll be stress-free knowing you're in great hands!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdzViVDhBRRAB",
            "text": "Have been coming to Ann Clair's for years, never disappointed. Always great food and friendly service."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNUx5RGl3RRAB",
            "text": "Everything you could want in an Italian deli with a neighborhood flair and pricing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueUxTODVnRRAB",
            "text": "Clean feeling deli with lots of drink options. I called in for an order. It's an Ok sandwich. Even though I called in for pick up they did not keep the hot sandwiches warm and they kept  them with the cold sandwiches. Which meant that my sandwich was not hot at all, others were warm. Overall its ok. They don't have seating inside, it is a take out place. Staff was friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueEtQdE5nEAE",
            "text": "Bacon egg and cheese was the bomb! The roll made all the difference. Love the tuna salad and coleslaw. I used to come here years ago, then was reintroduced in recent months.This place is a Morris Park institution😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcC0yYnFnRRAB",
            "text": "Let me start by saying that the Party sub I ordered, was the talk of the event.\nQuality of product was superb!!! Customer Service excellent. Thank You!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbW9fR2ZREAE",
            "text": "It is one of the best Italian deli in Morris Park, Bronx area. I've been a customer of Ann Clair's for the past 24 years. I continue to be a customer for their quality of food, service, and their genuine support for the community. It is a family owned and managed establishment. They know their customers, old and new by name. My favorite go-to-items are: hot and ice coffee, apple crumb muffins, Italian hero, eggplant-mozzarella-tomato-basil hero, sausage & peppers hero, chicken cutlets and vodka sauce. Recommend to try their menu if you're in the neighborhood 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyejVhcG1RRRAB",
            "text": "Best place for a sandwich. They are not cheap but they will load your food too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeXNHX193RRAB",
            "text": "It's still the same like fourteen years ago. I retired. People are still friendly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobTRUSEVnEAE",
            "text": "Great place for Italian fare. All sandwiches for breakfast lunch dinner.  Hot foods as well. Italian specialty is their Forte. Make it a stop on your list. Opens 6am"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdDY2cG1BRRAB",
            "text": "Great Deli!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbmFYM0tBEAE",
            "text": "This is a neighborhood staple. It's been here for years serving the community and has and never will let you down.\nThe sandwiches here are amazing , they are packed with fresh ingredients and flavor. The guys behind the counter cooking are fast, attentive and care about your order.\n\nA few stand outs are their sandwiches; the Godfather and the Godmother (you won't regret it) their Italian sausages you can buy to cook at home, their home made vodka sauce and their freshly daily made muffins.\n\nMust try if you want to experience an old Italian deli doing it the same way for 100 years!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENUxyWFRnEAE",
            "text": "No meat on the sandwich"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dHZfUC1BRRAB",
            "text": "Great place to get your cold cuts and the cutlets are thin well breaded and surely a delightful pair with fresh Mozz and marinara and the employees are kind and happy to be at work. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MnFyRmtRRRAB",
            "text": "I came here for the first and it will be the last for sure over priced for a sandwich 10.83 that has nothing not even lettuce or tomatoes I'm better off paying 10.83 for a sandwich at Monte's grab and go you get your money's worth there. Don't bother coming to Ann Clairs Salumeria overpriced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OFlHNkhnEAE",
            "text": "When I crave a lunch sandwich, I think of Ann Clair's. Everything in their menu is 5/5. Even the cold salads that tend to be mediocre everywhere else."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbi1Yb09REAE",
            "text": "The food was great! Will place all my oder from there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaDVUWHRRRRAB",
            "text": "Quick,friendly service. Food is always fresh,great variety"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWck5lSEV3EAE",
            "text": "Lots of Italian specialities!\nStaff service is exceptional!\nIt's definitely a neighborhood  favorite.\nDeli sandwiches are excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeU1hc0tREAE",
            "text": "Excellent place with delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNjdTSzZRRRAB",
            "text": "HANDS DOWN... ANN CLAIR'S IS THE BEST!! THE FOOD ALWAYS HIT DIFFRENT WITH EVERY ORDER! IT'S ALWAYS FRESHLY PREPARED WITH FRESH INGREDIENTS. THE PEST MAYO TASTE AMAZING...IT SHOULD BE PUT IN A JAR AND SOLD.... :-)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaal9iZHV3RRAB",
            "text": "Awesome sandwiches!!!"
        },
        {
            "date": "2년 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabXMyWndnRRAB",
            "text": "yum yum yum"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX2VIdEx3EAE",
            "text": "Ordered the Godmother sandwich. Taste great along with some fresh Mozzarella. I took some for my buddy in CT. Great place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa2VyblZ3EAE",
            "text": "Nice clean store, sandwiches made to order, they use the Boars heads meat. We would definitely go there again when in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa3EyNjJnRRAB",
            "text": "Great wraps good wholesome food"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdHAzd0VREAE",
            "text": "The Service is Great and the Food is Unbelievable Great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbXNHaldBEAE",
            "text": "The best Italian spot to get cold cuts and sandwiches and fresh mozzarella"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNElXZmlnRRAB",
            "text": "This place is not good with sandwiches. The grilled chicken is seasoned horribly, o don't know who chooses that flavor bit that is not it. Also they do not toast the bread. Who makes a hot sandwich with untoasteted bread? The bread became…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNGYtMlF3EAE",
            "text": "Great service! And delicious food. I got a 3 foot,Italian and eggplant Supreme. Half n half. It was just right for our picnic. Go here for an authentic Italian Deli."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKczZHQWV3EAE",
            "text": "Top notch ITALIAN DELI. Keyword. If you go here and order a ghetto chopped cheese or cheesesteak you already show how ignorant you are. Get a chicken cutlet or a Italian combo and show some class. 🏆🇮🇹…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKc19ETThRRRAB",
            "text": "Great Food !! Great Staff !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaHA3TXpRRRAB",
            "text": "Great food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dW9UbGFBEAE",
            "text": "Great food great value and great people"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MU8tOUh3EAE",
            "text": "I've been going to Ann Clair's before even knowing the name. Their chicken parm hero is the best and the staff and owners are the best. The place is always clean! This is a diamond amongst diamonds!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdG96T2d3RRAB",
            "text": "This family owned business has been around for many years.  The owners and staff are very kind and friendly, the deli is always very clean and the food is always fresh.  If you're looking to cater an event, I'd give Ann Claire's a shot. They will not disappoint. 5 stars is not enough. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbWZuTE93EAE",
            "text": "My pregnant wife insisted on this place for meatballs and I got the meatloaf with seasoned bocconicini. One of the best meatballs and meatloaf I ever had, took me back to my childhood like Ratatouille with one bite."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0MXQ3SE1nEAE",
            "text": "Morris Park..Sweet Morris Park..like thr world famous Arther Ave another ITALIAN çommunity in the BronX. Ann Clairs to the Bronx is like Juniors To Brooklyn. I personally enjoy the breakfast sandwiches..but im a chicken cultlet and chesse on a hero guy.. The selections is BIG. I think they have 50 foot heros for events..and outings..I enjoy looking at the family. Family is everything. I remember many years ago when my family was one of the only Black families living in Pelham Parkway and we ate at Ann Clairs the first time. Hilarious. Forgive the sandwich. I was hungry. No mercy. 4 stars. Salute.\n100 years from now.\nFarakhan Norris , Producer\nNobe Black Billionaires\nBrooklyn Free Speech TV\n647 Fulton Street, Brooklyn NY"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScl9fanR3RRAB",
            "text": "I wish I can give them 0 stars because 1 is too much for this place where they use no gloves and make tuna in a roll with nothing on in even dough you tell them can please have tuna in a roll with everything on it very disappointed I work…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdmFySndnRRAB",
            "text": "These guys have a little bit of everything at a good price. You might think the price is a little high when you first get there til you realize how fast the service was and how good the food is. They make whatever you want, just how you want it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4Z2Q3ZWRnEAE",
            "text": "Well, I will say, that even though their delivery was an hour late, the food was absolutely delicious.  We ordered subs - the Italian combo and the eggplant supreme.  The bread was so soft and fresh.  The sandwiches were generously made…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdTRfU2pnRRAB",
            "text": "Located on busy Morris Park Ave, there is metered parking out front and street parking down other blocks. This deli has been around for years and hasn't skimped on the quality of the food along the way, like most businesses.  They specialize in Italian food. Many items are made on site.  Salads, hot food,  butcher items and sauces are just some of the things they offer.  Catering is also a big part of their business. Beware, that as with everywhere, their prices have gone way up, but quality ingredients cost even more.  Staff are friendly and eager to please.  Owners are usually on site, which to me is a plus. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbXFfTUtnEAE",
            "text": "The food is fresh and the service is top notch. From when you walk in the place the staff and even the customers are friendly.\nThis place has been in business for over 30 years from when I started going…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdFphNzBBRRAB",
            "text": "Ann Claire's is my absolute favorite deli in the BX.  I treat myself whenever I'm in the area.  the sandwiches are fresh and huge!  The staff are super friendly and the food is fantastic.  A sub here is bigger and less expensive than any Subway!  A neighborhood treasure, hon just in Morris Park but the Bronx as a whole."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPODQzNnJnRRAB",
            "text": "Best deli. Fantastic sandwiches. Excellent fast accurate family run service. Great tortellini salad. Good cookies. Has a decent variety of soda, chips. Highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaUtELW9RRRAB",
            "text": "I stopped in on September 2 to buy a Godmother sandwich and the tomato salad. They both were delicious. However, I am giving a 3 rating because they have a sign posted that a 3. 5% service charge would apply if you are paying with a credit…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMzdQal9BRRAB",
            "text": "I'm a vegetarian, so when I go and get one of their amazing sandwiches, they always clean their machines, tabletop and sections also changing their gloves before handling my food. I appreciate their cleanliness and freshness. Best Italian sandwiches in the Bronx. Keep up the great work !"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3dUtySGxnRRAB",
            "text": "The food is top quality, there are packaged home made meals that are perfect for a tasty take home lunch or dinner. The many choices of amply stacked sandwiches will stand to satisfy any one's desire. I especially enjoy the bacon or sausage…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeXF5M2hRRRAB",
            "text": "Their food is delicious! We got the party for 25 catering package twice in one year and it is definitely worth it. We fed over 40 people both times! We will continue to give them our business for future events."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdk5EZVRBEAE",
            "text": "Good deli food. From antipasto to zucchini 🥗 salad and everything in between. It's all here at Ann Claire's. It's a very busy place and waiting to be served is something you need to have patience for but the staff are attentive and willing…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzMllUM0lREAE",
            "text": "One of my favorite places to eat when I’m back home visiting The Bronx!! I’ve know these guys since playing paddleball at Loretta Park in the late 70’s!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5aXBQMlVBEAE",
            "text": "We usually go here to get our hero sandwiches. They make a great sandwich & we get our cold cuts as well. Their bread is really good & very importantly they accept credit cards. The staff is very nice."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4dy16S3NRRRAB",
            "text": "So not happy with Them. They now charge you 5% to use a credit card. They charged me $1 for cheese even thought all the other sandwiches had cheese. I’ve been buying from them for 30 years. We cater from them for my home events and church…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdFB5Y1RREAE",
            "text": "Elitist mentality of the owners permeates throughout the deli. Your food is pretty good but your personalities are *rotten*. (I’m specifically talking about the small short haired woman) Hats off to the cooks keeping the place going. 🎩 Must…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMl9XSUhnEAE",
            "text": "They lost there skill in being the best . Ordered   almost 50.00 dollars worth of food to get sub par quality.  Wow. Over stuffed cornbeef had 3 slices of meat on rye for 9.00 bucks Did i miss the over stuff or they kept in there pocket . Ordered a Salad with grilled chicken 13.00  looks like something out of a street corner store. Can't even say that because they probably have better . I seriously don't understand if I wanted expensive food with not quality or care there was other places. I know they won't be getting my business again\nIt's ashame .... can't believe this is what they are putting out and charging.  Stick to sandwiches I guess if that\nGo to Battaglia's  on Eastchester rd you get quality and quantity for there prices"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcC1id3dnRRAB",
            "text": "I am originally from the Bronx and was hosting a party downtown. Looked at lots of delis down there with mixed reviews and outrageous costs. Thought of Ann Clair's and thrilled I did. Tons of food, raves from all guests and half the cost...…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NHNyX0tnEAE",
            "text": "Ann Clair's on Morris Park Avenue in the Bronx is the best Italian Deli.  There fresh ground chopmeat and homemade sausage are delicious.   Their vodka sauce is the best anywhere.  My husband and I have tried vodka sauce from other places but Ann Clair's is absolutely the best."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpa19PSi13RRAB",
            "text": "Always the best, freshest food. Service is awesome. Never failed to provide safe  service and adherance to distancing and plexiglass protection guidelines, all throughout the pandemic. Ann Clair's is one of the best reasons to stay in, live in or visit the Bronx!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcGF5eU5nEAE",
            "text": "Great breakfast sandwich and coffee but the service is soooooo slow. Got my sandwiches very fast, buy the time the person at the register rang me up coffees and sandwiches were cold. Only 2 people ahead of me, waited 20 min to ring me up.…"
        }
    ],
    "reviews_count": 70
}