{
    "name": "Sabrosura 2",
    "place_id": "ChIJ2ekR-en0wokRZp4LFKEtCGM",
    "grid": "BX3",
    "address": "1808 Westchester Ave, Bronx, NY 10472, USA",
    "rating": 4.3,
    "user_ratings_total": 2236,
    "phone_number": "(718) 502-9878",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMGNuZDFTbVJHT0VKUE5ubFdiSGRZU0VWdVdFRRAB",
            "text": "So I did enjoy my steak,  but just wanted it a little  thicker next time.  Everyone  at my take seem to enjoy thier food with no complaints...Nice c atmosphere  also."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM00yRk9jM05YY0VKcGNVdE9ORWhMYlVFMlgxRRAB",
            "text": "Love coming here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTmNHMWtTSEV0UVdwcVIyRmlOMlZVYTNoWmVWRRAB",
            "text": "Nice and spacious. Food appeared good.  I will say no flavor.  I had chicken wings and when I asked for plain.  I got plain.  No seasoning on the wings I order pepper steaks with yellow rice.  Pepper steak was ok.  Lack flavor. Rice was as plain as yellow color rice can get.  Again no flavor I should have just asked for white rice.  I was expecting something different then just rice with color in it.  Then other plate my co worker enjoyed but he said they churasco was slightly over cooked. He said it was ok,till when the waiter came with the check. He told us not to put the tip on the check.  I paid with card.  So I gave him what I had in cash which was $3.  He could have gotten more. I assume he was trying not to share his tip with the others.  Price was good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWlNqZ3RkakkzYjA5a09FVjRYM0pRVjB4VVVHYxAB",
            "text": "The rice was to hard and very little shrimp u can't see the chicken to much bacon in rice more bacon than anything"
        },
        {
            "date": "수정일: 1달 전",
            "language": "gd",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneFliR3dnRRAB",
            "text": "Their Tostones a la Vinaigretta are great and Chofan Latino."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMGJFNUlhM3BXY3pkNVNteFpNRGR1UlUxT1JYYxAB",
            "text": "La comida excelente!!! Una recomendación no dejar quemar mucho la salsa de soya con el arroz!! El resto excelente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFJWRnFXamQxTjJWQldrbEZUbHBYZG5rMlkwRRAB",
            "text": "We asked for mofonguitos they stated they did not have but the table beside us for an order later on… my chicken was black and cooked probably on an old pan. I’ve been to the other location and had a great experience not sure what happened."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa00xUTRWSEZRYjI0d1JHNUxRbFZCVG1SRWJIYxAB",
            "text": "I went thinking it would be good the Chinese egg fried rice was dry didn’t taste good at all pork chop was over cooked and hard….. had no flavor..\nI also bought chicken wings thinking it would be regular wings that you get Chinese instead the gave widgets . My niece or aunt did not like it .. place is over price … should tired the Spanish food maybe I would have enjoyed it I would never ever spend my money in that place and those that do like the Chinese rice must have no taste"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcDlTYzVBRRAB",
            "text": "Some tvs with sport should be cool\nFood is good\nService is good\nParking hard in the street"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cGVuRldWVFpKYkZKRU4zZ3hUMU42YmpsWFMyYxAB",
            "text": "The food is great 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVWEwWXpaSGxGTmpFdFFqSmlUMFJhZHpCcUxXYxAB",
            "text": "Food is good."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdWN2c3d3RRAB",
            "text": "I love sabrosura. This one is my favorite location because there's almost never a wait time. The food is always served hot and fresh! I had shrimp tostones, first time trying it here and so happy I did! It had pico de gallo and avocado, the chicken fried rice is my fave and a must when I come here. The wings are fireee! We always get bourbon sauce for the wings :) oh the yuca fries are a must."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMldGVkxkMnRtTTBaRVF6bEpjRGhoVkd0QlNrRRAB",
            "text": "Demasiado  costoso para estar en el Bronx !!!!!!  Y en un sector que nada que ver 😒😒😒"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNVoybEVOWGR1WVVkNGJscHFWR2RhYWxrNWJHYxAB",
            "text": "Been checking out this place for a while now. It’s local to one of my offices and I usually go pretty routine with my orders, like the steak with fried rice. I tried the spicy chicken this day, and let’s just say, stick with the classics. Definitely check this place out, Chino Latino food is one of the spices of life"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NmVWSmFXRm94Vld4UU0yWkViMWRmYzBOaWFsRRAB",
            "text": "Muy buen lugar"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNM1N5NnpvLVpITTh3RRAB",
            "text": "La comida muy rica, un ambiente agradable para compartir en familia, excelente servicio"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLZXk2XzNtcTd1SEtREAE",
            "text": "My first time here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMlIxOTVVVk5RUVhwVWN6RkpaMGQ0ZW1SdFVWRRAB",
            "text": "I love the marisco chofan!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYVRuOUthdDZlZHB3RRAB",
            "text": "Our absolute favorite restaurant in the Bronx! The Chofan Nuevo Latino has its consistent taste and we always get an order for the table to share. It is family friendly, you cannot go wrong with any of the items on the menu and its more spacious than the original spot on Castle Hill."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPdldoUEtmdVBHeTVRRRAB",
            "text": "There is no hand soap in the men restroom."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb3JDZUp3EAE",
            "text": "Great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaUluZldnEAE",
            "text": "Greatest food would recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveDV6ekZ3EAE",
            "text": "First time here. Nice place, large portions. Food is flavorful. The fusion with Spanish food and Asian is nice. Everyone is friendly. Place is bigger than I thought.\n\nCould be a family friendly place or even a date place. You’ll leave satisfied with your food.\n\nWill come again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFo3WnpRRRAB",
            "text": "very place always good food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcHFPY1dBEAE",
            "text": "Everything is great when I eat food here.  Chill spot in The Bronx. It's an open secret the food is the BOMB."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMHF2MExnEAE",
            "text": "Good food at a decent price"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z3VlcHlRRRAB",
            "text": "Excelente comida"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRemJYcFpREAE",
            "text": "Took my wife there as a surprise and she LOVED IT"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdlAyalNREAE",
            "text": "Been coming to Sabrosura for 40 yrs. From the original at Castle Hill to this one now on Westchester Ave. Simply the Best"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbUlqS0F3EAE",
            "text": "Q rica comida tan deliciosa me encanta este lugar ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNllyZGpBRRAB",
            "text": "This past weekend, I ordered from this establishment for the first time in years. My family and I ordered the chinese soup, chicken lo mein, and chicharron de pollo sin hueso with plain fried rice. I placed my order through Uber Eats for pickup. The app made the process a bit confusing because although the order of chicharron de pollo was supposed to come with pork fried rice, I wasn’t allowed to select pork fried rice on the app.\nThe food was very delicious as everyone was happy but there were two little issues. The first issue was the overcooked noodles in the lo mein. The second issue was the quantity of food in the chicharron de pollo. The order of chicharron de pollo came out to $22 but the take-out container was not full. I have always had this theory that restaurants give less food for their take-outs than in their dine-ins.\n\nI would give this restaurant another chance but I would definitely dine-in."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWFPWGhRRRAB",
            "text": "I go to both locations.. The food is great. We don't go anywhere, but we go there. We have the bass fish on the bash fish with c*** meat. Delicious and hot dishes😋😋😋Add the hot toast bread with garlic."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc1lpRllREAE",
            "text": "No Good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNDhhLWNnEAE",
            "text": "I placed an order for delivery; tostones vinaigrette with diced tomatoe, onions, and avocado. What I got was tomatoes, onions and guacamole drenched in vinager. I live far, by the time I got home my food was spoiled. If I wasn’t hungry I wouldn’t have tried to eat it.  The food quality at this place is no longer the same. This is what happens when you hire inexperienced lazy cooks. Here’s a photo of this discussing food I had. The guy who prepped my food name is Mathew, probably a fake name, good luck with your food when placing an order! The tres leche cake, I don’t even want to get into that nasty order as well."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMzhfZFJREAE",
            "text": "Great food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbFpua09REAE",
            "text": "I used to enjoy the dishes here. Now? It lacks flavor and apparently when you order for delivery, the order is not correct. Ordered house special fried rice- received pork fried rice. Requested duck sauce (in notes) and no utensils, received a fork and no duck sauce. Now I have dry chicken and the rice I didn’t want. Nice smh."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBX2ItRk9nEAE",
            "text": "Awesome restaurant with great tasting food. Great time to go is during lunch. They provide garlic buttered while you wait for food. Reasonable prices. Clean restrooms. Metered street parking."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaC1PSHpnRRAB",
            "text": "Food extremely oily. Can't even enjoy the taste of the food."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dF9tM2l3RRAB",
            "text": "Muy mala experiencia el pescado frito que pedi tenia sabor a podrido.\nNunca regresare a ese lugar"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbkt5Z2VREAE",
            "text": "We had diner around 7:30 pm with a large group of our friends in which we had to take six tables. We all ordered different dishes and we ordered all types of House special fried rice (chow fan mixto).  Everything was rich with flavor and…"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ekxPTk9REAE",
            "text": "First time visiting the food was excellent they give you a hefty portion, the price was awesome for the amount of food they give you. The Atmosphere was nice little music playing not to loud, very laid back. I shall be return."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNb19yNDNRRRAB",
            "text": "Tasty food , broiled lobster any way u like.(try ginger glazed Lobster).\nALCOHOL Drinks are on point ♡clean establishment , perfect seating space for family groups or any gathering, the best spots for date night. Music selection…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMk5iNVNnEAE",
            "text": "The portions were great and the prices were spot on. I didn’t love the MOFONGO and I was excited that it was on the menu but disappointed ;I took it home and made my own sauce with garlic and it turned into magic . The yuca stuffed bowls…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNFB2YnZRRRAB",
            "text": "Santos/ Sanchez was a great waiter! I can’t remember his name lol that’s how good the drinks were. Amazing customer service!! Can’t wait to go back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNF9xN2x3RRAB",
            "text": "Update****The food was so good I came back for more!!! This time I had my husband with me. We ordered the boneless bourbon ribs with house special fried rice and skirt steak with chicken fried rice combination platter. O. M. G. The portions are HUGE. Each combo is enough food for two people. We had alot of food left over and gladly brought it back home to enjoy later. We love this place, and will be back!\n\nWhen I walked into the restaurant the fusion of spices engulfed my nostrils. I knew we were in for something spectacular. The aroma was inviting and I couldn't wait to sit down and see if the food tasted as good as it smelled. The food was brought to the table expediently and was superb! We ordered Virgin Pina coladas and they were milky and smooth. Not like those horrible Pina Coladas that are made from crushed ice and cheap store bought mix. Get there early because it gets crowded fast and make sure to bring a good appetite. Don't be surprised that you have to wait for a table because it's a popular place"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTMEp2RG5RRRAB",
            "text": "Skeptical with delivery at times but this was a good choice. Portions are very good along with flavor...everything had flavor and neatly presented. Guacamole and tostones were delicious, i wish i ordered two servings. Pina Colada was just 👌…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNoallWeRAB",
            "text": "This place was a new way of dinning. Fusion at its best with Pizza, American, Hispanic and Chinese foods all in one facility. Plenty of seating, fast service, and the food was the best I have had on Westchester Avenue. Although the atmosphere and cleanliness could use some work I was still satisfied. I had the Fried Shrimp (4) with Pork Fried Rice (4) and a small side salad of lettuce and tomato. The hot tea failed at a (2) it just had no taste. The portions were very good and the flavors were there as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILWNMNU9nEAE",
            "text": "Placed a DoorDash order for chicharrón de pollo sin heuso and this is what I got . A steak 🤦🏽‍♀️. I don’t eat beef. Workers need to pay attention when packing customer orders. I had to spend my lunch arguing w DoorDash about Sabrosura mistake.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFOElxdE1nEAE",
            "text": "Absolutely love Sabrosura. Best Chino/Latino in NYC IMHO...\n\nWe always eat at Sabrosura 2 on Westchester between Beach and Taylor Ave.\n\nFood is always delicious.... Service is great."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cW9POXpRRRAB",
            "text": "La verdad que el lugar se muy agradable y demás pero la comida no me ha convencido las veces que los e visitado más bien tampoco el servicio de los meseros nunca está  pendiente de si quieres más de tomar o necesitas alguna otra cosa... Aquí les dejo las fotos de lo ultimo que ordene en mi última visita..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxLUttakNREAE",
            "text": "The food here is excellent, and generous portions. There is a wide variety of Dominican, Chinese and Japanese dishes.    My dish had a nice balance of spices, not overly fried. Be prepared to wait as this is a very popular restaurant."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNb2FxSzVRRRAB",
            "text": "Great tasting food all the time. Been going to the original one since I was a child. This one is NO different in quality and taste. Just a bigger space"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxLUszb1d3EAE",
            "text": "Food was delicious. Done very quickly and in a timely manner.  Waiters were working at a thousand. Short on staff. Place was packed!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzenB1M3B3RRAB",
            "text": "This restaurant is pretty decent for the area. It has Hispanic food, and Chinese. You don't have to tip due to certain Chinese customs.    There is a sign saying so. They do serve alcoholic beverages. I had a Churrasco  with Yuca fries, and I devoured it. The Tres Leches is delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNXVfMDBBRRAB",
            "text": "Lots of different options to choose from which consisted of Dominican and Chinese inspired food. With big portion sizes you're definitely going to need a box to go. If you're in the area go check it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdUtpRWhnRRAB",
            "text": "Went to new york sabrosura restaurant in bronx . Place was clean nice crowd food was delicious and was served fast . Love the guacamole stuff plantains"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhelBEUHl3RRAB",
            "text": "Food was phenomenal!! Came out STUFFED!\n\nFlavors are always rich!! Had shrimp in butter-garlic sauce with rice and beans. Comes with a salad. Avocado was additional."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNk4yWjJRRRAB",
            "text": "The food and the customer service is amazing and the ambiance of the establishment is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa1B6eDlnRRAB",
            "text": "Okay so the place wasn’t pack which is good we was sat right away but never served any water only bread which was ok, the meal\nI order was steak and pork fried rice and the steak was overly cooked where it had some charcoal crisp to it but still tasty , the rice was horrible it tasted like a blob of bland white rice smack with soy sauce  no eggs or bean spouts only had chopped onion and pork which is not the case for pork fried rice so not worth it being your money elsewhere !!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNEtmWEhREAE",
            "text": "Sanchez/ Santos was my waiter at the time. He was attentive to our table to make sure everything was fine and any refills. The drinks were delicious (they'll sneak up on you). The food was fresh and fantastic. I love the fusion of Spanish and Asian cuisine. The place was clean, and the atmosphere was cozy. I'll definitely return here again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVb3F2V0JnEAE",
            "text": "Surprisingly good. Very few downsides. Too much food may fall into the downside section because everyone was so full. The mix of Spanish and Asian worked well though."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdWZqeWJ3EAE",
            "text": "The food and atmosphere is always great here. The restaurant was very clean and the service was very good."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwb01uNlhREAE",
            "text": "Rica la comida , limpio , es grande el lugar , hay sillas para niños , entrada a sillas de ruedas , se ve  bonita o decoración , el parqueo  es difícil para conseguir ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtXzlPV1lnEAE",
            "text": "The food here is alright but could be better & taste better. Check your order before leaving to make sure they put everything you paid for in the bag cause they left out some things I paid for & it also happened to other customers. I think the Castle Hill location is better."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMG9EdDZBRRAB",
            "text": "I have tried their Chicharron De Pollo and Bistec Palomilla with pork fried rice and house special fried rice with tostones. Both tasty meals I highly suggest. What I don’t suggest is their fried shrimp.. barely any taste and they it doesn’t come with tartar sauce!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjMXFTWDZnRRAB",
            "text": "Well price, excellent service, and outstanding food. If you're interested in Latin/Asian fusion, this is the place to go. Definitely worth checking out."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdTUyUGRREAE",
            "text": "I absolutely LOVED this place and their Huge menu full of amazing options. I've always loved Latin food with an Asian fusion blend and Sabrosura has it all. I found it because I was looking up Mofongo in the area and their Camarofongo DID…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX3Rha2d3RRAB",
            "text": "This place is not that fancy...but the food is Incredible. The service is good and the environment is cool and very very clear(alot of light)...👍👍👍👍👍…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweE9tNGtRRRAB",
            "text": "The place is nice. The waiting was long for seating and ordering. But the food and drink OMG was great. I couldn't finish it you could feed two to four people in one plate. Wow."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRLWFmZVBBEAE",
            "text": "This might be one of the best fusion restaurants I have ever been to. 12/10 would recommend, I wont rest until I come back here"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN2F6TDF3RRAB",
            "text": "Great food 👌. Great big portions for the prices. Haven't had any reason to complain yet one of my fav spots…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWRpeDJBRRAB",
            "text": "Delicious food great service this is a picture of Chofan De Cerdo. Porkchop and rice. Always come here for events. Rice has bacon and pork rinds. Amazing food love this place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpb0p6RHlnRRAB",
            "text": "Was an Uber order but was hot and fresh like I was there! Good comfort food! Yummm"
        }
    ],
    "reviews_count": 73
}