{
    "name": "Patsy's Pizzeria Morris Park",
    "place_id": "ChIJG1dgAqX0wokRqPwXSi-lqIw",
    "grid": "BX3",
    "address": "980 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4.2,
    "user_ratings_total": 502,
    "phone_number": "(718) 676-2527",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSVYyRkZWMDVFYmtWcFExQkRabUV0ZHpGZlJYYxAB",
            "text": "The place was very cold, so if you are gonna be there in the fall or winter make sure to wear a warm jacket. The bread was also too cold to eat. Honestly, who serves cold bread, especially when pairing with butter? I understand if there was some olive oil on the table but there wasn’t any. I was very disappointed with the hot antipasto. It was a heart attack waiting to happen. The calamari was absolutely terrible. Too many fried frozen foods on my plate. The meatballs were decent but I’ve had better. I am a bit skeptical about going back here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVRFSXpNaloxWldWU2VXZG9SRTlKWTJ3MlpWRRAB",
            "text": "Delicious Italian Food served here,Authentic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWb1dXZGZXbDlrTVdOb1ZtaHJOVGRxWlhKNExYYxAB",
            "text": "Order any antipasto, entre, pizza or a cocktail & you won't be disappointed!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOYVIwUlRkbkU1VUhFM1pYQmhRV1ZYWmxobmFtYxAB",
            "text": "A week ago we hosted a dinner for close family and friends (close to 40 people), after my mom's funeral service. DANIEL was amazing at helping us with the booking and seating arrangements! He abs the staff was amazing during that difficult time for my family and myself. Highly recommend Patsy's."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMUxXUkJhV3hWYmxKbFgxcEZTM1JZVnpKMlYyYxAB",
            "text": "Propre et accueillant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1S1gwVlRWR3RNTFMxeFEzRk9XUzF6UVhoNk9WRRAB",
            "text": "Don't waste your time or money ordering from this place. The pizza is horrendous, always cold and paper-thin to the point it feels like you're eating nothing. They're also very skimpy with the toppings. If you want good pizza, visit Addeo pizza next door and Patricia's of Morris Park which are all on the some block"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT1UzRnpjM1pxYlZSYVFtMWZSMHd5UlVoNGVtYxAB",
            "text": "An Excellent Restaurant, Pleasant Atmosphere, Delicious Food, & Excellent Attentive Staff❗️A Great Place To Go❗️❗️❗️❗️❗️\nA Simple Formula:\n🧑🏻👧🏻👩🏻👸🏻🫅🏻👦🏻👩🏻🧑🏻➕️🍕🇮🇹🟰❤️❗️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1NUWkRjbFpWZW5ONFgyUnBMWEZaUjNkU2FYYxAB",
            "text": "My wife and I were greeted by a friendly staff! Steve was our waiter he was amazing the level of service we received was first class. We started with the a strawberry cocktail simply amazing!  My wife had a pork chops with mashed potatoes she loves it! I had there famous chicken parm with vodka sauce I was in heaven the portions where so HUGE we took it home and also we took home a pizza pie which is THE BEST pizza we ever had! This place a a GEM shout out to Steve and the rest of the staff Thank You so very much for your great service we will be back!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMllsVkJVRjlwUTNWbGJqUkxWMjU2Tm1sNWNYYxAB",
            "text": "Atmosphere and service was ok. Food wasn’t great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobVVuaG5NR1ZsYjFORFduTklaR0ZHYmtZM1ZHYxAB",
            "text": "Awesome food great place!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cVFVeG5WRVl4YmpSR1RERnhabWRWUmt0MlQzYxAB",
            "text": "Patsy’s Pizzeria in Morris Park was a total letdown from the moment we sat down. The service was terrible—other tables were given bread immediately, but our server didn’t even bother offering us any. It felt like we were being ignored right off the bat.\n\nWe ordered a few appetizers—arancini, calamari, and a pizza—and that’s as far as we got. The arancini were the worst offender: just plain white rice and cheese with zero flavor. No seasoning, no depth—just bland and lazy. The calamari was overcooked, rubbery, and greasy.\n\nAnd the pizza? A complete embarrassment for a place that claims to be known for it. It tasted like something straight from Domino’s. Cheap sauce, flavorless crust, and nothing that made it worth the calories.\n\nWhat made it even worse was the strange smell lingering in the restaurant—it was off-putting and just added to the bad experience. We didn’t even bother with entrees. We were done.\n\nFor what it’s worth, the Patsy’s location in New Rochelle is far more superior—great food, better service, and it actually felt like a real Patsy’s. Sadly, it’s temporarily closed, which is the only reason we even gave this Morris Park location a chance. Huge mistake. Never again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNZmw4Wno4OExtdUp3EAE",
            "text": "They don' sell slices but they take credit cards"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLV1M5N3pfOWZ6aEFnEAE",
            "text": "Great service & food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT213N3FlNU11UklBEAE",
            "text": "Quaint Italian restaurant"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcUYzTGpmaV9YYkNnEAE",
            "text": "Great Italian food!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc3VPVlBBEAE",
            "text": "Had a lovely time. Had  early dinner so it was very quiet and so I had my book and was served by one of the best waitresses."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3N2ZXRjVnRRAB",
            "text": "Great italian tasty"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneGM2MUtREAE",
            "text": "Delicious food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnak96eGNREAE",
            "text": "We got a large pizza with pepperoni it was kinda thin but many people like it that way, my wife who is very picky liked the pizza very much."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdWJiQklBEAE",
            "text": "Very nice  people good service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NjZDYUNnEAE",
            "text": "sucks"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aTdxdW9RRRAB",
            "text": "All I have to say is horrible"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N2RpbzB3RRAB",
            "text": "Chicken  Pam 🗑"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bWFETjRRRRAB",
            "text": "They don't sell large pizzas to eat at the table. My family ended up leaving before we even ordered. 20 dollars for a personal pizza is a crazy price."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNVpTcV93RRAB",
            "text": "we’ve ate at another patsy’s and had a wonderful experiences. However, me and my friend decided to come here and when the food arrived to our table, there was a spider crawling out of my boyfriend’s plate of food. Very disappointed, will not return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMHNYQlpBEAE",
            "text": "Cozy and welcoming environment. The staff are always friendly, the food is delicious and priced fairly for the hefty portions you receive, the restaurant is always clean, and you can't help, but feel good vibes when dining here. Keep up the awesome work, guys, and thank you for consistently providing excellent customer service along with your excellent food!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzd0wzWmJREAE",
            "text": "Maybe I needed to sit in and try the food there but I did take out and the three dishes I got was awful. Tasted like everything was microwaved and the grilled chicken was burnt. Shrimp was over cooked and spaghetti was stale. I would love to support the businesses around my neighborhood but I had to be honest with the food I received, it was not good at all."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dXFMOG9nRRAB",
            "text": "Pizza and service pretty good . Ordered also a soup to go but no bread or crackers..only downside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHRPWGpRRRAB",
            "text": "Two words, Vodka Parm. Really happy I found this place, really nice people. I will be back 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYc3FhM1B3EAE",
            "text": "I called Fri Oct 25, 2024 at 3:44 pm ET. They picked up and hung up without a greeting not even given a second for me to try to say hi. All I wanted to know was what was the HH on. Nvm now, feels like there’s rude employees during this shift. Will report to their HQ"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuak83bWpBRRAB",
            "text": "They have the best arancini! Never ate in, place doesn't give me the warm fuzzies. Sign not to cross past the bar for take out or pick ups is off-putting and should have been done better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIN2ZxUElnEAE",
            "text": "Very nice place, good food and great people and service....."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINFlfekJ3EAE",
            "text": "Surprised when we saw how large the restaurant is..\nFood was well prepared and service was excellent..A plesant surprise!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIc0xYMjB3RRAB",
            "text": "Our server was amazing... Pasta was delicious... And the atmosphere was super friendly and relaxing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcmVHYU5BEAE",
            "text": "Thank you Patsy’s for the amazing time last night! We had a retirement party in the back room and it was wonderful! Lucia was taking care of us and she was so patient, sweet and just the best! Thank you so much Lucia! We were a big group and you handled everyone with such grace! The room was full but that didn’t matter! The dinner was excellent! From the wine to the salad, pasta and main courses, we were all so happy! We highly recommend Patsy’s for a party! Delicious and excellent service! Thank you all again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ29MZUJBEAE",
            "text": "It was our first time here , Lucy was so pleasant and super friendly. The food was delicious, would definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3c1ozSzl3RRAB",
            "text": "Fantastic, go during off hours. Everything was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cHZ2N2Z3EAE",
            "text": "I had high hopes for this restaurant and made a reservation months in advance for a special event with approximately 30 guests. Throughout the process, I called multiple times to confirm details and inquire about any necessary preparations. Each time, the staff members I spoke to were pleasant and helpful, but unfortunately, the manager was never available.\n\nA few days before the reservation, I was finally able to speak with the manager. To my disappointment, instead of addressing my concerns professionally, he was dismissive and rude. He blamed me for not signing a contract, despite the fact that I was never informed this was necessary. Instead of taking responsibility or apologizing for the lack of communication from his team, he continued to belittle me.\n\nGiven that I had a confirmed reservation for a large party, I am baffled as to why there was no follow-up or communication from the restaurant if this was such a critical issue. I called on numerous occasions, and each time I was assured that they would call me prior to the event to confirm the menu and other details, yet this never happened. The lack of organization and the manager’s unprofessional behavior left me deeply disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaXF5bWtnRRAB",
            "text": "Best pizza in Morris park! I had the margarita pizza and it was thin crust and made to perfection. The pasta was delicious. The penne vodka was nice and creamy. Service was also excellent. Will be coming back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiblBtZk5nEAE",
            "text": "Food is good , service extremely slow, my plate and silverware were dirty . I took place setting from the table next to me.Please becareful with happy hour , the server gives food menu,cocktail specials menu .Then you ask for the happy hour menu which is  on a single sheet . My mother inquired about the drinks such  as a pina colada and the margarita. Which she and my Aunt ordered but the bill came I thought it was a mistake on price. I ordered a Blue Hawaiian only for it took look green...lol not. Had the server correct the drink he said he made. Why is there someone under 21 making my drink  anyway?? On  way out to to pay the bill I asked the server was told that not pina coladas and margaritas are not included on the happy hour. There is no excuse not to be clear about what the establishment is providing especially a Happy hour from 4pm to 7pm.. I'm annoyed, I paid the bill and left feeling a little taken advantage of."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOGZXQjB3RRAB",
            "text": "Tasty food, good portions, pretty clean and great customer service, I have been there more than once."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiX01qdzBRRRAB",
            "text": "Very Friendly and Beautiful Restaurant! Food was Delicious! John and team doing a Great Job! Hot Antipasto was perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycXViaHJ3RRAB",
            "text": "Delicious food, authentic Italian food, and quick service. Heavily recommend."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6emJiS2JBEAE",
            "text": "Su pizza muy rica y sus comidas con precios muy competitivos por su ubicación me parece muy razonable y su personal es muy eficiente siempre disfruto al ir con amigos o familia."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqamNpZkNREAE",
            "text": "Had a catering event and wasn’t offered and told no for items included in the “summer wind” package.  Had to point out that espressos and cappuccino were included.  My 9 y/o daughter was told spaghetti wasn’t included and we weren’t offered the full menu for what we paid.  Also one table had to deal with a leaking ceiling at their table."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeFlmcDB3RRAB",
            "text": "I love the pizza here. Everything else is delicious too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdXJqQzlRRRAB",
            "text": "I used to hold Patsy's to the highest of standards. I would go there just to have a whiskey sour and a personal pizza. I would treat friends to this place. One day I bring my wife, I ordered the risotto and it was disgusting.  Risotto should never be given in abundance,  as a Chef, it was obvious that they gave me all the risotto that was left  (which means their food is precooked). It was just excessive risotto,  so much that it turned me off from eating. I don't remember what my wife had but she did order a teramasu that was the size of a twinky.\nI used to work at Patricia's down the street, I never liked the place. My wife made me go there and I must say that everything was amazing. The food as well worth it. Employee service is \"Down The Hudson\" but I stand corrected when it comes to their food. My wife's teramasu was huge....for that , Patricia's is my new go-to place. Patsy's should be ashamed of themselves especially how the waiters make people of color feel. I've been to Patsy's since the early 90's, and I'm smart enough to notice racial profiling."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMFppSkF3EAE",
            "text": "Great food,it's definitely a hidden gem in The Bronx."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdXIyTU5nEAE",
            "text": "My old co workers and I had a wonderful dinner at Patsy\"s a week ago.  Food was delicious, particularly my tortellini soup.  It was delicious!  Atmosphere was wonderful.  We went to Patsy's at 3:30 p.m. so we were there before dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MzhEd0NBEAE",
            "text": "Meatballs parmigiana heroes are great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cUx6WldREAE",
            "text": "Went to a retirement party here.  Theres a nice private room in the back that holds up to 50 people.  The service was outstanding.  The food was delicious.   Make sure to order sangria. It was delicious.   I will definitely be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN2ZyZFBnEAE",
            "text": "The experience could have been better. I’ve been here a few times in the past I usually only stick with the food I know, pizza, eggplant or meatballs but on nye we came here. Ordered the fish which was not cooked to my liking. My husband had some seafood with risotto and the risotto was overcooked. Sigh. The server was extremely busy so we didn’t get the service that we were hoping for. Also the tiramisu is getting smaller and smaller. I think I’ll stop coming here for a while. Definitely hate wasting money and Manhattan has better Italian cuisine, worth the money."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPd2JXdGdBRRAB",
            "text": "The food was good, the pizza is thin and fresh. The margarita pizza was good needed a little more cheese. The cannoli was fresh."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzLVpEc0JBEAE",
            "text": "While I waited for my 3 pizza I had an awesome drink(Woodford Reserva and Coke) and great conversation with the bartender.  Great place for dine in or take out.  The pies where excellent.  Prosciutto with Arugula,  Chicken Parm and Regular Pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMi1laDhRRRAB",
            "text": "Everyone was super attentive, always checking on you, the food came fast, I would definitely come back, the food was fabulous."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdU5PdUZ3EAE",
            "text": "Time and day I went. The place wasn't to crowded. The staff was very polite and helpful. The entire experience there was delightful,the place is clean and the food was delicious. The restroom was clean and stocked."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNXzlMbXNRRRAB",
            "text": "Horrible F$&!*%ng service!!! It is not my first time ordering from Patsy’s and I would’ve never thought of having a problem with them until this evening. I was anxiously waiting for my margarita pizza with my partner and when we received it, it was the worst pie of pizza I have ever seen! It was hard and dry as a rock, cheese was barely melted and the “fresh Basel” was maybe sitting in the fridge/freezer for weeks before putting it on the pizza. To put the cherry on top my partner called to give in our complaint and the manager told us we are basically wrong and shouldn’t be calling because they make their pizzas freshly, this doesn’t f$&!*%ng look or taste like a fresh pizza!!! Not ordering again, thank you for your service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyOE43V3BnRRAB",
            "text": "BEST PIZZA EVER - O-M-G\nPERFECTION- if you like prosciutto you have to try these pizza - no oil - crispy- fresh and quick services . Order online I got the delivered like in 30 minutes…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdXRDalVREAE",
            "text": "Thin crust chicken parm pizza. Pizza was just ok but wish they put a sticker or seal on box so you know it wasn’t opened. Ordered via Uber and was almost frozen when it got here.. that could have been Uber’s fault."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ19DTWVnEAE",
            "text": "Very quiet and warm and inviting. Tuesday night is pasta night and the food is a good portion and tasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbDZubWhRRRAB",
            "text": "There's like no cell service whatsoever in here but otherwise one of my fave places! Food is great (just not a fan of their penne ala vodka) but everything else is really good 😋"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVc0l2N0hBEAE",
            "text": "Always great food and service here! Great place to eat in Morris Park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkb0luTzVnRRAB",
            "text": "1️⃣ of the best🔝 Pizza🍕 in NYC. The pasta 🍝🧀& desserts🍰 are also great.🍷🍕"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDLUo2d2ZREAE",
            "text": "It is thin crust pizza. It’s light so you don’t get that pizza coma after you eat it. I like pizza and this is a good pizza at a very good price. Patsys"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dDhYZXRRRRAB",
            "text": "My friend took me here and it was yummy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOElibVVnEAE",
            "text": "I'm a truck driver delivering all throughout the Bronx, Yonkers, Mt.Vernon area. I ordered a small pie and when I got in my truck and opened the box it was one of the most beautiful pies I've ever seen. The crust was golden, the cheese was quality and evenly placed, not too much not too thin, the sauce was light and delicious. The slices were cut evenly too. I took my 1st bite and realized I found something special.  So special that I'm writing a review about it a week later.  The ambiance of the restaurant  is very cozy. Another plus was the owner and staff. Extremely likeable, very warm and friendly. If I lived in the area I'd be here eating all the time. Not many places you can order a pizza to go or take your Family for a beautiful dinner. Overall it's 5 stars for me. I hope one day to order from the menu but from my 1 encounter it left a great impression on me. Enjoy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaG83UmNREAE",
            "text": "Quintessential and classic New York City pizza experience.\n\nNot only is the pizza among the top three that I’ve had in all the boroughs, the service, particularly the wonderful and warm lady who answers the phone (I don’t know her name), is one of the NICEST people I’ve ever had the pleasure of interacting with!\nShe makes you feel like family from the moment she answers the phone.\n\nA perfect experience every time and the prices are still fair too! I appreciate that so much too!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROVlMbFdnEAE",
            "text": "Minestrone soup smelled sour. Alfredo was ok not great and I don't know what mousse cake should be but I don't think this is it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bk1lQnVRRRAB",
            "text": "This was my first time in New York.  As someone from the South, we are told people up here are rude.  That could not be farther from the truth.  My waiter Jason was incredibly kind, helpful and perfectly attentive. As someone who eats pizza everywhere I go, I can honestly say Patsy's is the BEST pizza i have EVER had.  Thank you so much for contributing to such a wonderful New York experience.  I can't wait to come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNGNTeU5BEAE",
            "text": "I’m not one to leave negative reviews but it was just disappointing. The server was like sad to watch, had absolutely no idea what he was doing and was constantly confused - we didn’t even order anything confusing. Was not attentive at all, had to ask us if we received our drinks and appetizers because he took so long that everything was gone by the time he came back. He was a nice guy but not great at his job, maybe he’s new - I was giving everything the benefit of the doubt. They charge 6 extra dollars (which is a little pricey but whatever) for grilled shrimp on the pasta and it came way over-cooked and slightly burnt. My first time ever having dry shrimp. The steak came so dry and over-cooked when it was supposed to be medium well. The alfredo was okay and the dessert portions were tiny but yummy. The cappuccinos are to die for. The calamari is amazinggg. That one red pasta sauce is so good. You have to pour your own water and it takes them forever to realize when you’re out of water. They (bussers or food runners not sure) kinda just like throw stuff on the table and run away. Slow or mediocre service would be explainable if it was busy but there were only three other tables when we went. The older guy in the front has horrible vibes, maybe he was sick or tired I don’t know but it repels clients. Food is over all expensive and not worth the price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NFkydGpBRRAB",
            "text": "The staff is friendly, quick and attentive.  I don't there's anything on the menu that isn't incredible. The pizza is good but their pasta dishes is where they truly shine.  The shrimp scampi risotto is phenomenal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzZPdm5nRRAB",
            "text": "The flavor of the pizza was on point.  The pizza itself was a bit dry. It could have used more sauce. It was definitely a decent  slice overall. However, I did expect more from the name, \"Patsy's\". I know many mom and popb pizza shops that can give them a run for their money."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTeWYyWXVBRRAB",
            "text": "Right now outdoor dining is good. Service was horrible. I waited a long time for my food. I ordered three things and only one thing was very good. The ravioli was too salty. The Alfredo was really good. And the last dish which was chicken…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNWJ1dzFRRRAB",
            "text": "The food was good but service was off.  It's a neighborhood spot and the area is busy. I know first hand mishaps can happen in the service industry. The pizza was really good and nice choice of salads. Wine selection was fine and so were the desserts. I will definitely go back again."
        }
    ],
    "reviews_count": 74
}