{
    "name": "Crosstown Diner",
    "place_id": "ChIJa5Aqk0eLwokRJkDgnJ10mdg",
    "grid": "BX3",
    "address": "2880 Bruckner Blvd, Bronx, NY 10465, USA",
    "rating": 4.1,
    "user_ratings_total": 2480,
    "phone_number": "(718) 597-3450",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSlEyNUdja3BWYmxkRWFHcFpSbTQyV1RWT1ltYxAB",
            "text": "A diner for real. Great food service and the diner atmosphere. Of course I had breakfast!!  Lots of booths."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dlVVUXlObEo1V1ZOeFowMHdTbUZPV1djNVpFRRAB",
            "text": "Amazing food ! great options to choose from"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ0wtS2VBEAE",
            "text": "I had 1 bad experience at this place when I was with my mom about 7 years ago, I have since been back and the food is really good. I like how comfortable the place feels."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUVh6SnZXRUZ0WTNOUFgxSmxUMXAzVjNwUVJrRRAB",
            "text": "This hyped up tic tok, instagram diner gets zero stars. Where do l start? My husband ordered a espresso martini and it didn’t look appealing at All it looked like a watered down coffee with a splash of liquor horrible, we both ordered cheese burger deluxe his with bacon and mine l substituted the bun for sliced white bread huge mistake , lm thinking it’s going to be nicely toasted and golden but it was the total opposite, how and why would you put my bread directly on top of the tomatoes now my bread is soggy and gummy, now to add to more chaos to this whole experience  my husband asks for a Ginger ale with a cup of ice on the side he’s thinking a can of soda, so the waiter comes back with some flat fountain soda with another cup filled with ice, at this point my husband is confused he’s like no l meant a can of soda he’s like sorry we don’t sale anything in a can 😳 like are you serious. No can soda but a good idea to sale flat soda to your customers make absolutely no sense but l guess at this point they have just given up completely. When it was time to pay my husband expressed his concern with our whole disaster to a gentleman in front who charges us his name is Robert , he completely seemed uninterested in what he had to say and totally brushed him off very rude. So with that being said l hope whoever reads this review please don’t waste your time in ever going here for a great diner experience , because it will be a waste and don’t listen or believe everything you see on social media. l learned my lesson don’t say you haven’t been warned."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNGNta3phRU5OT0c0eFNWbE5kV0Y0Ym5GMWNtYxAB",
            "text": "Sucks"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMk9HSjZSekJxVHpJdFdubHJTVzk1U1hWdldXYxAB",
            "text": "Staff very delightful and helpful. Food is what it is for an all night diner."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob05uVjNWaTFwZDFGTWVrRXlaa1oxTkZrNE1sRRAB",
            "text": "Amazing food and prices. The workers were super nice and the relative atmosphere was overall astounding. Thank you for a great meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNlFXaExOaTFzUmtvMFRtZEJSMEpZVVdOellXYxAB",
            "text": "Pedro, our server, was awesome! We all enjoyed our food. I had the beef patty with grilled onions and melted cheddar on toasted rye.  Delicious! My daughter enjoyed the apple salad with grilled chicken and my wife thought the chicken Quesadillas were delicious as well!.\nNothing like a cozy dinner at your local neighborhood diner!! I've been coming here for over 20 years!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1VuYzRWbEJNZERSdFpXUktUekZXZVd4eWVXYxAB",
            "text": "The food was ok... Had the avocado toast with poached eggs and salad. The poached eggs were not exactly the way they should be but ate it anyways along with corn beef hash."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUmRtSlpjVlEyZFdGNk1pMTFWbkYyTjNkd01rRRAB",
            "text": "A little pricey but the food is great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob1Uwd3RXRTB3UWw5c1RETjJlbWRsVlZSbGRsRRAB",
            "text": "Great food good service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcFlsTlNRMjVXYlhSbFkxaFhTa0puUkhWV1lVRRAB",
            "text": "Best diner in the Bronx"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQ1dFcG5ZMm96YlRWQ1QyNUNjRzVpUW5WRVpsRRAB",
            "text": "Good food and you get a lot. Also it have a parking lot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ01VVlRhMVk0V0d0cmJXNXpMWEJwVDFZeVIzYxAB",
            "text": "Place is okay drinks are very watered down food is horrible. Waiters will hover over you while your eating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdU5rbEROWFJoYzFCWFVITklRV1Z6V1U4eFMwRRAB",
            "text": "This diner is like a 2.0 of diners. They have nicely laminate and binder menus and placemats. The service was a little slow but the food was worth the wait. I had a Mexican eggs Benedict with chorizo and avocado. It was delicious! The waitstaff was courteous and engaging. They’re open 24 hours over the weekend. I definitely recommend and will return as well."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocE11c2NnEAE",
            "text": "One of the best dinners in the bronx."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wemFUbEVhbU0wU0hVNU5XbHZSamwyUTBGSWFGRRAB",
            "text": "I’ve been coming here for years and it was always open but that’s not the case anymore. Please update your hours because right now it says you’re open 24/7 and that’s not true. The past 2 times I’ve tried to come in the morning it’s closed and I already paid for my food for pick up."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXei1YZEpnEAE",
            "text": "They accommodated 9 of us quickly, customer service was excellent from entering to leaving, the food was so very good and the drinks hit the spot!  Thank you.  We'll be there again 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GelZVMWFOMHR2WlRoR2MyWkRPRnBsWHpOdFoyYxAB",
            "text": "Celebrated my Daughter's 41st BD.\nBruch was awesome. Parking available 2."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treFpqaExkMnRyYUVjeGMxOUhjRVp3TUVaVE9YYxAB",
            "text": "Wonderful experience everytime"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25welZYVnpZbUpWVGxWbmRUVTFNM1J1YkUxYVMwRRAB",
            "text": "If i could I would leave it zero stars smh worst baked potato ever I asked for cheddar cheese they put American the potato was dry it was put in the microwave to heat up the American cheese"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUVdtOXdObXBvYVdnMFVHSmpjREF0WDE5aVRVRRAB",
            "text": "The location is very good next to the highway, but the price and food quality are not. I ordered a New York steak medium rare. I don’t feel any sizzling on the steak. I need to put on a lot of sauce to eat it on only one side. The mashed potatoes are like too many mashed potatoes in an instant. They can put some other vegetables as an option to make this steak dish more delicious. The cheeseburger steak was too dry. The cheese looked too cheap. This was an unsatisfying dinner. We finish quickly and go to some other place, find some nice food and drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaU1tTmtjamQwYkhwMlZHOUlRbEJLUVdSdFdVRRAB",
            "text": "Always a pleasure to eat here , staff are professional and friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V05ISjNTa1V3TkhnelVXbFNiazk2YzNKM1MyYxAB",
            "text": "The food is actually a 2.5, but for these prices, absolutely ridiculous. Also, the drinks WERE VERY, VERY WATERED DOWN. I wanted to see if a shot of Hennessy would help my drinks, and I find out the shot is $17! Like, 1-7 DOLLARS. I noticed the manager who made the drinks kept looking over to see if I was enjoying the drink, and I hope by my face, he knew the drinks were shit.\n\nMy server was nice. But the other ones didn't taste their own juice to see what I'm talking about. It's obvious they're trying to cut costs everywhere, but it's unfair to assume your customers are stupid and won't figure out you're jipping them off of quality. I don't mind paying extra, but let me get my money's worth!\n\nI want to give this place another shot, but there way too many complaints to justify paying $20 for 10 wings, or $17 for one shot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRlltUkJZazFxY1ZsYVdHNWxZbWxYVkZsVWVVRRAB",
            "text": "The food was awesome. I went there with my friend and we basically got like a lot of food and all of it was nice and hot like everything was like fresh and we even got dessert at the end and this cake was so good. It was the Oreo explosion if I’m not mistaken, and I also do really recommend getting the mozzarella sticks for appetizers because those are really good and if you have kids coming with you they have a kids menu! Me and my friend got like waffle and pancake type of platter. I forgot the name of it but it like has all different types of food on it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSmVrVnNTRTAyY1VWaWVVeG9PV3czVm1oeVFsRRAB",
            "text": "My favorite diner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbVVUaFZRblV3WTB4c2RrOUNSamh6ZGxSWmFHYxAB",
            "text": "They are closed!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSlNYZEdkbVZOU0ROTlRFdDJOMkZZZGt0dGMwRRAB",
            "text": "I don’t usually leave reviews but for this place I HAD TO. The waiter was nice & accommodating. The service itself was good. but THE FOOD ? Absolutely disgusting.I was with a party of 8. & everyone agreed with me. I regret not taking no photos but guys do not come here. Plus the tax & graditude is too expensive. Absolutely ridiculous."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT09FcG9Oek5ZTlVsdFJuTmZVRmhwTWt0dVMyYxAB",
            "text": "Well I don't know how to start off the manager was sooooooo nasty and disrespectful. The food took a long tome to come out. And for 3 meals it's a total of $124. I would never go to this place again. I don't recommend. Pic of the manager who started to raise his voice at me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUlh6ZFZhbVJHTTFsQlpqVTVRblpNZVRZeFZIYxAB",
            "text": "The price of a BLT silly.  The office usually orders breakfast a few times a week, I can't justify the cost anymore."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT1ozSjVVbm81YmpCeWVXTjRaelUwVnpsaWFGRRAB",
            "text": "Came in here to grab some food with my mother. I’m of Desi descent, so I kind of look Indian but I understand some Spanish. While we were eating, a Hispanic lady that was sitting across from us with 2 other people (apparently a REGULAR according to the diner) kept looking and pointing at my mom and saying gorda while herself and some of the staff were all laughing and saying things in Spanish. Once they noticed I caught on, they stopped. I lost my appetite after that and confronted the people at the table who made fun of my mother, who obviously denied it. The manager just apologized to me and didn’t say a single word to anyone at the table of his regulars that made fun of my mother. Besides that the food was mediocre. The ONLY nice thing about this place was my waitress, she was very pleasant and brought out my order correct…."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGamVTMUlTbGhFZVUxVU1rVkRNRFY2Ykc4eWQwRRAB",
            "text": "The desserts were a highlight and not to be missed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSGJVMVBhRkpvZG1WclJteHZSakpmU2w5bGNFRRAB",
            "text": "Always mess up my orders. I stopped coming here because there is always something wrong with the orders I put in. Food is way over priced as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWmFGTjZUR2hITUhsM1JXOWhZMjF4Y0dSdlFWRRAB",
            "text": "Food is always great. Service is always friendly and reasonable."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnemU2QmFnEAE",
            "text": "Great food ,  nice atmosphere. Cocktails available.  Soup to nuts the menu is stacked with items"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eFFsQlROakpoTm5WcWFtRXRZemh3VDNkMlpYYxAB",
            "text": "The best diner in the Bronx hands down by far !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMGFIaGlVMEo2ZFhneVZqWlphbmRQTVRWU1FsRRAB",
            "text": "Very nice place to eat with friends & family"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWE4xRnljM1Z3YUZJNWNITkVPRzlyVVZOa2IzYxAB",
            "text": "Excellent food and service. I love the menu for all of its variety of options!  It's a nice atmosphere where the music isn't too loud so it's easy for my family to talk together.  Also nice there's parking that's always easily accessible."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBN3R5ZXB3RRAB",
            "text": "100% Great Experience & Food was good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1EyTm1VRzVNVFdGQ1l6bFlRWEJyY0hGRFlXYxAB",
            "text": "Best 24 hour diner in the BX"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReWQxOXBjV0ZMVDNsaWVYQTVVbk5SYXpOTmRrRRAB",
            "text": "The place is nice they have parking which is a great thing, the food we order was over priced as the entire menu is and honestly after we both got sick for few days if I go back there I can take a drink but eat never, the service is good nice people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdVlrRkZlbkZGYVVKYWJXdFFaMWQ0YjBNd2NIYxAB",
            "text": "Delicious food and great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaE1FTmxaRkZ1YldSME1IUldkMUZGUjFCd1lVRRAB",
            "text": "Love this place so much. It gives you such nostalgia vibes. I had the oreo waffles and kit kat milkshake. Odd combination for sure but I enjoyed both of it, especially the waffle. It was soft, massive, and cooked to perfection. The milkshake was good (took some to go as well)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TFMyeFFibEJQY0MxSE1rTlhMVU52TTB4R1gzYxAB",
            "text": "Love the old style diners from the 50s, great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd2FtZGxWR1ZQTWtwbWRXUktXVmRTVFhCaFdrRRAB",
            "text": "Slowest service I have ever received in my life."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabGJYVkRielJrT0hsdGIwOTBaRzFFUVZCek1HYxAB",
            "text": "The day that I was here, the food & service was good.  No complaints.  The diner does have a parking lot you can use, but be warned, the lot is small & could be rough in finding a spot at times."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwci15QndRRRAB",
            "text": "Always a great choice to get a bite at Crosstown Diner. Friendly staff and delicious food makes for a great time waiting to happen."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNmFUVnBOMGxvUm05Q05FcGtUWEZzVVRoWU5HYxAB",
            "text": "Very nice restaurant specious conveniently located right off the highway food was very well presented and tasted good and it was very very affordable the staff lady was very very attentive and this is going to be my new go-to spot you may like it if you try it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLenVyc0NzXy1hUE1REAE",
            "text": "This is one of the last 50’s diners in the Bronx.   The owner is really keeping it up. The food is delicious.  I come here regularly with a friend for their Western Omelette and their delicious sandwiches.  They make excellent home fries however I do not like their French Fries.  They have a large menu ranging from breakfast to lunch eats.  They also won The Food Fight Daily News Challenge as the best eats in town."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeVVuZENhRFUxTkZGeVJIZzFkVE4yV205VGJGRRAB",
            "text": "Such a fun addition to  #CrosstownDiner a classic since my childhood. #buzzybooth"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLajJ0SXYzeWVMU3NnRRAB",
            "text": "A little out the way but wow was the food delicious. The staff were friendly and we were greeted and seated right away even during their busy rush. The prices were more than fair. In the picture is cannoli pancakes and cannoli french toast."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OUw3X0RREAE",
            "text": "Decided to try an ice cream soda, never had one before. Tasted sooo good. Ordered a Greek  platter, it was really tasty. My friends had a chicken salad, and a french toast with whip cream. They loved their milkshakes with alcohol. Appreciated the extra sauce. Overall food was great. Would come back again if I’m in the Bronx."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvczdYa2lBRRAB",
            "text": "I hate doing these posts, but this one irked my soul to no end. This was a Mac n cheese burger with the best sweet potato fries I have had in a long time. The food was great. Our waiter was top notch. However, the owner and his wife were rude, dismissive and liars. What was the lie? I asked if I could charge my phone, because I was at 6%. They said no and I explained that I was with my 90 year old mom and I wasn't familiar with the area, so I needed my phone for the GPS app. The owner went on to state he was the manager and his boss said there were all kinds of legal issues with phones. I even offered to write a release and he said no and that I was scaring his wife. The only reason I didn't walk out was because of my mom. She doesn't need to be dealing with that. The name of the diner is Crosstown Diner I highly recommend you never eat there. Oh and let me not forget the wife kept coming out from behind the register to check on us, to see if we were \"done\" It made my mom feel uncomfortable. The place was empty and it was the afternoon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4b2Vpa3p3RRAB",
            "text": "This place was absolutely amazing. The food was totally delicious. The Bronx Burger was my favorite. Oh my Gosh! I am working up an appetite just thinking of it. The service was superb and the atmosphere was quite inviting. You have to give it a try! You will not be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeXRXZEtREAE",
            "text": "Delicious!!! Margaritas bomb, wings bomb, burger bomb!!! Service was great place very clean. Cheesecake pure heaven!!! Very good, this was my 1st time but will not be my last. I forget the guys name at checkout, you were absolutely right on about the Cheesecake being the best for $12.00 a slice Delicious!!! 😋 Thank you!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2d19XNFVBEAE",
            "text": "I came in while waiting for my car to be serviced. I got breakfast quesadilla and got soup left of pastry pieces to go. Great little place to visit. Fast service, polite servers, (they do wear ties and white shirts!) and the food tastes delicious. The owner was there and the place filled up fast!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaDcycVFnEAE",
            "text": "Food was very good especially the Turkey Club Sandwich and the Chicken and waffles (with tenders) only thing was the burger that was well done was too dry so luckily we had appetizers but the other burger with bacon and baked potatoe on the side was a medium rare but was right amount of juiciness lol the oreo cake was moist and fresh ! It was my bday dinner and all this plus appetizers not all are included but I put the Calamari and I really loved the fresh calamari with a nice crunchy consistency that the pieces did not taste chewy at all! Oh and the Mac n cheese balls are very good - must try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibWRmcDVRRRAB",
            "text": "I love their cheeseburger. They are consistently good. I also had fried mac n cheese balls and calamari for appetizers. They have a huge selection of food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxN0tQeWFREAE",
            "text": "Had the best time here today. Almost didn’t go because of bad reviews. Waitress was fantabulous didn’t get her name. Food was delicious especially French onion soup. I would totally go back in a heartbeat. Shout out to the awesome waitress who made us so comfortable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyOS1pXzNRRRAB",
            "text": "Stopped into our favorite diner today and had a fabulous homemade keylime pie! If you are in the neighborhood today try it out...not a usual item on the menu. Yumm\n\nIn addition they have delicious bread pudding.  A favorite of another customer here."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1b0x5bU1REAE",
            "text": "Everything about Crosstown was PERFECT! Our waitress was amazing, the atmosphere was amazing, the food was DELICIOUS!  Definitely making this my go to spot in the Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbHR1QmdBRRAB",
            "text": "Ordered “huevos rancheros” from this diner and it was terrible. No salsa, and about half a pound of almost raw home fries. Please take this off the menu since you don’t know how to properly prepare this dish. False advertising"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNGVIem1nRRAB",
            "text": "If you have $21 to spare you can get this disgrace of a bacon cheeseburger or lack of a burger!!  I think I paid $20 for the bread & $1 for the burger.  My wife had a Buffalo chicken salad...  pretty much lettuce, red onions, Tyson frozen chicken tenders with Buffalo sauce drizzled on it.  Better off eating at A fast food spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMk11WkxnEAE",
            "text": "I really enjoyed the breakfast here. The staff were all kind. They checked up on you, but didn't rush you out. We got an omelet, pancakes, sausage, ham, toast, coffee, potatoes. Everything was delicious. Still has that classic Diner look…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKaUx4OF9vdnRxWnZBRRAB",
            "text": "If you don't mind paying restaurant prices for diner food, enjoy.  Also, if you have any food allergy, let them know.  They sometimes don't follow the proper ingredients for foods.  I've ordered Lobster Bisque and Manahattan Claim chowder from here.  Those soups are not supposed to have shrimp in them, but this place adds the baby shrimps as a filler I guess for real crab and lobster meat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaN1lMSi1nRRAB",
            "text": "From the minute I walked in, I already knew I should have left. The waitress was giving this disgusting mean girl attitude when I tried explaining to her that I got the wrong order. The order had bacon which I couldn’t eat due to restrictions from surgery but she continued to argue with me. They still forced us to pay for food we didn’t even touch or eat. Don’t waste your time here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc296OFBBEAE",
            "text": "It's really nice and friendly here. The food is really really good and they have such a big variety of foods. I honestly enjoyed it so much. Thank you for the experience."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMnZhNTZRRRAB",
            "text": "Absolutely Amazing Food and Ambiente, but sadly the bench don't fit 4 Fat people.\nBut the food ist absolutely delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOEtqZGxBRRAB",
            "text": "This used to be a good diner. I don't know what happened but the last 3 times my food was always super late and at a room temperature.  How is this how we do Nutella pancakes?"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4eWRmNmlBRRAB",
            "text": "It was a delightful and windy experience. This was one of the first outings we have had in many moons. The service was great, the food was great. I rather enjoyed being outside with photos symbolizing places outside of our normal in this part of town. Had gotten a wonderful waffle."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdGJLVTVnRRAB",
            "text": "Est. 1935\n\nLayout/atmosphere\n*Chrome exterior; counter and bakery display straight from entrance; tables, booths, two TVs; covered outdoor dining structure in street, booths on sidewalk; parking in back\n\nService\n*Solid\n\nFood/drink\n*Big Frenchie Sandwich (fried egg, bacon, sausage, cheddar cheese, three pieces of French toast) with French fries - good; fries solid\n*Cheesecake (plain) - really good; creamy [NY style]"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ0pEaDZnRRAB",
            "text": "Big group in the middle of the day. Took a while to get everything out but they put us together and got everything right. Didn't miss anything. Food was good. Service was good. Prices were reasonable. Glad they had off street parking.  Would go back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaF9yeEhBEAE",
            "text": "The wait was about one hour and fifteen minutes to get your order. My onion soup not good. Some cheese on top. Put in the microwave and warm. My panini was a Flatbread sandwich and was place on top the salad with fries. Very disappointing..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OThTd2xnRRAB",
            "text": "Too many items on a menu means nothing is really great. My burger was on a dry bun and was barely warm. It used ti be an ok.place but I would not recommend it now. Overpriced as well. Staff is friendly and it is spacious but they need to focus on breakfast, burgers and some Greek items only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdU9ucFJ3EAE",
            "text": "Billy Tsibidis & his cowner dad have served this Bronx community since 1982.  This handicap accessible diner has its own parking lot and street parking and covered outdoor seating, full bar (they make a mean variety of martini's)  and homemade desserts.  Try the Papa's Cheesecake, 🥕 Carrot cake, Chocolate Mouse pie and Bread pudding.   As for  food they are known for their triple tiered Bronx Burger.  However don't  overlook their International fare: Greek, Italian. Mexican and of course American breakfasts, lunch and dinners.  Specials offered every day.  There is a Children's menu and an attentive staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLbWtvNVdXOHZQcEN3EAE",
            "text": "Good food and great service"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNDl2ZjJBRRAB",
            "text": "The food and ambiance were okay.  I would eat there again, but it wouldn't be my first choice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OG9fQnNBRRAB",
            "text": "Came there for Mother’s Day  of course  I expect for it to crowded and have a longer wait time . The food for most part was cooked but wasn’t enough seasoning in the chicken Parmesan and  I wished they have enough shrimp in the shrimp scampi  they gave an  overload of pasta. I have to order a salmon  to get over compensate for that . Their mudslide was good as well as their lemonade they put sugar in it.   It well priced  I wished I would ordered the brunch instead.  I had to wait awhile to get my receipt for the order."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNXzVtTFV3EAE",
            "text": "Crosstown Diner is a very nice diner to sit to talk with people and have something good to eat. California Avocado toast is my go to lately because I love it. It's so light. They have other things that are good and they have brunch on weekends."
        }
    ],
    "reviews_count": 79
}