{
    "name": "Michaelangelo's Restaurant of Arthur Ave",
    "place_id": "ChIJCdXhVYD0wokRdg-4W4T1QCs",
    "grid": "BX3",
    "address": "2477 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.3,
    "user_ratings_total": 766,
    "phone_number": "(718) 220-8455",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neFMxbE1aRFpXVTFOTmEwOVlkbTVqVlV0NlVHYxAB",
            "text": "We've been coming to Michaelangelo's for years and it's always delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneVkySnlORFJ6VlRrM2JVcHJVRWxqWTJGcVQwRRAB",
            "text": "The staff and location was great. I would go back to see a more variety  of food. Looks could be deceiving because on the outside it looks like a small restaurant but when you enter it's really big in the back and has multiple seating areas it's really cute and has a nice great bar in the back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdmFIUm1WVmR0VUROQ1dWVmZaWGg0VEdGMFNHYxAB",
            "text": "This is my first time coming to this restaurant in the Bronx and I thought it was one of those smaller tucked in places but it was quite big in the back. It had a bar and had a very chill vibe with a couple of tvs playing different sports. I ordered ravioli with lobster and that was amazing. In the picture there is only 4 pieces but it comes with 6 larger pieces. In addition to this I also had the calamari which tasted good and had the perfect amount of crisp. The most notable thing that I noticed about this restaurant was how speedy their service was. The restaurant if I had to guess was at medium capacity and I was with quite a few people and they brought out the food in less then 10 minutes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTldGVmFRemRRVGxSU2VVZzBORlIzZEVWU2NXYxAB",
            "text": "After spending a day at the Bronx Zoo we got the cravings for pizza since Arthur Ave is nearby. I’ve tried other pizza shops in the area but was never to fond of any of them. I saw one person great review of Michaelangelo’s  and I’m glad we tried it because it is by far the best in the area. Freshly made with a perfect crust. They have an amazing spacious outdoor type of seating are in the back with a bar and the tv’s great for baseball playoffs and football. The owner is great,she greeted us and made us feel comfy. It’s definitely a must try."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdGRHeGhSakZaYVRZMWFUSjJhRkZTTmxGTlltYxAB",
            "text": "Great food, great service, beautiful atmosphere.\nHighly recommend. Our server, Enxhi was super attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb0xWVTJPVU5uWTFaVVpVWlVjazVZT1d0NlIyYxAB",
            "text": "We stopped in on a whim didn't think they could handle a party of 8 so quickly. After a little back and forth the two super friendly hostesses took us to our seats. DO NOT let this place fool you. Gorgeous, absolutely stunning garden area with large tables. Our waiter was phenomenal and very personable. The food was definitely something to brag about to our friends. You can easily underestimate this place just looking from the street. I wish I got our waiters name. He did such a great job. Even the bus boys were tentative to our table.\n\nThe only thing I wish was better was the time it took from ordering our food to food on the table. About 30/40 minutes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMVpGaE5XVkJuT0RJelZVNDRWV05EYURKMFQzYxAB",
            "text": "Great quick lunch, loved the back room and reasonable prices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYWIxRlNWemxxWWpKV1RrbHhjR1pXUTFreE1YYxAB",
            "text": "Ok so we went for my sister's 50th birthday and this place didn't disappoint.   Best Calamari ive ever had, soft tender,  crispy,  just amazing.   The stuffed clams were a 10!  More clam than stuffing and fresh.  I had the eggplant parm and let me tell you... it just brought me back to my grandmother's kitchen,  it was just perfect.  The service was impeccable,  atmosphere was great.  A true gem of Little Italy in the Bronx."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MlRIRkxNVmh3TFVOS2Vrb3pNMU5STlZaaGNtYxAB",
            "text": "An iconic restaurant on Arthur Avenue. Enjoyed the old school vibes"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR01DMTBlVWxVYW1aTE5XMTVXRjlNYVZNdFFsRRAB",
            "text": "Hidden gem, super intimate restaurant ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVWR6UlZOMWcyUms0Mk0yMDVYelZtTFc5dFgwRRAB",
            "text": "Dont be fooled by the front of the restaurant. When you walk towards the back to get seated youre teleported to a beautiful backyard garden/patio. Very spacious and bright. Ive been here a few times for dinner and private parties and ive always had a great time. My favorites are the stuffed mushrooms, chicken francese, brick oven pizza, and chicken parm. As for drinks, you can never go wrong with the homemade white sangria. Everyone also raves about the espresso martini. Service is fast and attentive and staff is very friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlJtOTFiV2hrV0ZweFpGcE5NVjlGV0VGWk4xRRAB",
            "text": "Richard and Francisco were wonderful! Our food was delicious. Would recommend the Penne allá Vodka but with cavatelli pasta!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdmhwWTZ5dFBMVnF3RRAB",
            "text": "Absolutely delicious, came to nyc for a family trip. A local man on the subway said this was the best Italian food around. I now see what he was talking about. I highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLUG4zby1Bel9qaC13RRAB",
            "text": "Came on a slow day. Service was perfect our waitress helped when our drink tasted off. Really attentive and food was delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM2UtYmJxbmFDWVNBEAE",
            "text": "Excellent servic"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYlk5WmZZNk51Y1lnEAE",
            "text": "Best steak we had in all of NY.\nLovely staff! ❤️\nIt looks so lovely in the back area, they should advertise it more for sure.\nTruely a hidden gem"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNNmp4Ny1EdjVfZElBEAE",
            "text": "Food was great but pricey.  They had entertainment when we ate. Music was very good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VObkdsb0hlb3JQRWp3RRAB",
            "text": "Wait time for take out pizza was a little long. Price was fair for the size of pizza. Tasted very fresh."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKN1EyOEt1aDZLc3Z3RRAB",
            "text": "VERY ATTENTIVE SERVICE..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2NLNkdnEAE",
            "text": "Atmosphere and service was a 5. Drinks were definitely overpriced and small but delicious. The food... Average at best. We had a large party, drove an hour from upstate to get some legit Italian food and pretty much everyone at the table was disappointed. Could have gotten this quality food in my hometown. The appetizer portion was tiny for $24 and not even that good. The prices on the menu on Google maps were way less than the pricing in the restaurant. Cute place to go for drinks but extremely disappointed with the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNmF5U3VnRRAB",
            "text": "Visited yesterday for the first time and loved the “outdoor” decor in the restaurant. Our food was wonderful - we enjoyed arancini, penne alla vodka and the skirt steak. Steak and vegetables were perfect. Service was excellent. Thank you!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdDhMTTl3RRAB",
            "text": "Excellent Italian dishes and friendly service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcDdLc29nRRAB",
            "text": "The food was authentic Italian exquisite cuisine."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdFpuc2NBEAE",
            "text": "Excellent food friendly staff beautiful ambience. Definitely going back for more!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdXVIcWdnRRAB",
            "text": "One of the better ones in the area, pizza and everything taste great  nice crust on pizza, sauce is well done great tasting atmosphere is great. For one or for families and  meetings plenty of sitting area very large."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUlTcFFnEAE",
            "text": "Branzino was delicious and the pear salad was scrumptious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aUlEM0tREAE",
            "text": "Delicious Italian food. We went for lunch and had the eggplant parmigiana and veal a la michaelangelo. The space was quite loud but the food made up for it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeUlINWNBEAE",
            "text": "I made a reservation of 10 yesterday with my company. Service was fast and friendly, food was fresh, and overall a good time. I would just suggest some more heating."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMjdTelpnEAE",
            "text": "Italian. Period. Genuine Italian cooking. Informal atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLXF6ajN3RRAB",
            "text": "Delicious and carefully prepared food combined with absolutely excellent service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeDViTEN3EAE",
            "text": "The restaurant had a charming atmosphere, but the experience was underwhelming. We waited a long time for our food, and when it finally arrived, it was just average."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MGRqSHpRRRAB",
            "text": "Un lugar bonito, en el patio de atrás se ve un lugar familiar, buena atención 👌 son super amables"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Zy1ienN3RRAB",
            "text": "Very busy place...five holiday parties tonight but the staff managed it all very well.  Service was good and food was excellent.  I would definitely dine here again."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURraGRpSG1BRRAB",
            "text": "I’ve worked in the area for 31 years and not only frequented this restaurant but also held work luncheon where we have ordered hundreds of dollars in food.\nUnfortunately myself and my co-workers (especially myself) were not happy with our luncheon order today. I ordered a Caesar salad that was smaller than a house salad served with your entree and bottled salad dressing. I was charged $18.00 for this salad and when I asked to add chicken they wanted to charge me an extra $12.00. That would have cost me $30 for a side salad serving.\nShame on you guys for over-charging customers for below mediocre food! So disappointing!  Having said that I/we will no longer order from here! I regret not taking a photo. 😑\nBeware customers!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQamVYcVFnEAE",
            "text": "I came in for lunch last week on Thursday. Almost didnt eat there because of how small the front is, but the backyard patio / garden was so nice and surprisingly warm!  Our server was really friendly I just wish I could remember her name. Food was good, didnt take long served nice and hot. Could use some more salt/ seasoning but overall a good experience and I would come back :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQamZIeFdnEAE",
            "text": "Great food, very inviting. Would definitely recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHFPWGlBRRAB",
            "text": "A Disastrous Dining Experience\n\nI am writing to express my extreme disappointment and concern regarding our recent dining experience , Despite taking every precaution to inform the staff about my wife's severe gluten allergy, a careless mistake resulted in a horrifying ordeal.\n\nMy wife was served gluten-free pasta that was clearly contaminated with gluten. Within moments of consuming it, she began to experience severe pain and was forced to rush to the bathroom. The negligence displayed by the kitchen staff is both shocking and unacceptable.\n\nThe manager's panicked response further compounded our distress. It is evident that the restaurant lacks adequate protocols and training to handle food allergies, particularly those as serious as celiac disease.\n\nThis incident has caused significant physical and emotional trauma to my wife. We expect a sincere apology, a full refund, and a thorough investigation into how this could have happened. We urge the restaurant to take immediate steps to prevent similar incidents in the future, including rigorous staff training and strict adherence to food allergy protocols.\n\nWe will be sharing our experience on various platforms to warn others about the potential risks of dining at"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMVBQenJRRRAB",
            "text": "The service and food, as well as spaciousness, make Michaelangelo's a great place to eat and meet. I am a native and a regular. Love it, and my props to everyone there and Sylvia. Va bene!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzb0ltWUtBEAE",
            "text": "Checks all the boxes for an Arthur Avenue Italian restaurant. The dining area in back is spacious and classy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzM3Z6V2JnEAE",
            "text": "I am sooo sorry to say that Michaelangelo's fell off. The food was absolutely disgusting. I ordered a Lasagna and a personal pizza pie. The Lasagna was crunchy because it was burned and the pizza was cold and flimsy. The waiter was…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMEpQdll3EAE",
            "text": "I ordered a pizza with eggplant. I live less than a mile from the restaurant. The delivery took 50 minutes and the pizza was cold, soggy, and had looked like it had been dropped when it arrived. It also included sausage, which I did not order and do not eat. If you cannot guarantee the quality of a $50 pizza, don’t use Uber Eats. I will not order from you again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNDVMRmR3EAE",
            "text": "Still one of our favorite places in all of NYC (and we live in Queens). We stumbled upon this place about 7 years ago (was gonna take my Thai boyfriend to White Castle, lol, and ended up here instead). The food is always delicious and the wide open patio seating adds to a relaxing atmosphere. We even lucked out this time and were treated to live music from a female singer. She had a beautiful voice and a very eclectic playlist to sing to. Portions here are also very generous and we always bring food home with us. I always look forward to a trip here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMzZYZUx3EAE",
            "text": "Great atmosphere! Friendly staff. I got the penne a la vodka and added chicken to it. I gave it 4 stars only because I wished the portion was a little bit bigger"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdDZQd3ZRRRAB",
            "text": "Best Alfredo I’ve ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb3FQT193RRAB",
            "text": "This place is beautiful and low key the food was perfect drinks where on point my first time coming here and I well be coming again Leo was absolute Gentlemen and professional  really cool guy My friend Amelia was the one who took me here. Thank God I'm in love with this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeGY2djlnRRAB",
            "text": "The servers were very nice and the food was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdk5lY2lnRRAB",
            "text": "I definitely wish i could put 0 stars…This food was SO disappointing and disgusting. This was so unfortunate because my whole family went there hungry ready to eat and everyone disliked there food. It was so bland, unseasoned and gross. definitely do not recommend, DO NOT GO!. This place definitely needs a new chef."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdkl6RmN3EAE",
            "text": "Food is very BLAND , Place needs NEW CHEF , Very disappointing Dinner !!! Nothing was Good !! Was there on 9/1/24 After a Yankee Game. Would not recommend at all !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIekppZnVRRRAB",
            "text": "Penne w vodka/salad special/linguine w white clam sauce"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OGFlX1V3EAE",
            "text": "Great taste!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqN0lDNkpBEAE",
            "text": "Got to the restaurant the front of the restaurant is small, waited no more to than a min to be seated. The hostess took us to the back of the restaurant. To my surprise, it was huge, well decorated and beautiful . I loved the design and all the details, truly 5 stars. Service was great, as for as attentiveness, bus boy kept trying to take our plate and we were not done. Food comes less than 5 mins after ordering it. The  appetizers and food were ok at best. Was not happy with the food at all. Drinks was a good waiter/bartender, which was great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N3V2MHFnRRAB",
            "text": "My family took my Mum here for Mother’s Day and it was a very pleasant experience.  They were super busy but provided us with enough delicious bread to hold us over till the food arrived.  The mussels in white wine were amazing and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMnZPRHpRRRAB",
            "text": "I went here off a recommendation. Overall it was a decent experience. I loved how the bar and restaurant seems to be hidden in the back. The food was a bit bland and seems unseasoned but well cooked. The drinks had to be sent back because they were very light on the alcohol so I had them remade. Which we were charged for surprisingly. Other than the mystique of the place, I would be hardest to recommend this place for the food or drinks. Though I did not try the bar, I may return to see if this is any better."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDaUlHVV9nRRAB",
            "text": "If you're looking for an authentic deli with awesome sandwich combinations, you must drop by this place. A tad pricey in comparison with its neighboring competition, but it offers some of the best burger combos in the area - the menu is massive. Wasn't able to drop by before the pandemic so not sure if they always used the same ingredients previous to lockdown (the patties and fries seemed to be frozen/precut). Nevertheless, this place is a community gem. They have ample curbside seating and decent service. In the same vicinity of 7/11 and tons of other outdoor dining options. Be sure to wear a mask if you order inside. The cons of this place is that we sat ourselves and no one acknowledged our existence on the side seating portion of the establishment."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdzdpQm93RRAB",
            "text": "Looks very small at first, when you walk in, but opens up tremendously in the back to a nice seating area and bar area (bar not pictured). Would definitely recommend the chicken a la Michaelangelo's which was a great meal with the side of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxNkpTU3ZRRRAB",
            "text": "From the manager to the waiters and cooks, everyone was very friendly and attentive. Now the food, OMG, it is extremely delicious! I have no idea how they make their marinara sauce, however, it is finger licking good. I had to take an order to go. I am definitely going back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NzdpMVlBEAE",
            "text": "Went there post Christmas in 2020, Just did a simple google search and found this gem. The entrance to this restaurant can be deceiving, It's actually a huge one with open brick walls, lots of green space and pretty lights. The ambience was delightful with music and the staff was very courteous. We were a group of 3 and there were no other guests when we entered. Ordered Rissoto Arancini and White pizza, but got a veggie pizza with white base instead which I believe was due to my voice being a little inaudible in mask but nonetheless the pizza turned out to be good. We were given  complimentary breadsticks with salsa, which was nice to cure hunger pangs till the food arrived. The restaurant also has two restrooms. The prices are on the higher side but the taste covered it well. My only suggestion being, when I asked the server if the Rissoto Arancini was vegetarian with eggs in it, he had replied that 'it has Cheese', which vegetarians do consume but vegans don't. If the servers could be informed the difference between Vegan and Vegetarian, it will help people like me with dietary concerns or limited food options. Would definitely visit again when in Little Italy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdWRIcEV3EAE",
            "text": "Just had an amazing dinner. Our server was Leonardo, a polite and professional gentleman. I was happy to have ordered the white sangria and one of Michaelangelo’s specials as my friend ordered a chicken parmigiana. This I will say is a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlXy1Ea2xRRRAB",
            "text": "Nice restaurant with great atmosphere. TV's at the bar. Food and drinks were excellent at good price. Great service.  Very friendly staff. Would recommend"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NnRtbU93EAE",
            "text": "We celebrated my husband's 50th Birthday here. The service was impeccable and the food was delicious. We definitely recommend this place. We'll be back for sure. Thank you for making it a very enjoyable experience even during Covid times."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlemFTaWdnRRAB",
            "text": "Went here with my family and it's just an iconic New York restaurant for all out of towners! The atmosphere is fun and the cocktails are phenomenal. I had the espresso and lemon cocktails, and both were amazing. I would go back for drinks.\n\nThe gluten free pizza was gluey and pretty meh, but my husband's shrimp risotto was decently tasty.\n\nOur son also loved the place and the Halloween decorations were really fun."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbU03ODlBRRAB",
            "text": "Delicious food. Love the outdoor indoor ambiance. It was cooled inside somehow under this canopy. Surprisingly empty for a Monday evening. I went with my sister and we were maybe one of 2 diners. She enjoyed her pasta and I enjoyed my pizza which they accommodated for me to make vegan without cheese. The bread was really good and came with this tasty seasoned red sauce. The service was friendly. Would definitely return and Carlo’s acknowledged us on the way in and out. The food was so good I did takeout and got my partner his calamari for home which he enjoyed and another personal pizza for myself to eat later in the week! Would definitely return. 5/5"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNkpLend3RRAB",
            "text": "The food was superb and ambiance was beautiful! Bread with dipping sauce and the bruchetta were fresh and so tasty. We ordered the margarita pizza and the white pizza and hands down - best we have had. Service was a tad slow but worth it.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM3RHRWlRRRAB",
            "text": "STAY AWAY! I ordered a prosciutto pizza from this place. The picture is what I received.... A horribly looking overly BURNT and COLD pizza. No prosciutto no arugula some type of wilted green leafs on top and that's it. Unacceptable. Will never order from this place again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcjdfYVRBEAE",
            "text": "Ambiance is nice. The seafood platter was gross. It is the worst plate of seafood I've ever had.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMHFPNHdBRRAB",
            "text": "Had a lovely Mother’s Day with my family!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMktmNUVREAE",
            "text": "Amazing atmosphere at this restaurant, amazing food and very well seasoned, had the rack of lamb and it was very good, my wife got the fettuccine alfredo pasta with chicken, for the appetizer we had stuffed mushrooms and it was very good. I give this restaurant 5 stars for food and 5 stars for service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNdDZ2UXVRRRAB",
            "text": "Food was amazing. I had the eggplant parmigiana with angel hair paired with a glass of Malbec. The restaurant itself is beautiful. Service was a bit slow due to only one waiter working that evening."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVa0plcXV3RRAB",
            "text": "Lindo ambiente, excelente servicio al cliente, la comida muy buena por buen precio."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZzhMdnlnRRAB",
            "text": "Very professional staff! The food was delicious!Highly recommended !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhaHNtck53EAE",
            "text": "I love the set up in this place I went early around 3pm so no one was there. I didn't give it a 5 star cause would like to know how would the service  be when the place is pack drinks was worth the money and food was good also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZzdIMGl3RRAB",
            "text": "I went with a couple of friends last Sunday. I am a foodie person. The service was great, I can't complain about that. But the fact that your waiter is also the bartender at the same time sorta throws you off a bit. The food was tasty but not all that great. Also, one of our friends' food came out last and had to wait while had our food there wasn't that good.\n\nI will come back and give it another try myself. But I don't think the people I was will come back."
        }
    ],
    "reviews_count": 72
}