{
    "name": "Minato Izakaya & Garden by Porto Salvo",
    "place_id": "ChIJn2Kr0cn1wokRV26IuUgbVTk",
    "grid": "BX3",
    "address": "407 E 161st St, Bronx, NY 10451, USA",
    "rating": 4.5,
    "user_ratings_total": 111,
    "phone_number": "(929) 376-9651",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201emFrNXVTSEF0UzJ4SVJGaGlUbm8xT0dkWlIzYxAB",
            "text": "I'm delighted with the location the service and the cocktails I was surprised by the wide variety of delicious drinks I ordered them and they arrived at my table immediately, and I was already enjoying them thanks to the friendly, attractive, and charming bartender."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlFYcEROSFo2WWtOVWJtbHhjRGhTVDE5TFRtYxAB",
            "text": "I had a spectacular evening at this restaurant in Minato I sat at the bar The bar itself is beautiful and the service was outstanding The drinks were delicious the best martinis I've ever had and I was impressed by the selection of Japanese whiskies Marco the bartender I'm not sure if he was the manager but his service and quality were excellent He earned a very generous tip He kindly explained most of the whiskies to me, and my favorite of the evening was Nikka Days The food was superb, as was the ceviche. Without a doubt, the service was excellent, and the restaurant is second to none A hidden gem."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRU9XZzNjVGx0VmtSTWR6WTRhVjlVVXpKRFZIYxAB",
            "text": "Terrific local spot that is really needed in the area. Will be back soon with a group of friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4M1h6RmxjbVZYYlhsWmVFRjRPRFZ1WldreFNrRRAB",
            "text": "Friendly staff, delicious food. Large back garden area"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMWRWaEtNa3hVUmtaSFdrZHVjeTF0TlZGbU4xRRAB",
            "text": "The staff is very welcoming I recommend everyone to go here this is the best place to eat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poV2RHZGFNVFEyVERCWlIwMXVWSEpvUjJVM1dHYxAB",
            "text": "The food is delicious. The service is awesome very friendly and very affordable. Great for date night or hanging with friends highly recommend.!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tndGQyOWFPRU5IWmtONk1WSmxWMVpPVm14bE1YYxAB",
            "text": "Hole in the wall but don't let that fool you food was fresh and great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd2RDMVNObW80VGxwNGMwOVRYM0JETjFVMU1tYxAB",
            "text": "Shaquille made the best drink ever. A cucumber cocktail. Top 5 easy.  Recommended for sure"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeFNVMVdYMUY1V0hsR2F6STJSbkV5TFZkWFNYYxAB",
            "text": "Went here with my brother and the food, service and atmosphere were great! A fantasy local spot I absolutely want to return to. And the back area is one I definitely want to bring my girlfriends to for drinks. Great for pics."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoa1NITlFRamRoTkdSNmFsRmpNa040TTJVNE1IYxAB",
            "text": "An amazing experience, especially because it’s a Local gem very humble and affordable thanks to Thomas for taking care and making it an experience.  My boyyy!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUVUxWlNWMWR6UmxneFNESk5ORlZ3Y2tJMVpVRRAB",
            "text": "Wow this is a gem love this spot so great service From Thomas!!! I was here today and was the best service eve thank you !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM1RUVmlkbUY1TnpSR2NqbDNVak40UVU1RlRFRRAB",
            "text": "Had very nice tempura here. Staff is very nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScWNscHFVRWc1U2xaZmJERXRhamcwWDNrM04zYxAB",
            "text": "Being a patron from day one, it never changed and always been a very good restaurant The staff are very professional and treat everyone special."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWVNHdE1aMDVCZFdKR2NuRnlkMUJtUmpSdU1FRRAB",
            "text": "I highly recommend this spot. The food, the music and the service is on point. Thomas, Rachael. Ally, Frank and Marcus are very professional and know how to treat a patron."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aU1NWSktWR0Z1U0hoVlNWVlhiekpWYWtrd2RuYxAB",
            "text": "Highly recommended date night spot 💯😻🏆\nRachael is the absolute best! 5 stars all around\n🌟🌟🌟🌟🌟"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbGJHeHRiSEo1Vmt4S1duZFRSbm94VDA5VlZIYxAB",
            "text": "I spent a pleasant afternoon here with my family on Sunday and found this place. I loved the service. The waiter Marco served us at a very nice table in the garden I loved it The drinks weren't perfect, but they had their charm The food was spectacular I will definitely return Very good. 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcmNHVlVVbHBDYlhOWVVUTlVUM1J1TTNOWVRYYxAB",
            "text": "Minato is one of My favorite place staff is great the food to die for, atmosphere amazing, come to Minato and check it out, I wouldn't stir You wrong. #djpapahulk"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOME1XWlRjblZ4VEZsd2IxOXFUSFF6Y1RWMk9VRRAB",
            "text": "everything sucked, LITERALLY. I give a 0 out of 10 rating"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eTZqLXl3RRAB",
            "text": "Echoing some recent commentary by other reviewers that Minato is not what it was.  Sushi chef and sushi grade seafood have disappeared so don't come here expecting sushi- because you won't find it-just a few ersatz \"rolls\" remain on the menu and they are without flavor.\n\nWhen Minato opened, it seemed simply too good to be true that a sushi restaurant of the first order was operating on East 161st Street...and so maybe we should be grateful for the two years they gave us.\n\nBut we are all too familiar with the \"downgrading\" or dumbing down by business operators that often occurs here in the Bronx after the shine of the grand opening wears off...but we were just hoping it wasn't going to happen at Minato. We'd just been through this before Minato opened in fact, when another popular sushi restaurant in the area likewise cut quality & service -and then abruptly shut down.\n\nMinato remains for now an attractive and authentic looking space that feels surprisingly Japanese-all the more reason that you're expecting to see the sushi guy at his place along the counter when you enter.   But now he's gone and the restaurant in current iteration is more or less a generic place for drinks and unremarkable bar food.\n\nWorthy of a big shout out though are Minato's dedicated and longtime employees who continue to do their best amidst the shifting winds to create an inviting atmosphere where all feel welcome.\nThey are the best thing about Minato !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeE5HSkdhMkZvYVd4cVN6SlhWRGMzUTFoQ1RsRRAB",
            "text": "Decent place in  a shady area - the only question I have is why they have a cat on premises?  The answer rhymes with cats.  Night disposal?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WFRuVkdWa1pJV0ZCNGRYRnlZVjlMT0hkM2RsRRAB",
            "text": "Very dishonest. I was a party of 3 and they added gratitude. The check was presented on the toast pos and did not reflect this. So I ended up tipping on top. Incredibly dishonest and I will not be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1Z5MXFRWGhKZG5aTGNISkhaalEwUjFaU2VFRRAB",
            "text": "Its unfortunate..  Hoping that I stumbled across a hidden gem deep in the Bronx, I decided to check out Minato...\n\nSummary: Weird odors, located in a basement, seems to havr lost their Sushi offering, & bad service..\n\nHonestly at first I thought it was great to find a japanese sushi spot with a basement-esque vibe.  It also had a serene enclosed back yard with Asian themed decorations.  I figured it might have been a great after work drink or dinner spot.\n\nUnfortunately, it's not worth a visit due to the following:\n\nthey don't serve any sushi..\nthey had very few traditional Japanese dishes...\n\nWhile decently decorated, there is a lingering and pretty regular faint smell of sewage throughout the restaurant, or at least the indoor dining area.\nThey did have sake, but it was a low quality and was not served at any kind of regular temperature when ordered hot.  Once it came at room temp, another was scolding hot..\n\nThe Vibe:\nNot sure if these guys had some previous instances or if its just a social club with food, but they definitely had a weird kinda of anti social energy towards anyone who wasn't a regular and whom the owner or manager didn't call out by name upon entering.  Basically, if they didn't know, you would be prepared to roll the dice at getting treated shady.\n\nThere must be an issue with their food health inspection rating.  Due to the faint sewage smell that was regular throughout the 3 times I visited, the lack of sushi & other japanese staples, and the horrible service I gotta say, skip it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weWJpMU1kRmN4VXpJeFRWcEZZbFUzV0ZaNU1sRRAB",
            "text": "Food has deteriorated dramatically - when I enquired about the change I was informed the previous sushi master  had left and not been replaced adequately.  This shows in the standard of the rolls and cold food - hot food is decent enough.  I gave 5 stars for atmosphere as the staff all appear to drink heavily behind the bar - reason enough for an excellent atmosphere.  Hopefully the staffing issues can be amended as it a great place 6 months ago."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMFJqTnFTRGxXTkVOeE0zRmxZV0Z6VFVsNk9YYxAB",
            "text": "I personally do not like their rolling technique for sushi. There’s too much rice. The chicken karaage was delicious though! Solid 3.5/4\n\nAlso, I didn’t think the musical was a little too loud."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLWHpscVhXX3Q2SnV3RRAB",
            "text": "They apparently lost their sushi chef and it shows. Sushi is horrible now. Also their menu changed to reflect fewer sushi rolls. This place used to be good but once again , the Bronx encrapifies itself."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa2JtcDBTbkZCU0doUmJXUmxOVE5pVURCTGFWRRAB",
            "text": "Please bring back the old man that used to make the sushi! It was odd to have salmon sushi partially cooked. What's going on? We were here a month ago and it was great. The sushi quality definitely dropped. I appreciate the updates to the backyard area and inside though!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdlVWUjZRbmxXTVVsTVh6TmhMV05GZURWVVgzYxAB",
            "text": "We ordered sushi for takeout. It was about a 30 minute wait. The employees were not very attentive, seemingly under the influence at that.  Never have I ever received halfcooked sushi. I'm still unsure how that even occurred. I STILL tried it anyway, against my good judgement and almost immediately got sick. I wouldn't recommend  this place to anyone other than to not go for sushi. That is all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbmNYYzFYM3BaUVdWcWNsaDJaMWxRU214UFNGRRAB",
            "text": "Literal 5 stars across the board! I had such an amazing time here from the cozy and chill atmosphere to the fresh food. The sushi portions were great and the food was so fresh! Also, the staff were amazing as well. Definitely would recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaUV1LXlqMGVlemdRRRAB",
            "text": "Exelent place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNlp5Y1RWeWViNnBnRRAB",
            "text": "Atmosphere is beautiful inside and outside at the backyard."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWFZfdHY3MTVTS2pnRRAB",
            "text": "I love this place !! Something finally this good in the bx"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaHZ1c0JBEAE",
            "text": "This place used to be an amazing sushi spot, the rolls were great and the service was as well. But recently I’ve went with family and they’ve taken out all of their sushi leaving only two rolls on the menu and having everything else be meals now and overall it’s not worth it. We got to minato at 4:02 and left at 5:45 because they took extremely long to bring food and even to bring us menus and it wasn’t even busy. This place is not what it used to be and I will sadly not be coming back bring back the sushi"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJallmbXlRRRAB",
            "text": "Excellent selection of sushi and the service was amazing. Do not sleep on the surf and turf roll!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReEptS2FREAE",
            "text": "The large assorted fish was incredible. My server, Rachael, took care of all my requests with care. Will be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbnRqbk53EAE",
            "text": "Food is great and place is cute BUT they auto add in 18% gratuity. We were a party of 2 so not one of those large group issues. And I didn’t know about the automatic 18% tip so I also tipped. Ended up spending about $30 on the food and $30 on the tip. FORCED TIPPING IS NOT OK!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnekxDSnhnRRAB",
            "text": "I dont usually write reviews for restaurants, but I had such a great time I couldn't help it! The vibe is really nice and cozy, the music is good and it's a really chill environment to hang out with friends or family. They have a beautiful patio for when it gets crowded that my family was really lucky to see. The food was really good. I'm a vegetarian, and they had enough choices for a comfortable experience, and they were also comfortable modifying the order as well. I loved the vegetable gyoza, avocado spring rolls and the green tea creme brule was divine. We sat at the bar, and the server Juan was very amiable and was such a good conversationlist. I highly reccomened this restaurant!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdXRmVS13RRAB",
            "text": "Excellent food and atmosphere"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMWZISjdnRRAB",
            "text": "Great people. Cool atmosphere. Just pleasant as an escape. Cool dining area out back 🔥"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeEtTdkZ3EAE",
            "text": "What a charming restaurant! Minato Japanese in the Bronx was cozy and welcoming. It started a bit noisy, but the sound level settled down.\n\nThe attention to detail on each plate was impressive and the food was absolutely delicious.  Every dish we tried was packed with flavor, except for the karaage chicken. We should have asked whether it was dark or white meat, but we were a bit disappointed with it. We had hoped for white meat chunks, but it didn't quite meet our expectations. The other dishes we ordered, such as edamame, seaweed salad, vegetable gyoza, shrimp tempura, spicy tuna roll, shrimp tempura roll, and soft shell crab roll, were all fantastic. For dessert, we ordered the yuzu ice cream, green tea crème brûlée, and lychee panna cotta, all of which were delightful.\n\nA big thank you goes to Frank for providing exceptional service throughout our meal. His expertise with the menu and attention to detail made the experience seamless. Frank was friendly, attentive, and went above and beyond to make sure we had a memorable dining experience, even discussing custom substitutions with the chef for someone with a shellfish allergy.\n\nAll in all, from the moment we walked in, we knew we were in for something special. The whole experience—delicious food, excellent service, and a lovely ambiance—was outstanding. If you're looking for authentic Japanese cuisine, Minato Japanese Bronx is a must-try. From appetizers to desserts, it exceeded all of our expectations!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbGRxV0xnEAE",
            "text": "Estuve buscando opciones de sushi en el sur del Bronx y esto es lo mejor que he encontrado, un pequeño lugar pero totalmente cálido, con buena atención de parte de los trabajadores, el sushi es bueno y fresco, gran variedad y precios muy acordes a la calidad , los visitaré otra vez !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaXZPUVZ3EAE",
            "text": "I’ve been wanting to go here, and it didn’t disappoint! The chicken avocado roll: 10/10."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aUtmVk53EAE",
            "text": "My two friends and I arrived around 6 pm and ordered happy hour drinks, miso soups, some rolls and a dessert. We sat in the garden and enjoyed how pleasant and beautiful it was. Miso soup was lovely and prices were approachable.\n\nHowever the issue arose when we finished up and went up front to pay. We split the bill and were presented with prefixed amounts on the card reader we all assumed the tip wasn’t included and tipped. I noticed the amount was a bit higher than I’d anticipated but dismissed it because I was having such a great time with my friends however I did have a receipt sent to me via text since I had a lingering feeling. I was disappointed to see we had already been charged an 18% gratuity without any notification or any warning printed on the menu. Typically gratuity is charged automatically to groups of 4-6 during peak business hours not 3 people during happy hour on a Monday night. Definitely left a sour taste in my mouth and sadly will not be returning."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN0pfZUlREAE",
            "text": "Buscaba un lugar de Sushi en el Bronx, y encontré esta joya. Me encantó el servicio y la comida."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdElhQk5BEAE",
            "text": "Our dinner at Minato was amazing! I was truly impressed by the ambience and serenity of the garden area, with beautiful lighting and a fountain. The staff was incredibly kind and informative as they fielded all of our questions, and even were open to adjusting our order based on our preferences.\n\nHighly recommend the assorted fish flight and salmon flight, and the teas which came in beautiful pots!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcS1TWnhnRRAB",
            "text": "THANK YOU SO MUCH MR FRANKLIN. GREAT FOOD, ATMOSPHERE AND AWESOME SERVICE."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eWRYRVVREAE",
            "text": "We have been there twice and are very happy to welcome this gem to the neighborhood!   Food quality was very good and fresh.  The rolls are very good here!  The back patio is nice and peaceful  -- it's covered and has AC so perfect for the summer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaDRTN3NRRRAB",
            "text": "Our second time visiting this spot while in town to see family. Very cozy, freshly made food we had Avocado shrimp spring roll stuffed with avocado delicious. Also the chicken karaage, and shrimp tempura. The vegetable tempura, tuna poke and seafood ceviche deserve mention which we tried the first time all spectacular. Lastly the shrimp dragon roll, Godzilla roll and Yakiniku don (grilled beef and rice) for kiddos that don’t eat fish. The first trip they also had shrimp shumai, veg gyoza and chicken Katsudon all very taste as well. Definitely stop by this charming lil spot for sushi and drinks you will not regret it. Forgot to take pictures until after we had already had a few bites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiak1YLVhREAE",
            "text": "I took my girlfriend here. Amazing food, amazing service, amazing atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHAydHJBRRAB",
            "text": "I love it all! Walking distance, cute and quiet.  Good food! Great lychee martini! I just wished it opened earlier.......!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMelluM09REAE",
            "text": "Drinks on point food was awesome n prices was amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN0pTUk5BEAE",
            "text": "I had an Amazing time, sweet vegetable giosa and Minato rolls have an amazing great texture and flavor. Nice hidden Gem in the Bronx. Will recommend. Good Food. The atmosphere is so nice 🙂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaVlUTWVREAE",
            "text": "This spot is a heavenly hole in the wall. Perfect for locals that want a nice vibe and great Japanese food. Everything was cooked to perfection and the decor is lovely. I tried hot sake for the first time and while it's an acquired taste, i appreciated how it prepared me for the rest of the food/drinks. I came here on a last minute whim with a friend and we'll definitely be returning.\n\nCome here after work for a nice drink and some sushi rolls or plan to celebrate an event, it's appropriate for both!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbzZlak53EAE",
            "text": "I love Minato for us in the Bronx ✨\nIt’s a calm low key gem..\nI really enjoyed the outdoor backyard seating with the wind chimes and relaxing music playing through the whole room.\n\nFood: The rolls are good with a beautiful presentation, the mussels soup was absolutely amazing!(I ordered one to go )\nThe shrimp shumai were tasty and the shrimp tempura were such a great crunch. ( just wish we had 2 more 🥲)\nThe lychee Pana cotta was such a creamy dessert, simple and lightly sweetened . The mochi ice cream and the red bean paste were different.. not my type of dessert but not bad!\n\nThe drinks were moderate but delicious and the bartender is super humble ✨💖"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ODUzVWV3EAE",
            "text": "A very flavorful Sushi and Japanese cuisine experience! The restaurant is very cozy the staff is very nice with great service. Loved the selection of Sake and Japanese Whiskey's. Even the green tea deserts where amazing. I will be back expecially when the backyard is ready. A very much welcomed Bronx Gem, Recommend!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dkpDbkN3EAE",
            "text": "Great concept and addition to the neighborhood. Had an authentic Japanese feel and the food was on point. This place boast a small and intimate atmosphere with lovely staff. However it lost points because the floors were dirty and the table they sat me was sticky. Overall the place has potential, but could do with a lot of cleaning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMjZxZDdRRRAB",
            "text": "There's so many great things to say about this establishment. Let's start with the ambiance. The atmosphere and brand new decor made the restaurant very chic and clean. I definitely didn't feel like I was in the Bronx, but in a traditional sushi restaurant in Tokyo, Japan. Not to mention, I was met with excellent and attentive service.\n\nThe food, absolutely delicious. I ordered...\n\nAvocado/Shrimp Spring Rolls, which was a good portion and really tasty.\n\nKaraage Chicken, definitely not your traditional boneless chicken tenders, which had a very unique and savory flavor with a touch of Japan.\n\nShrimp Tempura was crisp, juicy, and tender. Mixed with their soy sauce, a very tasty appetizer.\n\nMinato Roll... I have to say that this was the dish that stole the show. I'm not traditionally big on sushi, but this meal definitely opened and expanded my taste buds. The combination between the crab salad and Chilean sea bass, with the drizzled sauces and hint of wasabi. Chef kiss. 🤌🏾❤️\n\nMy overall experience was an excellent one, and I will definitely be a frequent guest. 🙏🏾"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeExXQVJ3EAE",
            "text": "The owners of Porto Salvo didn't disappoint. Finally, it is open .. announcing PORTO SALVO JAPANESE .  .... Thanks Mark & Lugui\n\nI love their signature drinks and amazing dishes.  We had the following.\n\nSeaweed Salad\nKaraage Chicken (winner)\nSpicy Tuna roll (winner))\nCalifornia Roll\nSalmon Roll\n\nChicken Katsu Don (just enough)\nChirashi (Balanced with Rice and Assorted fish)\n\nFollowed by\n\nLychee Panna Cotta with real Lychee\nGreen Tea Creme Brulee (I do have to admit, I loved their  Basil Creme Brulee at  Porto Salov."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOVBYaUJBEAE",
            "text": "This place was amazing!! I’m so happy I found a great local spot. The food, drinks, service and atmosphere was more than perfect! Juan and Stephanie took great care of us! I will definitely be back :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MUk2M3JRRRAB",
            "text": "New Sushi Spot walking distance from the crib! Wow....we had a great time and the food was delish! The service was great and the owners table visit convinced me things are just going to get better!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONEx2ekNBEAE",
            "text": "I read about Minato Izakaya from Google reviews and had to give it a try. I'm still s noob at traveling and decided to walk from Yankee Stadium to the restaurant needless to say I was worn out. I guess I looked bad because when I arrived I was greeted by the hostess and offered a seat and a glass of water which I accepted. I looked at the menu and went for the Poke bowl (my first ever) I couldn't enjoy the food there and took it to go. When I got home, I opened my Poke bowl and thoroughly enjoyed it as I relaxed. I'm looking forward to going back and enjoying some other sushi dishes in a more relaxed manner, hopefully this weekend.\n\nEdit: I went again yesterday 2/11/24 and had the Lobster Salad Roll in the picture and the cocktail they were both good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNks2LWNnEAE",
            "text": "Absolutely loved it and so did my loved ones. Beautiful ambiance and service. The bartender Allie made us feel like royalty. I thank the owner for bringing this place to this area!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdXBYcWFREAE",
            "text": "So I'm happy to say that I got to try this out. There is room for improvement when it comes to certain dishes that we had in terms of like the warmth of the dish. For example we had the edamame and most of mamas I've had are usually hot and steamy this was either lukewarm to cold. The vegetable gyoza was okay just felt like it was missing something in terms of flavor but otherwise fine. The muscle soup also okay. The main dish Chirashi Don  was good, but I feel like the prices are a little high for the atmosphere you're getting but this could be due to them just opening so I know that one of the workers had explained to me that they are planning on expanding so to be fair maybe in the next couple of months it'll have more improvements so only time will tell."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMWYtSTdBRRAB",
            "text": "My daughters and I have found our favorite sushi spot. We absolutely love it! The atmosphere is low-key and has an amazing vibe. The music sets a great tone, making the overall atmosphere just perfect. Even though I highly recommend this place, I hesitate to do so because I want to keep it as our little secret. I don't want it to become overcrowded. I know it might sound shady, but this sushi spot serves the best sushi I have ever tasted, and my daughters feel the same way."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ3VtUVlREAE",
            "text": "New Japanese establishment. Food was great, staff was alert and professional. Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1Nk92TmR3EAE",
            "text": "This spot is a gem..tucked away on the corner of 161 street ...once you get inside you forget that your in one of the worst area's of the bronx"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MFliNVBnEAE",
            "text": "Awesome place! Innovative dishes, yet also reminded me of Japan!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMGQ2TGhBRRAB",
            "text": "Amazing little getaway on 161st. Food and service is great, so is the staff! The atmosphere was a pleasant surprise."
        }
    ],
    "reviews_count": 67
}