{
    "name": "Jay's Spanish Restaurant",
    "place_id": "ChIJCX96OgD1wokRr1Kw5utCbQw",
    "grid": "BX2",
    "address": "898 Hunts Point Ave, Bronx, NY 10474, USA",
    "rating": 4.6,
    "user_ratings_total": 14,
    "phone_number": "(718) 219-5019",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YVRtTXlNVWc0Um10SlgwNDFYM2hPUWpCemNGRRAB",
            "text": "Food is good they just don’t turn the rice often so it’s bound to be hard and dry please turn your rice don’t just let it sit"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MWNqRm1YM0pqVG1sdk9YSkNTRWMyUjNOcVNFRRAB",
            "text": "Shout out to Jay and his staff for coming thru via catering for an event me and my wife was hosting over the weekend,I must say the food hands down was amazing. I definitely will be returning in the near future for all my event catering needs."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ2VVVm5iRVl4YmxsT2RIQnNaVTlEVTJWV1ZHYxAB",
            "text": "Thank you Jay the food was amazing. Thank you and your team for a great service. My husband and I and our family enjoyed the food. We appreciate you for coming through. The event on 7/12/2025 was a success."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbFJXaHpXRmc1UmpJM2EwaDBjVkIxZERWNmFYYxAB",
            "text": "Really good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeFgxRm1WRWN0TFZGaloxWnRWamxDTkdkNU5XYxAB",
            "text": "Jay & Jessie really made me feel welcome the second I walked in. They didn’t just take my order—they actually took the time to understand what flavors I like and gave solid recommendations that hit the spot. The place itself is super clean and well put together, which I definitely appreciate. The pricing feels right for the neighborhood—fair and reasonable without cutting corners on quality. The service here isn’t just good, it’s personal, and that’s what makes the experience stand out. Definitely a spot worth coming back to!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZTV2TlhVOHFMTnl3RRAB",
            "text": "Fast tasty and joyful Dominican style food from the Caribbean."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOS3B0NVNjaDZPNG1nRRAB",
            "text": "I personally like the food but I don’t like the fact that I feel discriminated against because I don’t talk Spanish. They see you’re in line and speak to the next person in language like you not even there. I don’t normally leave these reviews, but someone has to say something!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbW9tcXhRRRAB",
            "text": "four words, THE FOOD IS AMAZING HANDS DOWN"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeklMYTRnRRAB",
            "text": "They Have the Best food in The bronx . Im going back for more ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRZ3BUQmxRRRAB",
            "text": "Always friendly and welcoming. And the food is good. I don't like the 3/$1 plantains but that's me. Everything else is good. The staff especially. Hope they keep the momentum and the spirit."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcEl5Mnh3RRAB",
            "text": "Great food, customer friendly!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa3BMSHFnRRAB",
            "text": "Most people in the Bronx know of Sabrosura in the Bronx over on Castle Hill, but Jay's is the new kid on the block. This is no hole in the wall!! This place stands out from the crowd in Hunts Point. Jay's Spanish Restaurant is not a sit down restaurant, but who really cares when the food tastes so damn good. Whether you want a really good pernil, mofongo, chicharrón or sancocho they have it handled and it tastes GOOD!!! I have not tried everything but my favorite so far is the chicharrón with a squeeze of lime juice on top and their mojito sauce, so much flavor and the crispiness of the pork skin is out of this world. Trust me, it worth checking out."
        }
    ],
    "reviews_count": 12
}