{
    "name": "RUTA 55 RESTAURANT",
    "place_id": "ChIJM8yeSKL1wokR6rqqXlx4FIs",
    "grid": "BX2",
    "address": "1316 Lafayette Ave, Bronx, NY 10474, USA",
    "rating": 4.5,
    "user_ratings_total": 148,
    "phone_number": "(718) 709-3935",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVU56RjVXbTFGUm5wUVRsTmpNV3BrT1hKRFdYYxAB",
            "text": "Food was amazing,  workers were very polite and patient.  I'll definitely be recommending this restaurant to my family and friends."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWll5MVRXVGRhYW5KRGJXazVUVlZqZGpGV2JVRRAB",
            "text": "Yo pedí arroz con guandules y me dio habichuela le dije que soy alérgica al puerco y me dijo que la carne era de res. Era de puerco y me hizo mal. Muy mala actitud también."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa3BmS2lRRRAB",
            "text": "I use them for all my catering! Literally the best!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeWNYWVZREAE",
            "text": "This hidden gem serves authentic Dominican food made with fresh, natural ingredients and a warm, welcoming vibe by their friendly staff. The mondongo brought back memories of home—rich, hearty, and perfectly seasoned. The pork ribs melted in my mouth, the tostones were made fresh to order, and the chinola juice was an absolute delight!\n\nGreat food, great prices, and a true taste of the Dominican Republic. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MlBmOFJnEAE",
            "text": "Delicioso, siempre que venimos a este restaurante la comida es muy buena y fresca."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQX3UyOHFnRRAB",
            "text": "not a good choice"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzX3BlOXFBRRAB",
            "text": "Dry mufongo- ordered chicken.\nCut some roasted chicken on the side. This meal is so disconnected. Charges me $18 and their menu said $15. Dishonest pricing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNub2FTanF3RRAB",
            "text": "Ruta 55 catered for a company event, and the food was DELICIOUS! From the appetizers to the main course, everything was flavorful and prepared well. Everything was good! I look forward to pulling up to the restaurant soon."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIa2FhSGVnEAE",
            "text": "Rico"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzg3cEpBEAE",
            "text": "Restaurant is way too expensive. They charge you to sit down and eat. That makes no sense, me and my coworker was shocked. On the top of that I had terrible stomach pain from the chicken soup that I ordered once."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHREOGF3EAE",
            "text": "love it here i always get my lunch and its so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyX196ZF93RRAB",
            "text": "Best Dominican food. I felt like I was home!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN3UyR3RRRRAB",
            "text": "Su comida muy rica 😋lo recomiendo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eVlhMk1REAE",
            "text": "Everything I had was delicious !! Highly recommend and will be back soon, the people here are amazing as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MFlIWXp3RRAB",
            "text": "Music to loud and the girls working there with attitude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6anNQQUZREAE",
            "text": "I took a 300 mg edible and the mofongo was the greatest thing I had ever eaten. It wasn’t even the weed tho. It was the mix of amazing flavors and the gummies that danced inside of my body and made my night in NY one to remember."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OXEzYnlRRRAB",
            "text": "Amazing store and even better service! Can’t wait to bring all my family and friends in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dVBmWmpBRRAB",
            "text": "If you're looking for a warm, family-friendly spot in the Bronx, you have to check out Ruta 55. This cozy, family-run gem offers delicious Dominican dishes that feel just like home. From mouthwatering Mofongo to flavorful Bistec a la Parrilla, every meal is made with love and authenticity. Amazing food, friendly vibes, and satisfying dishes. Check it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUXzZlY0RREAE",
            "text": "On point. Food is always good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcF9MSWZnEAE",
            "text": "Every time I visit NYC I make sure to stop here! You can’t eat this good unless you are in the DR. Staff is incredible and always feels like home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeDVMei1BRRAB",
            "text": "Amazing food, great service and pretty nice spot. Food is very flavorful and portions are big. Definitely going back for more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUclpEOHVRRRAB",
            "text": "Such wonderful family"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUZ2J1RmZBEAE",
            "text": "As a Native New Yorker, when I walked into the front door I knew that I was in for something special. I love the remodel with the lounge area and I would have my birthday party here. From the rotisserie chicken, rice and beans and plantains were all to die for and I can’t wait to eat here again!!! Don’t sleep on their food and all the amazing people who are apart of this family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcnQzVUJREAE",
            "text": "Ruta 55 in the Bronx is a delight that promises an unforgettable dining experience. This family-run gem is known for its great service and welcoming, friendly atmosphere, making every visit feel like coming home.\n\nFrom the moment you step inside, you're greeted with warmth and hospitality that set the tone for an enjoyable meal. The staff at Ruta 55 are attentive and genuinely committed to providing excellent service, ensuring that every guest feels valued and well taken care of.\n\nThe food at Ruta 55 is nothing short of amazing. I couldn't get enough of their fried plantains, which are perfectly crispy on the outside and tender on the inside, offering a delightful mix of textures and flavors. Their rice and beans, paired with pollo guisado, is another standout dish. The pollo guisado is cooked to perfection, tender and flavorful with a rich, savory sauce that complements the rice and beans beautifully.\n\nIn summary, Ruta 55 is a must-visit in the Bronx for anyone who appreciates delicious food and exceptional service. The inviting atmosphere, coupled with standout dishes like fried plantains and pollo guisado with rice and beans, makes it a place you'll want to return to time and time again. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaG9ESTRnRRAB",
            "text": "This place is amazing, one of the best - food is INCREDIBLE and the service is genuine and friendly - love them to pieces. You won't be disappointed - definitely go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNnZySTB3RRAB",
            "text": "Yummmmm this is my go to spot whenever I’m in the area! Get the oxtail and mofongo, it’s their specialty and cooked to perfection. Great service, food and atmosphere. Can’t wait to go back :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaXN5MVVnEAE",
            "text": "First time ever trying Dominican food. LOVED their oxtail and mofongo! I'll definitely be back next time I'm in town. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOHFtLU13EAE",
            "text": "a lot of people have said this, but I’m gonna say it again. When it comes to great food at a great price and atmosphere, you can’t beat this place. I go every time I come to town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOHBHeVZBEAE",
            "text": "The food is amazing and the ambiance is great. They make everything with love. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOHNIZWdBRRAB",
            "text": "The rotisserie chicken is some of the best I’ve ever had. Love this place! Thousands of stars. Great date night too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOHA2enJBRRAB",
            "text": "The food, the service and the atmosphere are all legendary and make me cry tears of joy. You will never forget the experience of dining at this wonderful restaurant. They welcome you and take care of you as if you were family. Come and be apart of this!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOHJ5WHFRRRAB",
            "text": "Amazing food! Chicken rice and beans are on point every single time. Also really appreciate the friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOHVUQlpnEAE",
            "text": "Omg so good! I drive from westchester at least once a week to get my fix. This food will heal your soul!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOHZqX1BREAE",
            "text": "This place is so good we were treated perfect and the food is delicious!!! We def coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOHJDcG9nRRAB",
            "text": "This place is 🔥🔥🔥! I probably eat here once or twice a week. The food is genuinely authentic and everyone on the staff is so welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOHJDZ0JBEAE",
            "text": "This is place is a 12/10! The food is delicious! The staff! The nicest people you’ve ever encountered! If I could eat here every single day of my life I would!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOHRERTNnRRAB",
            "text": "This place was incredible.  Had no idea what to expect and was blown away.  Got the Oxtail and Mofongo and it changed my life.  Will definitely be back asap!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc3BmeTVBRRAB",
            "text": "Best food and service ever!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUc3Z2V05nEAE",
            "text": "Great food, even better service. ⭐️ ⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc3Z2RDBnRRAB",
            "text": "Great fam owned restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUck5pYW53RRAB",
            "text": "THE BOMB!! This is honestly one of my favorite go-to restaurants and I can’t recommend it enough. If you’re looking for fresh, delicious food in an amazing atmosphere, this is your spot. The staff is also so welcoming and they make sure you’re completely satisfied with everything you order. My favorite dishes are the rotisserie chicken and rice and beans. I also recently had them cater my birthday party and everyone couldn’t stop talking about the food!! 10/10 on all levels - you won’t be disappointed!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbUlxcXV3RRAB",
            "text": "The food is so good, and the staff is friendly and attentive. Will definitely come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNk1Ld3V3RRAB",
            "text": "Food was AMAZING!! Literally felt like I was back in DR for a bit. Amazing staff and great service. Definitely going to have to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcUx1NjhRRRAB",
            "text": "Great food and even better service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcVA3SG53RRAB",
            "text": "Love it here! The food is delicious every time, generous serving sizes. The ambiance is warm and welcoming and the staff is pleasant and helpful. Their catering service never disappoints, on time and just as delicious as dining in. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeUlfUFpBEAE",
            "text": "Awesome Dominican Food!! 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeU92Q2ZREAE",
            "text": "The best service , always feel welcome everytime I go, and some of the best mofongo I’ve ever had! And can appreciate how clean it is. I live in the heights and I travel to the Bronx just to eat there! Y’all gotta try it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeU9qOUpnEAE",
            "text": "Came here while visiting NYC and it did not disappoint! They recommended the churrasco and mofongo and it was amaazing. Owned by the sweetest family too so def come thru and support this local business!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeUtDcGZREAE",
            "text": "I really enjoyed the vegetarian dishes! Came all the way from Astoria for their dishes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOEwtaGV3EAE",
            "text": "You should only go here if you like AUTHENTIC Dominican food. Absolutely delicious and a wonderful family owns it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NWJLWmlBRRAB",
            "text": "If you’re looking for delicious authentic food- take a seat and dine in. You will feel at home, but with more selections. Our favorite restaurant to go to! The food is always fresh, savory, healthy. My favorite is the oxtail and anything with chicharrón! My nephews and nieces love it here because they have options!\nThe staff are kind and friendly. Couldn’t ask for a better place in the south Bronx! Highly recommend for catering: birthdays, school events, and holidays- you won’t regret it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaTVxNzlnRRAB",
            "text": "Rice and beans were good the oven baked chicken is greasy. What killed it for me was the throw up looking mashed potatoes. Ruta 55 didn’t understand the assignment. It’s not worth the money in my opinion 🚫"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX0xqeDNBRRAB",
            "text": "Consistently delicious food and amazing service! One of my go to’s when im in the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NVppZkZBEAE",
            "text": "My go to spot!!! Food is always delicious and affordable. They serve good portions too! Staff is super friendly and attentive. I’ve also had them cater a few of my events and have never been disappointed. My guests always rave about the food and my food always arrives on time. If I could give more stars I would!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUXzhhV193RRAB",
            "text": "This is one of my favorite places to eat when I come to NY and it never disappoints! The food is amazing, the staff is friendly and welcoming and I always have a great dining experience. If you’re ever in NY do yourself a favor and come get some of the best food you’ll ever have!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOEozOHJ3RRAB",
            "text": "I was absolutely blown away, stellar food, great people. I don't normally review at all but felt the need after enjoying Ruta a few times now. If you are in the Bronx it is a must visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNmRyTkZnEAE",
            "text": "The food was delicious. We catered for about 40 people and the plates were so big, everyone took some home as well. I got everything I wanted on time, which was very important for me. I will be returning soon! I highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOElPVS13RRAB",
            "text": "It’s hard to come by great quality food and great vibe! A lot of them are a hit or miss but this restaurant has both! Food is great, prices are reasonable and the customer service is on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWNnRQTUNBEAE",
            "text": "I came to eat in this restaurant yesterday for lunch and it seems to be clean when you walk in but their prices fluctuate depending on who's at the register and they actually charged me a $10 service fee just to sit in the restaurant for lunch. The most disturbing part about this location was the roach that was crawling on the wall while I was trying to finish up my lunch. The waitress didn't even attempt to kill it they just told me that they exterminator had left two days ago just disgusting and horrific I will never go back here again. To be charged $10 to sit in a roach infested place is utterly preposterous and disgusting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUXzlYV2xRRRAB",
            "text": "Just found this place and what a gem! I’ve eaten there three times this week and ordered something different every time and loved every meal. The people running it couldn’t be nicer too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOTlMclVnEAE",
            "text": "I’m a Black woman who loves good food. This restaurant meets all three qualifications:\ngood food, atmosphere and price. They also have the best hot tea I’ve tasted outside of home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUZ1B5eDZ3RRAB",
            "text": "I don’t leave reviews but felt compelled. Absolute fire.\nI never thought I could fall in love with a food but here I am willing to risk it all for a plate of croquettes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cDZXc3JnRRAB",
            "text": "The food is excellent 100% of the time. The staff is friendly and quick. I eat there practically everyday. . This is not a hot and miss. This restaurant is a hot everytime I go. No I'm not related or work there. And their open the perfect amount of time. 9:00a-9:00p just enough time to finish everything and start fresh tomorrow"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdHJLY19nRRAB",
            "text": "We use Ruta55 for all of our catering needs.  We are raving fans of their food.  Our favorites include their pepper steak and rotisserie chicken 🤤! They deliver on time and have great cuatomer service! Gracias Ruta! Estamos super satisfecho ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOEoyNXF3RRAB",
            "text": "I love the mofongo here ! If you’re looking for authentic Dominican food then this is the place for you. Whenever I’m in the area I make sure to get some food and take some to-go for the rest of my family. 🇩🇴🇩🇴🇩🇴🇩🇴"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOElYYm5nRRAB",
            "text": "The food hit like it was made by abuela at home. Really delicious classic dishes! Staff is super friendly and good bang for buck!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUb0pXZU1BEAE",
            "text": "Very cool little spot with some slammin oxtail. Staff made it feel like you were walking into their own home, very friendly and accommodating to my many food requests."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUXy16R19nRRAB",
            "text": "I love this place so much! Every time I come in I feel like I have a new favorite thing in the menu. Can’t recommend enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOE8yc2RBEAE",
            "text": "The perfect place to stop for a great lunch. My husband of 10 years hates my cooking but loves when I suggest going to Ruta 55!"
        }
    ],
    "reviews_count": 69
}