{
    "name": "La Cueva Fonda",
    "place_id": "ChIJ0zK5_bD1wokRWzE8uQrJUZU",
    "grid": "BX2",
    "address": "961 Leggett Ave, Bronx, NY 10455, USA",
    "rating": 4.5,
    "user_ratings_total": 332,
    "phone_number": "(347) 406-5584",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWFJEVldRMWxZWkc1M1RYUnZiamczZG5abmNrRRAB",
            "text": "Perfect spot, amazing experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjek9HWjBXRzFvUm5OcU9WSTFlWGN3VUMxRlFuYxAB",
            "text": "All the food was delicious and the service was very friendly. The tlayuda is one of my favorites. I recommend it."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaFFsY3lNSGQwZVVGUUxYUnllRTlFT1hsdVUxRRAB",
            "text": "Amazing. Muy muy bueno y ameno"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnd2FtVm1ObFpCY0hKU1oyeGxiRWN5ZG5Kbk1rRRAB",
            "text": "I been ordering from cueva fonda for years, but there quality of food goes down year by year and is just not good I order some carnitas tacos and man they send me overcooked pieces. I take it as an insult I’m done. Want some quality tacos to go a place like Los tacos no 1. Or some places in queens but this place is down bad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUWNFaGFXR3gzY1haMFJIbHpabWsxY1dGZmVFRRAB",
            "text": "Delicious mole, tacos, pozole -- great menu! The tacos came with a side of grilled nopales, chili and onions. And the flavor of the mole poblano was amazing.\n\nThe only less good thing was the Caesar salad, which we probably should have known better than to order, and the cafe de olla tasted kind of watered down with not much coffee taste, but I've never had it before so I'm not sure what it be like.\n\nI would definitely go again so I can try the fried fish and champurrado next time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKM1UycFVXVFpSTlc1SVEzazNObGhMZUdGUlNGRRAB",
            "text": "La Cueva Fonda is a hidden gem in Longwood! The food is absolutely incredible, and the prices are unbeatable. I've been coming here for years, and everything I've tried has been delicious. The burritos with Camarones, steak, chicken – they're all amazing, and the tacos are fantastic too!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVE1HUldSMmhYVlV0SFRqZExNREJDY2xKS1QxRRAB",
            "text": "La comida 10/10, el servicio estuvo al 100, hicieron rápido mi orden, lo recomiendo 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JdGJFMXJaRFV0VTA1NlJYbEVSRlJyT0VGRFpGRRAB",
            "text": "The best Al pastor tacos ever. I live in BK and whenever I’m in the neighborhood I absolutely force myself to get these tacos. Birria Landia in Williamsburg, taqueria Ramirez in Greenpoint and La Cueva Fonda in the Bronx are just my favorite for tacos all round in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRGNXSkhVazFHU2tWUE1tVXliWFptUkdwck1rRRAB",
            "text": "Great fish tacos. Fast and friendly service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSFZtUlFSbU5zTjJ4TmJWQTNWa1p3Y0VaNFkzYxAB",
            "text": "Amazing food and atmosphere. If you feel like traveling without leaving NYC come here and enjoy it"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbHBxdEZnEAE",
            "text": "Food is not bad, best thing from them is the fish tacos. I did order chicken a la Mexicana and the chicken was freezer burnt so it was hard and chewy. Not for nothing but I can tell when product has freezer burn. Churros are okay, over priced and so are their cakes. The lady that's recently taking order seems to not know how to take orders, example... I had to repeat my CC info like 5 times and she would repeat back or input the wrong information till I got tired and said, lady nevermind. She also takes forever to take an order . Overall the place is not bad but it is expensive in my opinion for so so foodthey sell.  Their gorditas de chicharron suck because it's all masa and barely any chicharron, I mean I am paying right? I prefer Betos, since their gorditas de chicharron are way better but unfortunately they don't have fish tacos. La cueva once did sell me a pozole that tasted like burnt oregano, im going to assume they disnt taste it or just disnt care to sell burnt oregano wanna be pozole soup. When I called them about it, they replaced it and sent me a watered down version that still tasted like burnt oregano. I just like their fish tacos try not to buy from there much. They used to be better! Their guac sucks btw. Not worth the very high price of it. Only recommend the fish tacos."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJelFXdExSVGRPY0ZodE1URmFYMWxVTWtWTmNFRRAB",
            "text": "the torta chicken slice is smaller then usual"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNjExWl83LTZTQndBRRAB",
            "text": "So good!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWG92SXpxcUphblVREAE",
            "text": "Excelente servicio!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLWVsY18yNnRtNUpnEAE",
            "text": "The food was so good. I mostly enjoyed the rice drink. The service was great. Everyone was very welcoming and kind."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZVhwdlRIMGNMNFdREAE",
            "text": "Very small place on Leggett avenue on the Bronx. Food is amazing I can say it’s the closest to true Mexican taste. I highly recommend for anyone interested in real  Mexican food. My kids and friends love this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaWttczN6M0lTR19BRRAB",
            "text": "First time eating here and completely enjoyed the food that is served. Fast service. I will definitely be returning with many others to enjoy this experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaTctVDFRRRAB",
            "text": "I have a very bad experience with one of the people that answers the phone she said she could get anything that I ask for if I ask for extra sauce she said she couldn't do it It said charge me extra and she said we can't do it then another time she charge me 22 dollars for 4 eggs and fail to tell me that she was going to charge me for rice and beans very disappointed I use to order there everyday"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmenJiTE5BEAE",
            "text": "La.comida es buena y el trato exelente solo el único problema q no respetan los precios estipulados en el menú\nMe doy cuenta q siempre les suben el precio de cada.producto y más taxes q se…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmenFLUXJ3RRAB",
            "text": "Got food wrong called the guy got an attitude stating I got what I ordered said he would send right food after having me on hold for over 10 mins and never deliver my correct food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Z3REbnFBRRAB",
            "text": "I had two different kinds of tamales  and they were delicious just like my mom made them. I had a torta as well and a tostada and was disappointed that they weren’t more flavorful. Especially the tostada, it seemed like the beans didn’t have salt or any kind of seasoning. Their champuron and Horchata were yummy. Unfortunately it was very cold in the restaurant and it was not enjoyable to sit for extended period of time such as a date. Would go back to try other foods."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d3VQcWhBRRAB",
            "text": "These people sell rotten chicken. I just came out of the hospital with the worst case of food poisoning i’ve ever had. They should be shut down. Terrible!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOUlYdVVBEAE",
            "text": "Terrible service , they don’t have the food on the menu and this guy at the counter screaming …..not worth coming by the way the food has no taste"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucFAzbUNBEAE",
            "text": "Ordered for pick up. Everything was delicious. Must try their desserts"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaElIb2tBRRAB",
            "text": "Yasss!! I finally found a Bronx Mexican restaurant that serves delicious food! I was tired of ordering from La estrellita restaurants. I will continue to order from here! The pozole and nachos were on point!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OE16Uk9BEAE",
            "text": "La mejor quesadilla que me puedo comer. Muy fresca. Y muy mexicana."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMmVMVERnEAE",
            "text": "As a Mexican American that grew up on the border and well traveled, this is the best Mexican food I have had on the East Coast! It's made with heart and soul and the flavor in every bite me debating on whether or not to order more to take home. I can't wait to go back and try more because eating here and speaking to the owner, was like going home a short visit home. We had the nachos, gorditas, tlayuda, and chilaquiles."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNXRhUjh3RRAB",
            "text": "Excellent food! Definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMmNhbVNnEAE",
            "text": "Best Mexican food around"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqckpLVHNRRRAB",
            "text": "He comprado anteriormente, y buena la comida,pero estos tamales segun oaxaqueños nada que ver,demasiada grasa y super salados"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d0pEdW1BRRAB",
            "text": "I really enjoy this place. Food is great and always fresh. I love the tres leches cake and the fish tacos. The mexican decorations around the restaurant are so beautiful. I also like that is a family owned business. Service is great. I like going atleast once a week."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeDR2OTdBRRAB",
            "text": "La comida es excelente el servicio al cliente también!! Solo que si es un poco lento las entregas pero sigo pidiendo mi delivery oh pikcup 😉 porque no hay calefacción y aire acondicionado para disfrutar en la cueva !!🤷‍♀️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdzlIQUFREAE",
            "text": "1st time. Service was better than good. More like GREAT. Young lady at counter spoke english. Which was a plus. Tacos was perfect. Churros was delish. I will be back. Thank you"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMW9yekdREAE",
            "text": "Lo unico que puedo decir que buena comida 😘😘❤️❤️❤️🥰🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNGU3YXZ3RRAB",
            "text": "Went for lunch and felt relaxed while eating my two soft tacos! A great spot in the neighborhood!’n"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0aHFpc21BRRAB",
            "text": "Pésimo servicio mas de una hora por un deliver"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OU9hVTB3RRAB",
            "text": "Muy buena la comida, y la atención muy buena  pero el restaurante no tienen calefacción. Está frío el lugar! Y por lo tanto se enfría la comida rápido."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOXNPWXlRRRAB",
            "text": "The food was great definitely my go to spot"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1d3NEVlpBEAE",
            "text": "I came here with a friend and we were both amazed by the decór (Dia de los Muertos theme) that they had set up in the restaurant. She pointed out all the small details of each skeleton and the different coloured iguanas on the wall. We shared laughs and had an overall good time ! 🐺\nGreat space for sitting down for either casual or intimate conversation -- The waitress was eager on whatever was needed, and as well as a passionate chef that adds the needed character in the kitchen. It's safe to say that this is a restaurant worth visiting or making those evening taco runs in which they were tasty & robustly flavourful 😋."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGemZEdDV3RRAB",
            "text": "The lady behind the counter today purposefully messed up my order  when I tried to get it rectified, she lied and said whoever serves me on the regular is wrong and she’s right  this lady is rude and disgusting to intentionally mess up my order and then REFUSE to fix it I’m not giving these people business again especially when they don’t even have a letter grade!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGamRhbjFBRRAB",
            "text": "Slowest service everrr. Paid FULL price for guacamole and chips and got a side order of chips instead. They basically stole from me because why charge me full price and give me a portion of what I paid for???"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcGJEVU1REAE",
            "text": "Good spot in the BRONX"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aHJhSlRBEAE",
            "text": "Went there for the first time , met one of the owners at a mezcal event and decided to try out place . Best tacos de tripa , which are hard to get , cooked to perfection . I also tried the chilaquiles , nice heat to it , loved it . Too bad I couldn’t eat more , I wanted to try more items from the menu . Highly recommend this place ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaajhYUVJREAE",
            "text": "Great customer service, food is amazing. It's a friendly environment, and many great choices from the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaX01TbVVBEAE",
            "text": "This hidden gem of a spot in The Bronx is serving up some unique dishes. They make everything in-house, including their tortilla\n\nHad a great lunch!\n\nThe Costilla de res salsa verde con calabacitas (squash) thats ribs with squash! In a  green suace was outstanding!\n\nThe rib meat is slow cooked, and falls of the bone . The sauce is spicy and full of flavor. I could not stop eating this.\n\nThe pickled cows' feet were a first for me served on a crunchy tostada with bean puree, oregano, cabbage, tomatoes, pickled jalapeños,  cheese and cilanto Just a bomb of flavor!\n\nThe gordita had chicharŕon prensado ( chopped chicharŕon) with lettuce, tomato, sour cream , cheese, and cilanto.\n\nAnd the Pambosa a torta was finger licking good! ( more on this on the next post)\n\nFinsihed it with passion fruit juice and a churro cheesecake. Wow! And took one home. My mom loved it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcGQtVGpBRRAB",
            "text": "Words cant explain how delicious the food is. 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweGRXbGlRRRAB",
            "text": "Fish tacos and tacos placeros are great…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwME42SFVBEAE",
            "text": "Ate here on a whim with my best friend yesterday. Food was great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM0lpNXhnRRAB",
            "text": "Good service and good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKXzZ6VUhBEAE",
            "text": "One of the best mexican food in NYC. Very authentic and delicious. The place is small better to order take out or grab a quick bite there. Tacos de chiles rellenos and al pastor are amazing. Love their aguas frescas. Highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NHJhX0VBEAE",
            "text": "Definitely a must! The fish tacos 🌮 were light and crisp at the same time. Ceviche was fantastic! Really enjoyed the house made drinks in this 95F heat: my favorite was the hibiscus 🌺 Super friendly service! Will be coming back to try everything else on the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaVlQajlRRRAB",
            "text": "Super delicious! The fish taco is sooo flavorful and you get a nice big piece of fish. The menu is extensive so I had a hard time choosing! The staff is really friendly too :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdHZMQm93RRAB",
            "text": "The portions and prices are just awesome, my husband asked for 3 tacos and a quesadilla because he tough it would be small, we end up getting the quesadillas to go 🤣, flavor delicious, sauce on point and the service just something to apreciate.\nAnd the flavored water such as horchata and Tamarindo just delicious\nWhat makes me the happiest is that they had 2 taco options, the regular for me which is mexican original taco and the special, which is a more american taco perfect for my husband"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoanBPQThBRRAB",
            "text": "This is an incredible restaurant. I happened to be in the neighborhood. Excellent tacos, tamales, and picaditas. Very good prices. Tacos came with jalapeño and cactus and grilled onion. There are so many good looking dishes I'll have to come and try ranging from the more standard fare of burritos and tacos to Barbacoa, parrillada, tlayudas. My friend had the torta and he loved it. I don't remember the last time I had such good and authentic Mexican food. Definitely worth a trip!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3FYOWVnEAE",
            "text": "Um, awesome. Giant agua Fresca? Check. 🫔? Yes. Sopa de chivo 🐐(weekend only)? Give me another straw.\nLooking forward to the next time I stop in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNC12VG9nRRAB",
            "text": "Authentic and delicious! Came here on a Bib Gourmet review. Order the Alambres\nThe family next to us told me that few places in the states make it right and this place does it!\n\nI came here after visiting Ny Botanical garden and this place is worth the trek."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldG9QVTNBRRAB",
            "text": "Second time ordering from here and let me say the pozole verde de pollo is bomb , my comfort food on a cold October day . And the Jamaica is so goood reminds me of my moms 🤤 super delicious food 🥘"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOUltWU5nEAE",
            "text": "Excellent food offerings, deliciously prepared. An unexpected bounty."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXLTgtOURREAE",
            "text": "My fave, go-to spot for authentic Mexican. Generous portion sizes, great value, fresh ingredients and the staff are super friendly! I get both the delivery and stop by and it is always on point. Love the local feel of the place and the…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMHRQZi1BRRAB",
            "text": "Everything about this place is inviting. The staff is warm & welcoming, & the service is swift. The food is absolutely delicious. I highly recommend the chicken tinga tostada, the chicharrón Gordita, flautas con papa y chorizo, & tamales.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCXzdhTVlREAE",
            "text": "I can't say enough great things about this place! Food is delicious and flavorful. It is one of the most authentic mexican places in the Bronx and I've tried many.\n\nIt is clean, and welcoming and food is always consistent. They have fresh juice as well and great coffee if you stop by in the morning.\n\nP.s. I always come back for the fish tacos !! 😋"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOW8yRmlBRRAB",
            "text": "Food is usually great. I recently order a Pozole from this place and it came too salty. Husband called to let them know but according to them their patch seemed good. I had no reason to lie since we usually order from this place. I would have returned the order but it made no sense since I had it delivered.\n\nResponse: Yes, food is usually great that's why my husband called to let you guys know about the situation. Yes, you did offer my husband to get a new order. But since it was from the same patch it made no sense. Also, he was asked to pick it up which was unreasonable because our original order was for delivery."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eFltdWxnRRAB",
            "text": "If I could give a rating of 10 stars, I would do it! This place is great and spacious. The food is delicious and they have a variety of Mexican dishes to choose from. They also have a great variety of juices and sodas. The food portions are great for what you pay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNzZDblFREAE",
            "text": "I loveeeee this restaurant and I am grateful it is just up the block from where I live! The staff is super friendly and the food taste amazing. I frequently order the chicken tacos with everything and it is my favorite!  10/10 😍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteTdIZXZnRRAB",
            "text": "Good food. A little unfriendly and unprofessional. They don't know when to provide a check. They charge $4! to use a credit card.\n\nUpdate: the restaurant responded to this review by blaming me for their unprofessionalism and  bad business practices. When you're used to getting a check like any normal restaurant (excluding diners), you might forget to pay. Which is what happened. While I was putting money in the tip jar ( I wish I hadn't done that now), the cashier stopped her personal side lunch with a customer to remind me that she forgot to provide the check.\n\nThey think because they're \"fast paced\" (they had 2 other customers while I was eating and 1 delivery order), that they dont need to provide a check. And how are you \"fast paced\" if you have time to sit with customers? They need a restaurant mentor.\n\nThey also corrected to say they charge 4% not $4. My bad. But they missed the point; no reputable restaurant charges extra for credit cards in 2022."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDeThLZkJnEAE",
            "text": "I’m not even a big fan of Mole sauce but I took a bite off my friends dish and I was so taken back by it. I mentioned it to the sever and they said that it’s so good because they make it from scratch at the Restaurant. For myself I ordered…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXLS1fN2JREAE",
            "text": "If you’re looking for flavorful Mexican food like your abuelita made it - this is the spot!! Everything on the menu is amazing! The staff is super friendly and the service is exceptional! Don’t forget to add the Horchata to your order - the best I’ve ever had!! Your life will be changed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLUl2Z1p3EAE",
            "text": "This is hands down one of the most best and most authentic Mexican spots in all of NYC. If you are longing craving your abuelas cooking please support La Cueva Fonda.  You can't go wrong with ordering anything from the menu. I can't even…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdWU2TzRnRRAB",
            "text": "First my ratings from 1 to 5 and then why. Delivery 5, food 5, speed of order 5. I was in the area for a business meeting afterwards around 8 we ordered food randomly from grubhub. What a good decision. For myself I order a 2 chalupas with chicken and green sauces (not knowing what it was or the size). Each order it turned out to be 4 soft tortillas each with chicken with white sauce and green which was seasoned amazing well. Conclusion,  order 1 each and you will it will taste really good. Eat it right away it tastes best and the tortilla might break up if you wait too long because it comes hot and ready too eat."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNDhiSU1nEAE",
            "text": "BEST MEXICAN FOOD IN NY\nI am in LOVE with Mexican food and have tried almost every Mexican place in the south Bronx and plenty super expensive Mexican places in manhattan and NOTHING beats this place. I’ve been ordering here for a little over three years already. They used to be called “El Patron” but recently changed its name.\nBest delivery experience. If you want to go in the restaurant and eat it is a little small but very cozy.\nEvery time I order food is fresh you can taste every ingredient and their red salsa is my FAVORITE! Super spicy."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDM19EN0V3EAE",
            "text": "First. They give a lime slice for each taco and that alone is a 5 star rating. Besides that the food is CONSISTENTLY great and I’ll always come back whenever I’m too lazy to cook or just crave their tacos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcXJpeWFREAE",
            "text": "It was very good. Nice and fresh."
        }
    ],
    "reviews_count": 72
}