{
    "name": "Fratilli's Pizza",
    "place_id": "ChIJ7xJUhgX1wokRzz0vicS9T_o",
    "grid": "BX2",
    "address": "404 Hunts Point Ave, Bronx, NY 10474, USA",
    "rating": 4.3,
    "user_ratings_total": 742,
    "phone_number": "(718) 542-7340",
    "reviews": [
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUFFtTjRRVWREU0ZwNmJEQmhSMnROTnpaV2FYYxAB",
            "text": "👍👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQldqRnVXVkJRUm5sMlVHRmxjMTlHUWxoelMyYxAB",
            "text": "Food is delicious and exactly what NY pizza should be!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc2RsY3dlVVptYjJOQ1RGVkdPVlF5WDA1RWFVRRAB",
            "text": "They have the best pizza in town. I've been going there over about 15 years."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abU9HZG5VVGxMVUd0dldWTkRhV2RWUm1kcGVFRRAB",
            "text": "Ever since new owners took over the food ain't the same and I wouldn't recommend ordering for delivery unless if you don't mind waiting 2 hours for your food,place an $186 order and was told an hour which was fine but 2 1/2 hours later had to cancel my order cause never made it out there store so don't waste my money there no more"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eFRIRkxRVXhOV0dwS2JHWjJiR3BWTFRGUmJtYxAB",
            "text": "Had to keep something I didn’t want.. Wouldn’t let me change my order. Cheese steak was baddd."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNeWl3TnI1MmVxNERBEAE",
            "text": "The pizza there is good pizza. Considering the location that it's at is better than some places that are over on Arthur Avenue. I have not tried the entrees yet, but when I do I will leave a review."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaXJQZ3l3RRAB",
            "text": "It's hunts point home of the produce market but also home of the truckers to get something fresh instead of American propaganda fillers you'll be very upset if you didn't come here hands down best fresh slices pin wheels Stromboli's, HEROS PASTA BREAKFAST they got it on gawd"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZzV5U2pBRRAB",
            "text": "They need to improve the Food!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaDVXbnZnRRAB",
            "text": "Excellent food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNXZpbnp3RRAB",
            "text": "Pasta & pizza slices awesome"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxLW9UeHlRRRAB",
            "text": "If you find yourself in Hunts Point, you need to get pizza here. Classic NY style crust with lots of options for toppings.  Everything from plain to chicken/bacon/ranch. Try the Grandma slice too!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZzg3UjdRRRAB",
            "text": "Chidas las pizzas de pollo. Y puedes entrar al sanitario"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LXJhT1h3EAE",
            "text": "Hey mannnn! If you a TRUCKER, or just in da area and need a quick bite, stop over here nice and easy access! Double Park with the truck and grab a slice! Matter of fact, if your a Fatboy like me get a sample of everything! ENJOY!!! 🙅🏾🙅🏾🙅🏾 The Bronx Baby!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaVBUQTFRRRAB",
            "text": "Grandma's slice has the best crust."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcFpXUTN3RRAB",
            "text": "The food is amazing"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeDg3Q0NBEAE",
            "text": "It's under new management, and the food don't taste the same"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIemJUMU53EAE",
            "text": "We had it delivered to our semi. They were so nice and quick about it. The wings were delicious but there were only bones left to take a picture of.😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdnZ6V0N3EAE",
            "text": "Great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIajlMR2pnRRAB",
            "text": "Food is always phenomenal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdXM2RFh3EAE",
            "text": "Very Good Pizza! 😋👍"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3Mi1xMXBRRRAB",
            "text": "Buen service comida y Atencion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGZlMUxREAE",
            "text": "Requested 4 square slices, the square slice in the middle was absolutely disgusting, cheese and sauce all over the place, she took the entirety of the leftover squares and placed them in the oven as if to heat it up, only to be served the disgusting slice with my 4 requested slices. As soon as she placed it in the oven I saw her taking it out. All of this only to not throw out 1 square slice of disgusting pizza. She had no idea that my company spends about $3,500 a year catering that will surely not continue. I hope you enjoyed saving your $3.00-$3:50 square and didn’t throw it out. Terrible when you think so little of the customers that helped bring you a successful and thriving business that you would literally scheme a customer for $3.50. You never know who you are serving. Saving that one slice cost you a lot in lost sales"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bkt2RnpnRRAB",
            "text": "I found the best pizzeria in the Bronx! I stumbled upon this place one late night and tried their grandma's slice. It was so unbelievably delicious that I immediately ordered another one to go. I promised myself to come back for a whole grandma pie, and when I did, I fell head over heels in love with their pizza. This place is a hidden gem! The sauce and cheese are out of this world. I would absolutely recommend this place - and believe me, I've had my fair share of good pizza!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLUp6RkhnEAE",
            "text": "Ninguna queja"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNTluUjdRRRAB",
            "text": "Man. Compare this to Pizza Castle.\n\nBuffalo chicken / BBQ chicken pizza, same order as mine from pizza castle yesterday.\n\n100% better! Great tasting, textures and quality of toppings is great for this area of Waterbury this is the spot!\n\nNot my favorite place I've ever been to (hard to compare) but so damn close!\n\nWill always come back as long as I live here staff is great pizza is quality and timing is always good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6a3J5V01BEAE",
            "text": "Good place to eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNlltR3FRRRAB",
            "text": "Awesome food great price, adorable wait staff, checkout lady..wowsa."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMW9PY3ZRRRAB",
            "text": "First time ordering from here and it could have gone better. I was put on hold for a bit but I’m assuming cause they were busy. So that is a good thing! The man who took my order was very helpful and patient! When it was my first time ordering from there so I of course had to make sure my order was done correctly lol. There wasn’t a minimum when ordering so I was happy about that! I decided to get a pepperoni slice and a grilled chicken cutlet on a hero with mayo, lettuce and tomato. When I came downstairs to the building door I see that my delivery driver was still in his car and I had to walk over to him and ask him if he was gonna come outside! It def. wasn’t his first time doing that because he also did it when I ordered for delivery another time. Although I was very unhappy with the delivery customer service and my cold pepperoni slice! The slice still tasted good and I don’t even like cold pizza so that says a lot! Also their chicken cutlet hero’s are very juicy and fulfilling! Next time I would definitely like to come in person and dine in."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPN1AtRTJRRRAB",
            "text": "I heard about this place through a friend who comes here often. Isn't the new management and it's skyrocketed in a wider range of food and it's delicious I want to come back here and order something different cuz everything looks delicious. For it being my first time I grabbed the menu all their different dishes. I noticed that they are online, and I could order online, and deliver too!! Met one of the owners, Dino and I double checked about the distance for the delivery. I am ordering something Grand this weekend for my family to enjoy!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdk15SURBEAE",
            "text": "This pizza was absolutely wonderful. This is why I love New York City! The crust was perfect, the right amount of cheese, perfect sauce, amazing toppings, some of the best pizza I have had in many many years. And they deliver out to Hunts Point meat market, for the trucks that are waiting out there. God-bless these guys for taking care of the truck drivers.\nUpdate: 5 years later, I'm still ordering from these guys, they are still the best, and I still (mostly) only take freight to New York City, to get a smok'n fresh Fratelli's Pizza. Priscilla remembers too. The moment it arrived, she wanted her slice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MWVDTzBnRRAB",
            "text": "I had a very bad experience with there pizza it was cut in the size for a 2 year old and when j spoke to the manager he said well they must of cut it wrong and it’s a smaller today . the garlic knots taste like dough and the chicken on the buffalo chicken pizza were dried out like if it was sitting there for days ! Very dissapointed in my experience . When I called to complain one of the guys hung up on me. disgusting customer service !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdDY2V29nRRAB",
            "text": "My experiences with them has been pick-up and delivery via Uber. It’s very busy there, very chaotic. It takes a while to get the attention of the cashiers. They see you there but they don’t really acknowledge you and you have to be persistent in getting their attenion. IMy order is never ready for pick-up in time. I always end up waiting about an extra 10 minutes or so. They’re friendly when they finally acknowledge you. As far as delivery, same thing… it’s usually late. I’m sure the driver has ti wait for the order as well.\n\nTheir food is good though. I usually get the chicken parmigiana (no pasta) and it’s a big portion. I’ve also gotten their spaghetti with garlic oil, shrimp and spinach. There were maybe 4 pieces of small shrimp which was disappointing. But it tasted good and fresh (see picture). Their garlic knots are always warm. The Philly cheesesteak was huge, generous meat potion and tasty. I got it with tomato, extra onion, Mayo and provolone cheese (see pic).\n\nOverall, good portions for decent prices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbnRQR2hnRRAB",
            "text": "I recommend the Fratilli's Special Pizza. Has Meatball, Sausage, Pepperoni, Mushrooms, & Bell Peppers. Mmmmm!  Mouth watering. Philly Steak Sandwich with Onions and Mushrooms on the money 😋. Best part, is opened late til until 11:59p.m. Monday through Thursday. Got late munchies? Fratilli Pizza Restaurant is the way to go . You won't be disappointed"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbWRXTTVBRRAB",
            "text": "The pizza is super delicious I love it and they have so many things to choose from will definitely return"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndDh1Q0l3EAE",
            "text": "Great for drivers comin to Hunts Point. It's right across the street. Short walking distance.\nDecent pizza and other sandwiches.\nThey got wings too"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNkl1ZVhBEAE",
            "text": "Genuine NY style pizzeria, good lunch menu. The place is really cozy and the people are very friendly."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcHJMYm9BRRAB",
            "text": "Broccoli Rabe Sandwich!!! Fresh Italian sub!!!, garlic , Rabe  yum!!! Call ahead but well worth the wait!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnczV2M2pBRRAB",
            "text": "I'm a pizza fanatic and I eat pizza all the time. This pizza was gross. The sauce is horrible. There is some kind of spice on their pizza that really stands out, it's a nasty spice whatever it is. My mouth was coated with some gross film after eating this pizza. Didn't have enough pepperoni. I dislike their pizza much."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqc1lmYWRBEAE",
            "text": "I got a spaghetti there, it was yummy. This morning i kept checking even my bank statement to see if i can have the name because i couldn’t find it on google map. I spent a few hours and finally i found. I will be there very soon for another spaghetti. I really recommend this restaurant. The guy at the cashier was so kind to help me choose that day. Thank again for your service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLWVhSlF3EAE",
            "text": "Geat place to go if you want below average food. I called an order to pickup and arrived 25 minutes later they couldn't find the order.  I waited for 10 more minutes  to find that the order was on top of the oven. Now I get to enjoy a not so hot dinner. This place fell off."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMGVPb3N3RRAB",
            "text": "My boyfriend and I have ordered here twice. Both times have been phenomenal. Everything was so delicious. Highly recommend anything with Alfredo or vodka sauce! They even included garlic knots! This place is definitely one of my favorite…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb0xQNXFBRRAB",
            "text": "This place is next to my job and I ordered a whole pizza pie. Once I got there to pay and pick up I decided to get a couple slices of cake that was on the counter. The lady at the counter decided she was gonna place the 4 slices of cake in a brown paper bag with no wrapping on it. I asked her if she could wrap them she told me no. I asked to speak to the MGR and he said what she was doing was fine! DONT GO HERE THEY ARE HORRIBLE!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURFeXRPRDZRRRAB",
            "text": "Good place to I ordered my food it took a bit long but I don’t complain the longer the better"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoek5Md1VnEAE",
            "text": "BETTER THAN MOST BRONX PIZZA\nOrdered regular pie, drinks & danish.\nWill order again!\nLoved:. Accuracy & Professional : Quality mushroom topping. Taste potential above standard.\nDelivery Service: Responsive & courteous. Called for needed toppings , packets packed appropriately.\nDislike: Dry Pie. Pie needed a bit more sauce it was dry. Patty was not good. Best thing was the melted mozzarella. Dough and filling feedback. \" Ain't it\""
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXRXcExnEAE",
            "text": "Great Pizza, always busy place. Good Price, never stale pizza. Staff is very nice, courteous. They always seem to have my Vege pizza and if they don't it's coming out."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvN29pTXhnRRAB",
            "text": "Quick service and a friendly environment. Definitely the best Pizza you can eat in Hunts Point."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROU03R3dnRRAB",
            "text": "Food is great  but the service in the morning slow and unsatisfactory   girls in the morning 7 am are not very polite  for that reason alone  i will give a 2 star  review. If the girls where more polite like the girls a night I will give  a 4  to a 5 star review. Politeness is key to having good clientele."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMk9xSVV3EAE",
            "text": "Great pizza, meat pie and wings!?? 👍…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMXZUbzVRRRAB",
            "text": "Omg  awesome pizza and wings. Service was outstanding. My delivery from door dash was excellent. When I’m down  again will definitely order from u guys again. When it comes to pizza and wings I’m very fussy. But this meal was fresh and hot. Hope to do business soon."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcTZERjhnRRAB",
            "text": "I make this a must stop every single time I deliver to huntspoint market. Their food is the best Italian I've ever and I do mean EVER had! I recommend this business to everyone I talk too! If they are vacationing in new york city,  I tell them they've gotta stop in, they wont be disappointed! Thank you guys for always being the best!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MVBYNzdRRRAB",
            "text": "I've lived in HP for over 20+ years and discovered Fratilli's 2 years ago and I am very pleased.  I've ordered their pizza, lasagna, Rigatoni with broccoli, garlic and oil, greek salad and everything was delicious.  My only complaint would…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLTZIcF9BRRAB",
            "text": "Amazing two ladies working there, always smiling… the noon time is like the busiest, but the pizza and muffins taste so good… it’s one of my favorite spot, always parking, good vibes and hot eats ready for you."
        },
        {
            "date": "6년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZajV5VkdBEAE",
            "text": "Bread is delicious and fresh\n15$ for  this\nОчень вкусно и сытно хлеб настоящий очень рекомендую"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaDR1Yk13EAE",
            "text": "The food is amazing. Unfortunately they've yet to get my order 100% on delivery. Store pickup is always perfect. If the food wasn't so good I would not order from them but it is that good."
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRajhtdVVnEAE",
            "text": "I'm new to the area so this was my first time ordering pizza. The man taking my order was rude and rushed me, he said to give it about 30 min to be delivered. The pizza arrived 45 minutes later and my boyfriend had to walk 4 houses up to get it while the delivery guy sat in his car. The pizza was laying on the passenger seat not in the warmer bag. When we opened the pizza it room temperature. I had to give it to my kids because they were hungry. I called back to make a complaint and they were rude. They said all they could do was pick it back up, put it in the oven, and send it again. I have my own oven so that didn't make sense. The pizza was pretty good after I heated it up. I'm very disappointed with their customer service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdnVHaDN3RRAB",
            "text": "Food is good.  Good looking young lady behind counter (sorry that counts for me), but if I leave a tip when I eat in there, DONT make me come to the counter to pick up my order.  I don't care how busy it is.  If someone left me $2.00 tip on a 15.00 order, it won't hurt to bring the order to the table.  God, McDonalds does it for nothing."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdXR2WExnEAE",
            "text": "Great food and friendly staff. Even at 1139pm they had plenty of choices of freshly made food. Loved the spin wheels, broccoli so far my favorite. Maybe next time I will get spinach."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMzZPTzh3RRAB",
            "text": "There's always a fresh slice of their delicious pizza available when I pull up in my tractor trailer at 2 AM just before I deliver my shipment to Krasdale. The taste is like a \"welcome home\" from being out on the road. There's nothing like a NYC slice, and Fratilli's is top notch pizza at its NYC best!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcE5LZ1FREAE",
            "text": "I stopped here around midnight for a quick bite to eat while I am working. The food is good and the staff is friendly. At the time I come by parking is relatively easy. During the day might be a little different."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcGYtaU5nEAE",
            "text": "The food is great and the staff are friendly. Biggest thing was the hot chocolate actually and how wonderful that tasted. They added cinnamon to it and it just tasted even better after that. Keep up the great work!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMmVybDV3RRAB",
            "text": "Dan is the man! Gave me directions ! He found my Bank Card !  And is hooking me up with multiple deliveries in one night !! Food is always on point ! 5 star! Thanks Dan !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4NHY2N09nEAE",
            "text": "I absolutely love this place. Staff is super nice and they have the best food ever! Im a truvk driver so every time I have to deliver at Hunts Point I make sure I get me some food. Its always fresh and always delicious. Best pizza ever! I'd give them 10 stars if I could! 🖤…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcWMtVXh3RRAB",
            "text": "My entire pie fell out of its box face down in a parking lot today after just seconds of receiving it from the delivery guy. I was devastated but Fratilli’s sorted everything out in a very gracious way. They’re real life angels and their food is made with love."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcVl1RGVREAE",
            "text": "This is THE best italian restaurant i have tried by far in new york. The chicken parmigian is ALWAYS delicious and their pizzas are fantastic."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBX3BHSmZnEAE",
            "text": "These other reviewers are lost or from out of state and never had New York pizza. They almost always screw up the order and never accept responsibility.  The food is mediocre at best if its what you ordered and it takes over an hour to…"
        }
    ],
    "reviews_count": 65
}