{
    "name": "Boogie Down Grind",
    "place_id": "ChIJ_Y25fgD1wokRWMtstKibsA0",
    "grid": "BX2",
    "address": "868 Hunts Point Ave, Bronx, NY 10474, USA",
    "rating": 4.7,
    "user_ratings_total": 452,
    "phone_number": "(347) 270-0141",
    "reviews": [
        {
            "date": "6일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMGEzaGFMVFpCVTFNMmNuTkhhRmhpZFdOZldrRRAB",
            "text": "Me encantó este café hasta ahora lo mejor del Bronx 😍👏"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV1ZWaFplSEV5UTFWS2RuVXlNRXhTUzJ4Mk5XYxAB",
            "text": "exceptional service every time. The staff is genuinely welcoming and attentive, they have created a very quirky space that feels both friendly and professional. The food is always fresh and flavorful. Your good customer service isn't going unnoticed. Keep it up ..."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUFNEUmZMVEZsUldnek1FSnJXVjluTUdGcVlXYxAB",
            "text": "A complete vibe ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGek5tc3RhWEIwZGxkWVNVOU5abFJ3VjJwa2QyYxAB",
            "text": "Such a wonderful place — everything was perfect from start to finish."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFJuWnJaa3A1WkZFeVpFSXlWa0puYW5aQ2NVRRAB",
            "text": "Rain has the most exceptional service. I love seeing her face when I come in for my morning coffee, ALWAYS. My favorite coffee ever."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVFNVTXpRMWN0YW01VVJ6TkVSbGRQTTBOS1VVRRAB",
            "text": "This is my favorite coffee shop in the Bronx and you guys should try it. #love #beautifulpeople"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1IwVldMWHBUZWxWVVdHUkRWMmxpTjJZNFZuYxAB",
            "text": "This café has become my new favorite! The customer service was impeccable, Rain made me the best chai I’ve ever had. The atmosphere was amazing, making me feel right at home. I highly recommend this establishment to anyone looking for a great place to relax and enjoy a cup of chai."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa1ZFTkpOMVZ2YWpWRWFUUm1lRXhIZGtoek0zYxAB",
            "text": "Everyone here was so welcoming. Everything seemed fine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veGNHRm9VSFJJZEc0NVJucFBkVGRpVmt0V2JGRRAB",
            "text": "Love it here..great coffee and service and atmosphere ☀️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS09WUkpVV3RmTnpSZk1WSXlWamR3VEdSa2RtYxAB",
            "text": "Such a cute and cozy coffee shop with a great atmosphere! It has an artsy, creative vibe that makes it a comfortable spot to relax. The coffee is excellent—smooth and flavorful—and the panini is really good too. The cashier was super friendly and welcoming, which made the visit even better. Small, cozy, and full of good vibes—definitely worth a stop!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWlNXOXhkVkZvWVU1UE5YaHlVSGRsYnpCME5sRRAB",
            "text": "You definitely should check this coffee shop out. I got the “ cross Bronx cortado” and the “cheddar bay biscuit.” Both were excellent. Very cool place celebrating how awesome the Bronx is."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdFRrWXdWbTB6Um1SNmNsZGxSMXB3WWtKQ2FVRRAB",
            "text": "The Boogie down is something you need to experience yourself it’s south Bronx as only the south can be !\nYou always leave with a warm heart and a smile"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUWJYSnRSUzFXTmsxU1dYTnNSRXh3TUUxV1gzYxAB",
            "text": "I love the idea that a locally owned coffee house like this is in the neighborhood of Hunts Point."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFRtWTBVRk50UmtGTlMxWjNUVXBmTTJ4TlZGRRAB",
            "text": "Fly place, great atmosphere, incredible coffee!! 10 out of 10 highly recommend!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1QwMVJVbHBDU0ZkVlNYUlRZVVl6Um14RFNrRRAB",
            "text": "Gabby and James and the Black woman who owns Boogie down grind is nice and friendly and excellent to me and the brownies are delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSd1JHVktWVVIwVVd0cFgyZGpMVkpNV1UxWFprRRAB",
            "text": "Eric and Emmanuel are my favorite!! I can come in to BDG everyday easy. 💕 it’s great to have something amazing in OUR neighborhood"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205elkwMTFjREZQYjJ4eFRXaDZWRmhSUzNCWlIwRRAB",
            "text": "Very diverse cultural cafe"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeWNtT2l0MUtQWDlnRRAB",
            "text": "Best grilled cheese in “Da BX”. Staff is exceptionally welcoming and friendly ! Let’s not forget the beautiful Ms. Majora Carter she’s amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ1M5YTdwdXZpUDlRRRAB",
            "text": "Food was amazing service was too!! I didn’t want to leave!!! Definitely stop by!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSG8ycjdRNE9tV1hnEAE",
            "text": "Went there recently & found out they've been there for 7 years! The staff were so nice and the coffee was amazing. Definitely coming back again!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNHNMUUVnEAE",
            "text": "I came all the way from the uk to New York and when I went to Boogie down grind I got myself a coffee and the workers were really nice 👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaGFLTFBREAE",
            "text": "Love this neighborhood treasure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMDVpR09BEAE",
            "text": "Great music and relaxing environment"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnamVpNDlBRRAB",
            "text": "Cool little spot. Reasonably priced coffee and sandwiches. I’d go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBXzV6VmZREAE",
            "text": "Cute cute and cozy nice simple coffee date spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcXZqT2xnRRAB",
            "text": "Nice atmosphere, good coffee great barista. Very nice decor. 5 star definitelly.\nNegatives: very expensive , bad  neighborhood, wrong music style. Cant wait to go again tho"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfb1BUaHR3RRAB",
            "text": "Came here for coffee and something to eat.\nI had decaf latte with maple syrup and it was one of the best coffee cups I ever had.\nFor eats I had a panini (not sure which one, it was the barista's recommendation) and it was really good.\nWe were sitting inside, it was warm and cozy, quiet with some music in the background.\nGreat spot with friendly staff."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MnRMZzdRRRAB",
            "text": "The coffee is wonderful (strong and well made). The food choices are great. What I like the most, however, is the atmosphere. The space is unique, comfortable, and well designed. The owners are wonderful and the community that frequents the coffee shop are great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeS1yekNREAE",
            "text": "The drinks were reasonably priced and delicious the atmosphere was also very dope and the food was so good! I will now be a repeat customer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURia09DbWt3RRAB",
            "text": "If you’re a dayroom yuppie who wants to doomscroll while drinking bland coffee, kindly go to a corporate chain. If however, you want a café that not only has robust coffee & espresso, but a thriving community of artists, poets, and intellectuals, get yourself to the Boogie Down Grind! Like the great cafes of fin de siecle Paris or 50s Greenwich Village, this Hunts Point coffee shop is a nexus for creative people. Don’t miss their Wednesday open mic night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybC1HbGd3RRAB",
            "text": "Had the cold brew on a quick stop in, it was on point and refreshing on a very warm day out. Will stop by again soon, ty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN2F5b2JnEAE",
            "text": "Great find in the Hunts Point area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN3V5MV9BRRAB",
            "text": "I used to play supersmash tournaments here. Amazing staff and community. Great place to hang with true New Yorkers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURManJmenpRRRAB",
            "text": "First time ordering on Uber eats and they were out of stock with the sandwich I wanted but I was able to replace it and customize it , they followed instructions . I enjoyed it so much it was great & excellent service very happy 😁!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeXJQcUZnEAE",
            "text": "Something different for the BX!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6djd2dHJBRRAB",
            "text": "Cute cafe and beer bar in the Boogie Down. Chill by day and bumping at night."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb0xqYjd3RRAB",
            "text": "It's always a delightful experience whenever I visit or order delivery. This is one of the top spots in the neighborhood for great coffee and a light bite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUazlTUHl3RRAB",
            "text": "One of my FAVORITE spots to get cookies from. Top five NYC cookie places in my book (and I’ve been to a lot). But they run out very quickly, so get it while you can."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdGRxM3RBRRAB",
            "text": "I love this place it's like a true gem in The Bronx where I'm from. Ava usually is the one who makes my Matcha latta (which is always perfect). Today I tried a taro latte to switch it up she gave the idea and it was so tasty I'm a fan now. Still love my number one Matcha though lol. I feel so welcomed here from the first moment I stepped in, the baristas are so kind and friendly. The environment is so comfortable. I'm definitely going to be a loyal customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNWFXWTB3RRAB",
            "text": "This place has an open mic on Wednesday. Great energy and beautiful vibes were present. The sangria and lemonade drink was the perfect combination 👌🏾…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcC02NmVREAE",
            "text": "Stopped by this little trendy shop and it was pretty awesome for its size, plus they have 2 outdoor seating areas. I had the wings they were cool for 5 bucks! They also serve alcohol,  and the staff is super friendly... looking for a chill vibe hangout spot that won't break the bank in SOBO, COME HERE! 😁"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa2RuN05nEAE",
            "text": "Tried the vanilla-rose latte and it was amazing. Not just saying that cuz I created it! Try it and you'll see for yourself. In honor of Black Women's History Month."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZ0lXM2JnEAE",
            "text": "The girl at the counter doesn’t seem to be able to handle the environment with only two ppl in the store she’s flustered doesn’t know where things are\nHad to wait 10 minutes to order my food when there was no one else there ordering On top of the wait, my order was served to me wrong and had to be remade. I like the guy much better…."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbktyQXRnRRAB",
            "text": "This is a proper neighborhood coffee house. This neighborhood is fortunate to have a nice space and outlet for high quality food and beverages. Service is amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MVBTX0RBEAE",
            "text": "Amazing Matcha latte! And the vibe was great too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbVkyLUV3EAE",
            "text": "I love this place and can't wait to check out their open mic nights! Good food, good people, delicious drinks and artistic environment in Hunts Point 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONnNyX2ZnEAE",
            "text": "Lovely experience every time I visit or order delivery. One of the best places in the neighborhood for good coffee and a light snack."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdV92aFNnEAE",
            "text": "Perfect vibe, open mic night on Wednesday was a great time. Cheap food and drinks ❤️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWcjZmZTNRRRAB",
            "text": "Comida buena"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWeHBiNmFnEAE",
            "text": "We had a great time here! Good vibes all day!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPODc3QllnEAE",
            "text": "Wow, this localy owned place is the definition of community love and a safe place for all offering amazing coffee and fresh pastries ( croissants are delicious) and other food options ( must try their breakfast sandwich $5ish) omelettes, waffles and so on . They also have summer frozen cocktails. The prices are lower than other places around NYC and very affordable! On top of being a cafe they hold poetry nights open to local artists to express themselves and share their art, have local vendors sell their products and just a safe space for the community.\nWe kept coming back for our coffee fix and some breakfast bite. I highly recommend this place!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bkxmNzVnRRAB",
            "text": "Great coffee joint in Hunts Point !  Lots of espresso drink options . I had a cheddar scone and a tumeric anti- inflammatory latte. The staff was so super friendly and I love the urban vibe and decor. A must try for anyone who loves the Bronx and loves coffee."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabXNLRE1BEAE",
            "text": "Visisted with a co worker and worked remotely from their place for half a day\n\nLOVED the vibe of the place, the food was good, just not memorable - but I would not mind goong back\n\nThe service was quite good and the atmosphere and style is one of a kind\n\nIt's a very cool place to visit if around the area - but it's not like if I would go all the way there though... :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MzVURVp3EAE",
            "text": "It is sad to say this place was a real disappointment. I love finding local coffee shops to support and was looking forward to my visit, but this was a terrible experience. To start off when I walked in nobody greeted me. I stood in front of the cash register for about 5 minutes and the two people behind the counter continued to talk. Another customer walks in and gets served immediately. The employee sees me waiting and does not acknowledge me at all, and continues serving the other customer. Once she’s done with the customer she does not apologize and takes my order. I ordered iced coffee which I received totally watered down with barely any ice. I also ordered an egg sandwich that they apparently forgot to make. I waited about 15 minutes and still wasn’t served. When I finally asked about it, she looked annoyed and did not apologize at all for the wait or forgetting my order. Waited another 10 mins to get my sandwich. Overall, this experience was terrible. It seems like they attend regular customers much better than new ones. I hope they do better than this. I will not be returning here."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndTVUaXJRRRAB",
            "text": "I love this cafe! They have a variety of tea options, which I really like because I am a tea drinker at heart. Also they have delicious pastries and paninis! This over any dunkin donuts in the area. The staff are extremely passionate about…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM1BPeDRRRRAB",
            "text": "Now this shop is the real BX. On my visit,  a slideshow of interesting people. My favorite? The trendy lady with the pet ferret telling people is doesn’t bite much. On my next visit I want to try the pastries.\n\nThis location is so hip, it could be used as a movie set.\n\nPlease visit and tip your server."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNk9qakpnEAE",
            "text": "Hot coffee spot uptown in the BX. Good coffee, knowledgeable staff and cool looking little shop. They offer 64oz coffee growlers!! Support your local coffee shops, if your in the Bronx hit this place up!!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJLWMtbUpnEAE",
            "text": "A needed cafe for the Bx aka The Boogie Down. I'm glad I follow them. I read they are moving to Seneca ave. Great staff, Good Coffee, Nice Ambience. Big ups Grind."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cU0zWEF3EAE",
            "text": "Absolutely fantastic space run by good humans; we saw they were having a special event w a legendary graffiti artist the first night we were coming into town.  Got there a little late but the owner and staff made us feel right at home and made sure our kids came outside and met the artist, listened to him talk about his work.\n\nAlso the food was great -- especially the panini and wings -- and drinks outstanding\n\nBut really .. stop here for the vibe.. the humans.. the food .. and being part of the goodness they are brining to the Bronx"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNk9YY1NREAE",
            "text": "Great place! Love the vibe, the coffee and the food. The service is very great and it’s really one of the best coffee shops in the Bronx. Hope they’ll open more locations! I think they’re one of the only coffee shops that carries oat milk! I will be back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNc2RxUjF3RRAB",
            "text": "By far the best coffee in NYC! Awesome customer service, keep up the great work Tyson!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM0t5UGJ3EAE",
            "text": "Cute space. The cashier seemed bored and didn't greet us when we entered. Wasn't sure if it was place was actually open. The gate was not all the way up. I would suggest getting a soup wamer instead of making instant package oatmeal & grits."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNnFDSjdRRRAB",
            "text": "Really good atmosphere, good variety, the drinks should come out warmer, the wifi is decent but needs to improve.\n\nGood prices!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdmVHY3lBRRAB",
            "text": "Amazing coffee, amazing community!!!  The sandwich was phenomenal!  Big ups to Boogie Down!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dUl6YjRRRRAB",
            "text": "I am a huge fan of this place! There are a few decent coffee locations in the Bronx and this is easily #1.  The coffee is worth the price and the ambience is true to the Bronx.  The coffee itself is absolutely amazing, the flavor is always nice and woody and not once have they failed on my cappuccino or lattes.  Everyone is really chill and you will  constantly see the owner just hanging out here.\n\nI remember once my son dropped his cookie on the floor and she made sure to replace it without asking us.  This is one of the few local small business that I love to support and would bring everyone and anyone I could."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNFo3RnJRRRAB",
            "text": "I love getting me some Boogie Down Grind coffee and a pastry. Rich espresso and tasty pastries. Yummm!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dU1fWlJREAE",
            "text": "First time here. Enjoyed the coffee and the vibe. Can't wait to go back. Chill spot in the Hunts Point area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcHVqdU53EAE",
            "text": "Amazing amazing coffee shop. Only real coffee shop for a miles around. Decor highlights the beauty and history of the Bronx with signs from old businesses, artistry work from musicians, art, and literature unique to the area as well. Service is superb, got a double expresso from Rodney early in the morning.\n\nWill definitely be back to try their food and drink. Espresso tasted amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc3JyZzFBRRAB",
            "text": "What an amazing place. Great drinks, great atmosphere, great staff, great owners and great events. I will definitely be going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydUtHeGdnRRAB",
            "text": "I guess I went on the wrong day to this place.  The cashier seemed in a rush to take my order. The 3 people after me got their food before myself and my daughter. The cashier called one of them by their name and looked at me, as if he knew he messed up. Our grilled cheese was not hot nor did it taste good. The coffee was okay. Nice place but not going again."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eW82aG5RRRAB",
            "text": "Great coffee AND wifi!? How could I not stop in?! Such a great atmosphere to sit and meet folks from the neighborhood and get some work done. I've been to other locations in Manhattan, but it's great to see one in the Bronx. Nice to have…"
        }
    ],
    "reviews_count": 71
}