{
    "name": "Hunts Point Chinese Restaurant",
    "place_id": "ChIJFX52Eqv1wokRe7o7gpQgwiY",
    "grid": "BX2",
    "address": "901 Southern Blvd, Bronx, NY 10459, USA",
    "rating": 4.2,
    "user_ratings_total": 209,
    "phone_number": "(718) 378-2055",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cFNVMU9iM2t6VFRaRFJuaFRhM1pPYVhkNWRYYxAB",
            "text": "First Chinese restaurant that I actually found since moving to the neighborhood that tastes great and has awesome customer service. The woman who takes orders in the front is always so welcoming and sweet. Love their shrimp and broccoli combo with pork fried rice and an egg roll. I will say the prices here are on average 2-4 bucks more than other Chinese food take out restaurants throughout the city though and that part I wish were different. Great food and nice people though."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RU5ubHBXa3BZTFRSUlZrOVJhRE54ZWxkMFpuYxAB",
            "text": "The shrimp is spoiled"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TE1sQm1PWFoyVldFMmMzcFBOR1ZSTVZWcVVWRRAB",
            "text": "Delicious! Ordered on uber eats and everything was fresh and tasty. Definitely will reorder"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLTg2YzNBRRAB",
            "text": "I got the sesame chicken & Im blown away.. ABSOLUTELY DELICIOUS & the woman at the register is so friendly."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MllmcUhREAE",
            "text": "La cómida muy deliciosa, el personal es muy amable"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d09PR2FREAE",
            "text": "The food is really good and will take out again"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnXy1Ia1B3EAE",
            "text": "Food here is amazing!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNzdpcDdRRRAB",
            "text": "Small but the cashier is really nice and the food is good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMFlpX2hnRRAB",
            "text": "The best chinese food found here in the south Bronx. Also check out their hot oil and add it to your dish for more of a kik!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyLVB6YTJBRRAB",
            "text": "Can’t complain so far the food has been really good and fresh, and great customer service even the guy who delivers it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNManFIeWxnRRAB",
            "text": "Food is great! However they can’t hear when you’re placing a order, you have to call them  at least 4 times to place the order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OExhMzhnRRAB",
            "text": "I been going here for a minute and I only order chicken or shrimp but today I tried the chicharron it didn't even taste like chicken and it had no flavor at all I wouldn't even give them a star but I was forced to so I comment"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OTRUaFRBEAE",
            "text": "I love broccoli with brown sauce. The broccoli is very fresh. And the sauce just perfect, not too salty. I will come back ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbF8zcUlnEAE",
            "text": "Yummy. I love them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOTRuVi1RRRAB",
            "text": "Very polite and food was sooooo good!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ0xEdnpRRRAB",
            "text": "I ordered the Seafood Delight (supposedly a “chef Special”), it was completely tasteless, the King Crab Meat was artificial, the Lobster close to non-existent."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROb0xiVXJnRRAB",
            "text": "The food has no taste..  3 stars for the portion.  I ordered chicharron de pollo w/ pork fried rice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc2VqdzF3RRAB",
            "text": "The female who takes the order is always polite. The food has always been top tier for years. Don't really trust other spots."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsM2NmQXpnRRAB",
            "text": "Ordered steamed vegetables & brown rice, with side boneless spare ribs. Needless to say the vegetables and brown rice was delicious, but the boneless spare ribs was cold unfortunately they dropped ball. Better luck next time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGX2VLOTZ3RRAB",
            "text": "Ever since Pat left the food isn’t the same, it has no taste at all. It’s like having covid and eating Chinese food. We used to order at least couple times a month. We thought maybe we ordered it on a bad day , or we waited a couple of months before ordering from them again, but it never changed, the food was still bland!! We always get the same order. It is mainly the pork fried rice that is bland and the chicken and broccoli. The rib tips were dry (could have used more sticky sauce) , and chicken wings were decent, even tho some looked like bird wings due to it being small.  I’m not a negative Nancy, but I used to really lovedddd  their food, so it is a bit disappointing for me. I tried to find another Chinese restaurant in the area due to this , and even those dont come close to  Pats food ☹️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNGVMcjRnRRAB",
            "text": "Good local spot. Affordable, fresh food with good prices. Strictly a take out place. No dine in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacHA3TjNnRRAB",
            "text": "While I don't really think the food is super duper tasty it's definitely something that hits the spot when you need some American Chinese food. I give it five stars because every time I've been in this establishment I always feel very comfortable and welcome with the staff. I've never felt like they didn't really want me there buying food from them. They're always very friendly and I will continue to go to them for my little American Chinese treats."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaU43UUx3EAE",
            "text": "The best place for delivery 😍 they speak Spanish and English , I love this place thank u for make me feel special 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwalB6aUNREAE",
            "text": "Girl on the phone was very polite and professional definitely my new spot !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLWVDY3B3RRAB",
            "text": "So my father and his wife has been ordering food from here for over 5 years and they always show decency, but now that I called them from a different number they decided to make my 55 year old fathers food in a different way knowing he’s very specific. Their excuse was because we called from a different number. This is technically called biased. I ordered boneless spare rip tips I asked for it to be in a separate container and this is what they gave me! How freaking RUDE AND NASTY AND UNPROFESSIONAL IS THIS!!! It doesn’t even look edible. The delivery driver is very rude and demands tips before he hands you your food! Ohh and they hung up on me 4 times I will post audio recordings of how rude they are"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dUxHMGNBEAE",
            "text": "great food at a good price"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX1BEMDJRRRAB",
            "text": "I live this place they are always friendly and fast."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNGMteUlREAE",
            "text": "This place is great good cooked fully food fresh tasting nice stuff prices are the best I will continue to take the 5 block walk or do delivery with them thank u I have one closer to me and let's say they are no competition to this restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodnFIRmZnEAE",
            "text": "Love the food and the service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodklDNWlRRRAB",
            "text": "Best Chinese take-out in the Bronx. I wouldn't go anywhere else. Recently changed management but the food preparation is unchanged. Shoutout to Patty and her crew, wishing you the best on your next move. Welcome to the neighborhood Tracy,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOUlUUWlBRRAB",
            "text": "Safe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOWNIU1VREAE",
            "text": "This use to be one of my favorite places to eat when the owner was around. The food now is not the same. The rice is dry and hard, meat taste uncooked and it seem like the price changes from on the phone to when they reach my door. I just can't wait until the owner gets back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjb2JmeXRRRRAB",
            "text": "I love this place. Patty always smiling and always kind. She knows her customers well and treats them well too"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaUtlRnRnRRAB",
            "text": "The best Chinese food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcDkySUJnEAE",
            "text": "Good Chinese the lady is cordial too bad that u have to cross the brunckner to get there"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNDgzb29nRRAB",
            "text": "Another review  chicken  and broccoli. Seasame chicken  so Good ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1enViakhREAE",
            "text": "The best in the area.  Great prices.  Great service.  thanks"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2JYaXlRRRAB",
            "text": "Very nice and friendly people.  Quick delivery also"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MUwtaHZ3RRAB",
            "text": "Super friendly service and the best Chinese food in the neighborhood. Love them!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNUx2RC13RRAB",
            "text": "Food used to be good now it just has no good quality taste feel off a lot and they rush every order garbage"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOHJHVktBEAE",
            "text": "Great place. Enjoyed the food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXczRHdWd3RRAB",
            "text": "The food used to be good. However, the flavor is poor. They must have cut back seasoning and it clearly shows"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdHFqOGhnRRAB",
            "text": "Person on phone was very nice. Delivery was super fast. Food was very very good. Will always order from them."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2N0tPVGp3RRAB",
            "text": "Buena atencion"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhM2FIalpREAE",
            "text": "Great  Food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxekkyRl93RRAB",
            "text": "Bok Choy in the Bx! I'm glad that I found this store. Good food good prices."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxejlISlh3EAE",
            "text": "Love the food here and I have tried every spot from Soundview to huntspoint and this is the best Chinese food. The rice taste like love the chicken wings are delicious and crispy not over cooked and everything else was amazing as well."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLTRlVTlBRRAB",
            "text": "The cook was not wearing a mask and when asked to put mask on he immediately refunded my money"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5Z3IycmJBEAE",
            "text": "Good food"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVei1pelVBEAE",
            "text": "Found multiple strands of hair and when I called to let them know I asked why they didn’t offer money back plus free food the person on the phone stated that I was threatening her and that she had my information and would report me! I then…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMmFMU2d3RRAB",
            "text": "I really love this resturant because the owner is a woman who can remember the address of any customer who walks in or calls because she works hard to make sure that person gets what they need.  Now sometimes being a human you make mistakes and might forget something that a customer ordered, so you might ask for a receipt to see if you really forgot the order or if the customer is lying.  Now, if a owner of a resturant does not call you back is probably because they, I don't know, have a million other customers who walk in and call.  Especially if its a resturant that has been open for a long time and many LOYAL customers decide to go to this one resturant.  The service of this resturant is wonderful and any LOYAL customer that  doesn't understand that does not need to return there. More amazing food for everybody else."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNZzdEOXFBRRAB",
            "text": "Best Deli in Bronx hands down 925 Hunts Point Avenue! Stop by and get your deluxe sandwiches, breakfast wraps, omelettes, burgers, fresh raw juices, smoothies, build your own salads, lunch wraps and more! This is the best deli in the Bronx, fresh food! Fruits and vegetables."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3elBUOHFBRRAB",
            "text": "This is my go to place for my late night Asian cravings. This area needs legit Chinese, Thai, Japanese, etc. So until then this boogie down Chinese joint does the job. The family there has been there for years so to locals and in general they are very kind and acomadating.  No complaints."
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dThMQWVnEAE",
            "text": "The food tastes great and the people working there are very nice and also fast on the delivery score. They've gone the extra mile for me more than once."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnb1ozVzR3RRAB",
            "text": "They are very impressional, I'm disappointed in the fact they never even called me they had me wait an hr for food that was never delivered. I don't recommend this to nobody ."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDdHFLY1BnEAE",
            "text": "If you order food will get there in 20 minutes or less because of the pandemic you have to downstairs meet them in your front entrance, have also gone to the location small place clean nice staff always order from here."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBclBhNV93RRAB",
            "text": "My favorite Chinese take out spot.  I would rather drive home and order from here than to try my luck with a new spot.  I'm never disappointed with the food."
        },
        {
            "date": "14년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnem9fM05nEAE",
            "text": "Food is great and fast delivery. If they miss any item they have no problem coming back at no charge."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOUlheUp3EAE",
            "text": "I been eating at patty restaurant for many years the food is great patty n her husband are very polite and they do a great job"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReGQyWTF3RRAB",
            "text": "The best for me just love the way they cook my chicken wings nice and natural 😋😋😋😋…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTN3AzUmdnRRAB",
            "text": "Best since she was in hunts poin  the food is good and the restaurant is super clean I give them a 10"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwN2VIWUNBEAE",
            "text": "I have been coming here is awesome. Love the lady she is good very friendly"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRb0l6NFpBEAE",
            "text": "Promptly show her your drink and side selection, pay up, and then either sit in one of the two stools and eat or yet again, PLEASE MOVE OUT OF THE WAY."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNUt1ZV93RRAB",
            "text": "Food is always fresh and nice.  Reasonable prices and they deliver."
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOTRTSlB3EAE",
            "text": "I just recently started using them and quickly fell in love with their food quality and taste and fast delivery"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJejVyc193RRAB",
            "text": "Not very professional, they will take people they know ahead of time before taking a new person for a haircut"
        }
    ],
    "reviews_count": 66
}