{
    "name": "O'Hara's Restaurant and Pub",
    "place_id": "ChIJueUCrBBawokRiw9LMJFm0_o",
    "grid": "MN1",
    "address": "120 Cedar St, New York, NY 10006, USA",
    "rating": 4.6,
    "user_ratings_total": 5483,
    "phone_number": "(212) 267-3032",
    "reviews": [
        {
            "rating": 5,
            "date": "14시간 전",
            "text": "What a privilege to visit. Staff extremely friendly and helpful by being willing to discuss the history and impact they shared with first responders on 9/11 and the many years of cleanup and construction that followed.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "Every dish was cooked to perfection.",
            "language": "en"
        },
        {
            "rating": 4,
            "date": "3일 전",
            "text": "Called in for a drink to take in this special atmosphere",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "3일 전",
            "text": "Très bien,  je recommande",
            "language": "fr"
        },
        {
            "rating": 5,
            "date": "4일 전",
            "text": "We went there big group of friends and EVERYTHING we ordered was 10 out of 10!!!\nBut my favorite is their Reuben and fries !!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "4일 전",
            "text": "Our favorite restaurant.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "5일 전",
            "text": "great little find good and service",
            "language": "en"
        },
        {
            "rating": 1,
            "date": "5일 전",
            "text": "Tall big grumpy guy with grey beard RUDE RUDE RUDE. Rude to everyone sitting at the bar. Told us to close out because he was leaving. My husband and I both work in the industry, there are plenty of nicer ways to get some to close out. The other bartender, young black kid, looked like he didn’t even want to be there. Not attentive at all. Beer was good 👍",
            "language": "en"
        },
        {
            "rating": 4,
            "date": "6일 전",
            "text": "Cool bar next th the firehouse at the 9/11 memorial",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "6일 전",
            "text": "One of the best Irish pub in NYC. It's so cozy and relaxing. The perfect atmosphere. Service was fantastic and the food is so good. Generous portions of food at reasonable prices. O'Hara's is the kind of place you want to visit again and again. When you find yourself downtown, O'Hara's is the place to go for food and drinks.",
            "language": "en"
        }
    ],
    "reviews_count": 10
}