{
    "name": "Pepolino",
    "place_id": "ChIJf6tT54pZwokRI5EU-NKF7sE",
    "grid": "MN1",
    "address": "281 W Broadway, New York, NY 10013, USA",
    "rating": 4.5,
    "user_ratings_total": 895,
    "phone_number": "(212) 966-9983",
    "reviews": [
        {
            "rating": 5,
            "date": "2일 전",
            "text": "The best Tuscan dinner I have ever had! The service was first class and the desserts were amazing! The ricotta cheesecake was spectacular! Thank you pepolinos for such an amazing dining experience!",
            "language": "en"
        },
        {
            "rating": 4,
            "date": "1주 전",
            "text": "Stopped in for lunch on a Saturday afternoon and the restaurant was not very busy, the food & service were very good and I would recommend it and would visit again.  My only down side was the table placement next to a large party of 8 and next to the \"bar\" area which was not ideal but the upstairs looked inviting & with a better table location/atmosphere it could have been a 5 pretty easily.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "3주 전",
            "text": "I had my birthday dinner here for a group of 12 and everything was perfect!  They made sure we had a great table, food was delicious and the service was incredible, never letting our glasses get empty.   The team there went out of their way to make it a wonderful night!",
            "language": "en"
        },
        {
            "rating": 4,
            "date": "1달 전",
            "text": "Super cute and inviting interior, Luigi was helpful and hilarious, and the food was decent.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "My Italian friend took me to Pepolino on a Monday night and I was super impressed with the food. We ordered the calamari fritti, Tagliatelle porcini and the Melanzane scarmoza which was my favorite dish. For dessert we ordered the Ricotta cheesecake and it was delicious. I’m not a cheesecake person but I LOVE this one. Great service and relaxing ambiance. The whole experience transported me back to Tuscany ❤️ This is an amazing restaurant and I can’t wait to dine where again",
            "language": "en"
        },
        {
            "rating": 1,
            "date": "수정일: 1달 전",
            "text": "Booked a table, went there and turns out it was a table that is literally on the road on a very busy avenue. You are on the street with this weird smell around. I thought i was booking a table at a restaurant.\n\nNot a place to book for a date night.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "Deliciously Fresh Homemade Pastas! And save room for the OMG cheesecake!",
            "language": "en"
        },
        {
            "rating": 2,
            "date": "1달 전",
            "text": "Very average food. The servers are fine. The interior needs help.",
            "language": "en"
        },
        {
            "rating": 3,
            "date": "1달 전",
            "text": "Its nice, but nothing special.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "Great place , great atmosphere, great service and food !",
            "language": "en"
        }
    ],
    "reviews_count": 10
}