{
    "name": "Brickyard Craft Kitchen & Bar",
    "place_id": "ChIJme4A6d5bwokR7QwUdTNRp5E",
    "grid": "MN1",
    "address": "23 Park Pl, New York, NY 10007, USA",
    "rating": 4.7,
    "user_ratings_total": 620,
    "phone_number": "(646) 449-0826",
    "reviews": [
        {
            "rating": 5,
            "date": "7시간 전",
            "text": "Okay, can we talk about how amazing Benny is?! From the second we sat down, he had the best vibe — super friendly, funny, and somehow managed to keep up with a packed bar without missing a beat. Our drinks came out fast and the food was delicious!\n\nHe kept checking in just enough to make sure we were good, but never hovered — honestly, it felt like we had a friend working behind the scenes making sure our night went smoothly. You can tell he genuinely enjoys what he does because his energy is contagious.\n\nBy the end of the night, everyone at our table was talking about how great he was. If you go to this bar, do yourself a favor and ask for Benny. You’ll get great service, great laughs, and he will definitely become your favorite server! I will be coming back!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "The best!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "Best sports bar in the city",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "3일 전",
            "text": "Best service\nAmazing food\nHappy hour price and drinks were just fine",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "수정일: 4일 전",
            "text": "Fun place to relax after work. The staff is thoughtful and make you feel like you’re a local. Drinks are responsibly priced and the food is tasty.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "6일 전",
            "text": "Had the most amazing experience. The food and drinks were great. We had a great experience with Amintta, she was attentive and beyond pleasant. Very much would recommend and will be back!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "My boyfriend and I came here for the first time as Michigan fans. Our server, Benny, was the most sweetest, realest, most amazing person ever!!! We’re definitely coming back just for him! Also, the drinks??? AMAZING. Thank you again Benny for making our experience one to remember!!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Amintta was our waitress and she was so sweet and respectful.  The food was amazing and the atmosphere was so family like.  Would def come back and recommend for everyone!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "I need y'all to know Benny makes this place worth coming back to EVERYTIME. Yes the food and drinks are good but the service he provides is top tier!. He is friendly, attentive,funny,and his suggestions are never wrong. Trust his insight. Come here and ask yourself \"what would Benny do\" and then do that",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Benny is hands down the best ! He’s super attentive & friendly with amazing customer service, definitely makes the experience super pleasant & the atmosphere/music is fun, will definitely be back ! The strawberry margarita is a 10/10",
            "language": "en"
        }
    ],
    "reviews_count": 10
}