{
    "name": "El Nuevo Pollo Sabroso 2",
    "place_id": "ChIJGW_drZf0wokR7VF3L6WXv20",
    "grid": "BX11",
    "address": "651 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4,
    "user_ratings_total": 547,
    "phone_number": "(347) 810-5304",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaVNYcG5TMWRoYURSalJqVjBUV2hTTlc5WFRWRRAB",
            "text": "Pollo con Moro de habichuelas negra Riquísimo !! Me siento en mi Quisquilla bella 🇩🇴"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFh6RjROV1ZmV0VSYVVrcHBTMWN6Um5GWGRrRRAB",
            "text": "me gusta 👍"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQYTRsZjd3ek9mTXlBRRAB",
            "text": "Este restaurant pense que habia cambiado su forma de manejarse en este momento ordene un combo #1 la señora que me estaba preparando el combo note que me estaba poniendo muslo de pollo horneado la cual le dije señora ese combo es con pollo…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbi1pMEZREAE",
            "text": "Call to make an order for delivery at 8 pm and rude lady on the phone said the restaurant closes at 9 pm so no more deliveries. This place is ridiculous and rude"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneWJlVHJBRRAB",
            "text": "very good and fresh for daily restaurant"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOXBfWC13RRAB",
            "text": "Food, Service and everything they have is Great!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc3NhODl3RRAB",
            "text": "Was visiting from Boston. My cousin & husband wanted to have us eat at home tonight. They ordered a Roasted Chicken from this place. WHAT A DISAPPOINTMENT!! Very dry, charred, and seemed like it was hours old. I can understand my family was embarrassed. El Nuevo Pollo Sabroso 2 (Morris Park) should compensate them with a fresh one made with PRIDE. Fue un Bochorno y gran desilucion! 👎👎👎"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2amJpcE13EAE",
            "text": "Tengo años de ser clienta y estoy completamente decepcionada con el servicio. La comida pésima y con mal gusto. No le recomiendo que ordenen de aquí ya q hasta el servicio al cliente es pésimo."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ei1QNnVRRRAB",
            "text": "Let’s start with the rude delivery guy who was upset because he had to bring the food to the  door. Sir that is your job if you don’t like it get a new one. Now to the food I ordered the family meal which was a whole chicken and 2 pork’s…"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcmVfQktnEAE",
            "text": "Buen servicio y garantía  los recomiendo"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNnBhVl9RRRAB",
            "text": "El mejor sabor en el bronx"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcU5HaHlRRRAB",
            "text": "Food is good. I do not recommend the shrimp mofongo to anyone! Has more tomatoes onions and the sauce then shrimps had no shrimps. The plantain was watery because of everything they added."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMHRmSFN3EAE",
            "text": "Good Food and Staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNnNPTmRREAE",
            "text": "I ordered some tostones and pollo alcaldero and I told them I will like it separate and they said no. The only way to do that is to pay $26 plus dollars and I was polite and took the order all together when I got home tostones weren’t crispy cuz they mixed the chicken and the tostones. Not happy costumer. Too strictly system."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeDg2RU5BEAE",
            "text": "Good Dominican breakfast"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNXRHUTNnRRAB",
            "text": "I order from here all the time, the food is always great and fresh. there’s a reason why the chicken is the main thing sold here, it’s amazing with so much seasoning. the food is so affordable for what you get. also the customer service is very nice and likes to make conversation. takeout is fast as well have never ordered something from here and been dissatisfied or disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX05MMUZREAE",
            "text": "So good. Stopped by when visited the Bronx zoo. Come here before or after for good Latino food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNk5ESDlnRRAB",
            "text": "At around 5pm Monday on the 22nd of the July the I called for a delivery and the lady that answered the phone called me stupid because I don’t understand Spanish but I know what stupito means and she had a bad attitude and I was very calm and I felt totally disrespected and then the guy that delivered the food was rushing me to get my money when he only been standing there for 30 secs I don’t know why those two specifically people have a attitude but I won’t order there nomore cause I feel like they were being racist"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OC1ENzdnRRAB",
            "text": "You will pay for something and they will give you something smaller or a lesser amount. Then when you call them, they will argue with you and hang up on you."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c2REV0RnEAE",
            "text": "Es ambiente es bueno pero la comida es muy buena pero la ensalada está algo curiosa aún  asi estuvo muy rico pero el lugar cuenta con 3 mesas y una mesa unida con otra"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMWZXX1ZBEAE",
            "text": "Tried this place  the rotisserie  was amazing fresh and delicious  will be ordering again and again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbEktYXNBRRAB",
            "text": "I waited over 10 mins for fried pork and it was super dry. The rice and beans were cooked together but next time I would add beans on top instead. Great flavors but my plate was too dry for my liking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqczRYaG13RRAB",
            "text": "The service and food were absolutely great! Good pricing, lots of variety, and fresh. My only suggestion would be to give more beans and sauce with the rice. Balance the portions☆\n\nThank you☆ I can't wait to visit again.\n#Yummy"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ODlTal9BRRAB",
            "text": "El peor costumer service  aunque sea cocinan bueno"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dVBHUGV3EAE",
            "text": "Es buena y mucha comida"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0MzdEanFBRRAB",
            "text": "El servicio más malo y las trabajadoras siempre se le olvida completar el pedido correctamente .la calidad de comida es muy mala"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX2ZLS0dREAE",
            "text": "I ordered two whole chickens for New Year’s Eve because I was pressed for time and my order was ready in 15 minutes, let’s also add it was 30 minutes before closing. The staff was friendly and  it felt like I was picking food up from my tias house. 🙃 the chicken was fresh, and tasty! They never disappoint.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdE5HcGdnRRAB",
            "text": "Good food but pricey."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa2ZYWTZRRRAB",
            "text": "La calidad del arroz blanco ha variado mucho. Sabemos que a todos no les gusta el arroz graneado, pero tampoco es para que todos los días esté apastado."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNThySjhBRRAB",
            "text": "La comida es buena pero las mujeres que atienden es el peor servicio que eh tenido en mi vida las mujeres con una perreria como si uno fuera a comer gratis yo ordenaba mucho y siempre me mandaban algo malo la papa pasada de caducidad la ensalada verde no era verda ya era marron y las mujeres con una perreria mas nunca vuelvo a comprar aqui y si usted esta biendo este comentario tratelo por usted mismo y llame que la actitud viene de una vez"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMnZtd3h3RRAB",
            "text": "Their food is OK. Nothing special and their prices are kind of high for mediocre food. You could go to a much better Spanish restaurant for the same price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweXE2d3lnRRAB",
            "text": "Good Spanish food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaXREVU93EAE",
            "text": "waited like an hour and the food still wasn’t ready"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcUxyRXFRRRAB",
            "text": "Buena comida"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGY3NFJnEAE",
            "text": "I ordered a steak sandwich and probably the most disgusting steak I’ve ever had. The food normally is pretty good but definitely not this sandwich."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWV6YjFnRRAB",
            "text": "Pretty good Spanish food."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eWFDNFpBEAE",
            "text": "Mal servicio al cliente. Tardan mucho para todo y lo peor es la actitud."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cll1cFR3EAE",
            "text": "I highly recommend the rotisserie chicken,  make sure you ask for the chimichuri sauce on the side, complement the chicken w either yuca or the green bananas w red onios, amazing. Don't forget to tip the waitresses, they work very hard and are very friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N0wzQ2pnRRAB",
            "text": "Amazing Dominican food in the Bronx, right along Morris Park."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNTVEY0hnEAE",
            "text": "Real authentic Dominican food the prices were so affordable. And everyone was nice even though I don't speak fluent Spanish . I ordered arroz con pollo and chiccarones de huego. PERFECTION ❤️"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScUwteVZnEAE",
            "text": "Muy buena la comida un 100 💯 al cocinero.pero la atención al CLIENTE ES PECIMA MALÍSIMA LAS EMPLEADAS MUY MAR EDUCADAS. PARA DELIVERY y EN LAS MESAS NO AHY NADIE QUE PRESTE ATENCIÓN A LAS MESAS. EL CLIENTE SE TIENE QUE PARAR A BUSCAR ASTA LAS CUCHARAS PARA COMER PORQUE NADIE SE DA CUENTA DE LOS SERVICIOS EN LA MESA. MUY MALA ATENCIÓN. EN LOS DELIVERY SIEMPRE FARTA ALGO HO MANDAN ÑO QUE NO ES. NO LIMPIAN LA MESA Y TE QUEDAS AHY CON LA MESA SUCIA. Y TIENES QUE PEDIR QUE LA LIMPIEN Y CUANDO LO DISE ELLAS SE ENOJAN HO ASEN COMENTARIOS ENTRE ELLAS. A LA GERENCIA QUE PRESTE ATENCIÓN. LA CALIDAD DE ATENCIÓN ES (PECIMA)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdW9xR2lnRRAB",
            "text": "El morir soñado requisito"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwN0lxeXJ3RRAB",
            "text": "Great spot to eat the chef is amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb2VtTnF3RRAB",
            "text": "Not bad for a local place. I go here to pick up food for lunch later on. Wish they served maduros"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcV9YTkhnEAE",
            "text": "Es un come y vete"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdjhtcjFnRRAB",
            "text": "Terrible customer service"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLUpMd2F3EAE",
            "text": "The service was awesome and helpful, the food was delicious and the place was clean and organized, will recommend it to everyone else, the lady's now there job and attentive to catering, the taste had me thinking of my country"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdE1MV1pnEAE",
            "text": "Great soup and prices u can't beat!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZcXVEdnpRRRAB",
            "text": "I really love this place! But I have to make one thing clear do not come to this restaurant before they close the staff will have an attitude and will serve you pretty cold food because they're upset. unto the review.\n\nPros: I mostly dine-in when I come here I never had a bad experience ordering food the portion sizes are huge and can feed a lot of people food is well seasoned well-prepared well cooked delicious a great spot to come to have lunch or dinner I'll mention this again please be considerate of the time when you dine in try not to dine in if they're about to close you will have a bad experience this place offers authentic Spanish food that's not salty and the cooks know what they're doing.\n\nCons:my only con  about this place is you may be craving a certain item on the menu That's not available because it's not that day that it's available for. their food selection is based off the day so if you wanted lasagna you would have to wait until the day that they actually have lasagna to serve otherwise really good experience I will say. The menu is a little hard to translate if you don't speak Spanish but to be very honest with you the staff is pretty helpful in trying to figure out what you want to order."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPay1LUWFnEAE",
            "text": "This rice and beans with ribs if u can find it\nYou  get three little pieces for me the flavor wasn't there\nThe beans had more sauce then beans which I let them know\nWas it worth it, for me no\nThe staff was friendly also if u looking for a menu they don't  have one but I did notice the ppl that did came in was asking for the soup\nGo figure\nSo it get two 🌟"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlakxqemxRRRAB",
            "text": "La comida es buena. Lo terrible de este lugar es el personal, yo era un cliente fijo hasta que ambas de las mujeres que atienden me hablaron mal. ( te preguntan que deseas y ellas atendiendo a 3 personas más al mismo tiempo) me preguntaron 4 veces que que deseaba 🤦‍♂️Hasta que le dije wao me han preguntado varías veces lo mismo y lo que me gane fue un boche de ambas.\n\nCreo que si educan al personal sería un lugar magnífico. No existe ninguna promoción y recomendacion que la de un cliente."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdmNuUFRREAE",
            "text": "First time visiting this restaurant. I think it's open 24 hours. The food I ordered was good, based only in what I ordered that was a mofongo with shrimps, it was delicious. I'll try going back during daytime to see if the quality remains…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbkkyRWZnEAE",
            "text": "When I see bad reviews of this place I can't believe it! The food is made like from home! Amazing and Delicious food! I hope that those who gave it a low review go back and give it another chance it will be worth it! These small businesses are the only businesses selling food made from the heart and not full of chemicals!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMk5MZEdREAE",
            "text": "I came in to eat with my friends and i been sitting at a table for 10minutes. I don't know how to speak Spanish and the lady looked at me like i was stupid so i looked at her like she was stupid . So i showed her in the menu and she kept…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNDVtUzhBRRAB",
            "text": "Worse \"Spanish\" food I every ate.the rice was gummy and sticky the beans were tasteless and the chicken taste like nothing at all. It sort of all taste like I went to eat at someone's house who doesn't know how to make spanish food.a slice of pizza would have been way better..what a waste of money ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrcGQ3YnFRRRAB",
            "text": "Hello hello brother and sisters...this little eatery has been here for a while and has grown in leaps and bounds when it comes to delicious Latin cuisine. If it just a simple cup of hot expresso with got bread and butter to a warm bowl of…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NlpUYnB3RRAB",
            "text": "Good food though but the price are skyrocketing despite the fact these restaurants got a lot of financial aid from the government due to Covid-19.  The staff try to be nice but they seem to be overwhelmed and \"saturated\"."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOVBXM2JBEAE",
            "text": "THIS PLACE MOVED FROM ST LAWRENCE  PLACE BY THE 6 TRAIN , MY GIRLFRIEND ,DAUGHTER AND I  LOVE THIS PLACE SO MUCH WE , WE SEARCHED FOR THE NEW SPOT BECAUSE  THE OLD LOCATION  WAS GONE AND THE LADY HERE REMEMBERED  ME BECAUSE I ATE AT THIS…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMjhpYVNBEAE",
            "text": "The chicken they were making it black you could not eat the skin. They did it yesterday good wasn't dry.  Let's see if they continue making it like that. They give a small cup of beans for alot of rice. Needs to improve this"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMUpEMEZnEAE",
            "text": "Their chicharon de pollo sin hueso was off the chain and their price was on point.  It was a bit busy though but what can you expect from a place that sells tasty food. Go check it out.  It lives up to it's name."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNX3Y3bUdnEAE",
            "text": "The food is okay but the service is the worst. They ignore you and dont care about the customers. I sat at a table and had to get up after a very long time, place the order over the counter and carried it to the table. No water, no forks, NOTHING! Servers always with attitudes and in bad mood."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpZ05xNHdnRRAB",
            "text": "Crew members are passionate about their work. Quick take out, easy in and out, they prepare your order before you get there. Clean and organized."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVaEtIcDdBRRAB",
            "text": "The food is always well prepared and flavorful, cashiers hands out good service. I loved the cleanliness and atmosphere. I highly recommend this spot."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLVA2NzdRRRAB",
            "text": "The food is great....but some of the staff needs a LOT of TRAINING in customer service.....when people from all walks of cultures come into your establishment. ..you should be WELL trained and WELL versed to be of service to them...after all you need these CUSTOMERS revenue to keep your business going!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NG83Tlh3EAE",
            "text": "So I just call today 09/05 to place an order and after given the lady at the phone my address she said we don't deliver that far, mind you this is at St. Lawrence and I live in Parkchester. By train or Bus 9 minutes by car 6 minutes and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcy12OVVnEAE",
            "text": "Chicken with rice and beans was delicious. The garlic that is included on the side was very tasty. Prices are reasonable Portions are great. Social distancing was practiced."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMVlXTF93RRAB",
            "text": "Yo sólo pedí medio pollo y tostones, la muchacha trato de hacerme pagar de más, cuando le dije que me explicará por que era tanto ella sólo dijo, \"ok sólo dame $8\" que era la cantidad que debía pagar. Yo no soy tan sensible con el dinero…"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdHZuNDF3RRAB",
            "text": "Muy Buena la comida la atenciones de \"Estrella \" muy buena."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNjRIYXJ3RRAB",
            "text": "This place offers delicious Dominican food."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbU9lSk9BEAE",
            "text": "These people are racist! My husband and I came here for dinner, we sat at the counter and waited for 10 minutes, the workers never acknowledged us or even said that they would be there shortly. A Spanish speaking person walked in and they took their order right away!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbC1IZVVBEAE",
            "text": "I will never go to this restaurant again. there chicken is bland, there rice be having corn all in it and you shouldn’t do that to yellow rice, tostones are never made correctly. Go to brisas or Caribe"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnenVTaDB3RRAB",
            "text": "Bonless fried chicken is really poorly seasoned (spanish/italian flavor combo) chicken cutlets. The beans have no flavor and they are sweet, it was a waste of my money."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZeDhtejBBRRAB",
            "text": "Good food if they have what you want. Barely ever have pork shoulder. The customer service trash but food is good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcHVXYWZ3EAE",
            "text": "The food is ok. Hospitality great. It’s burned down as well as a bunch of other stores next to it. So sad."
        }
    ],
    "reviews_count": 74
}