{
    "name": "Patricia's of Morris Park",
    "place_id": "ChIJ5aH0oPv1wokRx2wGcb1NqFE",
    "grid": "BX11",
    "address": "1082 Morris Park Ave, Bronx, NY 10461, USA",
    "rating": 4.3,
    "user_ratings_total": 374,
    "phone_number": "(718) 409-9069",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padE5HZGlkMGhDTlVSQ04wcHBXRWMzTmtSQ1dFRRAB",
            "text": "Always a great time! Food is always delicious.\nMy go to is the Spicy Rigatoni with side of their amazing meatballs. My kids love their Margherita Pizza. Drinks are also delicious and strong!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twS1NFVTRVMVYwWW5oSFdsUlFkREZtTVdsT1IzYxAB",
            "text": "I frequently eat here, so I decided to stop by the bar for a few drinks and a light dinner. The food was just as good as always, but the service was nearly nonexistent aside from Steven.\n\nAfter sitting at the bar, I had to request service from the female bartender because she never approached or acknowledged us. We stayed for about 2.5 hours (8:00 to 10:45 p.m.), and not once did she check if we needed anything. Meanwhile, Steven who was moving between the dining room and the bar was consistently attentive, professional, and clearly the only one prepared to serve.\n\nIt honestly felt like nobody cared except him. The bartender spent most of the night on her phone and barely paid attention to the roughly 12 guests at the bar unless someone flagged her down. It was one of the worst service experiences I’ve ever had at a small restaurant, which is surprising given this place’s great reputation in the neighborhood.\n\nI would’ve liked to speak with a manager, but there didn’t seem to be one present. It almost felt like the bartender relied on Steven’s work ethic to carry the entire shif"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcVdWSjVlakk0YURkbGVtdzNUMHRhUjFCaVFVRRAB",
            "text": "Spent almost $100 for crappy pizza to be delivered. It was cold and disgusting, quite a divergent from the Patricia’s of old. Definitely not ordering again."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLT1J5OWpOeHNqc1dREAE",
            "text": "New delivery driver is going to tank them, and the manager acts like a thug. He is devoid of real service recovery. instead of trying to see what the issue is he defensive and thinks hes a gangster. Sad, I loved this place and ordered for years. The manager and new delivery will def keep the reviews low."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMVowOHlSM05VVVhSb05YSm9aaTFPWkVsRmFWRRAB",
            "text": "Great food! Nice cozy place!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOUozaTd3RRAB",
            "text": "Wonderful atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUFJYbG9kbk5ETTNaQ05ISjJXVTFzTTJOVldVRRAB",
            "text": "Service is always amazing and they have the best cocktails. Also, food is cooked to perfection and never misses."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c1FsTlFWSFZuTlZKdGRXOWFjSGszVlVWU1drRRAB",
            "text": "Absolutely the most unprofessional delivery service. My order specified to drop off at my door AND they agreed. The delivery driver couldn’t be bothered and they still took my money and I assume the driver ate the food. Disgusting people."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU1drTkpRek5TTUZKU05rOHpWWEZRWm5sWlYyYxAB",
            "text": "Patricia’s of Morris Park is one of the best restaurants I’ve ever dined in.  Everything was perfect from the wait staff to the food.  We shared calamari as an appetizer.  My main dish was the veal parmigiana with a side of pasta.  Delicioso!  The portions are huge.  I brought home half of my entree as well as the pasta.  We had cappuccino and complimentary biscotti, which was very generous.  Our server Maria was wonderful in every way, and the atmosphere is authentically Italian.  When in the Bronx, it’s a must to patronize."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVmRsbDBUMEpVVERWdFltWkRNRWt3UmxwME1rRRAB",
            "text": "We celebrated our cousin’s birthday, and Maria graciously took care of our party of 9. Order the artichoke (the best I’ve had!) and the Frutti De Mare. They have a decent wine selection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka1RrZFRia2hLZEdsMGNHUTRiMDgyVHpCRGNIYxAB",
            "text": "Just ordered delivery more than one hour ago and have not received my order. I called the restaurant and the woman who answered the phone stated she would find out the status of my order and hung up the phone on me. I tried calling again and was put on hold. Called again a few more times and the restaurant is not even answering the phone. Never again. I have ordered other times and have had the same exact issue. They take too long to deliver an order and when you call, whoever answers is always rude. I will no longer visit or make an online order from this restaurant since ordering is just a hindrance and waste of money—you only get terrible customer service and cold food.\n\nUpdate: I was able to get ahold of the restaurant. They told me the driver was on the way and had four orders before me. I told her it was unacceptable since it has been almost an hour and a half. After waiting almost two hours, I see the DoorDash app stating my order was complete. Suffice to say the food never arrived. I received no phone call from the driver or the restaurant and the order was not cancelled as per DoorDash. They simply did not deliver the food. I hope the owner cares enough to read this and know they lost approximately 15-16 customers with this move."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc1RITjFiM0pGV21WV2VqQlNkVU41YjFVM1VHYxAB",
            "text": "Ordered a pie and was told 40 minutes. It took an hour and a half and I got cold pizza. Sad and unacceptable that it took that long. We’ve ordered from here several times and never had a problem. Disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bVltRm5hbVpOVnpWcGRuZzRWRnBUTUY5eFJuYxAB",
            "text": "Everything we had was delicious and the service was great. Don’t sleep on the lobster bisque!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSWQxYzJlVGxDVUhCMmNWWnRZMTlPZUMxTExWRRAB",
            "text": "We had the greatest time and the service was great. Maria was so nice and friendly with excellent recommendations and service. Will definitely return and try different offerings."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc2FIWk1YMTk2VG1wSlMwUkdiemxCWkdjdGRsRRAB",
            "text": "Best Pizza and atmosphere in The City!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMk1VbzFUbTlaWjA1b2RFUlpkV1pLYkRaNU9XYxAB",
            "text": "I come here frequently, but on this occasion, a few things occurred that spoiled the visit.  First, the hostess ( I believe to be an owner) tried to seat us at the entrance to the dining room and when we asked for another table she resisted saying it’s not available because it’s not clean.  When I informed her that we could wait, she seemed displeased.  But, she had the table cleared and we sat.  Then, my friend ordered a dish which she orders all the time and asked to not include an ingredient.  The dish came and included the ingredient and was missing a key ingredient.  When she discussed it with the hostess/owner,  the lie was spoken that the dish is a popular dish and does not include the ingredient that was missing.  That was lie #1.  Does she think we can’t read?  That was insulting and unnecessary.  Hopefully she will read this and understand where she went wrong.  1-we can read, 2- don’t lie to a long term customer.  Then there was a baby screaming at a large table for about 20 minutes.  The parents were looking at the toddler and laughing.  Why would you subject a dining room full of people to that.? Why, as a parent would you allow your kid to cry? We cut our meal short and we are looking for a new spot. The hostess owner defended herself passionately.  She didn’t stop talking long enough for me to explain why this was the worse dining experience. Cest la vie.  You people need to stop lying because it’s insulting.  It’s not that a mistake was made, it’s how you recover from the mistake.  My problem is not with the waiter or the kitchen it is solely with the hostess owner who was not respectful to her clients."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TFRUZFhVVWRDWm1kSU1qUXpUa2R1VTBKc1VGRRAB",
            "text": "Fantastic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1drWnNVMHBTYmpKWFEyRjBlQzFyV2pGb1FuYxAB",
            "text": "My best choice of place to meet friends. You can have good conversation without loud overpowering music. White linen table clothes and you feel that your dining is important to the servers., who behave very professionally. Good Italian fare but I'm picky as I've travelled to Italy several times. I'll have to return to try more dishes- then 5 stars!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR2JVeDRSblZVV2tsSWFHUnFhVUUzTTFOSVQwRRAB",
            "text": "Great place for intimate dates. The service and food was amazing. And the prices are very reasonable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eVVFeGhiMlp4U0VZeWRGSTFRWEYyTWpSV1VsRRAB",
            "text": "Tends to be a little noisy, but the food is excellent!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UlVEWldUakIxVW10TVVqQmhjekJRTnpGQ1MzYxAB",
            "text": "I must say everyone always talks highly of this place and  This is my third time eating from this establishment and I have  never been impressed. I'm finally writing a review. Today we ordered delivery first the food took over a hour to come when it was finally delivered what a disappointment the food of course was cold . We got Manicotti, Alfredo and mozzarella sticks and this food is made with absolutely no love dry barely any sauce . I can spend half the price  and get way better food elsewhere. I will never eat from this place again. I miss Tosca on Throggs Neck."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMFdVSlNiVTlmYmxaRGMxRnZPVzh0VjBJMWEzYxAB",
            "text": "The best Pasta in the Bronx hands down Patricia’s never never misses we love it, great customer service the food exceptional great atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bVRscEZTMjlNWjNOaFgwNVdiMnBDY2tSUlkzYxAB",
            "text": "La Gardenia Pizza is superb at Patricia's"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVzlxNldyNW9hWkVnEAE",
            "text": "I love the eggplant parm here!! The ravioli montavi salmon brocolli rabe spicy rigatoni all are delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWGRVaGpNVkZtWm14MFJreEVNSGRvT0doSlFtYxAB",
            "text": "best italian restaurant in ny n nyc period!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNmFEQXpjMk0xWTJOeVNqQnVTV0Z0TkZwaWNYYxAB",
            "text": "I love it here. It's so nice and quiet, dimmed lighting, great service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVFWQlhUV1J0TjFGYVVuUkphVE00U1ZSb1lrRRAB",
            "text": "Food is incredible. I always get their cacio y pepe and chicken parm!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVFZsQkxSSHBPZDBGc1VteGhVbXRUVkVSMVNrRRAB",
            "text": "10/10 for food, service, and ambiance. All the food is great and the pizza is the best I’ve ever had. The owner and staff are attentive and you really feel like family here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cVlVNVNjRzB3Ym1kamIwTnNaRU5LWlc1aVpHYxAB",
            "text": "Been coming here for years and i have finally decided to leave a review for over 10 years ive been coming here. The food is absolutely amazing. The menu changes every 3 to 4 days chefs specials are incredible.\n\nThe food does not change they might switch it up from time to time but the flavor is always there and the service incredible.\n\nMy wife and i go weekly and plan to always support this place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSWREUlZSWGRSU21sT1JsaE5RWFJuYmt3M1ZsRRAB",
            "text": "The black spaghetti is so decadent. My husband had the lamb chops with string beans. The food never disappoints and the service is top-notch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR1dYVnVTRVYxUzNneE1WaFdRMlpwWkhsWVZHYxAB",
            "text": "We recently dined at Patricia’s (1082 Morris Park, Bronx, NY) and were really looking forward to enjoying a nice meal with our 7-year-old son. Unfortunately, our experience was disappointing due to the lack of consideration around the…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRWNYWk1SRjlqVUZnMk4yUk9hazh5UlZGcU1YYxAB",
            "text": "Everything is great here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRWJVazNYM2RMYTFFdFlrNHllWFp0Y3psV04zYxAB",
            "text": "The food is great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMWJrWm5UMU4yWTJneVdIRllUVXBXYjFJNWQzYxAB",
            "text": "We was told they couldn't serv us"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMmFrVkNWbEkyWDNCNFlra3dWMk5RU1ROMWEwRRAB",
            "text": "Memorable"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHp0YWFrNnQ3THdBRRAB",
            "text": "Best Italian food my wife and I have had !!! High recommended, from the Margherita pizza to the spicy rigatoni or the penne vodka. This place has never disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQldXcEVhRU5YWjNwc1FYZHZVR2huUW5OSVUzYxAB",
            "text": "I grew up on Morris Park. No one in my family is left there but we still go to Patricia's because of how good it is!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJcWZ4YkM2djc3VGx3RRAB",
            "text": "Visited Patricia’s last night, June 9 for dinner and while the food was as delicious as always, the customer service has noticeably declined. The hostess didn’t greet us, smile, or say a word—just dropped the menus on the table in a disinterested and borderline aggressive way. As someone who used to work in customer service, I was disappointed to see how cold and unwelcoming the staff felt overall. Our male server also lacked warmth and professionalism, choosing to leave water bottles on the table instead of filling our glasses, which made the table look messy. It’s frustrating because Patricia’s is such a great restaurant and hidden gem, but some employees make it hard to enjoy the full experience. There’s usually an Italian waitress who brings so much energy and care to her service, but unfortunately, she wasn’t working that night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFMySnlTaTA1TFZkdE9HZDNZVXhxZW1Jd1FtYxAB",
            "text": "Food ,service provided was excellent, the price was reasonable"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLT0h0WUtYaU9IS3RBRRAB",
            "text": "Prices have taken a big jump!.. The top notch service has slipped a bit as well as the quality of the food...\nHopefully they will get back on track.. Patricia's was definitely a neighborhood favorite  for yrs."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPLW43SmI3dmI2bUZnEAE",
            "text": "Burger was burnt on one side and tasted like burned manure, and had American cheese instead of cheddar.\n\nWaiter argued with me and refused to fix the errors. Would not even look at the burger. Said it was not possible to cook a burger on the grill without blackening it, which was not even the problem. Insisted the slices of Kraft American cheese on my burger were cheddar and said some ridiculous garbage about cooking burgers for 30 years. Learn how to cook a burger and what cheddar cheese is.\n\nAlso gets extremely loud and they will not turn down music, cannot hear other people at the table sometimes even when they are yelling."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS3R2cTZvbm9yS2tnRRAB",
            "text": "I LOVE THE FOOD HERE I GOT THE PENNE A VODKA WIT CHICKEN AND IT WAS VERY FLAVORFUL! I ALSO HAD A STRAWBERRY MOJITO AND WAS TOSSED WITH TWO DRINKS! haha! IT was Definiely a really good place to sit eat and talk! MY date also enjoyed the food and drinks! Was a plus plus!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaTd0NG1yeXVYWkRREAE",
            "text": "I love this restaurant, food was excellent, umm the only part will do an small observation is how plates/food are present it, notice some of them are missing that important part, make them more appealing. -Top Noch banana bread pudding, OMG full of flavor but at the same time having the right touch of sweetness without being overpowering. -Thank you for great time and excellent service."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQZkt4N3J5b3ZENGdBRRAB",
            "text": "THE TASTE OF THE FOOD IS GOOD, BUT IT IS A HAPPY MEAL SIZE, YOU WON'T BE TAKING ANYTHING HOME UNLESS YOU DONT LIKE IT. I DONT EAT A LOT, BUT THE FOOD ARE SMALL PORTIONS.\nWHAT IS FALSE IS REMOVING MY OPINION, IT WAS AT MORRIS PARK, THE RED SNAPPER DISH. DONT ASK PEOPLE TO REMOVE THEIR OPINION."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQX0w3XzdxcTd2eUVBEAE",
            "text": "For what it was worth, the food was good. It was not the BEST I have had in Morris Park. But it was also good quality. The biggest issue was the service. The waiter checked on our table a total of 2 times. Did not even take our order as that was done by someone else. Our table also didn’t even have utensils. A mildly disappointing experience overall."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMm8tWWZqLWVMak9BEAE",
            "text": "Great spot very welcoming and food is top tier"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTZMRUVREAE",
            "text": "The staff here is blatantly disrespectful, two faced and mean to their customers.\n\nI was out to dinner with my family and they assumed that we don’t speak Spanish and the ENTIRE STAFF blatantly was making fun of me for the way I look and the specials I ordered. They were making fun of us TO OUR FACES as they serve us. What the hell?\n\nI’m disappointed because I’m always polite and have a nice time here. But I suppose their customers are not important to them, and we’re just a joke.\n\nThat’s the last time we’re eating here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLVlPcmx3RRAB",
            "text": "I would say Chicken Francesa at Patricia is so far #1 in the Bronx. I’ve been to Antonio’s, Giovanni’s, Carlos in Yonker, Rory and heritage. This is my opinion. But if you know any restaurants with the best chicken Francesa let me know. During dinner time. It can get busy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbEpqSU13EAE",
            "text": "Don’t mean to be a tough critic but just not at all impressed with the food here.  I’ve tried a few times from pasta to pizza but nothing on the menu hits unfortunately.  Despite this, still a very busy and active place.  Food looks a little better than it tastes.  Also very tight dining area.  Both wine glasses I had were somewhat dirty. Very limited street parking."
        },
        {
            "date": "6달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc19uT1hREAE",
            "text": "氣氛很不錯的義大利餐廳，餐點選擇很豐富。我們兩個人用餐點了兩份開胃菜和一份披薩，食物都很美味也吃得飽。各種聚餐或約會都蠻適合的。"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c2RfQ2tnRRAB",
            "text": "This place is super family friendly. The service is amazing and the food is beyond amazing. Always love coming to this spot in the Bronx. You guys rock 🤘🏽. Keep up the good work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieHBmYnl3RRAB",
            "text": "I am writing to express my disappointment with my recent order. As a regular customer who has always enjoyed bringing clients to your establishment, I was looking forward to another great experience. Unfortunately, this time I was left very disappointed.\nI expected better. This was my first time ordering delivery, and it was a disaster.\n\nAfter waiting for 1 hour and 15 minutes, I received a cold pizza and a cold croquette. When I asked the delivery driver to take the cold order back, I was told to call the restaurant. Upon calling, I was informed that a new pizza would be made, but it would take another thirty minutes.\n\nThe interaction over the phone further solidified my decision to no longer patronize this establishment. I will be sharing my negative experience with others and no longer believe the hype surrounding this restaurant. It is evident that many of the positive reviews are likely written by family and friends.\n\nAdditionally, I would appreciate it if management could review the quality and condition of both the first pizza and the second pizza delivered. This might help in understanding the issues and improving the service for future customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6emVfbkNREAE",
            "text": "Tonight I dined at Patricia’s for the 2nd time and I’m never disappointed. The owners/managers greeted me and my party immediately, got us a high chair for my 1 year old.\n\nThe food was amazing and the portions are very good!\n\nThe dessert was fantastic!\n\nOur server (forgot his name but he had cornrows) was very friendly and prompt.\n\n10/10!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OGJEMEdBEAE",
            "text": "I decided to come and have some corn beef and cabbage on St. Patrick’s day. You would think since it’s only offered twice in the whole year that they would make it good for $38 but this was definitely not the case. The corn beef was overcooked and dried like if it was from yesterday, cabbage had no seasoning or flavor, and the brussels sprouts were so hard and undercooked. They were too chewy to eat. I told the waitress that the food wasn’t good. She took it to the back never came back out never said anything.\n\nThe only reason why I’m giving them three stars is because my hubby said his food was good even though I still thought it was bland, for being in a restaurant that was empty. When we went there was only  two tables, the staff was sitting in the corner, laughing making jokes unattended, we had to ask For stuff, including the bill while he was sitting there joking around.  Don’t think I’ll be going there anytime soon\n\nTake a look at the picture look at the outside of that corn beef. The color of it alone should tell you that it was overcooked and it was hard. How dare you bring that to Customer and not exchange it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMk9Ma1FREAE",
            "text": "Absolutely love Patricia’s - I frequented in the past and revisited recently and saw they added great specials. Pictured are the Patricia Salad, Black Truffle Fried Burrata, Spicy Rigatoni, Ahi Tuna and Four Cheese mini pizza. Everything was excellent. We paired our food with a house white wine that was offered and had great service from Bella who was super friendly and attentive. Get your reservations to try Patricia’s when in Morris Park. You won’t be disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajRpMEV3EAE",
            "text": "Absolutely delicious food. We had the grilled octopus, calamari, prosciutto pizza, pork chop milenese, and a couple different pasta dishes. Everything was really good. For dessert we tried the affogato, zeppoles, and Nutella pizza. No complaints from the table.\n\nWe were there around 2 for a late birthday lunch. Baby friendly atmosphere and great service. Would definitely return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaXZDVnBBRRAB",
            "text": "Great options for vegans.\nFriendly staff.\nHelped me locate my lost locket.\nFood tasty. Good portions.\nSimple and authentic interior design"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWXy1HNUtnEAE",
            "text": "Came here for lunch on a rainy day. The ambiance was beautiful and our waiter was very kind as well as helpful. I wanted to get a lunch size of a dinner portion of my favorite dish: spicy rigatoni. He was able to put it in and no problem and it was the perfect size. Food was delicious as always!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXA2TGdBRRAB",
            "text": "I've been going to Patricia's since 1999.\nExcellent food and service. The toasted almond cake is a must!\nGiacomo is the best and always makes our dining experience exceptional.\nHighly recommend !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6anJ5aGhBRRAB",
            "text": "It was my first time here with my family. The waitress was very friendly, polite, and very attentive. Love her♡\nThe food was amazing!! I can't wait to go again. Yo the waitress...Thank you for making my daughters graduation lunch special!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd29MX0t3EAE",
            "text": "Made reservation beforehand only to come and wait for an hour before getting a table. Servers did their best to apologize and service was great. Food, especially the fish entrees could be more flavorful."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1d2I2VTZnRRAB",
            "text": "What an exquisite dining experience. From the moment we walked in the door, the service was superb. Everyone we encountered was top-notch. The ambiance was ideal. And the food was so yummy. I highly recommend Patricia's."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbzRXdHdnRRAB",
            "text": "I  visited Patricia’s in Morris park and it was truly an exceptional experience! From the moment I walked in, the atmosphere was warm and welcoming, with beautiful Italian decor that set the perfect mood.\n\nThe highlight of my evening was the incredible hospitality. The staff went above and beyond by surprising me with a complimentary lychee martini, which was absolutely delicious and added a unique twist to my meal.\n\nFor dessert, they treated me to something on the house, and it was divine! The flavors were rich and authentic, and it really capped off a perfect night.\n\nIf you’re looking for authentic Italian cuisine paired with exceptional service and unexpected delights, I highly recommend patricia’s in Morris park.\nI’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2VXd0ZREAE",
            "text": "This place? Fancy. The waiters were persistent in refilling our waters and asking us what we would need. Very nice. I accidentally said order a well done ny strip steak and i thought it would be dry and bland. THESE GUYS MADE A WELL DONE WORK. Very nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNjVLb25nRRAB",
            "text": "These place has an amazing ambiance. Food is excellent. The host Giacamo makes you feel like you’re eating in a real old school cucinna. Great wine selections amazing desserts and the service was impeccable I fully recommend this place. You will enjoy the total experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMEwtQXZBRRAB",
            "text": "Amazing! The staff , the music was perfect & diverse. As a African American its hard to find restaurants that plays music dedicated to everyone. Normally i always hear latin music which isn’t a problem, the problem is thats all they play. This place plays American music & latin 10/10. My food was 10/10 , very classy environment at that ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOWVlYm9nRRAB",
            "text": "The food is always great every time I go. The restaurant is always busy as well.Nice restaurant and friendly staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLXNpQ0tREAE",
            "text": "I had ordered pick-up from this place before and had a great experience, so I decided to dine in. Unfortunately, it turned into a less than pleasant experience. The waiters were overly attentive, coming up to our table about four times asking if we wanted to order a drink, which started to feel a bit much. While I understand wanting to check in, it felt like they were constantly hovering over us.\n\nTo make matters worse, I got the wrong order because the waiter was rushing and after dining for around 45 minutes not even an hour, we were unexpectedly asked to leave because they needed the table for other customers. The whole situation felt rushed and disrespectful. I had high hopes for dining in here, but I don’t think I’ll be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcHBXNTdBRRAB",
            "text": "Well,  I have been here before but today they truly showed why this place is exceptional in every possible way.  My wife got the following delivered as a surprise for Valentine’s Day.  The folks at this great establishment were so kind to make this happen,  and I’m forever grateful!  Thank you Patricia’s"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmFqU0R3EAE",
            "text": "I am writing to express my dissatisfaction with the experience I had at your restaurant. While I generally enjoy dining out, my recent visit was far from enjoyable due to the pressure I felt throughout the meal.\nFirst, I noticed that the staff was encouraging us to finish our meal quickly, which created a very uncomfortable dining experience. The sense of urgency was not only unnecessary but also made it difficult to relax and enjoy our meal at a reasonable pace.\nIn addition, I was approached with offers for additional beverages every five minutes, which became increasingly intrusive. While I understand the goal of upselling, this felt excessive and left little room for us to enjoy our time at the table without constant interruptions.\nAs a paying customer, I expect a more relaxed and enjoyable dining experience, where the staff allows us to eat at our own pace and without being constantly pushed to make additional purchases.\nI hope you will take this feedback into consideration and review the service approach to ensure that other customers are not subjected to the same discomfort."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNGJQRERREAE",
            "text": "We hadn't been here in a while. And it was delicious, we laughed because 3 grown men from high school looked like we were on a date lol lol...great neighborhood restaurant"
        }
    ],
    "reviews_count": 71
}