{
    "name": "A Daughter And Two Sons",
    "place_id": "ChIJjVCGyH71wokR2giYBDuPP6E",
    "grid": "BX11",
    "address": "1807 Archer St, Bronx, NY 10460, USA",
    "rating": 4.7,
    "user_ratings_total": 26,
    "phone_number": "(929) 285-3425",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMFNXWXhNRGswWWtseE0waGhMVFZWVGxGVGQxRRAB",
            "text": "Hands down best soul food spot in the Bronx, better then Cooklyn eats better then Seafood Soul & Tingz. I really hope that ya cook with this quality for everyone because people deserve to experience good quality food like I did here at this restaurant!! I got the fried shrimp 10/10 I got the fried chicken 10/10 Mac and cheese 10/10 yams 10/10. Without opening the food you can smell the richness and authenticity. Please keep up the good work. I will be coming back ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d2RuRnROMjQ1TkRaS016VmxkMnREZUdZNGNrRRAB",
            "text": "Okay so the amazing reviews brought me here and they are not lying!!!! The Mac and cheese: phenomenal and well seasoned….the candied yams: omgggg the perfect balance of sweetness not overpowering as with other places…the shrimp/whiting: seasoned to perfection…the cornbread: melts in your mouth so buttery and amazing (comes with the meal free of charge)…and the customer service matches the food!!!! This place is truly amazing and I highly recommend!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRVV5MTJTSEpuV1hVMGVXZFVibGR2VVMxRVFXYxAB",
            "text": "I just discovered this spot today, and let me tell you, I walked in thinking, alright, it looks good, but does it taste good? Well… the answer is YES. Yes, it does! First up, the fried whiteys. Crispy, fresh, seasoned just right — I almost had to look around and make sure my momma, grandma wasn’t in the kitchen. Then came the collard greens. Now, listen… not everybody knows how to make collards. Some cook them without flavor  and put a lot of sugar. But THESE? These tasted like real-deal, Southern, know-what-you’re-doing collards. Then came the mac and cheese, and Lord have mercy. I took one bite and suddenly I was stomping my feet and doing the hallelujah dance right in the kitchen. It brought me straight back to my late mother’s food, specifically her MAC & CHEESE. It was rich, creamy, and cheesy to perfection. The candy yams were sweet buttery happiness in every bite. By the time I finished, I had already sent pictures to my family telling them, “Y’all need to try them out.” Annette and Arthur — y’all know EXACTLY what you’re doing in that kitchen. Honestly, if I could hire you both and tie y’all up in my kitchen to cook for me every day, I would! Next week, I’m coming back for the potato salad and banana pudding, because if they’re anything like what I had today… whew, I might not leave. This place brought me nothing but happiness, happiness, happiness. Y’all must check them out! They’re the TRUTH!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNFRsY3pPRXhmWm1sWk0xQk5NbEJEVlY5blZFRRAB",
            "text": "We are truly impressed with the food, quality and presentation on the food. Corn bread outstanding! Mac and cheese nice, cheesey and candied yams just cooked with perfection. We will definitely be back! Thank you for your delicious food! Has to be one of the best!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVE5WaDJURlkwZGtWVVEyNURNR1V5ZUZsaU1tYxAB",
            "text": "A1 everything I promise u won’t be regret it is a hole in the wall gem Idk how else to put it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFlUaGZSRXRhT1RKWGJteHZNbkpQVW1kTU5IYxAB",
            "text": "Just discovered this place in my neighborhood and the food was worth the 20 min walk from and to home. The fried fish was fresh and crispy. The mac n' cheese was cheesy and seasoned well. The cornbread was perfectly moist and sweet. I also got plenty of sauce packets without needing to ask for extra. Would definitely try again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVlkwMWtiMmRQZFhOMUxVaFZZazlpT1dKRGJGRRAB",
            "text": "I walked into this place randomly and I was pleasantly surprised! The gentleman that was there when I arrived was very pleasant which is always nice when you're trying food at a new establishment. I ordered shrimp, (which was fried at the time of my order so FRESH), with the candied yams and corn bread. The shrimp was delicious, so much so my son stole my plate lol. The cornbread was the best I've ever had. It was moist, flavorful and all the right things. Now the yams! OMG I love these so much. They give holiday, big loud family gathering vibes! I will definitely be coming again soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneFFUUjFiWGx1ZUd3elVVUjZNMVJhVEVoSGJXYxAB",
            "text": "This was my first time ordering through a food delivery app, and when I tell you it did not disappoint—this place is a hidden gem! I don’t know why I’m just discovering it. I got the chicken dinner with two sides, and the chicken was fried to perfection—crispy, fresh, and flavorful.\n\nSomeone even called me to let me know one of my sides was out of stock and offered a replacement. Super professional service.\n\nBy far the greatest soul food I’ve had in the Bronx. 10/10—I highly recommend this place and definitely want to try it in person next time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV1p4YXVoNHZHRmZ3EAE",
            "text": "This place is a hidden gem the food was amazing and really good quality I loved it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT3RnOEM1MGNLeGN3EAE",
            "text": "BEST SOUL FOOD IN DA BRONX !!! I LOVE THEY MAC AND YAMS AND FRIED CHICKEN ! AND THAT CORNBREAD ? DUMB GOOD"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNzVuM2N3EAE",
            "text": "I love everything that they have!!!!! Hands down seriously amazing food ❤️❤️❤️❤️💯💫💫💫💫…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMi03QWRREAE",
            "text": "I ordered food to contribute  a “Friendsgiving” I attended, the potato salad was my favorite, the Mac&cheese was cheesy and flavorful, the cornbread was moist and tasty too, the other guests enjoyed the taste as well. I wouldn’t hesitate to order again when I’m ever invited to another gathering. I appreciated her professionalism and great communication. I strongly recommend her should you need great food for your party/event."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ2JDY3VnRRAB",
            "text": "Absolutely phenomenal! Every dish on the menu is a delight, bursting with rich flavors and perfectly cooked. The atmosphere was warm and welcoming, making the experience even more enjoyable. I highly recommend this soul food restaurant for anyone craving authentic and delicious meals. The prices are great, and the owner is friendly and amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMklmQTdRRRAB",
            "text": "Hands down the best cornbread I’ve ever tasted and I’ve had plenty! The fried shrimp was also on point and my potato salad was good. I’ll be back to purchase the other items on the menu in the very near future! And black owned…..say less and show some support!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbHU3d1BREAE",
            "text": "The food is amazing and, the owners are very friendly. I recommend to try everything from their menu!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEN0staWZREAE",
            "text": "I Want To Personally Thank This Establishment For Catering My Mother's Palm Day Dinner On 3/23/24 In Brooklyn & My Niece For Recommending Them. Everything Was Fresh & Enjoyable, Especially Those Collard Greens!!! I Will Be Visiting Soon As I Hear Nothing But Good Vibes!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0X2YtajZ3RRAB",
            "text": "My Aunt had a Palm Sunday/85th Birthday dinner on 03/23/2024- so of course I had them cater!! I ordered full pans of Collard Greens, Potato Salad & Fried Whiting…. Baybeeee my family lost it! This event was in Brooklyn. The food was fresh as always, pans were full, customer service was immaculate. They called the morning of to verify and go over everything to make sure no details were left out!\nI couldn’t even get pictures bc the food was gone and take home plates! Thank you A Daughter And Two Sons- much appreciated!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bklmTXV3RRAB",
            "text": "I was looking for a new spot to get soul food from in the Bronx and stumbled across this location. Never heard of them before so I went to give them a try since I love soul food. Really just wanted to try a few things so I only got sides to be safe. I got mac n cheese, candy yams, and collard greens. All three were top tier and absolutely delicious. The mac n cheese was cheesy and flavorful. The collard greens were seasoned very well. The candy yams were sweet and addictive. And to top it all off, the lady handling the transaction was super nice with such professionalism and respect. You can just tell she has a good heart. It’s a very small location though so you might miss it if you’re not actively looking for it. But when you find it, you just found yourself a gold mine. And I’m speaking with this much confidence from the side dishes alone. I’ll definitely be going back more frequently. Think I found a new spot :-)\n\nSide note: This is the first review I’ve ever done, and I did it because the lady was so nice and the food was genuinely delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxLU02emdnRRAB",
            "text": "Never been to the location, but have had the delivery service and had the catering services. Excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGVLQ0RBEAE",
            "text": "This is the best soul food in the Bronx. A must try... I highly recommend the fried chicken, baked Mac & cheese, candied yams. The half & half was on point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGNLUlZBEAE",
            "text": "Food was fresh and flavorful. Enjoyed the fried chicken."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eU16eHFBRRAB",
            "text": "I love trying food from local businesses. I ordered from Doordash twice from this restaurant. Both times, the food was horrible. The oil on the chicken, shrimp and the fish was dripping. It was so greasy. I had to throw my food away because of the grease. The potato salad was drenched in mayo and mustard. I will not be ordering again. Waste of money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeHFxSkd3EAE",
            "text": "Thank you so much for bringing us such great food into the neighborhood. We love you to stay forever food and service was amazing !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabVBYa0dBEAE",
            "text": "Great people."
        }
    ],
    "reviews_count": 24
}