{
    "name": "Tasty Choice Shawarma",
    "place_id": "ChIJS8RiCaL1wokRGlmNErWV1lI",
    "grid": "BX11",
    "address": "704 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4.5,
    "user_ratings_total": 484,
    "phone_number": "(845) 395-3396",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VVVXOVBNWEkyT0dkWFQwaERaSEZpTUdnelUwRRAB",
            "text": "Had the most amazing steak sub and mini shawarma here. The steak was so tender and juicy and the shawarma was very crispy and flavorful. The chef Q made makes the best food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMmJHSnRWMVIxZWs4NFRtTm9aMmhYZVZKQmIwRRAB",
            "text": "The Food was Good But the Staff was not friendly I just Go over there today the cashier girl was Sooo Rude and unhappy I don’t like to come again.Because I don’t like that kind of behavior"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMlEzZE5TVkZWY1ZSRlVsQnFRVTVGVG5wcFduYxAB",
            "text": "It’s kind of pricey… WITH GOOD REASON! Their food is well seasoned, extremely flavorful and comes with generous portions. Their menu is customizable and they have a wide variety of options to choose from. If you can place your order ahead of time, that will cut the wait time in store."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeU1WRnBiRTFYY1VSc1pqbEhWMEZNUW1rNVJIYxAB",
            "text": "## 🌟 Combo Shawarma Review\n\"I just had the best combo chicken and beef shawarma experience! 😋 The chicken was tender and juicy, while the beef was rich and flavorful. The shawarma was loaded with crunchy veggies and topped with a dollop of creamy tahini sauce.\n\nBut what really made the experience stand out was the *EXCELLENT* service! 🙌 The staff were friendly, attentive, and made sure I had everything I needed.\n\n*Rating:* 5/5 stars\n\n*Favorite part:* The combo of flavors and the top-notch service! 👌\n\n*Would I order again:* Absolutely! 😊\n\n*Recommendation:* Try the combo and don't hesitate to ask for extra tahini sauce 😉\""
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMmFYQnZXVkp0TWxaR2FFTlRVRmRmVUhOTWIzYxAB",
            "text": "I enjoyed the chicken kebab platter that was served with rice and different veggie options. The flavors were fresh and well-balanced, and a generous portion size. It’s enough to share amongst two people. The staff member who helped me was warm and welcoming, even recommended this dish to me. This was my second visit, and I look forward to many more!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOYVgxSnFjV3AxVmxWdFVtZEZZVW8zUW1WQ1pWRRAB",
            "text": "Food was great and the service was amazing this is the best place for premium sharwama or halal chicken over rice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UGJVSTRXRVZWYUZaRmNYZDBVM2haVFd4SlFsRRAB",
            "text": "Food is great"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMVNGUTVkMHBzT0ZkRFQxSmFRV2xNTFZneE0zYxAB",
            "text": "Edited 9/4/2025 bringing down the ratings due to lack of consistency in food prep, and slow customer service. I was excited to bring food to my wife who is in the hospital. In four days this place deceased in food quality. My shwarma ended up with burnt meat. I asked for the manager to call me to speak about this. Unfortunately I haven’t received one.\n\nTasty Choice on Morris Park is an absolute gem in the neighborhood! The food is always fresh, flavorful, and made with care. You can really taste the quality in every bite. The portions are generous, and the menu has something for everyone—whether you’re in the mood for something quick or a full meal.\n\nThe staff here are friendly, welcoming, and attentive, which makes the experience even better. Service is quick, and you always feel like a valued customer. The atmosphere is clean and comfortable, making it a great spot to grab a bite with friends or family.\n\nI definitely recommend Tasty Choice to anyone looking for delicious food and excellent service in Morris Park. It’s become one of my go-to spots!\n\n*Ask for that green sauceeeeeee*"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRmREVklTM0ZsWlVWdVluZFRVVEJUTUdWUFpHYxAB",
            "text": "Thank you so much for the great shawarma wrap and the great customer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRVdtaG5jMkl6VDJsck1YaFdkRGR5TVZKbWVVRRAB",
            "text": "Great fresh food and great service. Will definitely be back soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WM0xYTnZMVkZPZEZZMWMwUklXaTFFUW5GclJtYxAB",
            "text": "Get ready for some great food. I had a steak sub. Couldn’t finish it all. This place is ON POINT. Food was nothing short of amazing. 20 out of 10. Will definitely be back when I’m in the area. Had to save it in my favorites. Smooches."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVmRHWm9RM0JCYUdsamNVd3RjVGM0UzAwemVWRRAB",
            "text": "This is the third time and their chicken is raw 🤮…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVIxRm5VVWhuYVVaRlIybG1WV1J3VkVjeFNrRRAB",
            "text": "I also love their 10 second game."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbFUyUmpiMHhHTUdZMVNtMUZibkpGZUV4Uk5IYxAB",
            "text": "Beautiful place, Food taste and great costumer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNWFVUnVVV1EyVjJwV1VrWjVObmRDZEd0aWFHYxAB",
            "text": "Love the food. Friendly service. Needs to do something about the AC unit & the FLIES!"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd1VFTlJjamx1U1cxS2RISndTVVJ1Wm5Ka1VtYxAB",
            "text": "Ces sont le plus nul des restaurants"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RVlVWjZXRzlPTVcxQ1RISnVSMkpoVEVwb1dHYxAB",
            "text": "Love this place..always get the same great food. Not like others one day it's good and the next not so good 🤷‍♂️. Good for dining in or take out..⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUVYyMUJUMXB6TjJkaE1VSmpWVVZMV1ZKcVVuYxAB",
            "text": "Food is really good and fresh but this the second time I've been there and the host messed up my order..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xemFYWTVaemgwTURJeGVERjBNR3BSYmw5RmEzYxAB",
            "text": "Food is to die for, one of the best chicken quesadillas I've ever had was from here. Hummus is good too, but the spicy hummus is gross.\n\nSometimes the workers can be rude/shady, I don't appreciate that. However the food really does make up for everything. Even as a picky eater."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSGFrNXFSazQyUTFSalIzSTBSRkkxVHpoWlMxRRAB",
            "text": "Amazing!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURvc2NaMBAB",
            "text": "Service was great, the staff is friendly. Falafel pita was very good and affordable. I would come back!\n\nUpdate: I was craving samosas and figured this would be the place to go. No regrets! I got the veggie ones and they were great. Not overly spicy and generous filling. The filling had a mashed potatoes texture which I loved."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQk1EZENNMkZFU1VWNFFuUTFlVXhaWTJ4T1FuYxAB",
            "text": "I love this Arab Local Food Place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocE5HdHpXV2s1T1dNMlpGVlpPR2s1YWxKVlRsRRAB",
            "text": "There is a kid in there who messes with people orders intentionally  very bad for business! He brought us raw meat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM1EwSm1kVU5rTTFCTmMzTmtObEU0ZDBsdVFVRRAB",
            "text": "The food is absolutely Amazing!!!! Friendly staff, warm and inviting atmosphere!!! Highly recommended!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS1IyTXlVbXRTWWxKNVoySkdOakJpY0c5eU9VRRAB",
            "text": "Great love it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNGNqTjNkRkZUYVVWdGExUllPVGx1VW1wUGEzYxAB",
            "text": "Best chicken over rice!! And the service is always excellent Super clean, I definitely recommend Tasty Choice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSFV1TVRTLVBIVmVBEAE",
            "text": "Stopped here to have some lunch & was pleasantly surprised since this was my first time there. The food was quickly prepared, delicious & super fresh. The staff, especially Mohamed- was extremely friendly & accommodating. He patiently answered our questions regarding the different options on the menu & suggested other items we could try next time we were in the neighborhood. I highly recommend this eatery."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcjhncGUxa2FyU1FREAE",
            "text": "First time in New York City came from the UK try the spot based on the rating and let me say it’s worth the money"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vME1VZEhNMlpFY1hORlJqVXpTRGxYVVU5WE5GRRAB",
            "text": "Great food.  Will definitely come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMcTNtcGozNW9TYkxBEAE",
            "text": "Beef meat to chewy not good quality meat for sure!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdWkxOG1hMHN1UHB3RRAB",
            "text": "Food was amazing! And the service was just as great. Will definitely be coming back when in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJbXJxX245c05LVU1BEAE",
            "text": "Not tasty at all bad customer service and they over charge me 20 bucks for shawarma plate worst experience so far i highly not recommending this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOUDR4dlg4aHIyMUNREAE",
            "text": "I love rice Platters, but this place don't have or make them. White sauce taste like cheap ranch dressing, the chicken is bad and small portion. The rice and salad was OK"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM2E2SVhWazd6MlBBEAE",
            "text": "Today bought 2 Sandwiches tasty so good and delicious. Thank you Muhammad alzendani he is good cook"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU0xrZkstNTdmTHZnRRAB",
            "text": "This is a new eatery to the area, so far so good, their sandwiches and wings are very tasty, the place is always clean."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOekh4NHlCd2FESHFRRRAB",
            "text": "Great service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcm9felJnEAE",
            "text": "Always great service from Ana"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbFpmbVBBEAE",
            "text": "Honestly best shawarma I’ve tried in the city"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMzh6ajhBRRAB",
            "text": "I ordered 2 shwarmas and 2 babaganushes. They charged me for all of it and didn't give me my 2nd shwarna. This would normally not be an issue, but I called their number to get a refund and it doesn't work, so I have to do a charge back with my bank, which is a further inconvenience for me.\n\nI get it, it's the end of the night, but I was charged for things I never recived.\n\nGo to the other restaurant across the street."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMG9fTzZ3RRAB",
            "text": "My family love this place. My daughter was in a mood for a shawarma and we all ended up getting our own plate. ☺️😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdl9mazNRRRAB",
            "text": "I had a great experience. The cashier is so nice & beautiful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeWFya1h3EAE",
            "text": "Very good food very good shawarma love Arabic food very fresh home made"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeWVLM1RREAE",
            "text": "Esta comida está muy rica está muy bueno"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaVpuZHRBRRAB",
            "text": "\"A very disappointing experience! I ordered the Mix Shawarma plate, and the food was extremely dry and not worth the price. I paid $18 for a dish with barely enough meat, weighing no more than 15 ounces, while the rice was excessive and…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcl96UkNREAE",
            "text": "Tasty Choice is a great place to eat. Since I just went to this place, I'm excited to talk about it and suggest it to other food lovers.\n\nI love eating food there when I’m hungry and need heavy food. There foods are really delicious. Mid eastern food. Dining is very clean.\n\nTasty Choice is a beautiful place to eat that serves up a lovely meal. It's a great place for a casual meal because of its warm setting, friendly service, and tasty food. Whether you want to eat quickly or take your time, Tasty Choice is sure to please your taste buds.\n\nGreat customer service. Would like to go more often."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bnVTbHNRRRAB",
            "text": "One of the only restaurants with readymade baba ganoush in the area, despite being in Little Yemen. They made a pretty good chicken shawarma as well. Staff is nice and accommodating. They have an expansive menu, so looking forward to trying their other items next time. A lot of seating is available as well. Definitely a great local spot for Arabic food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dGQ3eVpBEAE",
            "text": "This is my favorite place when it comes to getting some hot food that tastes delicious. I have been coming here since they opened back in 2021 I believe and the service here is amazing. However, the price has gone up significantly over the years which is understandable given the fact that we are living in inflated economy. But I recommend this place."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxM3JTZVJBEAE",
            "text": "If you are a picky eater n want some good clean wholesome food you want Tasty Choice. I have lived around here for about a year n tried a lot of different places near by. Their food is so fresh n  the place is immaculate. Their lamb is soft…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRazRhU2l3RRAB",
            "text": "Today was my first time in there\nOrdered shawarma sandwiches\nAnd let me tell you that the flavor is there\nBut having an inexperienced cook is the worse part of it\nLike who the heck put salad on a shawarma wrap 😭😭😭and none of the cashiers who standing there welling to ask you the simple question “what do you want on it”. For a grilled chicken sandwich i would give it 9/10\nBut please don’t disrespect the shawarma wrap and add salad to it 🤬"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycE9QVjVRRRAB",
            "text": "Really enjoyed the food. Its very fresh and clean and non greasy. Even the burger was non greasy. We got a mix platter and Korean bbq wings and a beef burger. Wish they threw in a side of hummus on the mixed platter but still it was great. Make sure to ask for extra white sauce on the side because its definitely very dry without sauce."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2MDVTMVpREAE",
            "text": "Definitely something to get to change up your week. I got the Chicken Shawarma, Chicken Shawarma Platter, Mixed Shawarma Platter, Honey BBQ Wings, and Korean Wings. Everything was good and definitely filling. Not sure what was Korean about the wings but it has a little kick which was cool. Will get again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdGFmc3RnRRAB",
            "text": "Went there for the first time today. Their food is pretty good. I had the lamb plate which was seasoned beautifully and it was very juicy and tender. Their humus was real good as well. Definitely will be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdW9QOFl3EAE",
            "text": "The food was amazing. I had a Beef Kofta, with rice, and I asked for a side order of fries. The fries was seasoned nicely. Great taste. I asked the woman at the counter if she could put the fries on top of the beef and rice, she was kind enough to do so. It was a flavor bomb for sure. I had no problems there. Great experience. 👍🏽"
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaclk2UjZ3RRAB",
            "text": "Wirklich tolles Preis/Leistungsverhältnis für NewYork.\n\nDie Möglichkeit seinen Salat selbst zusammen zu stellen finde ich sehr gut. Sehr freundlichen Personal, es geht zügig & alles ist frisch zubereitet."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN0staVVREAE",
            "text": "Fantastic Dining Experience at Tasty Choice!\n\nI recently had the pleasure of dining at Tasty Choice, located at 704 Morris Park Ave, Bronx, and I must say, it was an amazing experience! I ordered the lamb chops with rice and salad, and everything was cooked to perfection.\n\nThe lamb chops were tender, juicy, and full of flavor, with just the right amount of seasoning. The rice was fluffy and well-prepared, complementing the dish perfectly. The salad was fresh and crisp, adding a refreshing balance to the meal.\n\nBeyond the food, the atmosphere was welcoming, and the staff was friendly and attentive, ensuring a great dining experience. If you’re in the Bronx and looking for a spot with delicious food and great service, I highly recommend Tasty Choice! I’ll definitely be coming back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaE1iMnlnRRAB",
            "text": "This restaurant I think is very underrated. The food tasted good and different love that🔥👌. I got a beef falafel burger 🍔 and falafel burger sliders it comes with some extra salads too in the box. It was really good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bkp6cS1RRRAB",
            "text": "They should have focus more on on cooking they burned the chicken I ordered and also they always forget about the sauce when you ordered anything to go. I never get sauce . If they don’t give the sauce how can you eat and the chicken also burnt."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ0thTjV3RRAB",
            "text": "Me and my friend was looking for a place to  eat. We thought to give Tasty Choice a try since the reviews were good and the photos that were posted showed a clean and friendly atmosphere. Our expectations were blown out the water. The staff were very welcoming and the food they served were wide and many. The prices were very affordable and the restaurant was clean. Our lunch time outing was made to be great thanks to Tasty Choice and everything they stand for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX3VYak9nEAE",
            "text": "Been here multiple times and food is great. However, I  definitely don't agree with shady business tactic of adding random service charges without customer knowledge. Not sure what this additional 4% charge is for and when asking staff about it they blamed \"the machine\" and said its not their issue. Not an acceptable response."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NEt5MFFREAE",
            "text": "I used to come here all the time I was like a regular customer for some reason they change the girl in the front and she is extremely rude. She talks to you nasty and she’s so short with her delivery. I honestly cannot stress how dissatisfied I am with my last order my lamb chops were extremely burnt. I had two lamb chops that didn’t even have a bone. I cannot believe when I called the woman was so rude, I couldn’t even speak to the manager. She hung up the phone. I’m so disappointed and would never come here again. I have spent a lot of money with this establishment."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNWViQ2hRRRAB",
            "text": "Food is good. Service was also good. Atmosphere is good but it got a bit too smoky when we were there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbjZDeUZREAE",
            "text": "Ordered Beef Shawarma tastes so food and the sauces are just perfect. Worth the price for the serving. Will definitely come back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbmViVzlnRRAB",
            "text": "This was my first time and the food was Awesome (chefs kiss). I will definitely be coming back. The shawama wrap with lamb was so tender and you can taste it was freshly made. Even the owner came over and spoke to us and it so cool and friendly. Definitely my new spot!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ05IZjZnRRAB",
            "text": "Love this place! Been going for as long as I’ve living near by. The food never fails! Always hot and just like the name they are tasty! Not only is the food good but the staff are always great and very giving! Don’t think twice about coming here, you won’t regret it! 👍🏼"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOS1IUlZnEAE",
            "text": "Anna provides outstanding service, always ensuring a welcoming and seamless dining experience. Her attention to detail and friendly demeanor elevate every visit. On top of that, the food is absolutely fantastic—fresh, flavorful, and…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3Z5ci13RRAB",
            "text": "Such good authentic middle eastern food! So flavorful and fresh! Highly recommend!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNnNLa2pRRRAB",
            "text": "Literally one of the best places in the Bronx! I always loved coming here with family and now bringing my husband around to show him what a perfect halal wing spot this is! And on top of that the cashier is so cute and sweet! Love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX01LbFdnEAE",
            "text": "Best chicken shawarma in new york, and there customer service is great , and there special sauce is tasty 😋 😍😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNlBIYWFnEAE",
            "text": "Best combination I ever enjoyed. There rice is really good 😋😋😋 when you ordering any rice plater makesure it’s for two people Cz you can’t finish by yourself and taste awesome . Makesure try their chicken Quesadia"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ0xIVWx3RRAB",
            "text": "Best Halal spot in the bronx. Portions match pricing. Friendly staff. Food is always a hit. Try the lamb over rice platter. The salad is an actual salad with your meal. Overall, great food and great experience."
        }
    ],
    "reviews_count": 70
}