{
    "name": "Damascus Sweets",
    "place_id": "ChIJu47yK3X1wokRTarwFwf91Ys",
    "grid": "BX11",
    "address": "677 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4.8,
    "user_ratings_total": 164,
    "phone_number": "(347) 621-2791",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVgzbDBXVEpFWVVrdFYwSjNiR3hXYTFOemFYYxAB",
            "text": "First time trying. Its very good and affordable. Satisfies a sweet craving. Friendly worker."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVQweG5kMHBzZG5jMGQyZGtVazg0TW5SNWNXYxAB",
            "text": "Muy buena atención del personal, dulces exóticos para degustar."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMFZtcHJVbTkxU0Y5MmJscHhaR2haTlhKME1XYxAB",
            "text": "Everything here is really tasty and aesthetically pleasing. My only complaint is how small the bakery is, not necessarily their fault though. It's just hard to go in with family and get a look at everything."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNFJGazJWMnBFYXpOVFNtVmlWbFZoVGpsdlExRRAB",
            "text": "I visited for a late night snack and this place has some of the best kunafa I've ever had"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUVZub3RRakZqYVV4MWFrb3lkMUl4TVVsM1EzYxAB",
            "text": "I was craving knafeh so bad and decided to try this place. It was sooo delicious and the price is extremely affordable for such a large portion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQ05YSnZNV3BWYVVKWFdWTkhPRFJ6YmxWV1lsRRAB",
            "text": "Amazing knafeh and great people working there."
        },
        {
            "date": "4달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWmNWOTNZbUZMYWpsMldrcGxhbFZUZGtKaWJIYxAB",
            "text": "انه محل رائع كل اهلي يحبونه ولا نشتري للعيد والمناسبات إلا منه"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNlZEZDNVazR6UTNGTE1uWkVZWGRWWlZKNVVrRRAB",
            "text": "The guy at the counter was so nice! Will be coming back for sure"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQV3QxSVhodDdyYVV3EAE",
            "text": "Amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR2l2TF8wMC02aG9RRRAB",
            "text": "Came here to try dubai chocolate, and i can say im satisfied!! For $7 it’s so worth it, compared to other prices. The chocolate is so good and the kanafeh is even much better and juicier! Definitely will come back for more"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX1B3TlhUNTgzekRnEAE",
            "text": "I’ve had Dubai chocolate from Dubai and this bakery’s one tastes almost exactly the same. And much cheaper only 7$ for a big piece. Their knafeh is also very tasty and sweet. The workers are very friendly and provide fast service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT3F6SmlxbHRyYzZBRRAB",
            "text": "I Was in the area at 11:30pm on a Tuesday craving something sweet. There’s one or two other few dessert shops in the area but I didn’t want anything too heavy. Randomly saw this place and wandered in.\n\nWow what an assortment. The place was FILLED with a variety of fresh desserts. I never seen any of these types of desserts. I had no idea what to Get.\n\nThe guy inside saw how intimated I was and without any hesitation or prompt started offering me samples. Try this, try this. I had a handful of sample desserts within minutes. And They were very good. I had Nut layers, syrup soaks, jam filled, he kinda gave me literally everything.\nThe samples alone Definitely Solved my sweet tooth.\n\nI still went ahead and bought 2 types of cakes to have with my coffee tomorrow morning.\n\nThe two desserts I bought were Only $5. In this economy ? I don’t even think I’ve ever bought a single slice of cake in my life for less than 8$. So 2 for 5 is crazy. And they appear very fresh. I Greatly look forward to them in the morning\n\nI am so happy I wandered in, I see myself coming back . I saw that they have party trays, and I could totally see bringing something like that to the office or to event with friends it being a major hit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTlxUzhnRRAB",
            "text": "Amazing desserts"
        },
        {
            "date": "6달 전",
            "language": "ar",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOWN2Y0F3EAE",
            "text": "لابأس"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaWVfNEpREAE",
            "text": "I found out about this place thru friend he brought some of their pastries and I have to I loved it , asked the name of the place and now it’s my go to place for desserts. Must try pistachio mamoul 🖤"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2NfVVBBEAE",
            "text": "I love getting my treats here and especially my Dubai  chocolates. The service is always on point."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdTg2NDhBRRAB",
            "text": "Absolutely top-notch Baklava. All the sweets are \"eat with your eyes\" type, fantastic work! Take-out only: mamool, semolina honey slices, and kanafeh.\nThe staff is friendly, generous they gave to try baklava (which i missed taking the photo) freshly made. This is a great example of how to win a customer :) I enjoyed the baklava and the mamool. The kanafeh has cream inside, i prefer the crustier type of kanafeh. And the semolina is a good choice with tea as it has honey.\nIs what we call \"small hole in the wall\" therefore, the space is limited and not a spot to eat rather for takeout.\n\nThank you, great work!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Nl9IQkd3EAE",
            "text": "I am a chef and caterer in Westchester. I live in Queens and usually purchase levantine sweets in Queens or Brooklyn. However, I wanted something that would be closer to my work so came about this place. I wasn't sure what to expect but when I walked in I could smell the authentic scent that I know. I had a catering for about a hundred people and I'll tell you this is the absolute best leventine sweets I have had in the US. The basbousa was absolutely perfect!. The baker and probably the owner as well was very hospitable and wanted to make sure that I got the freshest product possible. Thank you so much!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z3N5RU5REAE",
            "text": "Best tasty and prices! Excellent customer services."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDhtYjlBRRAB",
            "text": "I was dying to try the sweets from this place. Finally made it here. I have to say I got a couple of pieces of baklava and they were so heavenly. Sweet, tasty slight crisp, perfection. I ate most of them and only left one to take a photo. I also got the Dubai chocolate everyone has been talking about. It was ok, the baklava was better. Will def come back to try other sweets from here ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbE1pazh3RRAB",
            "text": "I went there to get some Dubai chocolate and it was a 10/10. I made a 2nd trip and got 3more bars and a pastry i don't know what it was but it was so amazing. Highly recommended."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbHNxZmZnEAE",
            "text": "Nice"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa19hbl9BRRAB",
            "text": "Service was amazing! I tried the Dubai chocolate for the first time and it was such a treat! I also got to try a baklava sample and it was delicious. I will absolutely come back to this store for more!\n\nEdit: I came back! Still amazing :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNTdEaWJnEAE",
            "text": "The sweets here are amazing❕️My favorite is the Dubai Chocolate🍫  even though I think the $7 for the small piece is a little pricey for size & could be less but what can I say, it still tastes good. The Baklava & Baklava with nuts is also good, etc."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdGYtS0Z3EAE",
            "text": "I love this spot. My Egyptian dad loved his cake and desserts from here. They really made my dad's day so special."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMDZ2Qld3EAE",
            "text": "Baklavas get chef kiss"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNTVMOE1nEAE",
            "text": "Went in for Dubai chocolate with pistachio and kunafa.\nYoung professional man from Moraco had treats to taste.\nOmg....delighted so I got a couple of things.\nThank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc09qNUJREAE",
            "text": "Pistachio baklava and \"Dubai\" pistachio chocolate, delicious. You can really taste the quality and richness in their desserts ❤ Great prices as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcWZibV9BRRAB",
            "text": "Delicious 😋 generous and fresh"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcl9UOUlnEAE",
            "text": "The Milk pudding was really delicious and so was the kunefe"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bWJHQkVnEAE",
            "text": "The workers there are amazing and super sweet will definitely go again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZzlEcGZREAE",
            "text": "The best middle eastern sweets n treats i ever had. Fresh and flavorful. I adore this place. 10 star customer service. The best dubai chocolate I ever had. Ahmed you treated us like family.  Thank you. For a full review check out Annastravelsnyc on Instagram & Tiktok next week. This place we stumbled upon. Not sponsored. Everything I ate was 10 star."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNXMzdW9nRRAB",
            "text": "This is one of the best dessert spots I’ve ever visited. The baklava and other sweets are incredibly fresh and delicious. The owner is warm and welcoming. I highly recommend this place for anyone seeking Arabic sweets."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMHBmLW53RRAB",
            "text": "They were so friendly and welcoming! The pastries were soo good. Will definitely come back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa1lPLVhREAE",
            "text": "Great variety of Baklawa pastry. Everything is made in-house and is very fresh & crispy.\nSeems like they put a lot of efforts to the details as these small pastry Baklawa requires lots of layers & efforts to prepare.\n\nThe End result is definitely worth while. Must ask what's the filling inside as they're loaded with nuts & people who're allergic must confirm before consumption."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aXZDMW5RRRAB",
            "text": "Amazing Baklava, they even gave free samples, will be coming here again🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dWFpdmFBEAE",
            "text": "The man that served me was fantastic, great customer service and was very friendly. The baklava was super crisp and the Dubai chocolate bar was absolutely delicious!! For only $7 it was a steal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLTlUM3pBRRAB",
            "text": "Wonderful sweets and very cheap"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidklqMFpBEAE",
            "text": "Came here the other day with my parents for the first time and the owner was very sweet welcoming man. He offered us a free sample of his baklava without nuts. I came to try out the Kanafa cheese desert and baklava it was delicious. I've also tried a coconut pastry and something else that had like a yogurt or something filling as well. Next time I want to try his chocolate bar that looks like the viral Dubai candy bar shown all over TikTok."
        },
        {
            "date": "1년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaTdLR1VBEAE",
            "text": "رائع"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNkxHMnNnRRAB",
            "text": "I came in to get some kunafa & immediately was greeted with warm welcomes and smiles. The staff was super kind and helpful! I came across the dubai chocolate and decided to get that aswell. The gentleman even gave me a piece of baklava to try. The service here was everything & the deserts were amazing I will definitely be returning ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNnVtV0ZBEAE",
            "text": "My only go-to when it comes to sweets, real addiction!\nAhmed is the kindest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX2F1TE53EAE",
            "text": "Best baklava I’ve eaten in the US—crispy, buttery, sweet but not to a cloying degree. We especially loved the pistachio baklava. Prices were very reasonable and the staff went out of their way to be friendly and helpful, giving us recommendations of their favorite baklava and making conversation despite it being the store’s last hour of the day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNlkzUktBEAE",
            "text": "Very sweet ( literally and figuratively) little gem of a store. Sweets are affordable and the owner is very nice. He overheard it was my birthday and gave me some free sweets and baklava."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MV9LeWVnEAE",
            "text": "Best Kunafa in New York City and it's warm Kunafa is so soft and delicious I love it and I always eat like almost every day. They are very friendly and I highly recommend going to this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NTZibTh3RRAB",
            "text": "Best baklava in Bronx, everything is delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NUtPRmF3EAE",
            "text": "The best sweets in Bronx , baklava tastes great 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6ME5DN2l3RRAB",
            "text": "I took a bite of the pastry and there was mold in it. I won't be returning. Nothing is refrigerated it's probably left out all night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcmVXOGJREAE",
            "text": "She loved it 😊"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX3ZYU2xnRRAB",
            "text": "AMERICA'S BEST KNAFEH! I REPEAT! BEST IN AMERICA! YOU WILL NOT BE DISAPPOINTED! My friend suggested Damascus Sweets, so I traveled from Saint Louis, Missouri to Bronx, New York to try the knafeh there! My entire viewpoint was altered after trying the knafeh, wow! For a brief moment, after taking my first bite of knafeh, I thought I was in heaven! I haven't stopped thinking about the knafeh I had at Damascus Sweets until now. Even though it takes two hours to go there by plane, I will dine there not one more, not two more, not three more, but more than countless of times since it is worth it! I REPEAT! IT’S WORTH IT!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa3BMeFBREAE",
            "text": "Best Baklawa in town, hands down!\nEverything is freshly baked and made with love.\nthe shop's owner, Um Omar is the nicest aunty ever!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OTU3cG1RRRAB",
            "text": "Wifey and I felt like being spontaneous after a long day and decided to have a middle eastern dinner. We searched for best baklava in the area and found this hidden gem! The staff was so nice and friendly. Will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcmZISl9BRRAB",
            "text": "I literally cannot walk past this place without buying knafeh and warbat. Sooooo good - I'm obsessed...and gaining weight but SOOOOO DELICIOUS. Everyone is so kind there and makes recommendations. I think it feels daunting at first to walk into an arabic establishment when you aren't Arab but they are patient and friendly so if you're curious, go in and check it out. Let them know how sweet you like your desserts and they can recommend something you'll like. Everything is reasonably priced as well. Everytime I go in there I buy several things and it's always like $12 lol."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTaXRmaEtnEAE",
            "text": "Ahmed always greets you with a smile and provides excellent customer service. If your a foodie and love deserts I highly recommend this place. Damascus sweets is one of NYC’s hidden gems."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMzh1UXJBRRAB",
            "text": "Great service for good quality sweets. Prices are reasonable, I recommend this place. It is also family friendly and offers a wide variety of sweets."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNmVhM29RRRAB",
            "text": "Exceeded expectations. The pistachio coconut cake is my favorite . The cakes are flavorful and well moistened!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNza015NXd3RRAB",
            "text": "تشكيلة متنوعة من الحلويات اللذيذة انصح بزيارته وتجربته والاستمتاع بالحلويات المنوعة، خصوصاً الكنافة الناعمة."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabElUaG5BRRAB",
            "text": "this is everything i could want in a baklava shop. so yummy and fresh. super nice workers as well. so many options and super cheap!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLenJLbXh3RRAB",
            "text": "Update:\nI still love their baklava but last time it had a bit of old oil taste which wasn't good.\n\n---------\nOh My God!!!!!! Hands down the best baklava I've had in the whole USA! FRESH, so tasty! Normally people are stingy in how much nuts they put in the baklava but this place was so generous! The pistachio one is my favorite!!!!! Good job!\nThe owner is so friendly as well. I'm gonna be back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaTVYWmN3EAE",
            "text": "Now this is what I call an all time high experience, the sweet lady working made me feel so welcomed.\n\nThe sweets are soft, fresh & tasty. By the way this is what you call real Baklava !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnF5d3lnRRAB",
            "text": "Wow, this place is a gem. I don't live near by but I travel for these. They have so much selection & you can see the sweets being baked fresh in the back. The staff is so kind & friendly every time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a2J2d2ZREAE",
            "text": "The best hands down no need for a long review must try the knafe fresh. It’s heavy and no holding back water after is a must."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhb09lUHhRRRAB",
            "text": "A really delicious assortment of baklava! A must-stop for dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bnBIWXhnRRAB",
            "text": "Wonderful place to get middle eastern sweets. The service was amazing, they’re super friendly and kind!! I absolutely loved it and highly recommended it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxN1ByYWlRRRAB",
            "text": "Definitely need to\nStop by everytime! I love it"
        }
    ],
    "reviews_count": 65
}