{
    "name": "Arth Aljanatain",
    "place_id": "ChIJ9UxILNn1wokRcGOKZ15EcIY",
    "grid": "BX11",
    "address": "700 Rhinelander Ave, Bronx, NY 10462, USA",
    "rating": 4.6,
    "user_ratings_total": 137,
    "phone_number": "(718) 918-9191",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT1ZVcHZTVXM1YUVNM1NIUTBWV2xWWVdwWk9HYxAB",
            "text": "Dried chicken. And pricey."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVVGSkpZV2RsUzJOQlFqTkRiVXhVUm1OSWNIYxAB",
            "text": "Really a great and very unique restaurant. First of all, the bread is more than great and completely different from any other bread in the United States. In the restaurant, you feel as if you are in Egypt or any other Arab country. You can have breakfast with beans, falafel, hummus, liver, and heart, just like you would eat in any popular restaurant in Egypt. For lunch, you can also eat Mandi and various delicious meats. The prices are reasonable, and the area where the restaurant is located is very lively 🌸🌸"
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaYWRUSktjMjlrYlZOMGRVVmtVbTFMVURCRmRIYxAB",
            "text": "يعني"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RlRXUXRVRGRmVkhCUlVVdHpTbkEyYkhaek1FRRAB",
            "text": "The best food in the ny"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTGFYaGFhblF3V1U1SWQyMDBiR1JyWnkxMVVHYxAB",
            "text": "I call to ask if they have place for family the old man on the cashier say yes we have But when I got there, I was surprised that the place was mixed. I went to the old man. He said, “Do you want me to close the place for you and your…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVWFrcHpVRlV6VlRGSE1VTkJaRVpWTFV3MGFXYxAB",
            "text": "Food was delicious the meat, tender melting between your fingers the soup to die for .the service wasn’t bad not great,,,  atmosphere not for family"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMVMzbFFkbFJXZVhKNU5WSlBUR05xVldaMFpFRRAB",
            "text": "Amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV2p1T2JfMGVDS1ZREAE",
            "text": "Roasted chicken with rice, and roasted lamb w rice.  Each plate serves 3 portions, or 2 heavy portions. For 20-25 dollars a platter, it’s a good buy.  Excellent flavor, variety of condiments which gives it a little kick.  Quality meat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUFYxSlZOekkzU0RaRldtcGFha0ptVlVkNE5FRRAB",
            "text": "Good portions and flavorful food in the heart of Little Yemen. Enjoyed the zurbian with meat and bread with spicy sauce with cheese and bread. The soup was delicious and soup and salad come with each meal"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPTGRrOHpVOGZYM0FREAE",
            "text": "Amazing food with incredibly reasonable price and friendly staff!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYTFyYVNBNUlmWERnEAE",
            "text": "Ordered via ubereats. The salmon was so tasty and the hummus was the best I’ve ever had! Only one “complaint” was one of the breads was over charred BUT still great. I will order again for certain."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLVDdvTkdMMmJ1M2lRRRAB",
            "text": "Yemeni food in the heart of the Bronx. Authentic, flavorful and economical. We had the Lamb Haneeth, 10/10 and also had the hummus with meat 9/10.  They start you off with broth soup & salad & the bread was perfect.  Cost about $20 a person and we got a few cold drinks."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNWV6ZHh3RRAB",
            "text": "Great Yemeni food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUR3NkpobxAB",
            "text": "Review of Arth Aljanathain Restaurant – A Hidden Gem with Exceptional Service and Food\n\nIf you’re looking for a small yet extraordinary dining experience, Arth Aljanathain is the place to be. This hidden gem may be modest in size, but it delivers big on flavor and hospitality.\n\nFrom the moment you step inside, you’re greeted with warm and friendly service that makes you feel right at home. The staff is attentive, ensuring that every detail of your meal is perfect, and their passion for hospitality truly shines through.\n\nNow, let’s talk about the food—simply outstanding! Every dish is prepared with fresh ingredients, rich flavors, and an authentic touch that leaves a lasting impression. Whether you’re craving traditional dishes or something unique, the menu offers a delightful variety that caters to different tastes. The presentation is beautiful, and each bite is a burst of flavor that keeps you coming back for more.\n\nDespite its small size, Arth Aljanathain has a cozy and inviting atmosphere that adds to the overall charm. It’s the kind of place where you not only enjoy a fantastic meal but also feel like part of a family.\n\nIf you haven’t visited yet, you’re truly missing out. This restaurant is proof that great things come in small packages. Highly recommended!"
        },
        {
            "date": "8달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndzltMkRnEAE",
            "text": "احلا مطعم في امريكاء تحياتي لك يانورالدين"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMTRXMGhRRRAB",
            "text": "Yemeni cuisine is a rich tapestry of flavors, influenced by the country's diverse geography and cultural heritage. Airth eljhannah remarkably delicious rich mixture of butter and spices, typically served warm and garnished with sesame seeds amazing toasted taboon bread\n\nMulokhia Popular here, Each dish reflects the warmth and hospitality of Yemeni culture, combining simple ingredients with complex, aromatic spices. This combination makes Arth elJanathain food a truly enriching experience for those who enjoy exploring international flavors."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc0lmanJRRRAB",
            "text": "Overall 4 stars. Not bad. We went as a family of seven .\n\nI will first start with positive:\n\n1. Salmon portions is large compared to other Yemeni restaurant around\n2. Free tea for all customers\n3. Free soup and salad with all dish\n4. Soup is quite good\n5. The food is ready very quickly.\n6. This is located right next to the masjid. So I can pray and come back during prayer time.\n7. The guy understood the English very well. Sometimes it is not the case.\n\nNegative side:\n\n1. Small restaurant. Difficult for a large family to sit together\n2. The falafel is not cooked well inside.\n3. Lamb hanith, I think the meat is not baby lamb. But not bad.\n4. The meat portion is less compared to other Yemeni restaurants that we have visited.\n5. Difficult to get parking specially during prayer time.\n6. Kunafa desert seems not very authentic. It is full of coconut. I have kunafa before. It supposed to be very creamy and smooth.\n\nPlease see the latest menu as of January 2025 in the picture."
        },
        {
            "date": "1년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM2RPc1l3EAE",
            "text": "مكان له طابع خاص ونوعية الاكل لها نكهتها"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaHU2RlFREAE",
            "text": "Been purchasing here for almost 8 years, and their food is always cooked right and delicious.\nLately however they've been burning the grilled chicken, my past 3 orders have been grilled and rotisserie chicken, all burnt to a crisp.\nI have to remove 20% of the chicken just to get to a part that isn't burnt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidjlpX0hBEAE",
            "text": "Superb!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiazZPcUZnEAE",
            "text": "Very expensive don’t go there\n\nThey ripping off people for small amount of food\n\nStop 🛑 don’t go there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUakxIVG9BRRAB",
            "text": "Dry"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqM1pETmZBEAE",
            "text": "What a find!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeFlpalNBEAE",
            "text": "Great tasting food, tender,,& juicy meat, Great flavors,"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcU8zOHJBRRAB",
            "text": "I had the Kabseh Chicken, which is chicken & rice in lightly spicy, but suprisingly savory tomato paste. It's served w/ salad, an herbaceous & lemony chicken broth soup, & a green tomato & cilantro sauce that I liken to Yemeni chimichurri! I feel a bit wasteful not taking home the leftovers of the generous serving, but the remainder was mostly just rice & lettuce anyway. I also liked the honey flavored malt beverage."
        },
        {
            "date": "1년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bXFMVUx3EAE",
            "text": "Nice test and good price 👍🏻\nللامانه المذاق جداً رائع وخدمة العملاء جيده واسعاركم ايضاً بالتوفيق ومتمني لكم الاستمرارية"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5a29EUVpBEAE",
            "text": "Price to much to compare to other"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5X2F6V2xRRRAB",
            "text": "They know what they’re doing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MnN1YnF3RRAB",
            "text": "The grilled fish is very, very good ! The food is well seasoned and filling. The portion sizes are exceptionally generous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeS0zU3ZBRRAB",
            "text": "Good food , delicious, variety of dishes.\nNice people in the kitchen and very friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLTZIeW5RRRAB",
            "text": "Delicious Yemeni food.\n\nI was very impressed by the food I ate at Arth Aljanathain. I have eaten there a few times. I have had a chance to taste several of the dishes.\n\nThe restaurant interior is decorated with scenic images of Yemen framed with white border. That same white border is used to create decorative geometric patterns on the wall.\n\nYou get a good sized portion of food on each plate. So far, I have had the Zurbian chicken, which is aromatic rice and pieces of chicken buried within the rice. I tried the roasted chicken and rice dish, and salmon, both were superb. Some of the meals come with a small soup and salad. I really enjoyed the hummus and bread dish. You can taste the tahini in the hummus and the bread was light and soft. It is one of the best flat breads I have ever had.\n\nFor drinks, there are many to choose from. I had a Ayran mint flavored yogurt drink (one of my favorites). I also had a Laziza regular malt beverage. Laziza \"regular\" is an unsweetened malt beverage that is pleasant and refreshing.\n\nOn your way out do not forget to grab a small espresso sized cup of slightly sweetened tea.\n\nThe food at Arth Aljanathain does not disappoint. I will surely be going back for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWZzV2MnFnRRAB",
            "text": "Got fatteh and it was so heavenly. Sorry the pic was after eating it. Every bite was delicious. The rotisserie chicken and rice wasn’t bad either, but you should ask for a white sauce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4b1liZ0l3EAE",
            "text": "Small Yemenis place with 5-7 tables serving authentic middle eastern dishes. I visited at 11:30AM right before lunch rush. The portion size was great. The soup was warming. The lamb was cooked so tender. The rice was fluffy. This is a hub for middle eastern cuisine, and there were plenty of regulars as lunch rush rolled in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNUpmVUpREAE",
            "text": "pretty smacking if i do say so myself. feels nostalgic. super yum. they serve salad and yummy soup with most meals. come here for yemeni food in the bronx! ps i’m sorry for spitting my water up on the floor my friend made me laugh"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCX3J5QjR3RRAB",
            "text": "The waiter took a while to even hand us a menu however he was kind and the food was so amazing"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMVl1NmxRRRAB",
            "text": "nice place to eat Yemeni restaurant. There is chicken /lamb are wow ❗  yummy 😋…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWenFmcllBEAE",
            "text": "What a welcoming authentic place!  You feel like home here. Every single dish that I tried was particularly delectable. The service is always above and beyond. Such a fair price for hefty portions of food. I highly recommend to everyone and anyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M1BhdGJBEAE",
            "text": "Unassuming but amazing. Clearly very authentic. Fresh-baked Yemeni flatbread, stewed beans, roast lamb... the soup that comes complementary with the meals is very flavorful. Add to that very reasonable prices, it's an easy 5 stars."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOU55RXlRRRAB",
            "text": "Had the chicken sandwich. Very tasteful and cooked to perfection."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdmJ6bjBBRRAB",
            "text": "This spot is an absolute gem for good food made with love."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHX1AyRmtBRRAB",
            "text": "Brother took care of us. Great food and atmosphere!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dDhLaHpnRRAB",
            "text": "Soup was awful tasted bitter, food had a weird taste. I ordered the chicken rotisserie but it had a bitter taste which made the whole meal worthless."
        },
        {
            "date": "2년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNV9la2RREAE",
            "text": "الاكل لذيذ ولا غلطه"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxa2RIek5nEAE",
            "text": "Unreliable, very dissatisfied as a regular consumer whom orders from them thru Uber and pick up!!! My food was so cold, and their attitude was really unbelievably"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb3JmOXVRRRAB",
            "text": "Small restaurant serving great Yemeni food. The lamb haneeth was very succulent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURObVpDWWdRRRAB",
            "text": "Absolutely wonderful place with delicious food and welcoming atmosphere! Will definitely be back with my friends!🫶🇾🇪"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMmVfMTBRRRAB",
            "text": "It's good but the dining service is not good. They're busy to serve takeout instead of dinning ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ2RtX2NREAE",
            "text": "Second time at this establishment and the food was better then the first time I went. I will definitely eat here again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaUttZENBEAE",
            "text": "Very nice and clean place the bread is so delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdGE2Vmx3RRAB",
            "text": "Waited too long to order even though the food was worth it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1a3NURTFBRRAB",
            "text": "Very nice and delicious but relatively expensive"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSajd1amJnEAE",
            "text": "The zhug sauce they have is perfection."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNFlMWVRBEAE",
            "text": "The best lamb in the area and hummus."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dWNYSjVRRRAB",
            "text": "One of the best chicken kabsa in the town!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aHZUdDh3RRAB",
            "text": "Good food, nice service"
        }
    ],
    "reviews_count": 55
}