{
    "name": "Triple Chocolate Crepes & Waffles",
    "place_id": "ChIJaaWW6_T1wokR6AavV5LlgKs",
    "grid": "BX11",
    "address": "712 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4.6,
    "user_ratings_total": 180,
    "phone_number": "(929) 614-7444",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "ro",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NmJIcFVURmhXVUZweldHSXhjVFZ0YzNwM1JtYxAB",
            "text": "Excelent"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M2JqSndaR0ZNWDI1NlptWmtZMkYyZG1WMU4wRRAB",
            "text": "Their chocolate is very good and service is good too"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRFJERjJXazlYYUdKR1YyMTJSRkJSY21SV2JsRRAB",
            "text": "The best crepes I ever tasted 😋 I recommend it for everyone ❤️…"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWR6WnRkRUZQY2pKUGRuZHdlVWxOVERaR1psRRAB",
            "text": "I admire this store very highly quality and the staff very professional and friendly"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZmJVOHlOazF0Ym1sR2VHaE9WRTVJUlU1NVMzYxAB",
            "text": "The best store in the world"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdGJqZHROVmxqTFc1b1JISjBjRkpuZFZCUVIzYxAB",
            "text": "Can’t wait for the new store to open across the street from them. They are dirty and expensive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlJFNVRUWG81UjBkalRHUXRSbFJpT1ZSTGVGRRAB",
            "text": "Delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNVJtZEliM2RaY2taSk5XNXFRVmRTWVVWck0xRRAB",
            "text": "I had the Dubai chocolate and Strawberry Dubai chocolate Cub 10/10. The staff were welcoming and they were very polite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWk5ERmhkVk0xU0hOTmJtb3RYMGMwTUZCSVZHYxAB",
            "text": "Amazing crepe. The service was on point. Highly recommend coming here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWUxWSnJVelZTWkd4aVFraHBMV2R1Um5wallXYxAB",
            "text": "Ambiance 10/10\nQuality 10/10\nCustomer Service 10/10\n\nA must try\nShakes are premium"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WFlVdHJkemREUW1kU2NqQXhiMk5IZDFwNGRHYxAB",
            "text": "fire food, fire music, fire vibes. great place to come and get some food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkS1RuVnpRbWs1UkdsNGIxRmxkR1ZIZWtaSU1IYxAB",
            "text": "The best experience! The staff is so kind and welcoming. The Strawberry Dubai Chocolate Cub was AMAZING! 1000000/10 will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZME9XRjZRbW8xVUhwcU9YaDViVVY1WjNabFQxRRAB",
            "text": "so good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNd1MwVmFhalJMZVhscFNrbDZZbXhtZG5kbVRIYxAB",
            "text": "Enjoy the vibe of this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tselMyTlhlbkZCTURJMlVFMUVORzlvUVVGM05rRRAB",
            "text": "The environment the food the staff all are 10/10🤌🏼🫰🏼.…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMU5VeEJWREp6V0Rsb1UzUjZNVzV1ZG14UGJVRRAB",
            "text": "The shakes were good but they were too liquidy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLek9rb3V6LVlLbjdRRRAB",
            "text": "Delicious cappuccino & waffle sandwich\nThe service very kindly!\nThe place that you want to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQYWE5SURSejZyUkdnEAE",
            "text": "Very good place for sweets and specialty drinks"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNnpfY19NOHJmWl9nRRAB",
            "text": "The best pancakes and mojitos! There are many other stores that are alike like this but nothing beats their drinks and desserts!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneS0yTURnEAE",
            "text": "Good customer service great hospitality drinks is actually good! & they’ll make anything you ask for beside the menu"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnelpfR0J3EAE",
            "text": "ive been to this place twice now and they do NOT disappoint!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnamZpcHN3RRAB",
            "text": "The milkshakes are amazing and so are their waffles if you do go there try the birthday cake milkshake its my Fav !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbWJtRWx3RRAB",
            "text": "Crepe was incredible so good. I also bought the famous Dubai chocolate bar and it was A M A Z I N G. Never tasted anything as good before. Staff was very helpful and nice and I will definitely be going back soon! 11/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcUxydG1nRRAB",
            "text": "I stop in for my macchiato, chat for a few then go. The staff is always pleasant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOEpHd2NnEAE",
            "text": "Food is decent but night time staff is rude. Just asking if they take cash was a big issue for them."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bDY3SEt3EAE",
            "text": "Delicious dessert spot!! Tried the fruity crepe, so yum…it had plenty of fresh fruit (inside and out) and the 3 types of chocolate drizzled on top took it to the next level for me!  Also had a pistachio coffee, absolutely delicious!! Service was friendly, it’s a casual spot with maybe 3 little tables and  seating for 7 in total…would definitely be back to try more stuff from their extensive menu! Really affordable too!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaW9Tblp3EAE",
            "text": "The best in NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud3FyMWh3RRAB",
            "text": "All the way from NY to IL. I got American coffee! It was so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucE9QSTBRRRAB",
            "text": "I had a great experience at this coffee shop! The service was wonderful. Also, the latte coffee was so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudUtmODNnRRAB",
            "text": "10/10 definitely recommend my first time there and literally didn’t know what to get i think they were pretty patient with us lol but we were also given complimentary ice cream"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcW9UME9nEAE",
            "text": "Been here dozens of times. Always a friendly atmosphere and a great experience. Coffee and waffles are both top notch. Lots of options to try and staff is always welcoming."
        },
        {
            "date": "1년 전",
            "language": "so",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINHNLYnFnRRAB",
            "text": "Mashallah so good 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OVl6N0p3EAE",
            "text": "Iced caramel latte was amazing. Not to sweet not to bitter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b2ZiZHhBRRAB",
            "text": "I’ve been here twice and both times I had the lotus crepe, they were delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bHBDYmV3EAE",
            "text": "It was a lil hard to find but we got it. It was kind of in between a few other stores. They are wonderful here made us feel very welcome. My daughter hurt her foot on the door and it bled but he gave us all the supplies to help. My kids had the waffles I tried it they were so good not sweet at all. My daughter had a Kit Kat milkshake and she loved it I love that it wasn’t sweet. I had crepes with biscoff delicious. 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidUxxcmt3RRAB",
            "text": "Very attentive, kind, and efficient customer service. I will definitely be dropping by again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyekthMUVREAE",
            "text": "Very nice new cafe in Morris Park. I am pleased for the emergence of this new nightlife in my area. Crepes were good and the workers were very nice. They don't speak too much English, but they gave free chocolate covered strawberries, and free bottles of water to me and my daughters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOHJtZGJBEAE",
            "text": "I hate to give a Karen type review I truly do BUT I walked here today, hot as heck super muggy weather just to find them closed..they open at 12 supposedly and the guy who was working opened around 12:05 then had to wait and additional 20 minutes for him to set up, and additional 10-15 min to make my order..I find this to be unacceptable because it’s a Friday afternoon in a busy area in the Bronx. Had it been 8am opening and a little late? Ok..but this is 12 noon. The worker was talking on the phone didn’t even acknowledge me LOL like wow you’re late AND your service is bad. No apology , nothing. Then I ordered an original crepe and cappuccino- the crepe 50/50. They added a good deal of chocolate which I liked but the crepe itself had no flavor. The cappuccino wasn’t good but they did add caramel and that saved it. Would not come here again not because of the food, but because of the poor service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNManBIWjFRRRAB",
            "text": "Love their clean and friendly staff, reasonable price, quality, and generous amount of portion of the crape."
        },
        {
            "date": "1년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbVlqT2VREAE",
            "text": "مكان جميل جدا"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGVTMGtnRRAB",
            "text": "The staff was very friendly. The iced caramel latte was ok but the milkshakes were good. The latte tasted like college campus coffee if you know what I mean. They had interesting milkshake flavours. The sauce on the side of the cup for the milkshake was the best part. The Ferraro Roche milkshake was good and My cousins said the chocolate cheesecake milkshake was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MjlUYnB3RRAB",
            "text": "My first time trying Triple Chocolate and I loved it such good tastes and atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cXVTbFpnEAE",
            "text": "great place , amazing quality , great customer service .."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdFBlRDZBRRAB",
            "text": "No te vayas sin probar los mojitos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MDlHSkJREAE",
            "text": "Went to both locations and none of the stores had cup sizes in medium or large to sell drinks in but nonetheless ended up going to the Allerton location and waited an hour and a half for a small shake and a small cappuccino. The shake made turned out to be a different one from the one I had ordered and then instead of making a cappuccino the girl had given me coffee and when I confronted her she kept on denying it until I had told her I was watching her make it from behind the counter. While the Albanian girl behind the register had just kept on talking nonstop either to customers or on her airpods when there was a line full of customers waiting behind me and even though I had politely asked both of the girls to remake both of the drinks and said that I’ll pay for all four drinks if I have to they both would still ignore the request and the situation.\nOverall customer service and customer satisfaction is very poor here but the environment within the store is great, the layout inside of the store beats the service at least."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeEtQenNnRRAB",
            "text": "I went to the new location at 750 allerton ave. Food was great, but the two ladies that were preparing the food did not have on any hair net or hair coverings. They had long hair."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeU5tYzJ3RRAB",
            "text": "The first picture is from the people who service in the morning & the service picture is from the people who service at night but over all the food is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREenNIdDhBRRAB",
            "text": "Their very slow"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaUsySFdnEAE",
            "text": "This Place is awesome for satisfying that sweet tooth. The owner is there most often f the time I have visited and can make a great cappuccino. The place is small with a couple of tables and chairs but the waffles, crepes and coffees are on point. They are not cheap with the chocolate, so be prepared to have extra chocolate you can scoop up just to have by itself. Now if you excuse me I have to go shoot up some insulin."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaVB1Nkd3EAE",
            "text": "Their sushi crepes are addicting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOUlITEFnEAE",
            "text": "If you are looking for delicious local coffee, then look no further than Triple Chocolate Cafe! I had the richest Latte I've had in a long time. We ordered two white mocha lattes and we will definitely be back next weekend.\n\nThe owner created latte art in front of us and educated us on his proprietary coffee blend. From the customer service and beautiful location, I already had high hopes for this coffee.\n\nI was blown away at how balanced and robust the flavors were.  You would think a medium latte this good would cost you around $6, but not here! Only $2.99 !!!!!!!\n\nIf I lived closer, this would be my daily go-to cafe. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX3VxRUVREAE",
            "text": "I’m so glad they opened this place. I seen it passing by and had to come back to try it and I am glad I did.  I was not disappointed. They have a good selection and everything was fresh mind you I had it at about 9 pm. They are opened late and the people are so nice.  They place is clean and smells amazing.  I usually go to Manhattan to get crepes,that is until I came across this place. The crepes are huge can’t wait to go back and try the waffle sundae!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab0kyQnVBRRAB",
            "text": "I had a wonderful experience here. Their customer service was great, the crepes and waffles were amazing. The price was very fair and the presentation was perfect. I will definitely be coming back and be recommending to all my friends and family!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbU9MUmZBEAE",
            "text": "Delicious crepes with fresh fruit and Nutella! They offer waffles with toppings, shakes and other sweets.  Cute to go boxes that match the black and white decor of the store.\n\nBrand new and they are still working out the kinks, but service is friendly and the sweets are tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWb3NiX1l3EAE",
            "text": "Tried the pistachio sushi roll and it just melted in your mouth! It was recommended by the owner and it was a great selection. The chocolate was to die for. Order anything with a little drizzle of chocolate and you won't be disappointed. Also ordered a few smoothies and the kids loved them!\n\nWe love and support small businesses\nChef's Cafe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSenBuZVpBEAE",
            "text": "HORRIBLE EXPERIENCE. Waited for an hour for 2 crepes a frappe and shake. Customer service was horrible and did not get my order right. People ordering double we ordered after us and got their food before us. Wait time was expected to be 15-20 min even though thats too long but ended up being more than an hour. Crepe was not even made correctly, it was very chewy and raw like and didn't have Nutella inside just a drizzle of chocolate on top. To add on to that the fruit was not fresh and tasted horrible. The strawberry cheesecake shake didn't have cheesecake in it, It just tasted like strawberry milk. I spent $45 for some overpriced trash. I wouldn't mind paying the price if it was good but it didn't even look presentable let alone taste good. Try this spot at your own risk!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aktiR0hnEAE",
            "text": "Omg love that they put a place that is all about chocolate and more in the morris park of the Bronx.  And it stays open late ! My daughters pre birthday desert was amazing !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aHVHTWh3RRAB",
            "text": "Coffee is rich and frothy as i wish for. I like this cozy place for my daily morning coffee. Totally recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNV9LM1RBEAE",
            "text": "Very excited staff, locally owned, and quite decadent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeE1DTkdnEAE",
            "text": "I been going there since they opened everything I had try is so delicious, I highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkX1p1LUx3EAE",
            "text": "I ordered off door dash and the crepes and waffle sticks are absolutely amazing 5 stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cE03RnRnRRAB",
            "text": "Mad sweet, obviously, but lip smacking and finger licking."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSenRHQjh3RRAB",
            "text": "Crepe was not crepe like. Fruit toppings were not fresh and the cheesecake shakes were had no cheesecake flavor. Overall flavor was lacking and customer service was terrible. Lady had us waiting for 40 mins for food but she didn’t announce to us when our food was ready just watched us stood their."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MnFibEh3EAE",
            "text": "There crepes are amazing. Im not a fan of too much sweets so i ordered the fruit crepes. They made it with so much love.  The ambiance here is amazing. Great people Ma sha Allah :)"
        }
    ],
    "reviews_count": 64
}