{
    "name": "Golden Eagle II Diner",
    "place_id": "ChIJnUOHzpf0wokRZMvdBmW_0gE",
    "grid": "BX11",
    "address": "682 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4,
    "user_ratings_total": 233,
    "phone_number": "(718) 822-9433",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR2NVRlpRMXBMZERKcWJITkpSeTB5VDBwcGJuYxAB",
            "text": "Decent food service is good place could be remodeled but still decent place to sit down and eat ..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WVExUlRWa2hKWVhsVFZrTkdlR2hTY0MxeFdIYxAB",
            "text": "Tons of egg shells in the omelette."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Xzh6TnFRRRAB",
            "text": "i ordered bean burrito and carrot cake for home delivery. The delivery person told me that I have to pay in cash since something wrong with her machine. I didn't pay attention to this. Started eating burrito but there was no beans inside - only veggies, couldn't eat. Tried to call them but they were not picking up-they probably saw my number. Now I understand why the delivery person asked for cash, she knew that the burrito was not good and didn't want me to cancel the charge on a card. they even put extra donut in delivery - that I didn't pay for. They were aware that the burrito wasn't good. I paid $14 for burrito. It is a fraud, don't deal with them"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcy1xSkJ3EAE",
            "text": "Great food, great service and the waitress/cook was very welcoming"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaXRqN1V3EAE",
            "text": "Absolute amazing atmosphere at this place! The music was on point, the right volume, the waitress was amazing. It just felt very “diner like,” and that’s what really made the whole meal an experience for me. The food was at our table quick and the price was very fair."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOHJfdFpnEAE",
            "text": "My most favorite diner to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybkt6cGFnEAE",
            "text": "To whom it may concern, I will never eat at this restaurant again. I walked in and wasn't greeted at all, after that we were seated and our food was cold!!! Terrible restaurant!!! Never again!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NXRycmR3EAE",
            "text": "Will never order from there again for as long as I live. I told the guy medium 3 times and sent a burger that was harder than concrete"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbXNmT3RBRRAB",
            "text": "Good Service. Food is good and reasonably priced. Atmosphere is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ09hWjV3RRAB",
            "text": "The prices cannot be beat! Especially for the portion sizes. They have your classic breakfast options, with great toppings already on the menu. Great place for a lazy breakfast with wifey or friends. Staff is also a delight"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDN0wyWHNBRRAB",
            "text": "OMG this place is so clean good service excellent meals breakfast lunch snacks and you can seat in the restaurant that is a plus right now.and the best is this sweet older man he will bring your meal to you with a smile. Great Service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEN2QyenFBRRAB",
            "text": "Always good. Burgers are my favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNVlXTUpBEAE",
            "text": "I have a diner near me, but I order from  Golden Eagle II all of the time. This place is my go-to diner on the Bronx. The food is very good and they're always on point on the orders."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkc1lXaGl3RRAB",
            "text": "Prices are very high for no reason this is the bronx not manhattan to be charging $12 for a roll sandwich some servers are rude too especially the old dude with a mustache. If you order 3 sandwiches be ready to pay $47"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOXBTZWtnRRAB",
            "text": "The prices are exaggeratedly high a white egg sandwich sausage and cheese on a roll they charged me almost 10 dollars I have been to other places and the most I have paid is 6 dollars !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cjlYcC13RRAB",
            "text": "Delicious breakfast to enjoy a family Sunday 😋 and excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dC1UQzhBRRAB",
            "text": "I love this place. Everything I had here has always been cooled perfectly. The ladies wait on me are always sweet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0X1lUZFdBEAE",
            "text": "Great food but prices a little high."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaXYtLTZnRRAB",
            "text": "It's a great place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNXRXUy1BRRAB",
            "text": "Customer service is top tier"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbV9QRk53EAE",
            "text": "Food was amazing, stopped by for breakfast. Ordered a sandwich however they forgot to put lettuce and tomato in the sandwich smh banana smoothie was good and so was the egg sandwich.\n\nEdit in Spanish: Para la señora chaparra usted no se tiene que enojar con los clientes por ningún razón te pareces loca quien te va a dar propina así, es más espantas a los clientes potenciales 💀señora usted tiene que cambiar su actitud"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMXNITXlBRRAB",
            "text": "Do you have a communication service such as WhatsApp?"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNHJfUk53EAE",
            "text": "Nos fascinan los chilaquiles rojos y la comida. Es estupenda felicitación a las personas que están en la cocina y lavando trastes\nSolo la atención algo agria y bacía."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGb19Pa1hREAE",
            "text": "Don't go in the morning there's an mean lady. Who hates dogs"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabnBlUHpRRRAB",
            "text": "Excellent customer service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLXAtOHZBRRAB",
            "text": "Always a great experience. No matter what time of day it is."
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnN0tlSkVREAE",
            "text": "De lo mejor en desallunos y comida mexicana y americana las pastas y el servicio de lo mejor la atención y la amabilidad es única buen café y ambiente familiar y los tacos muy buenos a demás la comida para llevar y los deliverys son muy rápidos y entregan la comida a tiempo lo recomiendo pero vengan y saquen sus propias conclusiones buen día y que dios los bendiga"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeWFDMWJREAE",
            "text": "Great place clean and good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dFpmY2FnEAE",
            "text": "Nice little reasonably priced diner with a Mexican  and M'erican menu 😄"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aXJUZXNBRRAB",
            "text": "Love this place. Food and service is always top notch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN282ZTRnRRAB",
            "text": "I came to eat with my aunt and I love the place. It's a small place, you will feel like being at home. The food is amazing. Servers are very polite and welcome you. I recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoc3BITE5nEAE",
            "text": "Two pieces of deil ham cooked, two slices of cheese on top of the scrambled eggs. (Could've at least scrambled the cheese into the eggs)Bacon was ok. Sausage was ok.\nWaffle was ok. I gotten the mocha \"frapp\" which was delicious. And this was their Bronx Breakfast combo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCejVTSDl3RRAB",
            "text": "Delicious vegetarian burrito; the best I've had. Great service and friendly staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMWVEZ0JREAE",
            "text": "The food is always amazing, staff are super friendly and welcoming! Prices are also great, i go back every week"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcDlXNDlRRRAB",
            "text": "Muy agradable lugar y muy buen servicio 👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMG95MHZBRRAB",
            "text": "I have given this restaurant many chances but I am done. I order from them Pretty frequently and it amazes me how they always seem to do something wrong. It’s never the taste of the food though (which is why I’ve always reordered), it’s…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydHFuV2FBEAE",
            "text": "I've been ordering from this place for at least 2 years. I've had the same delivery guys and I believe the same workers have been there consistently for some time now. My food is always great from here. When they aren't busy my food can…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQya3JTU2lBRRAB",
            "text": "I just want to talk about the coffee for now!  This is probably one of the most satisfying cups of coffee I've had in a long time.  So thank you Golden Eagle II for that one.  Now the sandwich was another story.  Let's just say the coffee saved this review!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXajR1OGZBEAE",
            "text": "I've been going here for about 20 year's ther like family"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtOGJXNXVRRRAB",
            "text": "I love a good diner breakfast"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dFlhUUhREAE",
            "text": "Grub hub got my order wrong, I try to call the restaurant to inform that my order was wrong, there communication skill are horrible. They didn't help me any from or way. There food was very dry, it has too much jalapeño."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dDlpd0tREAE",
            "text": "I ordered 3 different types of cheeseburger and they got them perfect.."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bzhLX0x3EAE",
            "text": "Buena comida y muy buena atención"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcjhtZ1FREAE",
            "text": "Nasty service rude over the phone never gets the oder right stay away"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeHVqQWdRRRAB",
            "text": "Is good place"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLc0x6VEV3EAE",
            "text": "yeah it’s ok not 4 stars tho"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5Z1l5S1JnEAE",
            "text": "This place has great customer service.  Ive been coming here with my dad since I was 9 and their coffee is amazing. They always ask how are you and treat you really well."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbk9takp3EAE",
            "text": "Steak and eggs my fav! Great and friendly service"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjd01UN3NBRRAB",
            "text": "Pretty good food, good prices too"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndHQzN0NBEAE",
            "text": "My husband and I used to come as just us two and now we bring our little daughter. It’s a cozy place with great coffee. The service is usually fast, but they are not very friendly. Some seem like they don’t like their job, but maybe are…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnXzVhQ3ZBRRAB",
            "text": "Do not I repeat DO NOT order from this place. Horrible service. Good delivery took over 2 hours to be delivered, \"manager\" was rude, unapologetic, and incompetent to manage a restaurant. After I called and demanded refund because the fries,…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRa2ZmQVB3EAE",
            "text": "Recently passed by and didn't like how the attendant took my order. She was very stiff to the menu and didn't accept modification to the order as I have previously done in the past; even though I explained to her why I was doing it. I also told her that I was willing to pay for the differences if any. -She was not open to the customer's needs.\nThe food is still great, great breakfast, although not cheap!"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRN2ItX1ZnEAE",
            "text": "Nos fuimos  con los primos  y Tios la pasamos de Show Gracias a Dios"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbXYyaklBEAE",
            "text": "This has been my go to breakfast place for over 20 years.  If I don't go there, I will order. Delivery most of the time is quick. I like that they know me and my family and take good care of us in person and over the phone.  I highly recommend it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzbHNIb19nRRAB",
            "text": "This is our local diner spot! I have been coming here for about 8 years now! They have great customer service, and they are very friendly! French toast with berries is my favorite! But everything else is also as good and delicious!"
        },
        {
            "date": "17년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdHAyZnN3RRAB",
            "text": "I believe the menu here is identical to Golden Eagle I, which is only a couple of blocks away. The food is more or less identical; cheap and satisfactory. The difference is the service. This Golden Eagle is much smaller and the staff is…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROWZQazF3RRAB",
            "text": "Sat and waited for so long  I had to get up and ask for menu's for me and my family. Waitress never took our order. Got up and left when I saw people who just walked in getting there orders taken.waste of time. Spanish restaurant down the block is alot better."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbFpPME13EAE",
            "text": "Ordered a hungry man breakfast and a Belgian waffle with bacon, along with a toasted corn muffin on the side. The delivery was quick. The pancakes and waffles were so dry and my muffin burned! Disappointing start to my morning!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdEp2ekpREAE",
            "text": "Very nice diner, Food is good. Of all the times I had breakfast, I find the servers not very friendly. Maybe they were having a bad day, many times."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvczhtUnJ3RRAB",
            "text": "Quick service, nice employees, and the food is good. Worth the money and time. Go here often with my family and I definitely recommend."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dDhMYk9REAE",
            "text": "Golden Eagle has changed for the good!\nHappy to say the service is so much better\nAnd the wait staff is attentive.…"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaS1iVl93RRAB",
            "text": "Horrible,  I live in the neighborhood and tried it many times.  I'm done with this place.  Their service is horrible, and the host was rude. Even their deliveries suck.  The food is fair as long as it's not delivered. I know what your…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROGI3MnpBRRAB",
            "text": "Food is good. The staff are very rude and overcharges you for any substitutions. This diner has potential just needs better management."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOEpLNG9RRRAB",
            "text": "This is a family fav. They have added to the menu, which makes it better. Nice place for a variety of pancakes and other griddle food."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLXVHY2d3RRAB",
            "text": "Decent food, pretty good service. Standard diner menu. Great made to order milkshakes. P"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dEpQbS1BRRAB",
            "text": "Pretty good food at a really good price. The food isn't mind blowing but you definitely get your money's worth"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRN01TN0RBEAE",
            "text": "Very cool cozy and low key I do like the employees they are very cool and professional above the service at this local diner is excellent I recommend it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNXNMamR3EAE",
            "text": "They serve you super fast when dining in, but when ordering they always get something wrong! I gave up i don't order anymore!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncWJLTHRRRRAB",
            "text": "Clean,  a healthy mix of American ,Italian and Mexican favorites, you and good food. No nonsense pricing,  Breakfast,lunch or Dinner - eat in or take it with you!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZbzRES29BRRAB",
            "text": "Horrible they dont use gloves when handling raw chicken to them stick hands in pickle jar ...I wanted to cancel my order...not sure why I didnt"
        }
    ],
    "reviews_count": 70
}