{
    "name": "El Salvadoreño",
    "place_id": "ChIJyWCuV6P0wokR45bmBNVcuJw",
    "grid": "BX11",
    "address": "455 Morris Park Ave, Bronx, NY 10460, USA",
    "rating": 4.1,
    "user_ratings_total": 208,
    "phone_number": "(347) 879-4891",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poallXSXRMVTlpY2pCVFpqTXdNVXRrYWpGMk5XYxAB",
            "text": "This place makes each dining experience unique in some way. The meals taste wonderful and servings are generous. Great food served with helpful attitudes. Friendly, inviting, kind, professional. This spot merits a visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKblRXZEVUR3MzVjE4dFVGVlpOamd3U1hjNExVRRAB",
            "text": "The restaurant provides remarkable service. The standards at El Salvadoreño are remarkably high! I favor El Salvadoreño due to their delicious dishes and attentive employees. Their staff and dishes never disappoint. The food here lives up to promises."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSVFYWjVXV0pSY1RGNVFrRjFhMlZJWTJoeFNuYxAB",
            "text": "I ask for pupusas de chicharrón! It was something else it taste different and the tamales the masa wasn't cook complete! El curtido doesn't have flavor and the sauce it was pure water👎👎🤨🤨…"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RU5HdHVkVGgzVVZBMmVVMXJVbDlDYUdadmFWRRAB",
            "text": "No recomiendo este lugar. Cobran $4 por una pupusa de queso, frijoles y loroco, lo cual es excesivo. La muchacha que atiende tiene una mala actitud sin motivo alguno. Dicen que solo aceptan efectivo, pero igual cobran impuestos… cuando claramente operan sin declarar impuestos correctamente. Todo se siente como una estafa. Y todo esto por pupusas mediocres. ¡Eviten este sitio!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWmJ6SnVTUzFoVEMxVmExaG5NRzFZTm5sWmJHYxAB",
            "text": "Excelente lugar para deleitarse con la familia o amigos\nPuedes comer lo que quieras y es económico"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOXRYRllBEAE",
            "text": "Rica la comida\nVoya regresar\n\nBest soups and tacos and everything I'm not gonna lie"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXZLSzBBRRAB",
            "text": "Food was good and staff were polite and friendly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBb0llOFJBEAE",
            "text": "I love these Pupusas’s, my go to spot always!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLUpXNmlBRRAB",
            "text": "Good food😁🍲, tastes like 🇸🇻"
        },
        {
            "date": "수정일: 11달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXa2VUVmNREAE",
            "text": "Buenas las pupusas.\nLo malo es que los fines de semana la música esta muy muy alta que no se pueden hacer las órdenes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOHVhYmNBEAE",
            "text": "I love 😘😘 food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb2NpMktREAE",
            "text": "I Would Give Them Zero Stars, They Are Racist.  I Walked In And Went Up To The Counter And They Just Looked At Me. Then This Other Gurl Walks In Behind Me And They Both Were Like \"Holaaaaaaa\" And Still Didnt Even Acknowledge Me While They Answered Her Questions And Then When I Say \"Oh So I'm Just Not Standing Here\" Then They Still Both Just Looked At Me And One Was Like Sorry And Like Shrugged Her Shoulders. And I Asked If It Was Because I Was Black And Then One Was Like I Thought Yall Were Together (In Spanish To The Gurl That Walked In Behind Me) And I Was Like No You Clearly Saw Me Walk In By Myself.  I Would Never Go There Again And That Was My First Time Walking Into That Restaurant. (I Went Today (9/16) At 2:25pm, If The Owners Care To Know.)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeXYtbVVBEAE",
            "text": "I was craving pupusas and El Salvadoreño DELIVERED the exact flavors I was looking for. Great pricing, local establishment, and their pupusas are not pre-made — always fresh. Looking forward to my next visit already!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXanN2WVZBEAE",
            "text": "Muy buenas las pupusas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULWFIQWdRRRAB",
            "text": "The ideal restaurant to spend some time at, socializing, healthy food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaEtUUmdRRRAB",
            "text": "Had pupusa for the first time and it was amazing. They give cabbage to add on top and took it to the next level. I will def be back for more!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcGR5NVlREAE",
            "text": "Súper amigable ambiente y la comida ni se diga"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURscU5EWElBEAE",
            "text": "Excelente sabor de las pupusas y muy buen lugar ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcC16SVJBEAE",
            "text": "Siempre me ha gustado las pupusas de este lugar exelente y también sus platos típicos preparados por thelma...y un lugar muy bueno para tomar una cerveza con amigos."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcFB6SnBRRRAB",
            "text": "Nos gusta porq.esta cerca es buena comida buena atencion, tengo varios anos de visitar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4czlEQzdnRRAB",
            "text": "As we were passing by Morris park and 180 St. just off the train station, when we saw this restaurant. We were not sure to come in as it didn’t smell to food.  Very clean! I didn’t know or heard about this restaurant before so I had many questions about our orders. Gentleman who serve us was very knowledgeable and really nice! best of all, spoke clear English, which was great! He answer all my questions and even offer a little taste of horchata which was delicious! I had Pepper steak and my partner had Soup,  both dishes were delicious. Service was excellent, great atmosphere and food, food was delicious!!! for an unbeatable price!!! We will definitely come again!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Nk8yVFdnEAE",
            "text": "Les Daria un 0 si se pudiera por chavacanes. Pedi una tilapia entera con tonstones y lo que me dieron fue una miseria de filete que si acaso Era la Mitad de un filete de pescado y contaditos 7 tostones y Mal hechos. Ni siquiera tuvieron la delicadesa de preguntar si lo queriamos asi. Ladronasos Sean serios"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldXZfQm5BRRAB",
            "text": "Music is way too loud and is cash only, though they do have an ATM available. It seems to be more of a late night bar for men than a restaurant to eat at, as there is a bar, jukebox, poker tables, and pool tables. The pupusas are delicious, but the other food options are pricey."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOEtldVpnEAE",
            "text": "Tubo chido me llevo un compa salvadoreño soy mexicano.. chido"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtN2UycWtBRRAB",
            "text": "Las mejores pupusas! Mi lugar favorito por excelencia"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtenRHbF9nRRAB",
            "text": "A mi encanto la comida de otro países soy Dominicana"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMFpqOVVBEAE",
            "text": "I appreciate their gentleness... Nice pupusas"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NllqRzZBRRAB",
            "text": "Horrible es la peor experience salvadorian comida que e tenido fuimos por sopa de res y sopa de pollo estaban echadas a perder,las probamos  3 cucharadas y ya no las comimos y esas 3 bocados me enfeermaron, por favor denlen comida de buena calidad a la gente!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eHFfbFl3EAE",
            "text": "Friendly, clean, and good size environment. Limited seating, but overall good place. The food tasyes great and is usually prepared and nicely packaged."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NHRfanZBRRAB",
            "text": "Buenísimas las pupusas , llamas antes de llegar y listo para compartir en casa con la familia"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhem9XLXN3RRAB",
            "text": "It was good but they only accept cash though"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNElyYm9BRRAB",
            "text": "Goid place to eat quick  cash only"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBd2IyREZREAE",
            "text": "The food gets 5 stars it is always delicious & service is usually good but the last time I went it was horrible. They had a young dominican chick waiting the tables who completely ignored my family and I then began flirting with 2 men who…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeW9hNmR3EAE",
            "text": "So upon entering the store there is a menu outside with all the dishes and when you enter theres a regular store with salvadorian or guatemalan products, when you go inside and notice there are seats and food you might be tempted to try the food, i think you should. Not sure wiether its salvadorian or guatemalan food, however it was pretty good for what i got at a good price and it even came with handmade tortillas! Just wish there were menus there so i would know what i would want beforehand, pick what i want with ease and not annoy the workers there"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDb0xIVjFBRRAB",
            "text": "Love the convenience of having a Salvadorean restaurant close by, Their traditional dishes are delicious. The main dish I go in for is their pupusas. Try out their variety of pupusas from cheese to mixed (chicarron, cheese & bean mix)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdE4tRzRBRRAB",
            "text": "Very good food. It just wished there was delivery & that the restaurant was on any eating apps."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTanFXZXRBRRAB",
            "text": "I’m a first time customer and this place is trash! Don’t come here! they gave me old rice, the pusasa was dry, the tostones were badly made."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaGRtRy1RRRAB",
            "text": "Sólo he ido dos veces a comprar pupusas, y son buenísimas. Atención al cliente por una chica Dominicana, excelentes!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjd0xyRVNnEAE",
            "text": "Excellent food, evertime I eat here I leave full and impressed every single time"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJell1UF9RRRAB",
            "text": "Excelente lugar para degustar comida de el salvador y Honduras me pareció un excelente lugar puedes comer comida tradicional de esos lugares y la verdad me pareció excelente conocer ese lugar por su gastronomía y que puedes tomar cerveza de esos países"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpNmNhSkZnEAE",
            "text": "Es un restaurante salvadoreño que te ofrecen todo tipo de comida i es muy deliciosa yo siempre paso cenar ahí vicitenlo  se los recomiendo"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLODc3U2NBEAE",
            "text": "Excelente servicio al cliente y cocinan muy rico. Lo recomiendo... Díos bendiga los que hay trabajan."
        },
        {
            "date": "8년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3X1lHOEhREAE",
            "text": "Muy buen restaurante y bar visitenlo muy ricas pupusas esos que hablan no saben nada andaban borrachos"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaE02NXJBRRAB",
            "text": "Worst place to get food. Service sucked, took 20 minutes just for the waitress to take our order."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbzVIazJnRRAB",
            "text": "no warm approach. too serious. i ordered to go my meal.. food was overheated. and dry."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cnMyR1hnEAE",
            "text": "The restaurant had turn more into a bar for men but the food is good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVejV2OWR3EAE",
            "text": "I ordered bake chicken and rice and was given old soggy burned rice and old chicken ... definitely not going back"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3eXB2QzVRRRAB",
            "text": "Muy bueno  me encanta  sólo lamesera es bien sería amargada pero la comida es bueno"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3enVITlhnEAE",
            "text": "Excellent food but waitress needs improvement"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNzVuRUl3EAE",
            "text": "I am not sure. I did not eat. Went for work. The owner is paying minimum wage to workers"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVNi1xNktREAE",
            "text": "Si me gustó mucho la comida muy buena"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpZ3ZISXJBRRAB",
            "text": "My favorite place for pupusas ..and service is great."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNdjduckl3EAE",
            "text": "Good food. And the best Pupusas ever."
        },
        {
            "date": "9년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNnRUaVF3EAE",
            "text": "El dueño es un viejo creído la comida más o memos pero el dueño un tacaño ni aire pone  para que uno se sienta bien"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOE9HRi1BRRAB",
            "text": "You have to go this place, Their food is delicious 🤤 😋…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNGZyNkpnEAE",
            "text": "The pupusas here are delicious! As well as the horchata. 😍…"
        }
    ],
    "reviews_count": 56
}