{
    "name": "Addeo’s of the Bronx",
    "place_id": "ChIJlemYjaX0wokRWvFNrU9LlBM",
    "grid": "BX11",
    "address": "1056 Morris Park Ave, Bronx, NY 10461, USA",
    "rating": 4.4,
    "user_ratings_total": 556,
    "phone_number": "(718) 824-5036",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OR2JHRnhRMnRVYWxoUU4zSkZkMVpWTkRkalNFRRAB",
            "text": "Service from the staff is subpar - the cashier's annoyance appeared to grow as I canvassed the menu to view their offerings. Perhaps I caught him on an \"off day.\" I went over right over to  Emilio's of Morris Park where I received service with a smile. Thank you Rafael of Emilio's of Morris Park!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRGQydFdjVkZPTjFsUlFrWktaVlJSZWtVelJGRRAB",
            "text": "They left off a side of sauce for my cheese calzone order and when I called to have it rectified the manager refused to send a driver out to fix the mistake and hung up on me. They claim they don’t include marinara sauce with their cheese calzones. Are they even from New York? What kind of cheap nonsense is that?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVFYwMU5Za1JqVEdwWloyRndjMjV1WVRkSFZtYxAB",
            "text": "Very rude staff. I tried calling to offer a spotlight from a governmental administration, but the woman hung up on me twice. Unprofessional. Don't recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb2FIVkVaMDl3ZDBkSWNUZE1XWEpWTVMxc1ZXYxAB",
            "text": "I just can say… is my favorite place, 5 stars ⭐️ everything is perfect and delicious!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFJXWkhXVWRpVW10NGFXTjNSRVZwVUZSWmFIYxAB",
            "text": "Hit or miss. Insanely overpriced especially the pizzas which can cost over $40. This isn't a michelin star resturant for them to be charging outrageous prices"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOak0ycHRjakJHYlRWM2JGaG9ZWEZWTjI4eWVIYxAB",
            "text": "Food is very delicious. Hidden gem for sure. One of my fav spots for pizza. However there is one man who works there that has a terrible attitude. I come in often and he seems to instantly be annoyed and walk away while I’m in the middle of ordering my food. This really bothers me because I always try to be polite but his attitude sucks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNlQyVmpkMHRTVW1GS2FrUm9RekUwT1haU2MwRRAB",
            "text": "The pasta was under cooked! You can taste the sugar in the tomato sauce. Very noisy there,  couldn't hear anyone talk."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT2JEbE9UVEkyWjFKRmVYUk9URFJvVmtwWU1sRRAB",
            "text": "Food is mediocre. Overpriced. Spend your money somwhere else."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNck0wZm51MmJmN1lBEAE",
            "text": "Not hard to find an Italian restaurant in the Morris Park area of the Bronx, but the quality is not the same in all of them. We really liked the food and the service at Addeos. We will be returning, which to us is the best complement for a restaurant. And be sure to go to the back room!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX01pTHpNa015MWFREAE",
            "text": "Had a luncheon on Saturday for 12 guest and everything was excellent. They even took care of my early guest before I got there. Renato and the young man were so pleasant and kind. The owner of this restaurant should be very proud of the staff that works for him.  Thank u so much"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLblMzSk8zaXMtRVZBEAE",
            "text": "Great Italian food. The restaurant has a great atmosphere,  for fast food the front of the restaurant is a great place to eat and hang out. The back is elegant and the bar is well stocked. The back is great for dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNlo1S1dMeTQ3TkxBEAE",
            "text": "Awesome Italian restaurant!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdHZfTUpREAE",
            "text": "What a gem of a place. Food is awesome, but the service is next level. Couldn’t ask for a nicer, more accommodating waitstaff. we were a party of 7 with 3 kids and we felt right at home! mozzarella in carrozza, ceaser salad, penne alla vodka, and chicken marsala were all spectacular"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUpIYk9BEAE",
            "text": "I ordered a pizza, but it was bland, cold, and not fresh. Very disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJM1A3ZUVnEAE",
            "text": "Delicious pizza 🍕 😋 😍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cWViQ0tBEAE",
            "text": "At a confirmation for my niece\nFood cold\nSteak Well done when asked for medium\nCoffee cold"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aExpcWRBEAE",
            "text": "Food was ok wasn’t hot when it came out what kind of Italian restaurant doesn’t serve bread? we weren’t asked if we wanted anything to drink overall bad experience will not be returning"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d0kzS0F3EAE",
            "text": "I order their pizza pie all the time and side order of fried calamari too and taste really good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRXzV6Vy13RRAB",
            "text": "Best slice i have ever had...."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRanZmLXdnRRAB",
            "text": "Really great authentic Italian food, warm service and beautiful restaurant. Went with my sibling and I cannot wait to go back with more of my friends and family."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbDRyMldBEAE",
            "text": "Updated 2024,\nThey upgraded their quality from my original comment, with new owners. But lately as of 2024 forward, they improved their food quality substantially since the change over. Must try their rice balls..\n\nOriginal:\nThis used to best restaurant when it was called Captain’s with the original owners, but new management destroyed the food quality that it used to have. Avoid this place and move on to Nana kitchen, La Masa or Patricia’s…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOHR2VTdRRRAB",
            "text": "hidden gem\nthe front is a pizzeria, the back is a cute restaurant setting\nservice was top tier, very attentive to the point that I stained my shirt and they noticed i was using a wet tissue so they walked over and handed me a hot rag to help out\nit’s the little things that stand out\nappetizer we had burrata w tomato and roasted peppers\nFor the main course, we had chicken parm and penne a la vodka\nboth  very good w generous portions\nand my cosmopolitan was made perfect\nwill return for sure"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMFlEYTdnRRAB",
            "text": "The dough was very soft and everyone was so nice, overall vibes were great!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfclB2UERnEAE",
            "text": "Sicilian pizza was amazing and delicious!!! Definitely going back!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaS15WURREAE",
            "text": "Wonderful pasta and hospitality. Also had great fresh espresso martinis. Love this spot"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dEplR2xnRRAB",
            "text": "My first time there not a good impression the cook looked like he didn't want to work food he served was lousy."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeUtxUGRREAE",
            "text": "I went in here with my family because we love Addeo’s bread and hoped their pizzeria restaurant would be just as great. It’s not. Our pizza was ok, especially the crust (it’s obvious the owners come from a family that has been baking some…"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdHRMUUJREAE",
            "text": "En addeo's muy buena la pizza y la comida italiana en general. Es un lugar con una larga tradición de familia por casi noventa años, y el restaurante es un lugar muy tranquilo y acogedor para almorzar o cenar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYa3MyWjdBRRAB",
            "text": "this is the best place to eatAside from the luncheon prices, the food is delicious u must try it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcGQ2RUZnEAE",
            "text": "We had their pizza at work for the first time so I decided to order a pie one evening. I got a small pie with sausage and it was delicious! The food got here fast and was fresh. True NY pizza!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubmN5Q3VRRRAB",
            "text": "The best Gluten free pizza in the Bronx!!!!! Hands down! I will never eat gluten free pizza anywhere else!!!! Period."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHZEUUZ3EAE",
            "text": "I recently discovered a gem in my neighborhood that's been here for years, all thanks to their excellent social media presence—well done, it's definitely working! I’m so glad I decided to stop by and try it out.\n\nMy culinary adventure began with the burrata, served with fresh tomatoes and roasted peppers. What really set it apart were the balsamic pearls—simply outstanding. Choosing a main course was a tough decision due to their tempting menu, but I settled on the lasagna. Let me tell you, it did not disappoint. The lasagna was exactly what I craved: meaty, incredibly tasty, and the cheese was heavenly.\n\nI'm thoroughly impressed and already planning my next visit to try the other enticing items I missed out on this time. Hats off to the chef for an excellent meal and a big shoutout to the owner—keep rocking that social media; it’s bringing the crowds. Can’t wait to be back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIanF5N2JREAE",
            "text": "Customer service is bare minimum and close to nonexistent. Staff is not welcoming at all. Waiters are not clear about the menu. Food is alright tho. *THIS IS A RESPONSE TO THE OWNER AFTER THEIR COMMENT*. I am not trying to be rude. Your establishment is very clean and I am sure majority of locals love it. Based on my experience the other day there were two different burrata options. One in the specials menu that did not have any pepperoni and the other in the regular menu that did include pepperoni. This was my first time here so I was unaware of the differences or that there were even two different kinds. The waiter did not make that clear to me. Yes, telling the waiter about my dietary restrictions was a mistake on my part but I did not deem it necessary because I believed the item being ordered off of the specials menu did not have any kind of pork on it. If I misread that item that is completely my fault but from my memory I don't recall seeing any pepperoni on the burrata from the SPECIALS menu. Unfortunately I will not be back anytime soon and I wish your business the best moving forward. This review was not just a heated comment after receiving pepperoni. The waiters in the back were still not very welcoming. They were respectful yes but the atmosphere was not at all up to par considering the other establishments in that area. I hope you don't take this as a jab towards your business but just simply constructive criticism. All the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dTUyRUhREAE",
            "text": "The pizza is absolutely top tier, unbeatable. And the other Italian food is amazing. I like how the restaurant looks, it looks a lot better than when I last came. The service was great the waitress is very nice. The only thing wrong is the toilet being too small... I could not get rid of my stomach ache..."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReXBXWl9nRRAB",
            "text": "I visited six years ago and the place has changed in appearance and food. The atmosphere is great. We had a group of four adults. We ordered different items on the menu for dinner. Two of the four food ordered were great and reminded us of the great food we had before. The two other food were not great. One was a shrimp and lettuce dish. Shrimps were burned. The other was a chicken parm  and pasta which was hard. The chicken was overfried, the edges burned and chicken hard with plenty of sauce to hide the mess. We thought that since the place was renovated the experience was going to be great. Great looking place but food preparation not good. We will definitely not be dinning there in the future. There are other better places in the Bronx to enjoy an Italian meal."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpa1BmZ0Z3EAE",
            "text": "One of my favorite restaurant..excellent and brilliant staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaThUTEpnEAE",
            "text": "Best gluten free pizza in the Bronx."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMODlYbEl3EAE",
            "text": "The staff were all great, and the food was amazing. We started with the appetizer a mozzarella sandwich it was good the cheese and bread was well seasoned and the chesse was so good. Even the salad it came with was also good. I ordered the sangria and it was so good. Then I ordered the black sqid spaghetti with shrimp and tomatoes really good my boyfriend got the Sunday Gravy and he loved it as well. The dessert was great as well. I got the ricotta pistachio cake it was great light and delicious. My boyfriend got the chocolate mousse cheesecake and he loved it. Overall a great place to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MHA3N1d3EAE",
            "text": "Had a great anniversary dinner with my Fiancé here at Addeo’s of the Bronx, and \"Loved It\". Service was excellent and food delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcU9mTTJBRRAB",
            "text": "Beautiful chicken cutlet, Giovanni’s sangweech!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMmMtWUpREAE",
            "text": "They put Parmesan cheese on everything you order without even you asking . They don’t even explain than on the menu.Never ordering delivery from them again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcl9LQTBRRRAB",
            "text": "From outside, it looks like a small pizzeria, but there is an elegant restaurant at the back. We went to celebrate a birthday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENThmbWRnEAE",
            "text": "Food and drinks were excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkOUl2eUNBEAE",
            "text": "My favorite spot for pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxbk9UamNnEAE",
            "text": "My mom inlaw ordered lunch today and we ordered Cezar salad. And surprisingly the dressing they gave us is mayonnaise. Really?  We understand that it’s lunch menu, we ordered rice and we didn’t received it if not included in the lunch menu we can pay it separately.  We used to eat in this restaurant a lot because we like the food, we used to get side dishes like potato or pasta. So what is the difference when we ordered by phone , and we have to dine in (lunch in)? My mom inlaw called and complained but the guy who answered is not apologetic. And sounds irritated from the complaint.  Trying to justify irresponsibility, and inconsistency.  We are so disappointed."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbFl5TENBEAE",
            "text": "Delicious Food Nice Vibe Great Service! Waitress Fatna was very professional! Wine, Caprese, Lasagna, and Sunday gravy, meatballs sausage and homemade pork braciole! Keep up the great work! See you soon!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbElpeEZ3EAE",
            "text": "Food is always great (take our or dine in) - they have the most delicious bread, and that makes their pizza taste 10x better than any other place nearby.\n\nI recommend the Grandpa Addeo’s pizza which is such a legit pie and the Spinach Egg soup, a great comfort food.\n\nYou also can’t go wrong with any pasta dishes - they are all authentic and delicious.\n\nFriendly whether doing takeout or dine in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcG9mRXJRRRAB",
            "text": "My wife an I accidentally walked into this pizza store front with a hidden restaurant in the back, what a surprise to me. There was one waiter but her determination to serve every customer properly and promptly shocked me. Bravo to her."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnb3VPcDJBRRAB",
            "text": "Addeo’s is the best pizzeria in Morris Park. The owner, Larry, has done an excellent job hiring and training quality workers that are kind, competent and easy to be around. We eat here at least twice a week and will continue to do so."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcjdfUjNnRRAB",
            "text": "Menu selections can be better. Other appetizers for children,  young adults. As well as grill delights.\nOtherwise they were very attentive and food was good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbnYzUGVnEAE",
            "text": "Amazing quality and flavors in a relaxed setting. Even the bread is very fresh and unique. Was very impressed with this Bronx gem. Excited to take friends and family back to Addeo's."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMy0zeklBEAE",
            "text": "Expensive during pandemic and Seems like they are budgeting their portions now for 6 Shrimps with Linguine $30, no more side salad.  It's good but it won't be my go-to every week."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadUtpc0NnEAE",
            "text": "THE GIO SPECIAL.. oh my goodness just when you thought Italian food couldn’t get any better.. this sandwich is unbelievable. I need to come back for dinner but good lord youse all need to try this. !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c3BDeHNRRRAB",
            "text": "We went here both nights in NY The food and service were exceptional 👌"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcU16UW13RRAB",
            "text": "Nice Italian Chicken Cutlet Slider with fresh mozzarella roasted red peppers on an over-sized garlic knot the Pinot Grigio to was it down hit the spot. Can't wait to try more from them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOVAzS29RRRAB",
            "text": "The food is outstanding. Calamari is not over fried or oily. The meatballs are cooked to perfection. Delicious food, excellent service. AND I know this is going to probably sound ridiculous, they wash their lemons before slicing them (for the bar). I highly recommend this restaurant."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHem8yVFF3EAE",
            "text": "When we walked in we were greeted by a young man and was told where the dining is at the back of the pizzeria. The chicken tortellini soup, the calamari, pizza, sangria and cheesecakes were absolutely delicious. The atmosphere was great. Modern and clean. Our waitress Andreina was exceptionally sweet and made the best drinks and worked that dining area like a professional! She introduced us to the owner Larry and he was really nice as well...this was one of the best dining experiences I've had in a long time! Great food and great staff! When I'm back home in the Bronx, they will be my first stop for dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscXRHRW1RRRAB",
            "text": "Wanted to try a new place on Morris Park to support a new business and possibly look to cater food for the upcoming holidays. Ordered takeout. The eggplant dinner and eggplant parm hero was raw. Tough as leather!  They also forgot the side order for the dinner order. Called to inform them that the eggplant was literally inedible and that they forgot the side order. First they said they had no driver to bring out a new order and take back the bad one that I should go there. Asked to speak to the owner and was told he was the owner which I knew it wasn’t and called them out on it. Then was told the owner doesn’t like to be called when he’s off. Then they said the kitchen was closed. Had to return the food and got a refund. Very rude and unprofessional. Place looks nice on the outside, but beware. They could have gained a lot of customers especially now that catering season is here and I work for the MTA. I’ll never go back only because they way they handled the situation. The manager should be fired."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa2J5VFdnEAE",
            "text": "Went there with my husband Saturday evening and the sweet young girl working in the front convinced me to try a broccoli rabe with sausage slice. Was one of the best slices i’ve ever tried! Such a nice place for a relaxing evening."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPZ2N2Rll3EAE",
            "text": "Good pizza, terrible food. We Got the appetizer platter: Clams were sandy, meatballs tasted like dog food, eggplant rollitini tasted frozen, shrimp were soggy.. My drink was weak. Service was good. My wife likes her wine and slice of pizza. But you can get better pizza in a million other places, it’s NYC."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrN3EzNmd3RRAB",
            "text": "The best pizza and Riceballs in the Bronx. We travel all the way from upstate for them."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbE9DdWt3RRAB",
            "text": "Service was amazing, the food was delicious and made with lots of love. Andre our waitress was incredible. Please try her white sangria, I had a pitcher and it was one of the best I've ever had. Definitely will come back again!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb056UDhBRRAB",
            "text": "I'm always trying new pizzerias and I keep returning to this place. They make a great regular and specialty slice with good quality ingredients and dough and it's a large slice too. Many pizzerias today have cut down on slice size and it's…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNU42MmdnRRAB",
            "text": "Usually a good experience, I still hold them to a high regard, doesn’t mean I won’t call you out on this old lettuce and dry meat ball sub you sent me. Both taste horrible I can’t even finish them. Like I said, their food is always amazing just not today."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MDRQXzV3RRAB",
            "text": "The service sucks…the food is good, but the staff feel like this establishment is theirs. I ordered a large pie, when arriving to pickup, the staff said no you ordered a small pie. When my husband called to confirm, the girl who answered the phone hung up. This Is not the first incident. My husband spoke to the owner a few months ago, because this is not the first run in with his staff and all he could offer was a sorry and take a bottle of soda. This was never the case when Addeo’s was owned by Captain’s a family business.. I will never spend a dime in this establishment again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeHZ1dG1BRRAB",
            "text": "Great food, reasonable prices and our waiter was excellent. He really understood how to do that job properly by asking us which dishes we wanted when and making food selection recommendations. They should be very proud of themselves here."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdWRUd2N3EAE",
            "text": "Chefs excellent,  waitress are very professional & friendly! Appetizers are great & main courses come out on a plate for 2 people but it's one order ! Everything is great on the menu TOO! Worth, to go give it a TRY, YOU WON'T BE…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbGZUM1NnEAE",
            "text": "Great prices and even greater pizza. The garlic knots are definitely to die for. There's a restaurant section in the back that looks very nice but I stayed mainly in the front. The atmosphere was very nice and cozy. Would definitely recommend!"
        }
    ],
    "reviews_count": 68
}