{
    "name": "Pasta Pasta",
    "place_id": "ChIJO_oK86f0wokRG_C8AgOw9Jg",
    "grid": "BX11",
    "address": "2023 Williamsbridge Rd, Bronx, NY 10461, USA",
    "rating": 4.5,
    "user_ratings_total": 321,
    "phone_number": "(718) 892-9634",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTlRWWlBTR0ZDTlhabVUxQTVWV2RtWlVOWVdrRRAB",
            "text": "Came here for a quick lunch with my kids. The food was good and the service was great very welcoming. Our server Paco was very nice and attentive. We will be returning with the rest of the family."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMlNWUmhWWGM1TlhwTlNVSTFSVkJTWm5wdk9XYxAB",
            "text": "The rigatoni alla segretan is so good. I grew up eating there and I've since moved but I can't go visit and wanted my favorite dish. They haven't changed at all. Tasted the same as i remembered! Yummerz"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWmFFaENNM04wV2tWVFFWTTRUblkzVkRSd1QyYxAB",
            "text": "Nice place, good food, reasonable prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM05WbFFUMEo2VUdsbU9VZHpTRlpFVXpkV1dHYxAB",
            "text": "The house wine selections were excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFNqUk1hbkl6VDFaMFExSlhRMnBhYkZjeU5WRRAB",
            "text": "Ordered for first time Primavera. It was delicious. Want to dine in next time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGS1ZTMVZkMEZLYUVkdlF6SkhOelI1UlhOV2NrRRAB",
            "text": "I was told rice wasn't good to service\nSo I opt. To Broccoli n the Broccoli was Burned. I wasn't Happy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc2RESkJVbkpKWmtWbU5VOUNiSEJ0YVd0eGQzYxAB",
            "text": "Joe and staff are excellent- superb food and service- they treat you like family. The BEST\nHighly recommended!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odU1XUlZWSEZVWTFWSFdEZFdVVmwwZFhKZmEyYxAB",
            "text": "I love coming here. Had a reservation set for 10 people. It was an amazing experience, service was great and food was spectacular like always. The portions are not just delicious, but huge as well. Came to celebrate my mothers 61st birthday and it was a wonderful time, thank you Pasta Pasta"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvb0tQdXFnRRAB",
            "text": "Great place for families"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bXNUUjZBRRAB",
            "text": "Just fabulous\nExcellent food\nExcellent service\nEveryone must try. U will always return\nMenu of great food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRa2VMOHJ3RRAB",
            "text": "Great Italian food. Big portions"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN2NlYkxnEAE",
            "text": "Avoid this mediocre place at all costs, the food was utterly atrocious, the quality was terrible and beyod tasteless. I ordered the Penne Alla Vodka and I requested  for them not to add prosciutto(ham) since I’m a Pescatarian. The Chicken Alfredo also tasted poorly it had absolutely no flavor. I called the restaurant to make sure my order did not have meat and to request garlic bread since it was not an option on the menu. The gentlemen stated that he could send it but to add the Pasta E Fagioli as a replacement ($12) for the garlic bread, he would also make sure no meat was added to my food.  I called after I received my poorly executed order with horrible presentation and spoke with John, he immediately got an attitude and instead of addressing the issue he said  \"were too busy\" then proceeded to raise his voice and hung up(your attitude is disgusting and unacceptable John). I will never order from this place again and I’ll make sure all of my friends and family do the same. Almost $100 for overpriced nauseating food. I will continue to order from Original Joe’s Pizzeria down the block, unfortunately they don’t deliver to my area( excellent food and extraordinary service). I opted for the worst Italian food ever at Pasta-Pasta, save your money."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMDY2UDRBRRAB",
            "text": "Very nice and fresh!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eHZ1OEN3EAE",
            "text": "First time ordering to go, the portions were great, the food was delicious and packaged perfectly for travel. I would return and recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaW9HeTNRRRAB",
            "text": "Good service and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNGRfMDhBRRAB",
            "text": "My family loves eating here, our favorites are the chicken parm and shrimp parm.  This evening I had shrimp and calamari over spaghetti...It was delicious! The staff is always attentive and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibm8yQkZ3EAE",
            "text": "Everything was delicious. Lived around here for years didn't know about this place. Delish!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNGJEVWZREAE",
            "text": "Been going there for years!! Right across the street from my lawyers office. The best Italian restaurant I’ve been to in my life. Try the penne vodka. See you tomorrow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTRTUUNREAE",
            "text": "The owner and the cashier were the sweetest people ever, took our order out to our car. Helped me out with the menu, overall great atmosphere. Took only about 15 minutes for 3 big pasta dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLWV2T3JnRRAB",
            "text": "Great place and ownership.  My friend did his party there. Wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNTZMSlF3EAE",
            "text": "Authentic Italian food 😋 and great service 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6a0tQc213RRAB",
            "text": "Perfect"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc1ByZG9nRRAB",
            "text": "This restaurant has ruined me for all other Italian restaurants!  Everything I have ever tried there is terrific, but my all-time favorite is the chicken parm!  Yum!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNkwtc29RRRAB",
            "text": "They just celebrated their 40th anniversary on April 15 and the food and service is just as good now as it was when they opened.\n\nI’ve never had a bad meal in the 150 times I’ve enjoyed eating here. A must go Bronx restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cnBfVmZBEAE",
            "text": "Good food, large portions and very relaxed atmosphere. Would come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ck1xSGh3RRAB",
            "text": "Everything about Pasta Pasta is excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkem82Y2lnRRAB",
            "text": "I absolutely love this place, the food is exquisite, the prices are unbeatable and the staff is very warm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdHBldnhRRRAB",
            "text": "Great place with good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0LWJiSU5REAE",
            "text": "This place is a well-kept secret - an 'old reliable,' if you will.  Food is consistently good; even travels well; have ordered & catered from here several times - it's  always on point!  Service is friendly & attentive.  Always an enjoyable experience.  Highly recommend 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMTVTcUVREAE",
            "text": "Nice place go, Chicken parmigiana my favorite! Delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZ3JHZTZ3RRAB",
            "text": "Great! Always go for the Veal Villanova, my favorite! And say hello to Joe while you are there!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWXzZHOC1nRRAB",
            "text": "Loved it Food was great can't wait to go back very intimate setting"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWei1lVUd3EAE",
            "text": "Met family there for dinner. Food and prices were very good, was a little disappointed that the restaurant was not decked out for the holidays. Lack of ambience a real downer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGamVMNHV3RRAB",
            "text": "The atmosphere just right for friends catching up, first date, or date night. Our waiter was very attentive. We didn't feel like we were being rushed in any way. The food was very yummy. I will definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdVlQaUFnEAE",
            "text": "I am embarrassed to say that I had never experienced this great restaurant in my neighborhood before this visit last weekend. The food and service were unbeatable,!  I had eggplant parm; it was delicious, one of the best I've ever eaten!  It is a modest venue but the prices were right and I shall return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGc2JtaEh3EAE",
            "text": "Great service,, delicious food, great price,you have to try them ,,I have been going there for 3 years,,not just saying that because I have been going there for 3 years,the food is delicious,if it wasn't,I wouldn't be going,,you have to go, it's Delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMXQ2cGZ3EAE",
            "text": "why do people in general want to pay $50 for a plate of spaghetti noodle ,drowning in spaghetti sauce ..whats the catch to it.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc2V5NkFnEAE",
            "text": "We ordered takeout for the first time\nToday. I always drive past but I never ordered. Well I am so glad I did today! We ordered the Chicken Parmigiana! OMG delicious, fresh, mouth watering, yummy!!  I am very particular about my chicken parm. The line should be out the door for this food! You have a new customer! I would give 10 stars if I could! Thank you!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwX3FyQnZRRRAB",
            "text": "Hadn't been here in quite a long time and was pleasantly surprised to see the food was as good as I always remembered it to be! Went for lunch and the waiter was extremely accommodating! The atmosphere was pleasant and most of all the food was yummy! Definitely not waiting too long to go back! Great place! Highly recommend it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMU5QUnpBRRAB",
            "text": "Food is delicious\nStaff members are always polite and friendly\nThere is always something new I want to try"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKazZQR1dBEAE",
            "text": "Had takeout, and the chicken parm and chicken piccata were delicious. Great packing, by the way! Will definitely come back for dine in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXR6SDNRRRAB",
            "text": "Ordered the chicken parm, too much salt for my taste, chicken appeared overcooked. Ordered potato croquettes, for $3, l only got one??? That was disappointing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dTdHUGx3RRAB",
            "text": "The food portions are very generous. The seafood platter over linguini in a white wine sauce was delicious, with plenty of soft chunks of fresh garlic, 🤤 and the shrimp were butterflied and deveined nicely. However, the calamari could be a bit more tender. The rest of the food was delicious, especially those appetizers and the bread. The price for our group of eleven people was very reasonable and overall I recommend this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSazhEQmhRRRAB",
            "text": "The food was great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbmJYOXVnRRAB",
            "text": "Great food and great service. Place is a little outdated but the rest makes up for it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa2JqRmN3EAE",
            "text": "Always a treat to eat there.  Great service, great food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobGJXb21BRRAB",
            "text": "The veal parmigiana was fantastic! In fact, all of the food was outstanding! We were a party of 9 and everything was top notch!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbHBfUUVREAE",
            "text": "This was my wife's childhood favorite place. She was so happy to come back and see food still as amazing as then.  I  love my shrimp and arugula and polpo salad!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMHIyTm5nRRAB",
            "text": "The place was empty, but the food is as awesome as it ever was, in years past. Highly recommended!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdXJ1Vy13RRAB",
            "text": "We had the chicken parm, eggplant parm, and calamari. The food was delicious and servers were very attentive and courteous. I'm looking forward to returning with friends."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncGQ2SVVBEAE",
            "text": "Nice Italian restaurant located in the Bronx off of Williamsbridge road the food is fresh and delicious I got the chicken parmigiana it was really tasty and the service is good"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbmRHcWR3EAE",
            "text": "One of the best Italian restaurants I've been too they give you bread breadsticks and even eggplant appetizer! And everything was mouthwatering tried chicken parm and eggplant parm and it is definitely worth getting!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwLUx1dFBnEAE",
            "text": "Went with a friend and had a glass of moscato was really good the pizza was good and also the pasta. Nice people"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydHBHRFpBEAE",
            "text": "Good food but so disappointed not one dime has been put into upkeeping it.\nIt feels so institutional.  No warmth. No ambiance.\nTables are incredibly old, the flooring & the decor are so dated its a shame the owner does nothing to enhance it but the prices have gone up."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNmNlTjRBRRAB",
            "text": "Went there for Thanksgiving dinner. Food was good and the waiters very attentive. Didn't like that the holiday pies we're in the front as people walked in uncovered. Every time the door opened those pies were subjected to the elements. So I…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndGVXY2dnRRAB",
            "text": "This place is slow on weekdays but packed to the gills on Friday and Saturday. The seafood is fresh cooked well and the house wine is nicely priced. The ambiance is so so. They need a little bit of a make over but otherwise they get a huge A+."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVX3NxWG5RRRAB",
            "text": "We had a birthday dinner for my mother and nephew here, the service was excellent beyond my expectations, the invitees were so impressed with the service and food that several of them said it was the best dining experience they’ve had in The Bronx. There are few words to express my experience other than outstanding."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdTdDbC1RRRAB",
            "text": "Homey, authentic Italian restaurant in one of New York City's iconic Italian neighborhoods, Morris Park. The service was great as our waiter and other staff members were very attentive. The food was delicious, though a bit on the pricier…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBX3JQc0pREAE",
            "text": "I had shrimp scampi and my wife had Chicken. It barely had any flavor and the soda was in a small wine glass that cost $2.95. We were not impressed. Golden Eagle restaurant just a block away is better"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVOWFxWkRBEAE",
            "text": "As a regular customer was disappointed at service and attitude of people working in restaurant.  Ordered food to be delivered to my son while away.  Person that took order wrote wrong number cell number down.  Delivery never arrived and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNHRLQW9BRRAB",
            "text": "This place is a real gem. Food is always tasty with the freshest ingredients used every time. The customer service is also top notch with the staff always willing to answer any questions and make recommendations. This is my go to Italian restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcmRubE1nEAE",
            "text": "I don't know what happened, I used to love the food. However this time I got pale rubbery calamari, and shrimp scampi that was not scampi. All of it went into the trash. Wasted 48 bucks."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcnV1UlVnEAE",
            "text": "Best waiters of any local restaurant.  Food is outstanding and you get a very nice size portion for the money.\nIf you want excellent italian food and be treated with respect, this is the place you want to go to if your in the Bronx."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJajd2bmR3EAE",
            "text": "i like my pasta and clam sauce and fried fish was fresh"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRX0w2YmtRRRAB",
            "text": "Service, service,  service  unbelievable. Waiters took care of every person as though you were the only one  dining.  The food from Pasta, salad, entre  to cheese cake,  all excellent.  We were a big group occupying a private room.  Service flowed like a charm.  Luncheon in honor of Patti Doyle Galluchi."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdTlfR3FBRRAB",
            "text": "I went to a retirement party on Sunday, food and service were great. I would recommend Pasta Pasta for a private party. I lived in Morris Park all my life and usually don't go out to eat in my own neighborhood, especially for Italian, since…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX2JpaTZnRRAB",
            "text": "Excellent Restaurant - Highly Recommended. The service & the food were equally superb. Only downside  (& it's not even their fault) is that parking is such a pain; mostly street parking w/ only 1 hour meters. Do not let this discourage you - this place is fabulous"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3OVA3dzlnRRAB",
            "text": "Always amazing food! Every special is delicious, family oriented and have been here for many generations.  If you want authentic Italian food with great service, this is where to go!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNzlQbS1nRRAB",
            "text": "We started with the clams casino! Soooo good. Other restaurants try to pawn off clams casino that are horrible! These were made so good.\nI had the Osso Bucco which was good and plenty of it. It was over risotto. My…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbnQtSFZBEAE",
            "text": "Family oriented atmosphere. Good quality food. And excellent staff in meeting your dietary requests. Above average service. Highly recommend..."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcXJLX1JBEAE",
            "text": "A classic Italian fare, with great atmosphere and seating arrangements with the selection of wine to make for a great night. Unfortunately some of the specials where not well executed, but with 40% of the other food being fantastic it was an overall good meal"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0LU1EQU93EAE",
            "text": "The food here was amazing... Pork chops for tender and juicy chicken Villanova amazing... the service is always so lovely it's quiet and romantic the appetizers are delicious... For a quiet evening with the one you love this is the place to go."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZaTV1YXpBRRAB",
            "text": "Located in the Morris Park section of the Bronx. Very friendly and attentive staff and the food was delicious. Big portions so you will probably have leftovers. Great place for a delicious Italian meal!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcDVqNDN3RRAB",
            "text": "Had the Stuffed Avocado appetizer which was delicious. Unfortunately the main course which was Chicken Scarpielllo which I asked for boneless was not so good. Chicken was overcooked & very dry. My husband had Chicken Marsala & he said it was good."
        }
    ],
    "reviews_count": 74
}