{
    "name": "Morris Park Pizzeria",
    "place_id": "ChIJhV3ZTJb0wokRwAY1IVYzykk",
    "grid": "BX11",
    "address": "656 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4.5,
    "user_ratings_total": 322,
    "phone_number": "(718) 931-9191",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRlgwNU1NMHhHYnpOblgxWlJSR2RmVW5GV1puYxAB",
            "text": "So far , the best pizza I’ve ever had! Recently bought 2 regular slices and the slices not only were very good , but big as well. It’s soft and less crunchy, which makes it easier to eat. The service was great, and overall, the best place to get a slice of pizza!! Definitely worth it!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJX190Zmk4cGZtaVh3EAE",
            "text": "Small Pizze up from $7 dollars to $14\nI like it much better when the old guy was there Really Italian pizza?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvek5TbDNnRRAB",
            "text": "Worst pizza ever they cut it so not evenly. I don’t know if they. Played with it but it was so wrong looking pizza never going to buy from this place ever again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMG9hbm9RRRAB",
            "text": "Way over priced  not clean looks nasty be afraid to purchase anything again thru away 3 quarter of meat and cheese canzone nasty"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dnRQZkZBEAE",
            "text": "Good pizza"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b291dTBRRRAB",
            "text": "I love the bacon slice."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMHRMOUF3EAE",
            "text": "Amables y atentos con tus pedidos"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURveEszZmJnEAE",
            "text": "Great place to eat pizza and other stuffs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLU1IMjlRRRAB",
            "text": "Excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbUlxUUVREAE",
            "text": "THE BEST PIZZERIA I CAN EAT IN MY LIFE BETTER THAN DOMINOES WAY BETTER GREAT SERVICE THE OWNER IS A WONDERFUL NICE GUY 💋💋💋❤️ haven’t ate from here since I moved but will soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcGNiVnlBRRAB",
            "text": "Only come here for pizza. The chicken parm and garlic bread 👎🏽 the chicken parm had no sauce. The garlic bread taste like only garlic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidzludVhnEAE",
            "text": "Bad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaDdLaGJ3EAE",
            "text": "The man in the front with the blue Dallas cowboys hat was very rude as my friends and i were trying to order. We were all standing in a line, He took 1 of our friends order first, put in her order, then left to the back, did not acknowledge the rest of us, skipped us to take the next person BEHIND us. it literally took us 5 times to call him back to take our order. When it was our turn and we called him he said \"estan llamando\" two times, mimicking us because we had to call him over for some service.\nHe then proceeds to ask why we didn't order as a whole when we were all paying separate. I am a regular there and the fact that no one had the decency to even acknowledge and approach we immediately left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNm8zbGpRRRAB",
            "text": "I had pizza and wings it was great would Recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdy1HekJREAE",
            "text": "Great food. Good service. A little pricey for the area but service and quality makes up for it.  Chicken tacos are my favorite. 😀"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLUk3ZHF3RRAB",
            "text": "Saw a comment about this spot having a great margherita pizza, decided to try and I can't lie, that comment wasn't lying. I always get a Margherita pie! Always the same! Everytime! Never had a bad Margherita from this spot. Just thinking about that Margherita.....bruhh, make sure ya order that! Get a large! I don't even know if they do X-Large, if they do, order that because you would want more. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMEp1TVlnEAE",
            "text": "The flavor,  the taste and the food went down ever since the old owner Angelo owned it. The only thing that went up were their prices which isn't deservable. Who observe to charge sauce separately from the garlic knots and they're so darn small,  no one sells sauce separate. The pizza lost its taste along with the rest of their food. I think they're nuts for raising prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaWNLUEpnEAE",
            "text": "Great service . Very respectful.  Profesional and great friendly atmosphere.  I recommend this location"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NkxtczdRRRAB",
            "text": "you guys got my food wrong, but the food was good regardless. Maybe get a new person to take calls?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOHZITzJ3RRAB",
            "text": "The pizza 🍕😋 is good 👍😊 that's all 😁💯 I can say ☺️😁👋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbEtyeU9BEAE",
            "text": "He makes it ur way!! Great local spot"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOF9YZmVnEAE",
            "text": "I got 1 slice of pizza and penne alla vodka with grilled chicken. The young lady at the front was very kind. Loved her energy and the guy was very kind too.\n\nLove love love the pizza. It’s pretty big for that price.\n\nMy only complaint is the Penne alla vodka with grilled chicken. I’ve had my fair share of this so I’m familiar with it. Though for some reason, it was very oily. I’m sure everyone makes their pasta differently but mine kinda made me lose my appetite from all the excess oil. I kept mixing it and somehow it was still there.\n\nAlso idk if there black pepper or parsley but it makes the sauce flavor taste.. odd.\n\nOther than that, I would definitely buy pizza from here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMUlUT2JBEAE",
            "text": "Morris Park Pizzeria offers a solid dining experience. The staff is friendly, the food quality is good, and their pizza crust is particularly noteworthy. Worth a visit for pizza enthusiasts."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3AzN2JBEAE",
            "text": "Best pizza around"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbnJQcDJnRRAB",
            "text": "Great “local” pizza. I think it’s better than the places down the street in Morris Park neighborhood area. Thick crust, big size, not too much garlic in the sauce. For 3 bucks can’t beat it!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaHI3aGR3EAE",
            "text": "Muy ricas pizzas y pastas, a un buen precio."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4c2RESkVREAE",
            "text": "Been going here for 22 years"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eHJpZE1BEAE",
            "text": "Best priced pizza around! And they deliver now!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ME1PclRBEAE",
            "text": "Had a really good slice of pizza and what is becoming my favorite pizza place. And they make all kinds of pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazdlaTNnRRAB",
            "text": "Love this place and the people at great.  Best pizza in NYC"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSc3FlWWxnRRAB",
            "text": "Love my beef patty with extra cheese and it was the 💣 bom"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURod1l5RERREAE",
            "text": "Awesome"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaXNUSWxnRRAB",
            "text": "The lady that answered the phone was so nice .The best pizza ever !I love it .I am still eating right now .I had to pause and give them a good  review ASAP!Great  service and excellent pizza .Did not disappoint..Thank you so much !🙌…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcE5USG9nRRAB",
            "text": "Big slices small place but the pie was tasty and Hugh. Reasonably priced as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCalpHYlFBEAE",
            "text": "It's not a fancy pizza restaurant it's a plain old NY slice of pizza spot and it's so much better now that there's new owners. Thank you! Needed a good slice walking distance from home and I found it here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNllPQjBnRRAB",
            "text": "Hawaiian pizzia was very good, big slices too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla0pPdTJRRRAB",
            "text": "They have great tasting food and great prices! Very good pizzeria"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MllqWFFnEAE",
            "text": "The pizza is $2.50 and it's a perfect slice of deliciousness"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeHFhbHFBRRAB",
            "text": "Great pizza, great wings and friendly staff"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaXVlOXdnRRAB",
            "text": "Pizza de primera esta muy buena y mucha variedad 😋 👌 😉"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaGR2M2hBRRAB",
            "text": "New ownership, pizza is actually better now, tastes fresher"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMDdXcjVBRRAB",
            "text": "I love their pizza❤️❤️❤️🤤🤤"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtc3N1VFRnEAE",
            "text": "I want to stared off bye saying I’ll lived here over 13 years and never had a problem with they pizza into the own sold to this other people. I went yesterday night and the cook had his two daughters in the front with him while they was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdk0yVHBBRRAB",
            "text": "Under new management pizza not the same but it good sauce is a lil sweet if you in to that…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaDhyN2xBRRAB",
            "text": "I would highly recommend this Pizzeria. The store serves delicious large slices for only two dollars(which is definitely worth what you are getting). The employees make the store feel more welcoming smiling, starting conversations and the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdXAyZWdnRRAB",
            "text": "This pizza store was great and delicious. Angelo was very kind and happy making his pizzas. Maybe I can stop by for a slice anytime soon. Great vibes 30 years of experience well done body"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVczZiOVlBEAE",
            "text": "From Entertainers like Frank Sinatra, Bedstuys 1st Lady, & LA 2 NYPD, NYFD, MILITARY,~2  Neighborhood Regulars, Angelios Place is a SAFE inspiration 2 all!!  Connecting Love thru the BEST original 🍕 PIZZA in the BX!!!  Morris Park. True Italian Pizza, where all people get a taste of 🇮🇹…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjeDZydkZBEAE",
            "text": "I have been going to this pizza shop since the early 90's the pizza is average taste with big slices and the prices are reasonable. However, I recently went and observed Angelo not wearing a masks and not insisting the customers wear mask…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NVoycVFnEAE",
            "text": "I am new in the Bronx and with my job I have to move to different locations so I have tried so many pizza places because I am absolutely a pizza lover. I really have to write a review to this place to share with everyone that Angelo makes…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRem9lMDRBRRAB",
            "text": "This spot is hidden. But it has Quality pizza and other goodies.  Angelo is always very welcoming and very friendly.  Prices are the best deal for the the buck.  It Just can't get better in this neighborhood.  Old school stuff .!!! Amen"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5dXF1ZERREAE",
            "text": "Hands down they have the best pizza in Morris Park. I said the same for another pizza place, however that was before I tried the pizza at Morris Park Pizzeria. For $10 you get a bigger personalized pizza and the flavor is second to none in…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVaEoySURBEAE",
            "text": "I been going to this place since I was a kid, before Angelo owned it. Old mom and pop had that authentic Italian flavor and when Angelo took over he kept it true to them. Great pizza. One of the best in the city!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdktDNHhBRRAB",
            "text": "For $2.00 a slice you can't beat the price. Been coming here since I was in my 20's, I'm 48 now and never had a bad moment.\n\nAngelo (the owner) is a nice man. Very pleasant to talk to. He currently has a special where after 9pm everything in the glass case is $1.00 ( except calzones ). There's also a special 2 small pies for$12.95 Very Affordable.\n\nThe shop is small and seating goes quickly but he gives you a huge slice of 🍕 pizza for $2.00. You can't go wrong with that.\n\nHis large pie is humongous and you get a free 2 liter of soda to go with that."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhb3N2Q193RRAB",
            "text": "Generous amount of properly cooked cheese, but  light on the sauce.(really couldn't taste it)\nDecent size slice for $2.50.\nMedium thin crust,\nbut too much of the crust is left uncovered.\nCrust flavor is average , kind of reminds me of a soft pretzel.\n3.8 Stars."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dXR5cjFRRRAB",
            "text": "Best Pizza in the Bronx! Besides the food being great, the owner Angelo is one of the nicest guys you'll ever meet.\n\nI've been going there for 10+ years, and Angelo has always been a great example of what consistent entrepreneurship looks like.\n\nTHANKS ANGELO..."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcnJMeHZ3RRAB",
            "text": "Hands down THE best pizza in the Bronx!! I've lived in the neighborhood many years, and there's plenty of good pizza, but Morris Park Pizza is my absolute favorite! I have family who visit occasionally and they ALWAYS want to grab a slice…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3X08yS0xBEAE",
            "text": "I live in this Neigborhood for 15yrs, and visited Angelo's Pizzeria many time's. Love his Slice's they are big for only $2.00 dollar's. The Garlic Nut's in the jar as you walk-in are delicious. Owner great person and personality recommend his Pizzeria to anyone..."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOU9IX2NREAE",
            "text": "Angelo the owner is a great guy, the pizza slice is delicious and very affordable. I love the pepperoni rolls. It's more of a takeout place for me but there are a few tables available."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpMGVUZG1BRRAB",
            "text": "Literally my favorite pizza shop. Been going there since I was 6 and my mom and dad way before that. Their pizzas are amazing!!!! Of course everything else is good too but a slice with extra cheese and pepperoni is life"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjdzd1TGt3RRAB",
            "text": "I’ve come to this pizza place ever since I was in Kindergarten and now I am a Junior in college. My family comes from another country and always wants to have this pizza. Will always be delicious and hold a special place in my heart! Angelo is simply the best"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzc1k2YmFBEAE",
            "text": "This pizza shop is literally part of my family! Very welcoming and friendly family orientated place... The pizza is affordable and delicious! Crust is perfect and the sauce is exceptional! My kids won’t get pizza from any other pizza parlor in town!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdTdIR2hRRRAB",
            "text": "I called to place an order at 7:04pm. Angelo told me it would be 20-25 minutes. I got to the pizzeria at 7:20pm expecting to be a bit more of a wait but as I sat he began to make my pizza. It is 7:50 pm and my pie is still not done. Don't go if you want a pleasant experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMTdUcy1BRRAB",
            "text": "Best pizza around PERIODT! And trust me, I have tried the pizza all around. The owner has been there for a long time. Pizzerias come and go and they are still standing for a reason. Theres also a great sense of community there. All of the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMnBxc0dREAE",
            "text": "Whenever I'm in the Bronx I make it my business to eat here. The best pizza in the Bronx"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaFlETjRnRRAB",
            "text": "I have been eating his pizza for 20 yrs. They are good and big. The corner pizzeria theirs is greasy and smaller and cost 50 cents more. I will stick to this one for the many more years I am around."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZczdUem9RRRAB",
            "text": "Great pizza and pies usually done in 15 min. Also has really great prices. If you ever get there after 9pm anything on the shelf is 1 dollar. !!!!!"
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMDcyNXpBRRAB",
            "text": "It is the best pizza! Signore Angelo, the owner, is super nice and kind he always greets you with a good attitude and a smile on his face. :-)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOVp5NjBBRRAB",
            "text": "Used to eat here as a kid, and the pizza was the best pizza ever back then. Visited the neighborhood since then, and it's still the best pizza I've ever had"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5dHQ2TzZ3RRAB",
            "text": "I have Been coming here since I moved down the block from the store.  He has great Pizza, great prices and Angelo is genuinely nice guy."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNFAtY1N3EAE",
            "text": "my ex boyfriend use to take my children and i to this pizza shop five years ago, they're slices are big, and their pizza pies are huge!!! we loved their pizza, now that i found this pizza shop, hopefully i take my children there and have their slices of pizza"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVNUlyek5nEAE",
            "text": "Love love love their pizza !!!.\n.. prices are inexpensive... owners are very friendly.  My kids give it a thumbs 👍🏽. This is my go to pizza shop now…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMktMSm1RRRAB",
            "text": "Best pizza for two dollars am from the west side of the bronx and I come here to get my pizza it's very good love the sauce and cheese they use"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLX3RPWThBRRAB",
            "text": "Great place amazing pizza at an extraordinary price nowadays spectacular service makes you feel at home within this business also a family feel environment."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnLTh6ZURBEAE",
            "text": "We have many pizzerias in the area, but this little place has one of the best in town!   Very good and friendly service, and good prices."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweUlHa0FnEAE",
            "text": "Loved this place. Ordered regular plain  2 slices . Their pizza was okay. Not the best of the best."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRZzhHdTJRRRAB",
            "text": "My husband and I go there for the pasta. We usually have the spaghetti and sausage and it's really good. And he does have the best prices in town!"
        }
    ],
    "reviews_count": 76
}