{
    "name": "Golden Eagle Restaurant",
    "place_id": "ChIJQ0TT-6T0wokR4pDLOBaH094",
    "grid": "BX11",
    "address": "975 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 4.1,
    "user_ratings_total": 469,
    "phone_number": "(718) 863-4028",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVpERlVRbVprUnpJNFQyeHZjak5WVWtSZk5YYxAB",
            "text": "Awesome place to chill and eat"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVYxSjZOSGgyZG1SSlJXVTRXVGhLTmpWemEyYxAB",
            "text": "The waitress never ask anyone if they wanted something to drink the entire time.. Broken English..\n\nThe Greek salad was 99% lettuce.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbU1IaGlRa2RoUjFGZmNGRXlSMTlMT0hKb1dGRRAB",
            "text": "Really fresh and delicious food. Like really fresh. this is my favorite diner of all time! The service is excellent, and Annie is the best waitress ever. She’s attentive, goes above and beyond, and truly makes you feel like family.\n\nI highly recommend the wraps, especially the chicken Caesar. The fries are to die for, the breakfast platters are fantastic, the steak sandwich is full of flavor, and even the chicken tenders are surprisingly delicious.\n\nThe diner is always very clean, and after their recent renovation, it now looks modern and inviting. It’s truly one of the best remaining diners in the Bronx, and for good reason. Prices are very reasonable, and the portions are huge. Whenever I’m craving a great meal, this is my go-to spot. Trust me, it’s worth it! If you’re ever in the neighborhood, just go stop by!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NFJEbGhjVUZ2WkZKd2JscFdZaTB6ZFU5MFMzYxAB",
            "text": "I live in Alpharetta GA now and was back in The Bronx visiting family. Stoped in the Golden Eagle and was not surprised to find out that they are still the BEST diner in The Bronx! Food was excellent and the service just as good!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ak0yWlBURzV1VFdScFJUbFhhRlJrUTBkNWNsRRAB",
            "text": "Since the first time I ate in it, I fell in love with the service. Waitresses and waiters are very kind. I am convinced that service is the key to a restaurant success."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFlXUjNVVWhDVmxKbVRrVnBPVTlLVDJGNlZFRRAB",
            "text": "My first time ordering I got a philly cheesesteak with fries and a strawberry smoothie. The philly has no flavor, straight up taste like nothing. The smoothie is as if they blended strawberries with water. The only good thing about what I ordered was the fries."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZUpzSnJEeWZtRW1BRRAB",
            "text": "Great food and service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLMlh6OFNHa0ozR0RnEAE",
            "text": "Very clean, fast service. My bronx breakfast hit the spot. Very good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMF9maTZBRRAB",
            "text": "New rénovation isn't terrible although I miss the old 1980s looking Eagle where we celebrated my grandfather's retirement from the 49 Pct in 1998"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvby1hQThBRRAB",
            "text": "This place used to be amazing. I had 5 stars for years. But this is the second time I was delivered croissant French toast that was literally black. If you mess up why would you sneak in burnt food? Just re do it. Really upsetting. The food quality isn't what it used to be now that they renovated."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGF2M3R3RRAB",
            "text": "I love the service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOUxDUjBnRRAB",
            "text": "Not the same as before the renovation\nFood quality is below average as is the service\nComplimentary glass of water is common procedure but not here?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcU95c1J3EAE",
            "text": "The diner is nice and cohesive. Although it was busy, my order took over 20 minutes to be taken.\n\nWhen my order arrived, it was incomplete as well as the people sitting next to me. The waiter apologized to the people sitting next to me and just said they were busy. Although they Apologized for their mistake.i don't think I'll  be coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRa2ZXWnZ3RRAB",
            "text": "Food is overpriced."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX0lmZkNREAE",
            "text": "First timers and must say everything my family and I ordered was delish! Our server Annie was amazing and hospitable!\nI had the chicken franchise and YAS! It was so good over linguine…\nWe will definitely be back and making this our new Sunday spot.\nAlso the restaurant seems newly renovated so looks very nice and Clean ( easy street parking as well). Thank YOU !🌺🙏🏼"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ1phTWp3RRAB",
            "text": "Friendly staff good food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaVluaExnEAE",
            "text": "Honestly its superbowl sunday i called them to order wings and the guy told me 14 bucks which was fine, the delivery guy comes and then tells me Its 20 im like what i called the guy on the phones telling me 14 and this driver telling me another so that got figured out. The wings under cooked legit cold.i call back and then asked for a burger ok guy comes order comes how i didnt ask at this point im over. I was suppose to pay a 6 dollar difference for fries ans i did and didn’t come how I asked so i called back because they charged me for something i didnt get and then the guy tells me i gave him 5 not 6 meanwhile the first time i had a 20 he gave me 6 back and thats all the cash i had so i said are you calling me a lier then he goes its ok ima have another guy come. Worst experience ever I dont wish this upon any1. Ill never call them again…… Straght up horrible experience and garbage service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBb2N1Y19BRRAB",
            "text": "Place started at a 5 for me but unfortunately at 1 for my last few experiences. Everytime I order and I'm only couple of blocks away , they always go to the wrong address and my food always comes cold. Also lately every time I order it's either something missing or the wrong order. I ordered breakfast at 915 this morning still waiting for my full order which i paid for.Unfortunately looks like I'm going to have to find another place for me and my son to enjoy food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaHA3Wm5RRRAB",
            "text": "My go to diner!\nLove their food\n& Rosie she is the best! knows my order as soon as I call. Love the renovation"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX0wtaThBRRAB",
            "text": "Love eating here the service is great & the food is great. The sugar tray is neat and clean, with no issues. You will enjoy the custom wallpaper."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMHMyd0tnEAE",
            "text": "Awesome staff and awesome food! We always feel welcome here and are even recognized by some of the people who work here (we HAVE dined here A LOT). 😆 Everyone's always friendly, the food is always cooked to perfection, and it just feels like a second home. Nothing, but good vibes coming from this place! Thanks for always taking care of us, guys...you're amazing!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NmFieVpnEAE",
            "text": "We come here at least once a week since way before the place being renovated. The food always great. You could modified the food as you prefer. The portion always big. I always asked our favorite server (Rose) to give me less than the original portion because most of the time I couldn't finish it. Rose is awesome! We always come whenever she's around because she knows and remember things that we like or don't like. My son loves her. Like today My son and I came, the place was packed. It was almost a full house. She saw us and told us that we can seat anywhere available and she brought out my son's favorite drink. And She knows what his usual order. Its feels great to know someone remember things that you prefer. Keep up the good work, Rosie! You are awesome! And for the cook, thank you for always making my order so yummy!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd183aUVREAE",
            "text": "I order breakfast a few days a week from the Golden Eagle and I love how welcoming and kind Rosie is! She greets me in the morning and even remembers my phone number when I call. She is an amazing part of the Golden Eagle team!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLWZqVW93RRAB",
            "text": "Great diner, great staff"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzemVIcjBRRRAB",
            "text": "The service here is Amazing! Have gone several times and each time was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzektlNGJREAE",
            "text": "Come on guys please stop lying about this restaurant. They over charge  and don’t give you the right portion of food. Idk how in the world they still open for business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucjlERm5RRRAB",
            "text": "Awesome restraunt wheelchair accessible and good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NTVlNTlnRRAB",
            "text": "First time ordering from this place. I ordered a beef burger and added mushrooms and onions, it was so amazing. The lemon merengue pie was delicious also. I will def order from here again and the staff was friendly over the phone. Thanks again for the delicious lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOFk3T1FnEAE",
            "text": "Came in during my lunch break on a Tuesday.  Ambar & Jesse greeted me promptly and were attentive. Food was delicious. Place was clean! Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaDZ2U2ZnEAE",
            "text": "Great Diner, service is fast and staff is freindly and not so expensive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNXI2UVlREAE",
            "text": "Gave me explosive diarrhea"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbHJmRHZnRRAB",
            "text": "This diner has very delicious food at reasonable prices; however, the service leaves much to be desired.\n\nWith the recent renovations, this diner looks amazing and is well designed. The booths are comfortable and the environment is very family friendly.\n\nI visited on a Tuesday morning with my family, including a baby in tow, and there were high chairs available for us. While we were seated right away, it took time for the waiter to greet us and share menus. It wasn't particularly busy so I'm not sure why there was a delay. Although it took time for us to put our orders in, our food came within 10 minutes - very hot and delicious!\n\nWe ordered the Bronx breakfast, Colorado omelette and the Funny Face pancakes, with a side of grits. Everything was perfect!\n\nI'd recommend this place for anyone looking for great breakfast food in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMUxEa213RRAB",
            "text": "One of the worst restaurants. I rarely write reviews but this one is it. The red hair server has a very rude tone and is overall rude. Additionally, they didnt even tell us one of our order is not available until we asked an update on it.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdUxHMklBEAE",
            "text": "I love me some diners but this right here is the best I’ve had in a while. Everything was excellent definitely making it my go-to diner from now on!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aTlDNVJnEAE",
            "text": "Good service\nClean\nStaff is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaS1Da3NnRRAB",
            "text": "Breakfast was delicious and service went above and beyond to make sure all of needs were met. Very attentive staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOU02c0tBEAE",
            "text": "Ordered on Grubhub and they forgot to make my order. When I called after the order was 30 minutes late they said the order would be 15 minutes but they wouldn’t answer if they had even started the order. Contacted grubhub and they said the just started the order so i cancelled it. The restaurant did not care at all that they forgot my order. They could have offered something for free or even said sorry but they just kept repeating that it would be 15 more minutes which was a lie. Also they put me on hold and I could hear them laughing and not concerned at all. Very rude."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5d2QtYThRRRAB",
            "text": "This diner was recently renovated and it looks great. The arrangement was wonderfully set up. Food and service were perfect.  Will definitely be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqem9fZVdnEAE",
            "text": "The food was delicious me and my family ordered for takeout. I would’ve given them a 5 stars but the lady in the front was extremely rude on the phone and when my mom went in to get the food she completely ignored her so another man had to come had to come and help her."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREd1lYSTh3RRAB",
            "text": "Sweet darling place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbmVhSUZBEAE",
            "text": "So u waited patiently in the neighborhood for this place to open. The decor is amazing\n... Love it!  Greeter was good. Waitress acted as though she were making me a favor.  Coffee fantastic. Hence the reason for ONE star. Neither my friend or I ate more than  two bites.  Waitress never came to ask \"How is your meal?\" She must have known. I will be back when you get a new cook."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdXZPcDVBRRAB",
            "text": "Great neighborhood diner. Excellent food and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcEpmYUZREAE",
            "text": "I came here a wk before it closed down for renovation and food and customer service were great. I come back after renovation and everything is even better food was delicious great atmosphere and customer service was beyond great. Mary, who was our waitress was very professional, attentive and very friendly. Definitely recommend this place for its great service and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEME82ZnRnRRAB",
            "text": "Recently reopened, newly renovated. Very welcoming atmosphere. Annie is such an amazing server, she makes you feel like you’re family!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd01LRVV3EAE",
            "text": "Wonderful place. The waitress was sweet and very pleasant. Definitely I’m going back for dinner. 10+for Annie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cTh5Z0pnEAE",
            "text": "I’ve always loved this location and the food was always amazing but going back after the renovations was such a treat! The service was great, food amazing as always and the new deco def gives it that extra razzle dazzle it needed."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0d2RYSVZnEAE",
            "text": "Servicio bien rápido, excelente comida."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMWZDUmFREAE",
            "text": "Large selection of food and huge portions. The service could be better. I had to track down my waitress for a second cup of coffee. That day the restaurant was kind of busy though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbnNtZWhRRRAB",
            "text": "This place is the best breakfast place I have ever had in a long time. Barely any wait to be seated. The food came in no time and was amazing. As you can see, i got their nutella pancakes and the pile of fruit was an amazing bonus. I also got a delicious chocolate milkshake and a nice egg. Staff were all super nice. Come ASAP!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHME03WENBEAE",
            "text": "Great and delicious food everything displaced was 50. Drinks were wrapped and baggy with condiments"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdnZfOHVBRRAB",
            "text": "Great plan we for a Sunday breakfast for the young and older.  Good hospitality,  delicious food,  excellent service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteFplZ2xnRRAB",
            "text": "Good place for breakfast and lunch. Really liked their chicken enchiladas, California omlette and nutella french toast"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMlpqbzlBRRAB",
            "text": "Beautiful clean place, workers are very polite and they go around the tables to refill the coffee every five minutes, definitely coming back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNnFfY0ZREAE",
            "text": "Soggy French toast bc they weren’t smart enough to put the fruit and whip cream on the side for a delivery order. DO BETTER"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNlp1eFh3EAE",
            "text": "Really spectacular place, I don't even know where to begin. The place itself is big and usually not busy. You can pretty much sit wherever unless it's busy. Place is pretty clean. Now for the main things. THE STAFF... Are the best people…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcFlTcmVnEAE",
            "text": "The food and the service are usually fantastic.  As this is THE local diner, frequented by many neighborhood regulars, it can get pretty busy.  Personally I would love to see a few more vegetarian friendly items on the menu.  Overall…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhN29QWHlBRRAB",
            "text": "I ordered from Morris Park Avenue, Golden Eagle Restaurant for over a year, the breakfast menu is very good, and prices are reasonable. I ordered dinner from them once, the arrangement and taste was good, The delivery is usually delayed to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaVlMVXh3RRAB",
            "text": "My favorite place to go though I wish the vegetarian options were better. Needless to say you can always find SOMETHING to eat, even if you have a specific diet. It's been around ever since I can remember and it continues to be a staple. Shout out to Rosie for her incredible service <3"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtc3JuYV93RRAB",
            "text": "Even with a  big \"OPEN\" sign in the window, they don't look like they are because of construction, but they are open. Food was very good except for their muffins that are pre packaged. Service was excellent, couldn't have been nicer. Highly recommend."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLXRHZUNnEAE",
            "text": "Basic diner menu, basic table service, frequented by locals, delivery available. Cheeseburger deluxe is a hit or miss depending on the day it can be quite delicious, hot and cooked just right. The side of coleslaw is delicious. Their made…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5eGVtRFBBEAE",
            "text": "Good Breakfast and lunch! Haven't eaten dinner there but im sure it's good as well! People are so friendly and kind! I give them a 5 star and its around my neighborhood! Walking distance perfect for my family! And also fast service!🙏👍👌…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX2FxR1B3EAE",
            "text": "Local neighborhood diner that serves yummy breakfast, lunch, and dinner. The omelettes are delicious, I normally get the Texas omelette, and the California. I have gotten chicken franchese for dinner, yummy, comes with a side, vegetables, a salad.\n\nThe staff is great and always go out of their way to make the customers happy. Have been going here for probably 15+ years"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnLTl2QzdBRRAB",
            "text": "I absolutely love this place! The chicken noodle soup is always a good idea (ask for lemon to squeeze into it when you have a cold). They have everything you could possibly be hankering for at reasonable prices and the specials are even…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzbU1mNHFnRRAB",
            "text": "I am giving it 3 stars, not because of the food. It was good diner food. But the waitress could have been more attentive to us. I do understand if it was packed, but  it wasn't. Overall ask me if I would like another cup of coffee."
        }
    ],
    "reviews_count": 64
}