{
    "name": "Nana's Kitchen",
    "place_id": "ChIJM0JDlaX0wokRDjesSHnSNc8",
    "grid": "BX11",
    "address": "1809 Hone Ave, Bronx, NY 10461, USA",
    "rating": 4.5,
    "user_ratings_total": 210,
    "phone_number": "(347) 810-9070",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wak4wOXBSSE5OVmpaaGJYRTVaMmhVVWxwV01uYxAB",
            "text": "The food was absolutely repulsive. Wasn't upset about the vegetables tasting like cigarettes, but the chicken was old and dry. Took a few bites and just tossed the rest out."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFZHcHRjRXd0UmxocmVrOTFXSFpyYkVFNVpuYxAB",
            "text": "I meant it came to live a longer content made choice with Google review. There I had a convenient time with Nana Kitchen, it pertained to knowing about a good meal. I had a clear preference for Nana Kitchen’s recipes which are the lifestyle choices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVloxVllWWFJpUTJSUU5sTndhRkZLUlRRelpIYxAB",
            "text": "Nana’s Kitchen the best food in the world. It’s the best restaurant in Bronx NY👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdTJ3dWE3MzRPX3FnRRAB",
            "text": "The best restaurant I've eaten at in the Bronx. I really like the traditional Albanian food and the friendly service from the staff. You are the best for every order I've received. I'm so happy that you were there for me in the most special occasions, you are a lifesaver. You have to try the food at Nana's kitchen, it's the best🥰"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNHFuWS1BRRAB",
            "text": "The food is amazing. Traditional balkan food. Very delicious. The staff is very friendly. Very recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdjQ2RFZREAE",
            "text": "I have ordered tasqebab for and they put rice instead I did wrote it under as description “tasqebab not rice” they still made with rice.\nDisappointing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb1pidkN3EAE",
            "text": "My go-to spot in the neighborhood for good Albanian food. The qebapa are a classic."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOU1DanVBRRAB",
            "text": "The best"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc3Q2bUNnEAE",
            "text": "We love this place and Angela is the best."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dXVMN013EAE",
            "text": "Kind people with nice meal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d3BmT0hnEAE",
            "text": "Did not like anything there the meal came\nout cold!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cFBYdlFREAE",
            "text": "Firstly I must say this place is quaint and food comes out quick and for that it’s great but dishes are pre made, bread is old, other diners shouted so loud we couldn’t hear our server who seemed pleasant just unhappy to be there. Don’t order a sour pickle because they’ll serve you sliced sandwich pickles. Prices are similar to Manhattan prices which is odd and we ate because we were hungry but it was a disappointment over all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NXZiQXpBRRAB",
            "text": "What a gem! The food is delicious, the service is amazing. Very clean restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaHNuNS13RRAB",
            "text": "There is no food hobby shop"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNDU2Q0tREAE",
            "text": "Great service\nAnd the food is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxa3JtdndBRRAB",
            "text": "My first albanian dish (Lakra)was so delicious and reminded me of my own Nana.  Food and culture are so intertwine its beautiful. We are different but yet the same."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnZ2Z3lnRRAB",
            "text": "Fresh, delicious chicken gyros with friendly service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dnVUbGJnEAE",
            "text": "Great place and great people 👍 👏"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtODdpVUlnEAE",
            "text": "Fantastic home made Albanian food! Made fresh in house!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNk5MSVJ3EAE",
            "text": "Was out of Börek (the reason we stopped in), but the food we got was tasty. Seen while traveling and we may not have a chance to try again, but will if we can."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbUp1M053EAE",
            "text": "Restaurante albanes muy autentico. La chica es albanesa y nos trato genial. La comida muy rica. Y de precio muy bien. No tienen bebidas alcoholicas. El ambiente es un poco oscuro diria yo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4am9qeG5BRRAB",
            "text": "Nanas Kitchen is an absolute gem! From the moment you step inside, you're greeted with warm hospitality and a cozy ambiance. The menu is a tantalizing journey through the flavors of traditional Albanian cuisine. Each dish is meticulously prepared with authentic ingredients, resulting in mouthwatering flavors that transport you straight to Albania. The portion sizes are generous, and the presentation is visually appealing. The service is impeccable, with attentive staff who are knowledgeable about the menu. Nanas Kitchen is a true culinary delight that deserves five stars for its exceptional food, welcoming atmosphere, and outstanding service. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dnBLN3hnRRAB",
            "text": "Such a hidden gem in the Bronx! Food is so fresh, authentic and flavourful. Service at it’s best! 10/10. Very recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN3JURDdBRRAB",
            "text": "Great food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOWJXR29nRRAB",
            "text": "Very quaint and authentic atmosphere. We ordered the gyro and french fries, it had actual tzatziki sauce on it that was delicious. The service was great and very accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoanZhQkRREAE",
            "text": "I went to lunch yesterday 2/12/2023. I was disappointed 😞.  I sat down with my guest asked for salmon to be told it wasn't available. Then we asked for coffee or tea, to be told their machines weren't working. The ultimate disappointment was that they don't serve cold water to their guest. I should have left at that point. I won't be returning to this restaurant ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOTkycDdnRRAB",
            "text": "The best food, and service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdS1XcFdREAE",
            "text": "As a greek this is my first time to an Albanian restaurant went there by searching In Google the gyro was amazing tzaziki was on point and the bean soup was really good better then my mother's greek and Albanian food is pretty much the same but the food was banging and I saw 2 granny's in the kitchen that's when you know the food would be on point thanks nana"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldU5qdUtREAE",
            "text": "The greatest home-made Albanian food in the Bronx"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eHREYnVnRRAB",
            "text": "great food and quick service, 5 stars"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Mkk2R0F3EAE",
            "text": "Horrible food. I ordered peppers with potato. Potatoes were raw, stuffed peppers were so bad like someone threw up. I ordered chicken tenders for my kids and they were terrible as well. Straight from freezer and warmed up in microwave. French fries were greasy and kids didn't eat anything.\nThe only good item was albanian bread. I will never order from this place again.\nWhat a waste of money!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ekltYzFnRRAB",
            "text": "Best customer service, highly recommended"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXX2ZQdnJnRRAB",
            "text": "My husband and I wanted to try something new around our area. We tried this place, well rated, so we gave it a try! My husband was over charged, and the woman pretended like she didnt understand what math was, so he let it go. This now ruins my experience because hes too nice with someone that just wanted to take advantage and that's not right. It ruins also my food experience. I won't be going here again nor recommending a restaurant that doesn't know how to do business correctly. I mean even being shown the pricing on the menu and adding for her. Just be careful when you come here and read your receipt and ask to speak to a manager if she doesnt understand all of a sudden."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdVpUcVpBEAE",
            "text": "Delicious food! I've been living in the area for years and just discovered this gem. Chicken soup and burek are phenomenal. Addee bonus: the staff informed me that their meats are halal! Will definitely be visiting again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdE9HTVV3EAE",
            "text": "Had the goulash soup with rice and the byrek. The goulash very good but similar to any other beef stew. If you're wanting to try something new, I'd go with the byrek."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDanR1TjJ3RRAB",
            "text": "This restaurant is amazing. One of the most loving and hardworking crew there. Me and my family of 9 always have an amazing time. The food is great, the workers are really nice and fast. Will definitely recommend this place and I will be back. Nana’s kitchen is like home 🇦🇱…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMmNIS29nRRAB",
            "text": "Not only is the food amazing here but the family is just as good. Today in a snow storm they delivered my sick father in the hospital a home cooked meal when we couldn't get to him. There soup is amazing just like as if grandma made it in the kitchen. Wholesome good cooking. What more can you ask for."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBM082QjRRRRAB",
            "text": "Great place. My favorite place for cevapa. The staff is very friendly and pricing is very fair.  The have more choices on the menu than your typical Albanian restaurants. I also enjoy their fires and grilled chicken gyro.  I recommend the place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQweE1LeW5nRRAB",
            "text": "Nana's kitchen was very good and delicious. I'm planning to go back again. If you go there you will go back again. The price is acceptable and quality is very good. The staff was very professional and helpful. Thank you Nana\"s Kitchen."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdWN1M2R3EAE",
            "text": "The meal was so great! I ordered the steak, salad, and mashed potatoes and my mom got gyro meat, brocili and mashed potatoes. I will be going back!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdzRlcVJBEAE",
            "text": "First time and it won't be the last. Staff was friendly and helpful. Great tasting chicken salad, gyro will be next"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTNEtxT2F3EAE",
            "text": "Lovly traditional Albanian food, I recommend to everybody"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBZ0lESm1RRRAB",
            "text": "This place is amazing. The real deal. Friendly service and one of the best gyros I've had in the US."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5enJmVkdnEAE",
            "text": "Food is just like back home.\nService is great. Love eating at nanas"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdktmQjJnRRAB",
            "text": "Best place ever. Its one of those places that seem small and you have low expectations, but it is truly amazing"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcElENDFnRRAB",
            "text": "They have a great cuisine and service, whoever is looking for Balkanic food this is the place to go!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjNXJ6X2l3RRAB",
            "text": "Great food would recommend the tasqebap(idk if its written like this) and friendly staff"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aGQ2cjl3RRAB",
            "text": "The best place for lunch and diner very soon they are making breakfest i heard cant wait to go back its worth the drive ther"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaDRTMVlREAE",
            "text": "Simple the Best Albanian place in NY and very friendly top quality there don't miss nothing"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjc0o3UDNBRRAB",
            "text": "Great service the food was really tasty Definitely recommend it I will return"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNLTd5ZXRBRRAB",
            "text": "Very nice place, they prepare the best bread for the side in NYC"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMHJYbktBEAE",
            "text": "Nice place.\nSmall menu with limited option.\nRecommend gyro  option."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM28ybTNBRRAB",
            "text": "I highly recommend Albanian cuisine from this restaurant, very tasty food😀😀😀😀😀…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOU5HN1hnEAE",
            "text": "Great authentic food for very reasonable price."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNC1HOU9BEAE",
            "text": "Very nice people! Very good servis, very good food!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbk5QTUxnEAE",
            "text": "Amazing food friendly staff I will recommend"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX0k3VXpnRRAB",
            "text": "Nice and fresh food,  fast service  ,i like it"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdExlY3F3RRAB",
            "text": "Great food .and wonderful staff"
        }
    ],
    "reviews_count": 58
}