{
    "name": "Pine Restaurant",
    "place_id": "ChIJIcUqAKP0wokRJzfqJIeeYkA",
    "grid": "BX11",
    "address": "1913 Bronxdale Ave, Bronx, NY 10462, USA",
    "rating": 4.5,
    "user_ratings_total": 4661,
    "phone_number": "(718) 792-5956",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaFVGWjJOMmx5YTNaZmNqTmhkSEJ1TlU1TFIxRRAB",
            "text": "Excellent service, Ray is an excellent waiter. The food was great, as always, and every dish was served hot. We had a party of 11 people and everyone was completely satisfied. I highly recommend this place for any occasion."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobk1HMXRMVlZ2ZEVSUlNtVk1SWGRaTmxCa05WRRAB",
            "text": "Another family member left us,  get together was here.  We've had many here.  They are very accommodating, food exceptional and services over the top."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNFdUZGZWemR0ZDNvMmFrWk1ZWEZUVG14eWNsRRAB",
            "text": "It's great to know that these classic, old-school places still exist in NYC"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTmRteG1UV1EzUnpSRE1qbHVUME42ZWs1c1NrRRAB",
            "text": "We came to this restaurant as a party of seven, including two six-year-old children. Unfortunately, our experience was far from pleasant.\n\nTo start, when we ordered our drinks, each of us ordered one drink, but our server, Mario, decided to bring two of each instead. When we told him we hadn’t ordered doubles, he insisted that he “heard correctly,” which was not true. He eventually took the extra drinks back, but the situation already felt uncomfortable.\n\nNext, we ordered food from the kids’ menu. In any decent restaurant, children are served first — that’s basic restaurant etiquette. However, the kids waited over an hour for simple pasta and spaghetti — something that takes about six minutes to cook. By the time the food finally arrived, they were already full from eating bread and didn’t even want it anymore.\n\nWhen I asked Mario why the children’s meals took so long, he said it was “completely normal” because the kids could eat mussels and calamari from the appetizers while waiting. I don’t know many six-year-olds who eat mussels and calamari — and certainly not mine.\n\nThis experience clearly showed a lack of professionalism and understanding of basic restaurant etiquette. Children should always be served first, followed by the adults’ main courses. Perhaps I am used to dining at higher-end restaurants and expect a certain level of service, but this was simply unacceptable.\n\nA note for management: please educate your staff — especially Mario — on proper restaurant service standards and etiquette."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Q2Ftb3pOa2RhYzA5ME9VSkNUbmhxWkdGWlJtYxAB",
            "text": "We were at a large private party.  Food was served family style and was not heated well.  Otherwise food was just fine"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNFNWTkZOMjVTV0hGeVdFMHdlVU01VGxWTE5FRRAB",
            "text": "Veal Parm Sandwich was tough and had strange gritty texture. Very weird and unsettling experience. I hate not being able to trust my food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT1ptMVRibW93WDJJemNEZFRZbGxUTFRWR1psRRAB",
            "text": "Love the food, nice variety to pick from"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cm9yeW9BRRAB",
            "text": "Called to ask if you need a reservation for 2. Person on the phone the advised there would be no reservation needed. Got to the restaurant within 20min. Gentleman at the front said we need reservations an we could sit at the bar if we want to dine in. The bar side has small an uncomfortable tables so we just walk-out felt unwelcome"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ1dWaGpVazQyVVZWRlRUVmlNVWQ0TW05UVUyYxAB",
            "text": "Great fine dining experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ab2NUbFZZa052TVdNNGJtOXNNVTFCUWtsVlVIYxAB",
            "text": "Don't know how the food is due to not being able to get in. The host said a couple groups just left so they were clearing tables and cleaning it would be a few minutes. We waited 40 minutes the whole time people were being seated. As far as atmosphere looks like they are trying to be upscale fine dinning which actually explains why they wouldn't seat us it was me, my wife, and 3 kids (24, 6, 4). I guess we weren't bougie enough to be in their restaurant."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObWNESnZja1p5WldsWVFXbE1SR1JLTFZOZk9XYxAB",
            "text": "Delicious Italian food, great service and Beautiful Atmosphere."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ek4tTUN3EAE",
            "text": "Cali the bartender is the best"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gbk4ySllWRE5mYjFSZmRqTnVXSFJUTjJkRllVRRAB",
            "text": "Excellent service the food delicious 😋😋😋😋"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlZ6TktRbTh0YWpReVpVWkNPV3RZT0V4TlVYYxAB",
            "text": "Been to Pine multiple times and it has gotten worse on every visit. All the food was cold/warm like it had been sitting. Steak and chops were cold and unseasoned, drinks were carelessly made. Couldn’t even substitute potato for mixed vegetables anymore according to server. Dessert came and “lava” cake has no “lava” now they just dribble chocolate outside of cake hmmm? Ice cream was already melted on my daughter’s plate. Sad this place used to be a safe go to and now it’s a never go again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMlNXZHNiVVphTmxaRmRVNWhkWFpHT1VaV1QzYxAB",
            "text": "Food was amazing was there for my Father in law wedding. Very accommodating staff and very polite. Definitely would love to eat the restaurant one day."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdGRqbGxUbVI0U2xwSlVHaFFXR052TUZOVk4yYxAB",
            "text": "All my favorite dishes, served perfectly. This restaurant has been doing it right for decades."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0djZxeEVREAE",
            "text": "Pizza is great"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRVpGUldRM0pHZDFGeFQweE1XRmRpWTNKbFRVRRAB",
            "text": "My Pam and I died there for dinner last night, October 6, 2025 for my mom‘s birthday. My mom has transition for 10 years ago every year we celebrate her before and after so I thought it was convenient for everyone to meet there because if they live in locations, I chose them over Carmines. I definitely will not dying there again all I would say to this."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFJXbEVjVkZVWkhNMlZVUlhSRzVuU3pCeUxYYxAB",
            "text": "Me and a few of My cousins have a family reunion committee. We go out on these dinners or lunches to discuss past reunions and future reunions and other family fun activities. we decided to go to Pine restaurant because we did a repass dinner after the passing of an aunt. In the beginning of this year and  the food was amazing. everything came out hot and fresh, but this time for some reason me and one other cousin got a pasta dish believe it or not the noodles were way undercooked… I know they supposed to be El Dante, but this was El raw te.. and it’s an Italian restaurant. I ordered the lobster and shrimp. I asked for linguine noodles and Got penne, I left it because noodles and noodles but My cousins told me to return it, but I didn’t want to go through the trouble. I felt sorry for the waiter. He had a lot of tables to manage, but I believe there would’ve been easier if we could understand him he spoke so fast his words sounded jumbled together.. everything else tasted perfect. I won’t say we will be back anytime soon, but it could have just been a fluke of a day. I would still recommend this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVNYTm9hVGRITVdWWk1XUkNRVGt3ZUcxVmVVRRAB",
            "text": "I had my baby shower here. It was amazing. The whole experience, from food to service exceeded my expectations.\nI looked at a lot of venues, and this was an easy choice. The food options were all fantastic, Aldo helped me throughout the entire process and made it so easy and stress free for me. Communication was effortless, accommodations were granted and then some.\nI hope to celebrate my daughter’s 1 year birthday here!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ3BMZ2ZnEAE",
            "text": "I love the Pine Tavern! I have been eating here for more than 35 years, and the food NEVER disappoints. Excellent service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSU5ucGtlalJzZDJreVUxQmtaVXB5TVVaNlIxRRAB",
            "text": "Incredibly good. Great atmosphere service and food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR1FuZGhWVjlLWjJwMWRuTkxkemx3UkZJeFVGRRAB",
            "text": "Amazing food and great service as always!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRFNEQmlYM2t5UTAxS1gyeE9TV0p5TW5FNE1FRRAB",
            "text": "A gem in the heart of the bronx"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMlNUUk1PVzlRTkVSd1JuUnRVa1paVTNGVVRXYxAB",
            "text": "Attended a private event. Food was good. We had pizza, salad, calamari, baked fish, chicken parm and rolls. The bar staff was friendly and the atmosphere was welcoming and clean! The restaurant dining area was packed as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSGJXaDZaRFYzVHpsUFZYWmliM1pvYzJreGVsRRAB",
            "text": "Revisited this restaurant because it’s where my husband and I went on our first date 20 years ago this month.  The food wasn’t bad, the atmosphere was the same…loud. However, their service/waiter was terrible.  My waiter was too busy socializing with his regular Saturday night crowd and my husband and I were after-thoughts.  He went to every table that was in his section, had long conversations with them and even went so far as to sit down like he didn’t have a job to perform as we’re sitting there waiting. Quite frankly not my business, it’s not my restaurant, but was is my business is the long wait for service. He took our drink order fairly quickly, then came back with salad and menus at the same time. HUH??? You want us to eat salad and look at your big, giant menu at the same time??  It was all downhill from there!  The two things that really bothered me, however was that we were only two people and ordered an appetizer (which tasted like frozen calamari) and two dinners.  When the dinners came out, the dootdadoot put one of our dinners on the table next to us and then turned around and then continued socializing instead of paying attention!!!  You couldn’t remember what we ordered?  No!  Of course not, you were too busy with your regular crowd.  My husband and I were in disbelief that this guy just put our dinner on the wrong table. The guy he gave our food to is sitting there (and breathing over it) looking at it like “that’s not mine!”\n\nThe icing on the cake was when the check came and I handed him a gift card and credit card. The dude got all flabbergasted and was worried that I wasn’t going to tip him.  He literally stood there explaining to me that the “suggested” tip amount on his little hand held device is based on the remaining portion of the bill and not the total. He held onto the machine and hovered over me and watched me to make sure I gave him a tip AS IF he deserved anything more than 15%! THAT made me uncomfortable and I felt very pressured and he has no business standing there while I was conducting my business.  Who does that??? I need him to explain how tipping works?  Like I haven’t walked this earth for 50 years and never ate out at restaurants before that he needed to explain it to me? UNBELIEVABLE!  I will never again patronize that establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZmIzVmFlV2hHZUhKT1JsOUdZekI2TTJWVFRHYxAB",
            "text": "Legendary place amazing food everything is so good it’s hard to choose a meal… one of everything!! Staff is great and very professional!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM2RXOUlTa28xV0hRek5HcHFZMGRwUzFCb2QzYxAB",
            "text": "Total bliss.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMGVWRnZOVVZtVEhKR04wRjJZbkpZVVhOcU1XYxAB",
            "text": "My husband and I recently had our wedding reception there. The location, food and waiters were all wonderful. I want to say a big THANK YOU to Mr. Aldi Shala, our event manager, for his amazing service and support all the time. He clearly knows how everything works and answered all of our questions and concerns all the time. Thank you for being there for us!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNU5td3RXV3N6ZGtaRFdqUkVaMWRGWlVaeFZFRRAB",
            "text": "I love this restaurant. Not only does the food taste good, but they also give you good portions for your money."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMlNFTktjR3BWYjA1TU5FSkRZM2RRT0dScllXYxAB",
            "text": "Ordered to go.. cocktails at the bar."
        },
        {
            "date": "수정일: 1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcEk2cUlnEAE",
            "text": "margarita, limoncello shot    zuppa de pesce white wine sauce over linguine"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VVZubGhOMkZpY1VSVVkwVkJTWEo0VlRSRFlsRRAB",
            "text": "Good 👍"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aVkyWFh3EAE",
            "text": "🍕 🍝"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReWFucFdRemhNYkRKRVdGTk9RVGRHT0MxUUxYYxAB",
            "text": "Me encanta es unos de mi restaurante favorito.   Depues k estoy con mi pareja k tiene más de 40 años visitándolo. Cada ves k tenemos chance lo visitamos."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd1psZHlWekl4TlhBemJGSmtWemRMTFY5S2NrRRAB",
            "text": "Would be visiting again , we were at nice party , for Graduation!\nThe barman sucks , everything else excellent!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFelRFTnVXbUZVTlVObWJHNXdOMjUwTTFSbFNGRRAB",
            "text": "Pine is one of my favorite restaurants. I went here for a birthday dinner with my family and everything was great! Food was delicious and our waiter John was fabulous"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM1FqWkxNaTFPTkVNelNscEtVVTFFT1hOVFNXYxAB",
            "text": "Walked in a little before 9 with no reservation. Our server John was awesome. Recommended a great bottle of Merlot, was personable and accommodating the whole time me and my girlfriend were there. Shared a couple of conversations and laughs. The food was incredible and without even getting a chance to ask for a dessert for my girlfriend’s birthday, he picked up on it during conversation and brought it out for us with more of the crew. Will definitely be returning and hoping John is our server again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obk1uaFBWMEl4WVV4dWFFaGpkMFYyTUY5RFVIYxAB",
            "text": "One of the finest restaurants in the Bronx."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM2FHNVFVQzA1Y0ZWRU4wRXhTM014U25GcFMwRRAB",
            "text": "Had a good meal at the pine restaurant. We had the hot antipasto for 5 as an appetizer. Everything was delicious. I had tortellini Marc  Antonio for my main course. It had vodka sauce, prosciutto and mushrooms. Delicious. The rest of my family couldn’t finish their meals so they took them home. Our waiter was excellent. This was our second time there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT2VXUmFTSFEzZURGSVRuSndkbXgxUTBvMFJXYxAB",
            "text": "I've been going to this restaurant for at least 30 years. Although it has fully expanded and been renovated from the days when you had to wait for HOURS to get a table and then squeeeeeeeeze through the restaurant to get to your seat, one thing has never changed in all these years... the excellent service and the excellent food. Went for dinner this evening with friends. Simple meal. Clams oreganata, salmon with angel hair, and the complimentary house salad. Salmon cooked to perfection. What made tonight's dinner so special was the service from our server ... a young man named John. Friendly, funny, and beyond attentive to every detail! Truly kicked up our experience a notch! Thank you John - EXCELLENT service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeU1sTlpPRWxGVEhVd05IZ3RRVVZTZURocVFWRRAB",
            "text": "I’ve visited many times over the years and food today was as consistently delicious as it’s ever been. John M. was our waiter and he made the visit special. Attentive, polite, informative, charming, funny. He took the meal from good to great."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3d2Rid2RnEAE",
            "text": "Food was delicious. And my waiter was awesome. I didn't get his name."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T2FreERhR1ZuT1dReGJsaDJUalpxYkRBNWRFRRAB",
            "text": "Great place to dine. The food was amazing with excellent service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad1JWWXhSREJsUWs1RWFHeE1jREpaUWkxTWJXYxAB",
            "text": "The service can improve but the food was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeGJHNVlWbGhxTVZWMGREVjZRbEpFTUhRM1FtYxAB",
            "text": "I’ve been here a few times and the food is always succulent. They have a wide selection of good food on the menu. Some good options are: salmon, meatballs, Marguerite pizza & the pasta. It’s a great place to go with family, with friends or with a date…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcmVFeFVYekZITVV4VGNVTXpaamd4TmpoWE1YYxAB",
            "text": "This is the perfect place for special events or just a dinner night out. Excellent service and food.  A real Bronx jewel."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KalJHRnZZMlJCZFVwQ1VGQnFaaTB5VFZCV2QzYxAB",
            "text": "The dinner experience was fantastic!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNWNUZENVbXh0Unpnd1p6RXhTbW95TjBZMVYyYxAB",
            "text": "Just as I remembered the food, service and atmosphere is delightful. Their portions are still plentiful and delicious!\nI traveled 2 hours to visit with my teenage friends. We sat and chatted, the waiters and management were so very patient. Thank for the wonderful experience we had today at your restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb2RscGxjMGRYVUhwTU1sQjVNa3BRVlhnMFZVRRAB",
            "text": "Remarkable restaurant in the heart of The Bronx the food was gorgeous, our server Louis very friendly and attentive, Javier in the bar very professional and proactive,  they made  our dinner very special. Keep shining guys"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeGNXcFZaVzFLYmtvMFlVSjJjR1Z4ZDBSWFJsRRAB",
            "text": "Omg, the food was delicious. Family style servings so lots for everyone. Everything was very fresh and so good. I didn't have enough room for dessert but would of loved to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbFRVTkNiRjg0TkhZeE1tTlVWR2hUTm5SSmEwRRAB",
            "text": "We had a party of eight to celebrate my step-dad’s birthday. He has dementia and aphasia, which makes it hard for him to communicate. Our server, Joseph, was nothing short of incredible. I cannot say enough about how kind, attentive, patient, and accommodating he was with our entire family.\n\nFrom the start, Joseph made us feel welcome and at ease. He was extremely knowledgeable about the menu, explained everything clearly, and offered thoughtful food and drink recommendations that turned out to be spot-on. He checked in regularly, made sure every detail was right, and handled everything with calm professionalism and genuine warmth, without being overbearing.\n\nAt one point, there was a small issue with one of our meals, our fault not the restaurant. Joseph immediately took the initiative to speak with the chef, had the dish corrected, and brought it back quickly. He truly went the extra mile, and it made all the difference in our evening.\n\nThe food was absolutely delicious, but it was Joseph’s service that stood out the most. His ability to balance efficiency, empathy, and hospitality was remarkable. He treated my step-dad with real care and respect, which meant more than I can put into words.\n\nIf you’re planning a visit, do yourself a favor and ask for Joseph. He turned a special occasion into something even more memorable. We left not only full, but genuinely grateful for the experience.\n\nAsk for Joseph and tell him Raymond's family sent you!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLVBETmpnRRAB",
            "text": "We recently hosted our son’s first birthday party at F&J Pine, and everything was absolutely perfect. We worked closely with Aldi, who was so easy to work with—accommodating, responsive, and genuinely caring. He checked in with us often to make sure everything was going smoothly, even before the event. The entire staff was incredibly attentive from start to finish, always making sure we and our guests were well taken care of.\n\nOne of the most thoughtful touches—they packed food for us to take home, knowing we’d be too busy hosting to sit down and eat during the party. The space was clean, the atmosphere was warm and friendly, and the food was delicious. We couldn’t have asked for a better experience. Highly recommend for any special event!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYlV6dHZEXy1lbFN3EAE",
            "text": "This has always been a family favorite growing up and I can testify that the quality has NEVER gone down. What restaurant do you visit in 2025 that with only an entree, you get complimentary salad, bread and butter, side of pasta, and potato croquette?! Portions are generous, prices are reasonable, and the quality is divine."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM1EyZDJVRWRmY2xGWFRpMVBNSGRXVkdwM2VIYxAB",
            "text": "We had celebrated HS Reunion 50th Anniversary. The price we paid for the food in my opinion was over priced for 13. The food was not warm, the chicken Parmesan was over cooked and hard to cut, the ribs were not cooked properly and was not seasoned properly, the chicken wings and drumsticks were to myself ok. Overall, not the best place for me to eat there again. I travel a lot and I am a foodie, who likes to rate restaurants for their food, hospitality, etc. We decided to take a group picture and  it cost a lot in my opinion with frame. One picture we took as a group,frame felled and broke and when requested to see if they could replace as a courtesy their response was no you have to pay for it again that is outrageous for the amount of money we paid for a group and their service was mediocre. One of my friends talked to the manager and the money paid extra was returned.Don’t think I would go back first and last time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMGZyTmtnRRAB",
            "text": "My first time here and I’ve been in the Bronx my whole life. Went to celebrate a birthday and they were very accommodating. Once half our party arrived we were able to be seated. The waiter was kind and attentive. Got all the orders right…except I had to send my steak back to be cook a little more but no big deal. It was tasty and juicy and overall satisfying. The portions are big so you will definitely get ya moneys worth, be full and have left overs. Definitely recommend"
        },
        {
            "date": "수정일: 5달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXJ2RGRREAE",
            "text": "餐點份量大 生意很好 大家音量都蠻大因此店內蠻嘈雜的"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3ellyazBBRRAB",
            "text": "We were a party of 3 for dinner.  I have several severe food allergies. Our waiter, Ambrocio went through the menu and discussed all the items. He let me know why I couldn’t have certain dishes.\n\nI was very pleased with my meal.  I don’t eat out often because of the allergies, but I felt so safe.\n\nWe will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTWIzVlVXSEJmY0V3eWNtODNSMHhWTjB0bVVtYxAB",
            "text": "One pound stuffed meatball was juicy and ricotta and mozzarella were extremely fresh.\nMy lasagna was best ever, sauce was delicious. Filet mignon was large and delicious, perfectly cooked. Stuffed filet of sole was excellent and also a huge portion.\nDessert Napoleon was massive. Four of us couldn't finish it. Oreo zeppole were fantastic also."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cExXLVd3EAE",
            "text": "Great spot for Italian food with valet parking available. Good for groups and families ! I had many dishes here. The last time I went I had the chicken rollatini and it was incredible! The wine selection is wonderful. Basically everything here is great from the espresso to the desserts to the service . Enjoy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMHFLZTlnRRAB",
            "text": "The atmosphere - so very welcoming! Shout out to Marco! It was the weekend so it's busy. Party of 5, so we  chilled at the bar while we waited on our table. Seated in about 20 minutes. Hector, our server was amazing!! The drinks were great, and the food was absolutely delicious!😋\n\nI'll be back for sure!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMLU5XVV9RRRAB",
            "text": "Food was good, stuff shrimp needed more crab and flavor to much breading, trio scampi was amazing. Get doors for catering hall, way too loud during an event. Out wait staff was amazing. I’m a James Beard chef and I enjoyed the service and dessert. Sangria Red very good. Plain Zeppoles were amazing. Have someone monitor the kids during parties."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYa1BuUi1nRRAB",
            "text": "Generous portions of fabulously delicious delicacies. From the salad to the desserts, everyone enjoyed their selections. Highly recommended, especially on birthdays! Valet parking is a bonus."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDV2bjJnRRAB",
            "text": "Large area of appetizers and entrees. Fast seating and wonderful service! Everything was cooked perfectly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT2VXaElkazVWUm1GbFdXZ3hkM2N0TXpSUFYxRRAB",
            "text": "food…\nSteak great!\ncake great!\nlobster ravioli… do NOT recommend\nService…\namazing till he recommended that damn lobster ravioli\natmosphere…\nthey didn’t sing me happy birthday. and i couldn’t see anything after eating that damn ravioli.\nPS if you go, try not to order the lobster ravioli\nMario, if you’re reading this, why would you do that to me?"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodzVMZlZREAE",
            "text": "Came here for lunch on President’s Day 2023.  Was seated by one of the Valet Parking attendants.  Our server a was very nice.  A big restaurant with many sports pictures on the wall and Sinatra playing all the time.  Big portions!  Reasonably priced.  Credit cards accepted.  Moderately clean facilities.  The food was good but, I prefer a little more seasoning.  Spaghetti side dish was a little watery.  Overall a nice place and we will definitely be going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3RTSXJBRRAB",
            "text": "Had a reservation for 6:45pm and wasn't seated until an hour later. Saturday gets really packed by large parties. The host, Marco, kept checking in until a table cleared up. Several different servers stopped by my table, I guess, because how busy it was.\n\nThe food was worth the wait. Authentic Italian cuisine. Will return on a less busier day."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Nzd2c2NnEAE",
            "text": "Great Italian Food, large portions at reasonable NY prices.\nPlace gets pretty busy, with locals and tourists.\nGreat thing is that there is valet parking so that takes a big hassle out of your NY experience of finding a parking spot (and a safe one too)."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNGRqQUlBEAE",
            "text": "Consistently excellent.   We have enjoyed both catered events and lunch or dinner at The Pine.  The food is fresh and delicious.   The servers are courteous and accommodating BUT do not try to make a last minute reservation.  Plan ahead.  Same day reservations are tough to get.  You won't be disappointed.   From the fresh baked bread, to crisp salads, to tasty wings, to the extensive menu, you can't make a wrong choice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bjVYVmNREAE",
            "text": "Family style dining Italian restaurant. Week days it’s pretty quite no reservation is needed and there is no waiting for a table but on the weekends it gets crowded reservation is recommended or you might have to wait a while to be seated. Their oven brick classic Marguerite Pizza it’s one of a kind. Their seafood pasta and fried calamari are so really good. I love their crab cakes and fresh salad. The staff is very attentive and friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eU5YYXVBRRAB",
            "text": "Went to Pine restaurant in Bronx,NY for a family gathering. The service was great, friendly waiter/ waitress.The menu is extensive,super Italian choices.Great appetizers,too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIX2JlSFhnEAE",
            "text": "We had a great diner tonight in here. The atmosphere is quite nice; waiters are amazingly friendly!! And the food is pretty good, and plates are very generous.\nI really recommend this place if you want to spend a great time enjoying Italian with family or friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMTktR3dBRRAB",
            "text": "Perfection! I came here last night to celebrate my 2year Anniversary with my partner and it was pure bliss. We called ahead of time to check if we needed to make a reservation but we were told that we could walk in and it could be a 30min wait. We had no problem with that so we ended up waiting in the bar section and got one of their signature cocktails. The customer service with host, servers and busboys were so welcoming. Very clean & organized restaurant with a really large menu that have many amazing dishes and drinks! I seriously couldn’t stop talking about the food and I ended up taking food home! We had the PORTERHOUSE FOR 2! Wow!! I have to say one of the best PorterHouses steaks I’ve ever had and the best garlic cheesy bread! Even the packing for the leftovers were perfectly wrapped! This restaurant has valet parking as well! While I was waiting for my Uber the Valet workers seemed very much on point which is always good to know. I cannot wait to come here again and make this place a regular place to come to! Highly recommend if you want Italian food & a good cozy vibe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeGZLTktnEAE",
            "text": "An established and quality place, great clientele,  people of many races, and of great conversations. I've had several dishes,  all were tasty, The pine is the only place I can find that has an expresso martinis close by. My only issue is that I'm becoming a regular. I've had the same bartender 4 out of 5 times. The one time I had a different bartender, I was given a complimentary salad and breads with my meal. On the 5th time, I asked said,\" bartender if it's routine to receive a salad.\" The bartender said yes,,,, 4 times he never gave me a salad !! When I asked, he said he's been swarmed and extremely busy. Damn, the other bartender definitely paid attention to detail and made time for me. I definitely gave a bigger tip cause I felt special, being that I had never gotten a salad. It's still a very nice vibe in the pine. It's an old name and quality."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbjhudXd3RRAB",
            "text": "Update June 2024:  sorry to say that i feel the food continues to slip here.  Overall not terrible but not what i have grown to expect.  Still on my list of regular Italian places in the Bronx but will be trying other places.\n\nUpdate Dec. 2023 - Downgraded my food and service rating.  While the food was tasty some of our dishes came out not hot.  Service was slow and spotty.  It's possible they were short handed but was not as good as usual or expected.\n\nAlways good.  Service is wonderful and food is amazing.\n\nUpdate:  went to the pines while visiting.  They never disapoint.  Great meal as alway."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMU1tb1BBEAE",
            "text": "Great place. On the pricey side but the plates are generous. The drinks were well made. Me and my party of 8 waited by the bar and had drinks and apps while waiting. The ambience is great. They have parking out back but only with attendant services."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLTHVuWkNHNlB6RkRnEAE",
            "text": "Great food and service. Family friendly atmosphere.\nValet parking"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVOS1LbTl3RRAB",
            "text": "I came here for a Birthday celebration. The staff was helpful and quick whenever something was asked of them. Food was very good in flavors. The portions are just as good also.\n\nThey offer a nice size bar area for those who are waiting for their table or just for those who just want sit at the bar and order quick appetizers and drinks. They also have valet parking available and that's a bonus for their customers. I recommend this restaurant for a good time and a good meal."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnN2RqSmtBRRAB",
            "text": "I have been patronizing this establishment for over 20 years and they have changed ownership through the years. They finally settled on the right management and staff. Service is exceptional and food is amazing. Drinks are stiff and desserts are the perfect ending to an exquisite meal."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMk5tMlp3EAE",
            "text": "The food at the Pine is excellent. Celebrated my birthday there with friends and had a wonderful time.  The porterhouse steak was delicious. Drinks were good. The service was very good.\n\nI returned with my friends from New Jersey to dine once again. The service at the Pine has always been good in the past but yesterday it was the worst experience I've had in a restaurant.  The waiter was RUDE AND DISRESPECTFUL. MARIO NEEDS SOME SERIOUS TRAINING ON HOW TO TREAT LONG TIME CUSTOMERS ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU1QwRlNjMmRFZFVzNVVXOXRWRUZRWVd0YVJuYxAB",
            "text": "I took my family to this restaurant after my daughters baptism and was completely disappointed by the service- spent over 1k to only be rudely asked to leave because they needed the table- I completely understand we were there for a little over 2hrs but come on I just finished spending a decent amount and not only that the bust folks were literally just grabbing drinks and food that my family were still working on and throwing them out without even having the decency to ask if they were done. I will say our waiter Mario was Fantastic but this definitely left a sour taste. I can only imagine how they treat people that spend a lot less ..Never again"
        }
    ],
    "reviews_count": 81
}