{
    "name": "Luciano’s Pizza",
    "place_id": "ChIJIyiwrqX0wokR1x1J2xWMNsg",
    "grid": "BX11",
    "address": "1005 Morris Park Ave # A, Bronx, NY 10462, USA",
    "rating": 4.7,
    "user_ratings_total": 267,
    "phone_number": "(718) 863-2850",
    "reviews": [
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSFlXTXlObWhWWTBsYWMzTTFUMDlCUm5SbFdrRRAB",
            "text": "La mejor de Bronx Buen servicio la mejor Pizza de Lucianos"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNVdtRTRaRjluVW10cGJUbDFWa2w1U0cxaFpVRRAB",
            "text": "I ordered a chicken bacon ranch slice and they put full tomatoes on it. I got the option from the website and when I called and asked he said that’s an old menu and that’s how it comes. $25 on pizza and they all taste mediocre, idk how they got such a good rating on google. I’ll just go back to ordering Morris park pizza. Never again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdE5tRnRja1JLZVVwRFVIaEdWa2swTFVNMFIxRRAB",
            "text": "Luciano’s is one of those rare places where you can taste the passion in every bite. The pizza here is absolutely outstanding — from the perfectly crisp, golden crust to the rich, flavorful sauce and generous toppings. Each slice is the perfect balance of cheesy, saucy, and crunchy, reminding you why New York pizza has such a legendary reputation.\n\nWhat makes Luciano’s special isn’t just the food, but also the welcoming atmosphere. The staff treats you like family, always friendly and attentive, and the service is quick even when the place is buzzing with customers.\n\nWhether you’re grabbing a quick slice on the go, sitting down for a casual meal with friends, or ordering for a late-night craving, Luciano’s never disappoints. It’s comfort food at its finest, and easily one of the best pizza spots around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblJrOU1UMTl2WVY5cWNXeE5ZVUZCZFRSWmNVRRAB",
            "text": "Very delicious pizza and very friendly staff, my boyfriend and I really like this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WlZFUnZUWEpZVW0xNFRuVndNR0U1TVhwRmVFRRAB",
            "text": "Hey everyone!\n\nSo, my usual pizza place had a phone issue, which sent me on a Google Maps adventure. I found this gem with amazing reviews, and it's super close to home! Let me tell you, the pizza was INCREDIBLE! Seriously, a perfect 10/10. It tasted like REAL pizza – you know, the kind that makes you moan with happiness. And get this – the \"small\" pie had HUGE slices! I actually thought they'd given me the large one by mistake – what a pleasant surprise! My daughter loved it too, which is always a bonus.\n\nThe staff were all so friendly – both the lady and the guy I spoke to on the phone were awesome, and the delivery driver was a sweetheart. The only tiny downside? No desserts! But honestly, the pizza alone makes it completely worth it. You absolutely HAVE to try this place! 😋🍕⭐️🙌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocVZsWkNZUzFOZDFKbWVWUlRWbFkyWDNRNWNGRRAB",
            "text": "This is the best tasting pizza 🍕 in the neighborhood!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWE16QkpUMjVUYVVKdWRuWlNkRkZRZVVsR2VVRRAB",
            "text": "One of my top five classic, old-school pizza shops in the entirety of NYC. A little bit pricey compared to other spots in the Bronx, but definitely still a bargain compared to Manhattan and the hip, rebuilt trendy parts of Brooklyn. Consistent, always quality, and nice enough folks (though I've only done take out/delivery) and a nice variety of pies to choose from, all of which makes Luciano's a great spot and worth checking out if you find yourself in the Morris Park section of the Bronx."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFgzWk5TbkpPTFd0TWMwMXVaRWN0WTFZek4yYxAB",
            "text": "So grateful to have this place near me. Great pizza, great people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUldqaFNNVmRDY1Vaa1QyMW9iMjVHVDNaNVkwRRAB",
            "text": "The slices are always hot, flavorful, and made with fresh ingredients. Quick service and a welcoming vibe make it an easy go to for great pizza."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gek9URk1iR2swWnpOWFRHaG5TR3QyU25sM1puYxAB",
            "text": "Hands down some of the best pizza I’ve had! The crust was just the right amount of crispy, the toppings were super fresh, and the sauce hit all the right notes. The vibe is relaxed, and the staff makes you feel right at home."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNWVrczBkMmg1UTBoQ1UwTnVlR1ExVUVKNGNtYxAB",
            "text": "Margarita pizza hits the spot, and customer service is the best!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWGVHOW1XR3RpWDBKT2FWTmtXRzUyTjJ4d2RIYxAB",
            "text": "Luciano’s is the perfect pizza place, food is amazing, the price is very fair and the service is excellent they make me feel at home. Recommend heavily !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScFYybzFVekZzUVc4M1dqZEdlVEpVYUc4ek9XYxAB",
            "text": "Very good pizza authentic as it gets"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU1lsZE5OVzFqTW5KMlJGTXlVRzlPTUdWbGQxRRAB",
            "text": "If I could give more stars I would. Great customer service and even better pizza. Would recommend strongly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU05HNVJRV040WDBSM2JFMU1aMGhXTkZGNlNuYxAB",
            "text": "Very Delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R1NXVXRaMVpFVW1ReFp6VlRRelEzWm5kWlJsRRAB",
            "text": "Wonderful workers, they have the best pizza in New York by far."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNU4yMHljRlpoYjFvdGJ6QkNjRlpFWVV4Zk9IYxAB",
            "text": "Our favorite pizza joint! The guys there are awesome, the wait isn't long at all, and the pizza is always delicious (big slices)! We go at least once a week, definitely recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRFZuaElWMGh3ZWtab2JrWkJWa2x5T1ZOU1pIYxAB",
            "text": "Great pizza, quick and friendly service. They have a few tables to eat in."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaWJsQkhZa0ZKVmtGQlltNTJZMlpzWTJFelMyYxAB",
            "text": "My pick for \"best pizza in the bronx\"..(and always nice people working there)..I've only been going there for 35 yrs!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbFZESndXWEZJVm5oSk9UZERjMDl4Vm1saFoxRRAB",
            "text": "My spot when in the area great pizza and white pizza dine in"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQT1Ntb21KMnAycVZ3EAE",
            "text": "Bes.\nT pizza.\nIn morris park in the bronx"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOWVPSUVnEAE",
            "text": "I was going here for many years, enjoyed the pizza and service, but now their rating is \"C\" with the Dept of Health so now I go elsewhere until they clean up their act.\n\nThey are approving, I guess.  They now have a \"B\" rating.  I can't wait until they clean up their act and get a A so that I can go back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNHZfRDBnRRAB",
            "text": "Had cheese slice, and was really nice"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJamM3ZW93RRAB",
            "text": "Was my favorite spot, but just realized they have a B 🤢…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMFpDNHlBRRAB",
            "text": "Delicious doughy pizza. Staff is nice & accommodating. Prices by the pie are very fair. The cheese & sauce are both fantastic."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbU1xeEV3EAE",
            "text": "Best pizza in the Bronx!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eVpxUF93RRAB",
            "text": "When a cash-only place can stay open for as long as Luciano Barone's place, you know it's legit good ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROWE2NHBBRRAB",
            "text": "They make the best Sicilian pizza. Their regular is great too but Sicilian is my favorite"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDdiR2pnRRAB",
            "text": "Okey !!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBM1p5Y0ZBEAE",
            "text": "This is THE BEST pizzeria in a large radius. There’s plenty of competition in this Italian neighborhood but this is the quiet winner. Excellent delivery service as well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNVlpNWlRRRAB",
            "text": "Fresh crispy large slices. Very good. The best I've had in the Bronx."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cE1PM2FnEAE",
            "text": "The best pizza in town I don't get it for nobody else"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MTZtbU13EAE",
            "text": "Stopped in on are way threw,these guys were great very nice food was Amazing! Thanks Luciano."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ2RDWXJRRRAB",
            "text": "Best pizza on Morris Park, no doubt!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbnZDV013EAE",
            "text": "Best real old school Pizza spot. Their space is simply what it's supposed to be. Margherita is superb chef kiss 😘"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ3RqcG9BRRAB",
            "text": "the best in the world"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d3JucXd3RRAB",
            "text": "Excellent, no frills pizza shop with a totally classic vibe. Cash only, fair prices, giant slices and calzones, great quick service, large case of sodas to accompany your slice, and 25-year old newspapers on the walls. I absolutely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibE8zNVd3EAE",
            "text": "This pizzeria is amazing. The ingredients are so fresh. I come all the way from Queens and any chance I come to the Bronx I come here for the Margarita Slice which is 🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybk02WlNnEAE",
            "text": "Been on a quest for the best pizza in The Bronx. Tried several places recently. Lucianos is excellent. Big slices,the dough is very flavorful and proofed perfectly. The sauce is really good and plenty of mozzarella; quality mozzarella. This place is a nice small mom n pop type place with friendly people running it. Id definitely come back and this is one of the best pizzerias ive been to here im The Bronx."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bDZET1hBEAE",
            "text": "Very nice people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6M1pMcjZnRRAB",
            "text": "Nyc pizza? Hell yeah. Fast and scrumptious 😀"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcU02ajBBRRAB",
            "text": "Great pizza to eat and other meals too. 😋😋😋😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cTkzeW13RRAB",
            "text": "Best pizza in the Bronx. I’ve been going here for over 20 years. I since moved away from the neighborhood but I make sure to grab a pie while visiting or make my family bring a pie down to me.\nOnly negative is that they don’t deliver to Maryland!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bWF6MnV3RRAB",
            "text": "I usually watch Dave Portnoy’s pizza reviews and found Luciano's.\nStopped by over the weekend for a regular slice out of curiosity and it was good as they say. It’s not greasy and they don’t skimp on the ingredients, it’s just right. The gentleman who served me was very accommodating and the atmosphere was nice and quiet. I looked over the menu and can honestly say the prices are very reasonably priced. There's a table outside too if you prefer that. Overall Luciano’s offers good quality pizza and my experience was very pleasant. Go there, you won’t be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONmRiNlB3EAE",
            "text": "Overall this place is a go to spot for Pizza. This place has great Pizza🍕😎👍🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcHRDYl9RRRAB",
            "text": "Best pizza on the block compared to the other choices in the area and probably the best pizza in the whole city"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOUw3eHhRRRAB",
            "text": "Layout/atmosphere\n*Four tables; cash only; newspaper article from January 2000 when WWF’s The Rock visited & ate here on the wall; one table on sidewalk\n\nFood/drink\n*Margherita slice - Good; decent size; solid crisp\n*Marinara slice - good; the margherita without the cheese"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMF83bC13RRAB",
            "text": "Good pizza,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dHBIVVdREAE",
            "text": "Small store, can takeout and eat-in. The food is amazing, best pizza, prices are lower than other stores!!\nWould recommend. Amazing staff, very nice."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHczhMOEhREAE",
            "text": "Great pizza, worth take the long road back home to stop and get a slice or few!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d09MX3FBRRAB",
            "text": "Driving around 4 months ago with my wife and found this great pizza spot. It started with a regular slice each. Delicious!Then came back for a pie. Delicious!  Then decided to buy Margherita pie. Insanely super delicious! Have bought…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdnJ2NlpnEAE",
            "text": "This place is a one-of-a-kind old school Italian pizzeria that you only find in NYC. It's a hidden neighborhood gem that serves classic, crispy, fresh pizza, garlic knots, sausage rolls, etc... Walking into the pizzeria you're greeted by…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMWFidTJ3RRAB",
            "text": "$3.50 is a bit high for a slice.\nGood amount of cheese, but it's undercooked.\nMedium thin chewy crisp crust with no notable flavor.\nSauce is okay, but not notable\nCoverage is skimpy for $3.50, too much crust\nOverall, I give it an 88"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaS1UT0hnEAE",
            "text": "The best pizza I've tasted in New York! I prefer fresh mushrooms however from the dough to the sauce and all the ingredients I was truly surprised and 100% satisfied❣️👍😊😍"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4ODRqUnpBRRAB",
            "text": "Delicious.  I think I loved the sicilian slice the best.  Margarita was really good too"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cC1fVkdBEAE",
            "text": "La pizza tiene un buen tamaño ,  muy buen precio considerando la calidad, sabor y tamaño."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eHFLRU93EAE",
            "text": "This place reminds me of one of the many pizza joint in Bensonhurst Brooklyn except the pizza is damn good. The owner could not be more old school Italian. He has one helluva character. The sauce has the right amount of tang. The cheese has…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaTdDaVpREAE",
            "text": "Delicious and nicely priced! Keep in mind the veggie slice has no cheese so you have to ask for it - they happily helped make my slice amazing. Reminded me of my childhood growing up in the Bronx! Nice local pizza🫶🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcFBuMXNnRRAB",
            "text": "NYC short version; “If you know, you know” Go here.\n\nThe well earned version; Customer service from a bygone era, a man with pride in his food and a heart like a true New Yorker, hard as steel and wide as the Hudson. New york is known for its pizza, but while many argue what equipment or cheese they use or the aroma of the sauce as the reasons for going to various locations they frequent, true New Yorkers know that the difference is in the owner and whether he is standing in the store or not most if not all times.\n\nLuciano answers the call himself, I have a unique situation that I am dealing with, he does not only go out of his way, he goes above and beyond, in a way I have never seen before. His confidence that his food is the best is the greatest sales pitch you will ever hear“if you’re not sure on that particular item, I’ll send it with the rest of your order, and if you truly do not like it, do not pay me, but you will like it” a real man, a real human. I cannot recommend that you try this place, at least once highly enough. I have no doubt that his food will be perfect, and I cannot wait to go again next week when in the bronx again.\n\nMay all your experiences in food, be a Luciano Pizza kind of experience!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbXJ1em9RRRAB",
            "text": "By far the best in Morris Park. FAST deliveries, fairly priced ($20 for a large pie is standard price point for any generic spot-so points for staying loyal to the neighborhood too) and the quality of ingredients- balanced red sauce with gentle spice to the slightly sweet tomatoes, holding just a bit of texture, chewy and not salty crust, and the freshest mozz… The basic pie is so good, and I’ve had the grandma pie as well which is impressive. I hear every menu item is made in house. Not to mention I’ve so far only encountered the most genuine humans taking the service as seriously as the food. Note that deliveries are cash only."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOEt6VXR3RRAB",
            "text": "Was driving from Rhode Island back to Va and we couldn’t pass by NY without a good slice of pie! Since our route took us right by the Bronx we googled best pizza in the Bronx. We found it 🙌🏼🍕🫶 We had to hit up the nearest atm for some cash but now we know and we will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtczV5REVBEAE",
            "text": "I wanted to order for delivery, but the person I spoke to the first time, denied my delivery after I said my address. I checked Google maps and indicated I was only 5 mins away so I called back. The same person picked up and I explained my findings and he said I don’t know, speak to the driver. He then passes me to another guy (I guess the driver), who had trouble understanding my request which was only a half pepperoni and vegetable pie. I asked how much that would be and the first person takes the phone and he says it would be 40 dollars, I don’t know, I don’t have time to help you, I have someone on the other line and he denied my delivery. This is super unprofessional and rude. I was surprised because they had a 4.7 rating and I was sadly disappointed."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRd0ptOFpnEAE",
            "text": "Friendly people. Great pizza and huge slices. Sauce and crust are perfect."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdk1TMkVBEAE",
            "text": "By far the best pizza in an area with a lot of competition. Large, delicious slices. The best Grandma slice you’ll ever have. If you’re really hungry, try their meat & cheese calzone. Seriously, don’t go through life without a Grandma slice from Luciano’s."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeDZLUU9nEAE",
            "text": "Yummy food, friendly staff, and most importantly clean place !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLXBITFNREAE",
            "text": "I've been coming here for more than a decade. They're always the same. Pizzas are huge, prices are competitively fair. Just make sure you bring the cash. It is always worth it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2LTlYU3hnRRAB",
            "text": "I grew up eating at Luciano's in the early '90s; unfortunately, I moved to the midwest and have been away from home. Every time I visit NY, I always have to stop by my hometown. It won't disappoint. Highly recommend this place, great food, and outstanding customer service."
        }
    ],
    "reviews_count": 67
}