{
    "name": "Happy Garden",
    "place_id": "ChIJ8dCj2Zf0wokRKwbL3VYijfg",
    "grid": "BX11",
    "address": "706 Morris Park Ave, Bronx, NY 10462, USA",
    "rating": 3.8,
    "user_ratings_total": 186,
    "phone_number": "(718) 409-1471",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJemExWTFiVXBZU2tJMlUwSlhkWFZHY1U5dWEwRRAB",
            "text": "Hot and sour soup is absolutely terrible. More like sweet and sour. I dumped the soup out and in a whole quart of soup I swear I only had 2 pieces of tofu and 2 slices of mushroom. They skimped on the ingredients and the taste was awful. Also chicken in garlic sauce is more like chicken and sweet sauce. They use entirely too much sugar in their food. Would not order again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZmJrRnNRV2RsVEVnNFowODRielEwYkU5b01VRRAB",
            "text": "I don’t ever complain or do reviews because I don’t want to be the bad costumer. But the costumer service on the phone is the worst specially if you call after 7pm the young lady is nasty specially when trying to clarify your order is properly ordered."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa1kwUk9lbEZ6VWtKellXa3pWREZMYlVRek5IYxAB",
            "text": "This food is delicious as hell! My mother and I haven't eaten Chinese food like this in years! There's so much flavor, and they put so much food, and we get immediately full after eating. If we are hungry for Chinese food tonight then we know who to order from! 🤤😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWGFtbDVhekpCYkhGVmVFRlVjMG94WVc1TVdtYxAB",
            "text": "They the worst they give you old food and when you call for a return they say the manager not there !!! They only win bc they deliver and take card!! the worst for someone who lived in the neighborhood 7 years!! Stay away"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJend2b19Ocl82dGd3RRAB",
            "text": "Not a lot of pork in the pork fried rice, the rice was a bit bland, overall it was a good meal but not the best ngl"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOXVldUhBEAE",
            "text": "Sometimes the food isn't as good as usual, but still worth it since they have the best tasting dishes in the area.\nGreat service when ordering delivery as well."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NC03VzZBRRAB",
            "text": "Clean place 👌🏼 ✨️ and service was good. The food 😋 was tasty 😋 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbW92eTFnRRAB",
            "text": "The best orange chicken and rice tis side of the bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOXY3WXRBRRAB",
            "text": "I have never been to happy garden. I have never even seen it. But every single time I want Chinese food in Morris I order from here. The food is just great. I didn't even know it's possible to cook that well. The chicken wings are the best and the general pa tous chicken is just the best. Seriously. The fried rice is OK but the meats in this place is the best. The brocoli in the garlic sauce is the absolute best I've ever tasted. Please try this food. It's the best Chinese take out in Morris and the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyN3VmVTZRRRAB",
            "text": "NO STARS AT ALL!!! CHICKEN TASTE A DAY OLD DRY NO JUICYNESS TO IT I WAS HIGHLY DISAPPOINTED AND THE RICE HAS NO TASTE WHAT A BUMMER😮‍💨😡 AND THE SHRIMP IN MY RICE SMELLED FISHY. I DO NOT RECOMMEND EAT AT YOUR OWN RISK FOLKS🫣…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ0pyclZ3EAE",
            "text": "Nasty food never recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd3N6YjJBRRAB",
            "text": "Rice taste fake."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbE4tT2VBEAE",
            "text": "Clean, fast and not so expensive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNG9LYnZ3RRAB",
            "text": "Garlic sauce chicken wings are fire. Always ask with the extra crispy always comes out fire"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacWVyN1B3EAE",
            "text": "Fire food good fry chicken"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3U2LVd3EAE",
            "text": "Nasty place ! Eggplants with garlic disgusting , the oil dripping all over and no garlic at all. Seemed like it was frozen before. Awful experience, do not recommend to come ever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOEoyU213RRAB",
            "text": "They know me when I call. I love this place and the food is delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3NyeVJnEAE",
            "text": "First and last time I'm ordering from this place.  I ordered sesame chicken  combo. The chicken didn't have sesame seed.  Chicken tasted doughy didn't have the  sauce on the chicken.  No flavor whatsoever  Rice was  bland.  Egg roll was dry.  I DO NOT RECOMMEND THIS CHINESE  RESTAURANT    $10.00 meal thrown in the garbage."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKd1kzd0JBEAE",
            "text": "Delivery guy is extremely rude. The food did not taste well. I asked for extra vegetables the vegetables wasn’t even cut. It was big chunks of onion, the crab sticks with soggy definitely was a waste of money"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cmJMRW13RRAB",
            "text": "My spot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z2NQRWJREAE",
            "text": "Do not call this number they stole my mother’s information."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOXMzTlp3EAE",
            "text": "Delivery is fast"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOGVyb2pBRRAB",
            "text": "A typical Chinese takeaway with very low prices and an unexpectedly good taste!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHRtOXJnRRAB",
            "text": "Expensive for 1 order,was charged 27$ for sesami chicken and broccoli with cheese wontons,the guy was also incredibly difficult to understand"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cE02VEdREAE",
            "text": "The delivery man was very pleasant however the food has lately been way over cooked.  I thought maybe once or twice but it was the third time and I couldn't  chew the chicken at all unless I broke my tooth in the process! So I had to throw out my dinner!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMjZuYld3EAE",
            "text": "Very efficient service. The quality and food tastes authentic."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXejduTV9BRRAB",
            "text": "' Beef Fried rice with Egg Foo Young Sauce ;\nAbsolutely Delicious !!."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdEppUzlBRRAB",
            "text": "Beef Fried Rice with Egg Foo Young Sauce\nIs about to be Ordered !!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OHRHVk93EAE",
            "text": "Well for a neighborhood hole in the wall it's pretty good with take out service. Good portions and it's afford able my usual in the fall and winter months I get the General Taos tofu and spicy chicken soup great way to stay warm . also it has a decent menu with a variety Asian and American dishes ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bXFpVkx3EAE",
            "text": "Was very good feels like home!"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeGM2QnNRRRAB",
            "text": "The fastest food delivery I have ever experience. Logistics from call to customer satisfaction is on point.\n\nThank you!\n\nLa experiencia más rápida de entrega de comida que yo e tenido ! La logística desde la llamada hasta la satisfacción del cliente está a punto.\n\nMuchas gracias!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaTlPZmVnEAE",
            "text": "Nasty never again 🤢…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOWFPNFZnEAE",
            "text": "Good food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5djlTY2JBEAE",
            "text": "Great food"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MGVXTXBRRRAB",
            "text": "Me and my family have been eating here for about 11 years. Service is always impeccable and delivery times a rapid. I love this place !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bTRMMXVRRRAB",
            "text": "30$ on food that was disgusting even though homeless eat better than this for $30 I am so disappointed my tea is run down my face that's how disappointed I am and no solution money is hard I guess today I am fasting this food will be dropped off tomorrow"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5OHFfdVZ3EAE",
            "text": "These reviews must be fake! They have no regard for customers, I placed an order here at 11am to be here at my job at 12pm, it’s 12:35pm when I called them asking where my order is and at 12:40pm is when they get here, not one single person…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTb3M2eHF3RRAB",
            "text": "Love them, always so nice and food is always so good!! Best in area!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDOTdMaHJRRRAB",
            "text": "I know them 20 years there like family"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDb2FmWW5RRRAB",
            "text": "One of  the best restaurants in The Bronx. Love there food.  And customer service. Keep up with the good work."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjcE5ybDRBRRAB",
            "text": "I was excited and happy to see them reopen and as I tell my co workers of how good and fresh the food I was disappointed on my orders. First day I called to verify they open my order was cancelled because their driver called out. So I go…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNE9PZFBnEAE",
            "text": "I have never had a bad experience with Happy Garden. The food is delicious and clean. Food gets delivered quickly and still hot; the delivery man is always polite. I have been ordering from them for 3 years and all is well."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdkpEOTlnRRAB",
            "text": "I have been a loyal customer of Happy Garden since I was a boy in the early 80s. There is not one thing on their menu that I haven't tried that is bad. Everything they make is great and tasty. And given the neighborhood the prices here for their menu items are very reasonable."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOThmZWpBRRAB",
            "text": "I have been living in the area for a few years. I'm Asian and Asian don't order Chinese from American-Chinese. I find that this place makes better quality food than the rest in the area, and is appreciative of my business comparing to others within the area. Food is always delivered on time and never had much problem. Except they forget or bring the wrong soda or missing item once in a while, but they always redeliver my 1 can of soda if I call them.\n\nIt's a good place to call when you want to feel like a kid again like opening a bag of goodies. The variety you order sometimes feels like you're opening a box of chocolates especially during school finals. Though it can get expensive if you keep ordering on a regular basis, especially if you like the chef specials. My orders usually come out to $20+ on average 3-4 times a month.\n\nThe delivery man is always ontime, rain or snow. not like others who makes me walk down and outside, he always comes up to the 2nd floor to wait for me if I need time to get money even when its cold out, yes I tip. I see some reviews here that talks against the deliveryman being rude. Honestly I know how some bronx ppl are, they can be rude too and tipless so no wonder why you get an angry guy."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dS1haFNnEAE",
            "text": "I ordered from them today and I ordered some chicken fried rice. When I got It, I was like “WHAT kinda chicken is that?” I swear that was some chewy, weird looking chicken. Invest in some better chicken cause that made me feel like I was eating like half cooked chicken. Sweet and sour was decent, again, chicken was strange."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcjRqTzFnRRAB",
            "text": "I asked for delivery tonight and the delivery guy had the nerve to call me and told me to come down and get my food because I don't tip!! First of all I always tip!! Im a hair dresser and I know we in the service business depend on our…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndlB2c3RRRRAB",
            "text": "Only thing good about this place is the delievery man. This place over chargers. They prices are do not match what is on the menu they even charge for applying BBQ sauce and Ketchup!!! Make sure you have a menu before ordering at this location NEW MANAGEMENT IS TERRIBLE !!! 😒…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNM2RTY29BRRAB",
            "text": "This is serviceable, typical Chinese food. I was giving it a chance. I usually order China Wok and after trying Happy Garden I am going back to China Wok. I ordered their General Tsos and asked to please make it crispy and the woman said ok ok but it was soggy and like eating a wet sponge. So disappointed!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNEtDaGx3RRAB",
            "text": "I had always gotten my Chinese food from here but this time was my last after they got my order wrong. I called to report the mistake and they said they would send the correct order but after two hours of waiting I never recieved my order. I got my money back at the end but worse food experience. Really disappointed..."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MlpLeE5REAE",
            "text": "I had visited this restaurant in the past I remembered how good the food was I did not have a telephone number or menu on hand so I decided to take the 8 block walk and try it again. Wow my memory was correct this is the best Chinese food…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneWRHbGpBRRAB",
            "text": "I recommend calling for your orders. The staff is very nice when I go pick up my orders. They prepare the food on the spot so it is always hot and fresh."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dE5HcFZnEAE",
            "text": "Very good and inexpensive. Good delivery service. Food gets to you still warm and fresh. Definitely my favorite around the Morris Park section of the Bronx."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dDR5ZWZBEAE",
            "text": "Well over a decade eating here they never dissapoint the quality of food is always delicious and fresh although I wish the had better delivery the driver is always late and grumpy."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwNDY2OE9REAE",
            "text": "Have been ordering from Happy Garden for years. Our orders are always correct, hot and on time. Great delivery service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjajRpdFBBEAE",
            "text": "If I could give them a 0 I would. I went to the store and place an order never again they gave me the order wrong and when I call to report the issue the manager lie to me over the phone and said that I will get my correct order in 15 minutes LIER, it being more than 2 hr.Unbelievable horrible service"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaVBHQW1RRRAB",
            "text": "The delivery man is HIGHLY RUDE AND DISRESPECTFUL! He decided to put his hands on me, me a few nights ago. The cops had to be called and everything. He will be the down fall of this restaurant no doubt about it! I am so disgusted to learn he is still working"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeDdMYkpBEAE",
            "text": "The food is really good and the food rarely ever takes long when being delivered. The delivery guy is always so nice."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNkw3Rm1RRRAB",
            "text": "Very untrained employees and bad service, beside that they forgot my chopstick they wasn’t able to redeliver it. Definitely not a place  where I would recommend anyone I know. Good luck."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROXV2eDdRRRAB",
            "text": "Food is good, great price but the look of the place need more cleaning and the delivery needs how treat people and more manners."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjMG9LQ3B3RRAB",
            "text": "Decent food. The egg foo young was so good. Prices  not bad. Will go back again"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRb3RxcDJnRRAB",
            "text": "Ordered the same thing 2 different times and both times, the rice was undercooked and the chicken made me sick it was so oily. Will never eat here again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4eWVpZzRnRRAB",
            "text": "Happy Garden Service much is BETTER than Joy garden, just saying & Food was Freshly prepared, just saying ~"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NGZUdWt3RRAB",
            "text": "Great food, great prices, but the delivery man Is rude."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3MzRTamR3EAE",
            "text": "Horrible food, i ordered boneless chicken and it wasnt well cooked at all. Bad service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZX1ktdld3EAE",
            "text": "The food taste good.. If you want something quick and fast, this is the place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMEsycnJRRRAB",
            "text": "Terrible service. Always forget part of order. Food is almost cold and late."
        }
    ],
    "reviews_count": 66
}