{
    "name": "Flourish bx inc",
    "place_id": "ChIJu6ZmKaPzwokR8XRmvL0NCWw",
    "grid": "BX12",
    "address": "4035 Laconia Ave, Bronx, NY 10466, USA",
    "rating": 4.3,
    "user_ratings_total": 94,
    "phone_number": "(347) 859-9413",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVmJFTnhNMVJwZDI5RWRsZG1ielZmVUdGdFNIYxAB",
            "text": "Food is amazingly delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSWEwazRhbG81UkRoVGQyaE1kMWxrY2todlQxRRAB",
            "text": "I ordered a whiting meal with seafood mac and cheese (which is an additional $5.00 and steamed vegetables.  All I received was one piece of fish wrapped in aluminum foil.  You need better quality and control."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdGRYcEpTWFpVUldGVmVtVjJVVzB5TnpsWWNFRRAB",
            "text": "When I tell you I LOVE their food? I am INLOVE! The best tasting Jamaican food ever! And when it comes to service? Jacinth is my GIRL! She’s the epitome of AMAZING customer service! I love her DOWN!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCa1IxQkhkbkYxV1c1dk56bFJTMFpqYVhodVVFRRAB",
            "text": "Ordered steamed fish and it was quite literally the best fish!! Well-seasoned and nice. I drove all the way from New Jersey to get this and it was WELL worth the trip! Cashier was very sweet. 10/10 experience. It’s not often you find restaurants in the Bronx that provide excellent service & FOOD!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcE1HNDROazFQYVdGWFNFdDRNazlYU0hSelFrRRAB",
            "text": "So I am very very picky about food and often times people will consider me the best food critic. I normally do Yelp reviews but I was unable to find the Yelp page for the business. Jamaican food establishments normally start out extremely well and after some time dem fall off (food gets bad). However, the food here is very good and its CONSISTENT. My favorite items to order are seafood soup, chili shrimp, chili wings, and the festival. The service is always good and you wont be faced with the stereotypical \"upset Jamaican\" servers but the food is actually good. The seafood soup is my absolute favorite and the flavors are great with and nice and spicy. I'm addicted to the food here and always want to try new things but stick to my old faithful's. Please get the seafood soup or the chili shrimp if you go and thank me later."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM2JWY3lOaTFMWkhKZkxWUldiak51UTBsRk4yYxAB",
            "text": "Food was great customer service was great would definitely make it my number one stop."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTFQzQllSbEJqUVd0VlEwRmFNbWRSUlhKTGJGRRAB",
            "text": "Ok so my boyfriend and I were referred to this place by a friend, we were specifically looking for a place that had jerk chicken and mac. First time going, we had no issue, the young woman at the counter (the one with the glasses, you are appreciated girl!!) served us, we loved the food, and how packed the plates were. - Now obviously we came back a few times, the older woman working the counter gave us so much attitude, and one time even had us waiting an hour for food! She’s warmed up to us now being that I guess she sees we come in on a regular, so there’s no more attitude. But what I will say is the biggest issue with this place, they will carelessly and intentionally mess up your order if you place one for delivery. They will give you old food if they have any from the day previous, they won’t give you the sides you asked for, and if you happen to use a coupon on a delivery app, they will charge you extra just because they feel like it LOL. For example, today my boyfriend send me a plate via grubhub, and he used a 40% off coupon. In the notes I asked for Mac, mash, and broccoli, and I paid for a side of shrimp. They sent me cheeseless mac, had to be from yesterday, cabbage, and no mash. There was no side of shrimp either. I got my money back but this isn’t the first time, and I’ve already lost about $80 to this place in “wrong orders”. Order at your own risk"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOZkw5Y0xMNG9lTlVREAE",
            "text": "Food is usually good but lately the jerk salmon has been burnt every time I order on Ubereats. It’s charred black I have to scrape off most of the fish."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbFpEeEdnEAE",
            "text": "Probably the best modern jamaican restaurant when it comes to decor, quality of service, and how good the food is. Top notch!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmMzQkp3EAE",
            "text": "Cool"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveUt2MlVBEAE",
            "text": "Finally a spot that don't miss.i recommend this restaurant if you want freshly made good portions good taste"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNnNQTVBREAE",
            "text": "Love da place the food there is yummy you can smell it and u feel like having it 😋😋😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eWQzSXpBRRAB",
            "text": "VERY UPSET to be traveling all the way from Harlem on public transportation to not be able to eat! It takes me a lil over an hr to get here from my place just for them to run out of Mac n cheese before 3pm.. not even some in the back being made just straight out of inventory which is insane, aren't ya open until 10pm? Ya know darn well that Mac be bussin for ya to not have more in the back of the house. So I ended up going home with nothing this the second time ya ran out of something before 5pm even hit first time was the oxtail lomein as well.. I doing know what's going on but it seem you can't get certain food after 3pm 😐"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ai1xbjJBRRAB",
            "text": "Food so delicious !! Didn’t feel like coming out so I did DoorDash food was amazing !!! Service is definitely a 10/10 ❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bHA3LWdnRRAB",
            "text": "Came here all the way from Harlem 2 TRAIN plus feet after seeing a video reel on Instagram and mannnnn it was worth the travel and them long ole blocks I got the jerk chicken platter ate a little there and had grab some jerk wings to goo lol. Their service is lovely not cheap with their portions food WILD GOOD everything and they gave us free pina coladas once they heard we came a long way and it was our first time here, and their prices are very decent. WE WILL DEFINITELY BE COMING BACK TO TRY MORE OPTIONS 😩‼️\n\nPs this is the next day I wrote this review that's how you know I couldn't forget to post this 😂"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNWJxd2dBRRAB",
            "text": "I been ordering flourish since before they became a restaurant! I always enjoyed their food their presentation. So glad I work near by I been getting this more often since changing jobs now I’m glad I can walk to them!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcmFxNmd3RRAB",
            "text": "Food is really really good  customer service is also great  👍 👌  was a pleasure getting food there"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2d3JDS0hREAE",
            "text": "Though there was a mistake on my order after calling the store they went above and beyond to ensure it was corrected. Customer Service on point plus food taste good…."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNGNxRWF3EAE",
            "text": "Great food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNnZiUHBBRRAB",
            "text": "Flourish in the Bronx is my Uptown spot where my taste buds go on vacation! As soon as I walk in, I know I’m in for a flavor-packed adventure straight from the Caribbean—no plane ticket required. Their jerk chicken? Absolute fire, like it’s been kissed by the island sun itself. And don’t even get me started on the oxtail—so tender it practically melts. The plantains are the perfect level of sweet, and every bite makes me feel like I’m on a beach with a steel drum band in the background.\n\nBut it’s not just the food; the vibe at Flourish is warm and welcoming, like they’re expecting you to stop by for Sunday dinner. The staff? A+ hospitality, all smiles, and probably the friendliest folks in the Bronx. Honestly, if you’re looking for authentic Caribbean soul food that hits every single mark. I say soul food because they aren’t like some Jamaican restaurant that can’t make Mac n cheese lol Flourish is where you need to be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcW9uVGJ3EAE",
            "text": "It's been a while since I last felt the need to write a review, but this place made it impossible not to. Hands down, one of the cleanest Jamaican spots I’ve been to (no disrespect to my previous go-tos). The food was top-notch – fresh, flavorful, and cooked just right. They offer dine-in, but I opted for takeout. Prices were very reasonable, especially considering the quality. Highly recommend this spot; the flavors were 🔥!\n\nP.S. NYPD friendly! ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdTk2SWhnRRAB",
            "text": "The service at Flourish is amazing. The first Jamaican restaurant that they are kind and pleasant. The food is phenomenal. I  really enjoy the pasta. Let not talk about the sweet chilli wings. I give this restaurant 10/10!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcEt2cmtRRRAB",
            "text": "The food was delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLU5yX2R3EAE",
            "text": "I absolutely love Flourish! The atmosphere is cozy, and the food is always fresh and delicious. The staff are super friendly and make you feel like a regular from the first visit. It’s quickly become one of my favorite places to eat!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaTlQRTZRRRAB",
            "text": "My experience at flourish is always amazing. The staff is always kind and welcoming.  I literally come at least twice a week and they always know what my order is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN3Fqc3V3RRAB",
            "text": "Both the food and the service at Flourish, are excellent -"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuelpMeUVnEAE",
            "text": "Best food in nyc\nGrate customer service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dXVyTTFBRRAB",
            "text": "I love their shrimp Mac n cheese!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d3NyWlRBEAE",
            "text": "My favorite signature meal to get is sweet chili salmon, Mac & cheese, mash potato & broccoli. The shrimp Rasta pasta is sooo good (and it’s made to order) the entire menu overall is great. Great vibes, great customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d3FMSUNBEAE",
            "text": "The service was friendly and attentive.. the staff was quick to offer me recommendations and ensure that all my needs were met… definitely going back…. The steak and shrimp pasts is to die for"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cUl5OURREAE",
            "text": "I CANNOT BELIEVE THEY GAVE ME DAY OLD DRY TOUGH OXTAILS AT 1PM I SWEAR IF YOU ARE HAVING YOUR FOOD DELIVERED THEY DO NOT CARE WHAT AND HOW THEY GIVE YOU UR FOOD I DIDNT EVEN HAVE GRAVY IN THE MEAL I AM SO DISAPPOINTED AND UNSATISFIED SHAME ON YOU GUYS. YOU ARE LUCKY UR NOT WORTH ME COMING TO UR STORE AND LET YOU GUYS HEAR MY MOUTH!!!🤬 WORST FOOD EVER THE PEOPLE WHO MADE GOOD REVIEWS FOR THIS PLACE MUST NOT COOK WELL AND KNOW WHAT TASTY FOOD TASTE LIKE BECAUSE THIS IS NOT THE SPOT AT ALL!  YOU GUYS NEED ZERO STARS! FOLKS DO NOT I REPEAT DO NOT BE FOOLED BY THE PICTURES THEY ARE JUST AS PHOTO SHOPPED AS SOCIAL MEDIA PICTURES!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb083OHR3RRAB",
            "text": "I was Visiting from Las Vegas which is a state with great casinos and restaurants in hospitality! I rarely eat out and when I do I look for the best in the community! This was an awesome find on my vacation! Awesome customer service ! Unique Recipes. The food was delightful ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cHVxdWdBRRAB",
            "text": "The best food in the area hands down 😋🥰🌸"
        },
        {
            "date": "1년 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUODdlUFF3EAE",
            "text": "Dopest spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbzh2b0dBEAE",
            "text": "Take care of the costume"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdzhQb0RnEAE",
            "text": "Best food spot in the bx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbmM3aHpRRRAB",
            "text": "Welcoming atmosphere…. The servers are amazing and the food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUclllanpBRRAB",
            "text": "Best Caribbean food EVER ! Place is super neat super clean ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmFpaThRRRAB",
            "text": "The food was served with love ! The store was clean and the food was handled with care. I can’t wait to go back !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcmNpT0ZBEAE",
            "text": "If you are looking for real home cooked Jamaican cuisine, this is the place to be. Everything here is made with love. The ladies in the front are so pleasant. 10/10 Recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaFpTWG5BRRAB",
            "text": "The food here is spectacular. Everything looks good. The workers are friendly and patient. Definitely returning. The lamb was to die for"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbWN5dHJ3RRAB",
            "text": "wonderful customer service, food is magnificent ! definitely a 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMGVQUldREAE",
            "text": "Exceptional cuisine with a warm, inviting atmosphere……..i  love the chicken and shrimp pasta"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa2ZQcnNBRRAB",
            "text": "I love everything about this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb2JUUVR3EAE",
            "text": "I go here everyday for lunch and dinner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN3JMNmVREAE",
            "text": "The food was amazing and plated with love. I bought one plate of food and had enough for the next day for a decent price. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcm91Q29nRRAB",
            "text": "The service was perfect. The customer service was great The presentation of my order  made me excited to enjoy my meal not to mention to taste 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUanJpUml3RRAB",
            "text": "Food was great and they have a lot of options more than other Jamaican/ American restaurants I’ve been to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUanJDNjBBRRAB",
            "text": "Food was well prepared !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdHBqSnRRRRAB",
            "text": "I called and ordered my food. It was ready when I arrived which was a plus and the food was very good another plus. I would be going back !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bktPMGlRRRAB",
            "text": "Best restaurant in uptown Bronx! Very flavorful and tastes amazing! Whenever you’re in the area def give them a try"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX3ItSDFBRRAB",
            "text": "The service was fine, considering the stereotypes about patronizing a Jamaican restaurant. The staff was eating her own food at the register, and I unfortunately had to disrupt her phone conversation for service (LOL)! While the space hasn’t been open for long the atmosphere looks a little rough around the edges, which isn’t horrible cause no one really wants to dine in (shrugs). The chef was awesome enough to fry up a couple of fresh festivals for my meal; which is a nice balance to the rest of the food which is prepped hours in advance and left out to serve, which is why the food is always cold! There were items that were advertised on menu, but were not available to order (typical Jamaican restaurant) . If ur looking for a little around the way Jamaican spot, this one is pretty typical- nothing fancy or extraordinary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeHZiRmJ3EAE",
            "text": "Sadly I won’t be buying food from this establishment anymore. I’ve given them 3 tries and all 3x the food is cold. The mash potatoes have no flavor what’s so ever no taste of salt. I loved the food when they were selling plates via IG. But the restaurant food is just nasty. The Jamaican restaurant a few blocks up is way better and pocket friendly. I"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcnY2Vm1BRRAB",
            "text": "I've tried a few things and so far good. I'm a big fan of the sweet chili shrimp, sweet chili salmon and the grilled shrimp rasta pasta (the shrimp is freshly grilled and is delicious!). Food quality and quantity are good.\n\nI really like that they have broccoli and not only cabbage (like most places). My only comment is that I wish the broccoli were cooked a little less (a little crunch on broccoli is delicious).\n\nI also like the mashed potatoes. Items like these make this menu stand out from others (most places only have rice and peas, Mac & cheese and overcooked, tasteless cabbage as sides).\n\nI'd also love a veggie plate. The only way to have a non meat plate is to order each side separately.\n\nAlso, if they had fresh juices, I'd buy them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWN1lMTGxnRRAB",
            "text": "I ordered chicken soup and curry goat. The soup was cold salty and full of garlic. No other flavor. The goat and rice was cold? I'm wondering if the warmers were off. I won't go back. Sad becuase when they serve food at parties it's way better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cEx6djRnRRAB",
            "text": "I’ve visited this restaurant multiple times and they never miss! The food is sooo good, especially the seafood. When I go, I order multiple things because everything tastes as good as it looks. The staff is always welcoming and professional. Definitely one of my new favorite restaurants in the BX."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eE9IdmRREAE",
            "text": "I really looked forward to trying the food after following their instagram account. I drove out of my way to support them. The server gave me a half filled plate and charged me 17.42 for a large jerk chicken. I had one small piece of chicken chopped up with a few tablespoon sof rice. For shane! Their large is a small. The seasonrd rice had no taste. Glad that I had them put gravy on it. The chicken tasted fine but it was a boney small piece. I was ripped off. I wont be going  back. I am unfollowing them as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z0xyUmdnRRAB",
            "text": "The food is good. However, I just think it’s odd that whether you get a medium or large you get the same serving of macaroni. The plates look shallow to me. The price in comparison to the serving doesn’t equate to me. But spend as you please ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z05QVTFRRRAB",
            "text": "Food is generally ok. But today 05/07/2023 i had the worst encounter here, the cashier a dark skin loud woman was so rude to me i had to ask for a refund IMMEDIATELY she had an attitude with me as soon as i got in the establishment she was rushing me to pay and when i told her hold on she started yelling and cursing at me she was so irate that the whole restaurant had to take her to the back and try to calm her down. I’m not sure about anyone but i will not be spending my money somewhere that i can’t even get good service from. That problem needs to be fixed two other employees helped me and gave me my refund though so no money lost but she needs to be replaced she clearly doesn’t have any proper customer service training and is a nasty rude individual."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeGQtdWJBEAE",
            "text": "The food at Flourish is authentic, made fresh & it is so delicious. It is not overseasoned & has the right amount of spice. The restaurant is clean and the service is great.  The staff at Flourish is friendly & cater to your needs. I highly recommend this restaurant to anyone who loves authentic carribean food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacDctQV9BRRAB",
            "text": "This is my first time trying Flourish. When I say they understood the assignment, they got it on the first try. The fried shrimp and macaroni was just soooo yummy. I will be ordering again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcHNheGJnEAE",
            "text": "Delicious, presentation and portions are perfect. They have raised the bar you have a new fav customer thanks alot for what you guys are doing it definitely shows."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaExuODRnRRAB",
            "text": "The food was great, freshly prepared and they had great customer service. Will definitely be going again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dEpYUjF3RRAB",
            "text": "I've been getting food from here since day 1 when they delivered to your door and baby they do not disappoint  everything just taste sooo scrumptious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdktuTTl3RRAB",
            "text": "This food is horrible I ordered seafood Mac and cheese the food was BROWN LOOKING  the seafood was way OVER cook the fish was old I am not happy"
        }
    ],
    "reviews_count": 65
}