{
    "name": "Seven Spices",
    "place_id": "ChIJTz8jr0DzwokRixqqU1s0_dY",
    "grid": "BX12",
    "address": "906 E Gun Hill Rd, Bronx, NY 10469, USA",
    "rating": 4.4,
    "user_ratings_total": 174,
    "phone_number": "(347) 326-8646",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbnNPVl93RRAB",
            "text": "I've been going to Seven Spices for years,,.I've never been disappointed. I've even had his food catered. Very tasty 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPRzR4dFNQc1BibGpRRRAB",
            "text": "The food was OK but the guy that serves the food is very rude. That’s all I have to say."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMzgyX3ZkaV9DNll3EAE",
            "text": "1st here traveling from Ohio and I would say we were very pleased with the food and service.\nRoti, Oxtails and chicken is a must will be back for sure"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaXZUeFB3EAE",
            "text": "Service was poor, bakes were cold and greasy. Chow mein noodles were greasy with canned veg."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dnBuT0R3EAE",
            "text": "This is the best food. The vegetarian roti is delicious.  Highly recommend. Conveniently located next to a popular bus stop. So you can hop on the bus to get where you need to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIX3Zfemd3RRAB",
            "text": "Very good food 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NC12X293RRAB",
            "text": "The worst vegetarian roti I’ve tasted. It came with this nasty tasting creamed based spinach, steamed cabbage. They didn’t have no channa or potatoes to go with it. The cost was $14. The bread pudding and rum cake was stale tasting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MzRxYzlBRRAB",
            "text": "Asked for a small curry chicken...plate was def not small..it was delicious and I will most definitely come back for more"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeXFlTkZ3EAE",
            "text": "I just would like to say I love this restaurant so much everything is always so flavorful and worth the money. To anyone who reads any negative reviews about the owner PLEASE do not listen to that. He is a kind man and I see a few reviews of people saying he’s rude and miserable and that is Not true at all. Wonderful food and service. I will be back with my food pics 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eHVQZjFRRRAB",
            "text": "Fresh food made daily with a sense for flavor and spice. Spinach, Okra, mixed vegetables, fried fish, baked fish, shrimp,  chicken breast, rice and peas, pasta, oxtail, pumpkin, roti etc, etc, etc. Try it while you are on the go"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNlBIQW53RRAB",
            "text": "Live their bread pudding and coconut muffins."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscGNmaW1BRRAB",
            "text": "The food is wonderful. It tasty like home."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabVB2VW9nRRAB",
            "text": "If you like your jerk chicken hot. This is the place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwODRXblZREAE",
            "text": "I ordered a goat roti very disappointing\nThe portion was large the goat had no taste not seasoned the roti skin dry"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNElQcFV3EAE",
            "text": "Love their food, tasty and flavorful would order from them again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdVpMMGpBRRAB",
            "text": "This is a very small local place.  We ordered chicken roti which was good and came in large portions (aside from there being too many small bones in chicken and roti being a bit on the dry side). Unfortunately the seating/ordering area is an extremely small space that  was overcrowded on a week night with individuals not wearing masks and hanging out instead of ordering take out or eating. Aside from having less bones in food, they could also provide better service to customers by placing signage on front door stating masks are required for reservations & curbside pick-up, closing the seating area to public and only using it for reservations during lunch hours which would keep seating area cleaner and allow for proper social distancing.  They could also provide signage on front door informing customers of delivery service(s) they use, such as Grub Hub etc and only allow curbside pick-up for phone/on-line orders (masks required of course)…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNUluNlp3EAE",
            "text": "Seven Spices"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldF8zSXJ3RRAB",
            "text": "The food was terrific and the people are so nice 👍🏻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ2NuRmtBRRAB",
            "text": "The sandwich is salt fish in a dumpling. Oh how I crave this in the morning and. My cousin Pretty let me up on this. Thanks again  big Ed!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeXF5NC1RRRAB",
            "text": "If you want REAL Carribean food, this is the place! The workers take the time to listen to customers and prepare the food very well. They're also very nice. My favorite thing to get is their white rice with fried chicken, oxtail gravy on the rice, mac and cheese, and a side of veggies... the fried chicken is soooo good. And so is the mac and cheese! Go to Seven Spices, you'll love it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cnZLcnJBRRAB",
            "text": "Good location and their baked breads are fresh & good. Lunch special is priced just right"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cUxXQldBEAE",
            "text": "I've eaten here since opening. While the food is good, some variety or daily specials might give the place some life. The owner is just plain unhappy and rude. He seems very angry. He resents questions yet neglects to give consistent…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN0pDNVdnEAE",
            "text": "I give it a 4.5. And only because I only had 1 dish. But boyyyyyyyy was that one dish. delicious.\n\nOx tail, rice and peas, with Mac n cheese. Ox tail was perfect. The spices they use and sauces. Just the right amount. I only wish I had more Ox meat. 🤤 Rice and peas. Good. No complaint there. Mac and cheese was perfect. Cheese crispy at the top. Cheese oozing at the bottom."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdFluMnh3RRAB",
            "text": "I went here yesterday scared cause ive only found decent Jamaican food in brooklyn but im pregnant so it was a must and boy am i happy i did go in the owner was very nice and bendable with his price and the fooood was out of this world brooklyn who? Lol this place is a definite must try"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM0tHMmRBEAE",
            "text": "Best place to eat for me. Whenever I'm in the area. Give me the  Mac&cheese,spinach and pumkin and I'm good. Thank you"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBazQtd0NREAE",
            "text": "the best guynes food in nyc hand down.\nThe food is great love this place"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHc1pHNklREAE",
            "text": "Wasn't impressed by the pastries."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2M295QU5nEAE",
            "text": "The chicken Roti is so good omggggggg"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbHRiV2RREAE",
            "text": "Horrible service, over charging price $18 for just baked mac and cheese medium size, and $15 for rice and chicken . I don't even think they have a set price because every time I ordered is a different fee. After paying $27 for two items…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhZzZuMHZ3RRAB",
            "text": "The place is amazing! The food was great and the server Carlos was the best! I recommend it to everyone to come here and try. I will come back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhblBtYk1REAE",
            "text": "awesome guyanese food"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMUpmNTRnRRAB",
            "text": "Food was great. Edwardo’s service was fantastic!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbXRlN1B3EAE",
            "text": "Love the food. The Salmon and Curry Goat Love it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcmRILXV3RRAB",
            "text": "Amazing flavorful foods."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeWFMSm93RRAB",
            "text": "Love Love the spinach codfish roti! Definitely a burst to the appetite..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcFBpY3dBRRAB",
            "text": "If you’re in the Bronx and you want PURE caribbean food this is seriously the only place to go. Wonderful people. DELICIOUS 🤤 Food. Thank me right now! You will not be disappointed.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxLU9ubm93RRAB",
            "text": "Love the  home cook meals"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bl9hb1VnEAE",
            "text": "Honestly the food tastes so good I am forced to make this review, great prices and good quantity per serving. You will be full before the plate is finished, I’m over six foot tall and I can barely finish the medium size.. thank you... :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5d2JlZlNnEAE",
            "text": "The food is great The owners are always very excited to please 😀you…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5aVpiMENREAE",
            "text": "Always good food..baked salmon, rice & peas & cabbage are always my go to.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTa19pc0VnEAE",
            "text": "Delicious food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpMUxxNkFnEAE",
            "text": "The food was very tasty. I will return."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdmQyUWRnEAE",
            "text": "The best chicken soup in NYC."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeU9pbUJBEAE",
            "text": "Excellent chop mein wonderful desserts and great service if you love  🇬🇾 the support 👑 of BX with great dishes…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjbjUyWDNBRRAB",
            "text": "Love there Mac & cheese and there spinach"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaHNXRzRnRRAB",
            "text": "If you need your Caribbean fix, this is the spot. The chef knows how to actually make the stuff. Sign looks good as day 1. Support your local restaurants."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cVlUZ3N3RRAB",
            "text": "Love this place, been here four times now, solid food every time. I typically get a small jerk chicken with cabbage, rice and beans and bread pudding for under $8. Very happy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJa2R1ZVd3EAE",
            "text": "Great Guyanese People, their Food is Great. Prices and Services are Great. It's Cozy and Easy to Find. On Bus routes, Cross and Uptown. You will be Satisfied with the efforts Spend. Check out the Pastries and Cakes. Love it all. Happy Thanksgiving Season, to One and all."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVNlBPdFdBEAE",
            "text": "Definitely one of my favorite spots the food is excellent the staff is friendly and you must try this fish cakes they are awesome oh and by the way the hot sauce the red sauce!!!  Off the hook!\n\nYou must go and experience for yourself food is excellent"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzNEpUWk1BEAE",
            "text": "Impeccable service, great brown stew fish and salmon! Mac n cheese. Okra. Bread pudding. Etc. It's not loaded with sodium like most places....I ate VERY GOOD!!!! 2 thumbs Up"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOEx1WUtnEAE",
            "text": "Clean delicious fresh food. There  baked  mac & cheese is so good. I love there baked rotisserie chicken so juicy and falls off the bone. Love the oxtails and curry chicken. They have a variety of different foods and also offer homemade cakes, pies, and bread. The inside is always always always clean. The tables are niceky designed and they have a crystal clear 50' flat screen HD television that's wall mounted. Their lovely people. Mr. Spice and his wife i call Ms. Roxanne are people friendly and  courtesy. They also offer different sizes, but still give plenty..not just fill your plate up with a lot of rice. Its an overall excellent 5 star restaurant that is very well appreciated in my neighborhood.. And especially to me.\n\nLalynda"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbE8yN1lnEAE",
            "text": "This location is the best Guyanese  (Caribbean) restaurant in New York. Always fresh tasty foods & pastries.  Mr. George (owner) & other staff is courteous.  Easy access to I95. Anytime I'm in the area I must stop here."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOTlDa0lnEAE",
            "text": "Will literally drive over 5 miles just to go to this place for some good Caribbean food!…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNzRtZXZ3RRAB",
            "text": "If you want to experience some good home cook meals made just the way your Grandma would have cook it, eat here at Seven spices Guyanese Resturant, they are the best in the tri state."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMEpqVE9nEAE",
            "text": "I'm from out of town and the sweetest lady was helping me. SPICES will always get my business when I come back into town.. the food is GREAT!!!!! THE STAFF IS EXCELLENT!!!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNlpTbm13RRAB",
            "text": "7 spices at 906 E Gun Hill Rd, Bronx, NY 10469 is the best carribean restaurant ... i've been there so many times .. I had their cow feet soups, bake n salt fish,  chiken soup and today I had their jerk chicken .. omg so good.. it has nice balance flavor...  if you live in the area try it!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdl9mZmhRRRAB",
            "text": "My favorite place to eat on gun hill. Great potions great price amazing taste!! The owners are always friendly!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnel95b2JBEAE",
            "text": "Good Guyanese food and plenty of variety - rather eat here than the typical Brooklyn and Queens Guyanese places. Mac and cheese is the best."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaUltbFZBEAE",
            "text": "Really good food  . Place is very clean and  the service was excellent  !  It's a Small place.  Great for takeout."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LXQzQ0Z3EAE",
            "text": "I eat here all the time. Great food, great service, takes me home with every bite."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa19DLWxRRRAB",
            "text": "Food made fresh from scratch everyday.\nTry the bread pudding it's awesome!!!!. Everything is awesome are this restaurant."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcHB6ejZBRRAB",
            "text": "Get the roti. Get it vegetarian with pumpkin, spinach and cabbage. $8, cheaper than with meat, and so so good. You won't regret it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvOHJHbFdREAE",
            "text": "I love this place!!!! The food is delicious! It's amazing!! Owners are friendly food is just amazing!!! Great Caribbean place!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOHIyMF93RRAB",
            "text": "The food is consistent and delicious. If I could only have one last meal, it'd be from this place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwZ2ViRHNBRRAB",
            "text": "There food was so delicious I go there almost every weeks for the salmon and pumpkin."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNdGZ2bkxREAE",
            "text": "Great food, Great service, a bit expensive but with every dollar and you get plenty of food. Authentic,south American, Gayaneese food"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvc09tMUpREAE",
            "text": "The food is wonderful, wish they had a place closer to my residence."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bnZmSWpBRRAB",
            "text": "YES YES YES THIS RESTAURANT IS BETTER THAN ANY RESTAURANT  IN THE BRONX I WISH I CAN GIVE 10 STARS STAY BLESSED IM COMING THERE TODAY."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aHBfdzdRRRAB",
            "text": "Great food! Felt like I was at home! Definitely be back when in town!"
        }
    ],
    "reviews_count": 69
}