{
    "name": "Feroza's",
    "place_id": "ChIJ8f0d98vzwokRsZoMNeMrkGY",
    "grid": "BX12",
    "address": "716 Burke Ave, Bronx, NY 10467, USA",
    "rating": 4.4,
    "user_ratings_total": 165,
    "phone_number": "(718) 405-9081",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeE1XRXpZMGxGWm0xS1J6QjZSRFZNWld4RVZXYxAB",
            "text": "This place don't get enough love, best roti I've had in the Bronx so far. Tastes like I'm back in the Caribbean."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d1dIWk9WWEJpYWtzemNGSXlhbTFMU1U1WFVtYxAB",
            "text": "I got a drink and the cap was rusted and there was disgusting brown substance on the mouth part. But their food is delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeFFXRmFOWEEyYm1WVmNuQXpMV1ptYWxSb1NIYxAB",
            "text": "The beautiful surroundings make dining more pleasurable. The dishes taste great, service flows smoothly, and everyone shows friendliness. The team creates an atmosphere where everyone belongs. This restaurant always exceeds my food expectations. I plan to eat here again and tell others about it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213dFNXMHpVRVJHYUVSVFdrTTVjbEp3ZUZndFJHYxAB",
            "text": "My favorite roti joint in the Bronx."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TFVEbFZiRFZVTmswd1dqRnBjRVpOVWw5UWNWRRAB",
            "text": "This is a small shop but the food is delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFNrMTNjMjVRYkY4MGJXUTNWbVpEZEZweWVFRRAB",
            "text": "Delicious & MASSIVE oxtail roti. Worth the trip and EVERY PENNY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMVQyTlNPVnBhZFhKVFVDMDRWMk5xVTBwUVUwRRAB",
            "text": "This is a small hole in the wall, authentic roti shop. They still operate on cash only. The food is delicious. It has never disappointed and I’ve been going there for years. I would highly recommend it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcjV2OWFOdk1mVWJ3EAE",
            "text": "I've been there on multiple occasions and every time I've gone there I have never been disappointed! Food is always on point. Tastes great and nice and fresh. I would definitely recommend this Roti Shop to anyone that's looking for some good authentic roti."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMl9vOXl4aFpUWVVnEAE",
            "text": "I've been eating roti for 16 years from this place...THE BEST ROTI"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcnRDRGRBEAE",
            "text": "Always very delicious Roti, hot & fresh every time! Very tasty, however this time they didn't have buss-up-shut, but I still enjoyed it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneU1DWWR3EAE",
            "text": "They’re not open at 12pm as advertised and when you call the phone they don’t answer. If I could give zero stars I would not to mention the line is always long and their a cash only business which is very inconvenient. If their food quality wasn’t good I wouldn’t patronize them anymore"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdmRhaVJREAE",
            "text": "The food is delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcHJ1Z3BnRRAB",
            "text": "The best rotis in NYC. Been going here for years. Never disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OF9fVEZBEAE",
            "text": "Super friendly spot I always get a roti or brown rice with chicken curry their fry chicken is great too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM19IUDFBRRAB",
            "text": "I love Mama. ❤️   the food is amazing.  I going here over 30 years. It's a must eat place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueDdEajVBRRAB",
            "text": "Listen! I have had many roti’s. I used to drive to Brooklyn to get a good roti. Honestly this is the best roti i have had in a long time. Definitely a legit roti spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaF9ybVhREAE",
            "text": "Omg the BEST TRINI RESTAURANT IN THA BRONX! The doubles are to die for literally (get everything on it) I had a pear sparkling drink great. The food here will not disappoint! RUN THERE!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudk9qcjhnRRAB",
            "text": "Food is worth the wait but service was slow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLU1lcmVnEAE",
            "text": "Been coming here since I was a baby. They never fail!!!!  #BurkeAve #Landmark"
        },
        {
            "date": "1년 전",
            "language": "lb",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLVBDR0xnEAE",
            "text": "Gudd food, Gudd service em. Belly full mon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bkxIQlZBEAE",
            "text": "Food used to be good. Now it is completely a HIT OR MISS!!!! You never know nowadays"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN0lpNjZBRRAB",
            "text": "I’m a Trini living in Bronx and love to eat a good roti and I’ve have been going to Queens from\nBronx in search of it for years. I found this from a Google search and it’s near to where I live and I am 100% content! Nice big portion, lots of meat and SUPER tasty. This is my new home for roti in NYC hands down 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLXNtR3h3RRAB",
            "text": "World renowned for good reason."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdVppREpnEAE",
            "text": "Service was super slow but very friendly. Upon reaching the front of the line, I realized what was causing the delay. Not sure if the extremely old lady was the owner but she stood on top of both employees as they filled orders. Cash only and only the old lady can touch the register. Doubles were flavorless, cod fish fritter was amazing. I ordered a shrimp roti and got home to find that I was given chicken. Called the store because we live far and of course they didn’t answer nor are you able to leave a message. If you have allergies please reconsider eating here. I get the owner can choose not to serve but why get in the way and throw off the employees? We’re pescatarian and cannot consume the roti. Overall trash. If I lived closer I would have left Simboo Ramjatten‘s animal carcass mashed onto the door. Go elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUemVtVTNRRRAB",
            "text": "The food is good cant deny them that. I thought I found my go to roti shop in the Bronx but I was very disappointed with my order this weekend. I think it’s very shady to raise the prices and then significantly decrease the portions. The doubles are 2 dollars and change and are now the tiniest double i’ve ever seen in my life. The filling in the roti is also very minimal. They also move very slow and there’s almost always a long line. I guess I’ll be going back to Brooklyn for my roti."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdG9EaTVnRRAB",
            "text": "I been coming here since 2006\nFeroza has never failed me since ..\nI love this Roti shop for its authenticity and the fact that their flavors never change. The neighborhood says they have the best oxtail roti, so don’t kill the messenger!\nThe doubles with chickpeas, tamarind sauce and spice👌🏽\n\nIf you’re ever in town, drive down or take the 2 train to Burke Ave and get you some of this goodness!✨\n\n#fancyliteats"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUZ3BmOXNRRRAB",
            "text": "got some goat curry and roti there yesterday— potions weren’t that big, but it was $9.80 and I was full! :) definitely recommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlekwtS3VRRRAB",
            "text": "Been coming here for over 25 years. Foodnis always on point"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdU52MExBEAE",
            "text": "I just wish there were more locations!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZzlhT0xnEAE",
            "text": "The food is fantastic. Everything is fresh and delectable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcHREam9RRRAB",
            "text": "Traditional Trinidad and cooking when I want a roti I come here. it’s been in the community for over 20 years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENnNERGtRRRAB",
            "text": "Family owned with love to their customers! Chicken Rotti is on fire."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREX0tPcFBREAE",
            "text": "I finally got to visit the famous Feroza's, after a friend brought me roti and doubles from there months ago. I had no choice but to double park and the restaurant appeared to be closed since the front grill was pulled down. It turns out they were closing early as they were running out of some popular items, which was a good sign to me. I joined what seemed like a long line and was there for about 35 minutes. The food was delicious and fresh, and prices were reasonable, though no menu is posted.\n\"Cash only\" is inconvenient in this day and age but I knew it was going to be worth it.\nThis is one of those places I know I'll be back to. I ate 3 doubles within 5 min of getting back in the car!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0ck8zZVNBEAE",
            "text": "Every time I come to NY, this is my first stop for a Roti.  Curry Goat, Conch, Oxtail Roti and other options.\n\nI always get the pepper sauce and Tamarind sauce on the side\n\nThere is always a wide variety of drinks. They are the best, and always very welcoming. Great customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaWVQZXZRRRAB",
            "text": "I love this place been coming here for 20 years every Time I  come down to Bronx NY I have to stop by and bring some food back up CONNECTICUT has nothing like this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MnEzNGlRRRAB",
            "text": "I asked for a currygoat roti and received a beef roti. Received 4 small pieces of meat in the middle and everything else was skins."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MUlqVE5BEAE",
            "text": "Even though the food is good. This place is a joke. The have hours that they are open but they aren’t accurate and never answer the phone. They have no consideration for customer time. I shouldn’t have to wait 30 mins for some food. What is the point of having a phone number if you aren’t going to answer it. One day I was having any event and needed to order 20 Roti but these fools never answer the phone. So I brought my business to 7 Spices Restaurant on Gunhill Road. They had great food and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkci1XQjRRRRAB",
            "text": "Restaurant does not open at 12 and the total disregard for customer time is ridiculous however the food is good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0by1MOUVnEAE",
            "text": "This spot is a Legendary spot in the Bronx, with the best Roti, doubles and if you eat fish, definitely try their Shark option."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbXJiNnJBRRAB",
            "text": "Roti & Dishes are always fresh, hot & with authentic Carribean flavors. Staff is friendly & menu is friendly for any budget."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlc3NhNjB3RRAB",
            "text": "The food is not the same I miss Mrs feroza and her husband you could taste the love in their food now you taste the business I moved two hours away and I would come back just for their food I knew it was changing I had begun to taste that but my last visit confirmed change I was so disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWaU1yWTZBRRAB",
            "text": "When a pang for great Caribbean cuisine cannot be ignored, Ferozas is a go-to in the Bronx! Very tasty Caribbean dishes served in a courteous environment. Wait lines are indicative of the great food. It's a small space so sometimes feels cramped but so worth it. No dine in available. Drinks are also Caribbean favorites. You can confidently share this caribbean experince with your American counterparts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsekxETkdnEAE",
            "text": "Love the family set up. Line is a little long sometimes because the food is good !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdnIzLTJ3RRAB",
            "text": "Great roti everytime\nBest in the Bronx and one of the top 5 in NYC for roti"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsak1YUnFRRRAB",
            "text": "They are still making Great Roti's!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeGZ5R1d3EAE",
            "text": "I purchased 2 doubles and Phalouri from here last week. This place is a fixture in the Bronx, and I was so disappointed with the doubles. Firstly, I could taste the oil in the doubles, and the filling wasn't even substantial. I mean, it's chickpeas.. I didn't order any meat.\n\nNormally, the place would be packed around noon it was empty. Should of taken it as a sign.\n\nAll the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaG95M2VnEAE",
            "text": "I had the curry goat rotti, and it was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eW9LTG93RRAB",
            "text": "you’re definitely going to wait, but the food is very worth it. authentic west indian/trinidadian food. their drink selection is also very good too!! any caribbean person would love to have drinks from their country, you can find them here!! prices are also very reasonable for the amount of food you are getting. the plantain is also delish!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNmNIRzJRRRAB",
            "text": "Where do I start... I have been buying food from this restaurant since 1991... I know the owners personally and as time has passed... Feroza has lost her sister in law... her husband and other friends who used to work for her... now her son runs there business and there food had remained consistent throughout the years.\n\nSometimes the line is long but the food is worth the wait .. There roti is made fresh all day.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMHU3eEtnEAE",
            "text": "The curry chicken roti is wonderful and the prices are amazing.  The train is right next to the place . The staff is polite & helpful.  The food is fresh and good , I can't wait to go back and try the other dishes they have , I love this place 😍.  I would recommend everyone to go . The place only accepts cash no debt cards so make sure to stop at the ATM before going ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdDhIcG9RRRAB",
            "text": "A hidden gem of the Bronx! The food is delicious and always served hot. My go to is the shrimp, roti and doubles. I’ve food from here quite a few times and it is very consistent. Only downside is that they only take cash, but I guess that’s a good thing because if they took debit I’ll be here more often LOL."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMmNIa2xBRRAB",
            "text": "All around bad. Skimmed portions even though I ordered large oxtail and rice and asked for a lot of gravy. Terrible. Feel scammed and cheated. Never again! How do you pay like $20 and get VERY FEW tiny little pieces of oxtail with barely any meat on them?\n\nLet me also add that the flavor was underwhelming.\n\nI'm also not a fan of places in which you can't even SEE what the food looks like while you're there. Everything's hidden behind a wall, and I think that's for a reason.\n\nI also ordered a curry chicken roti with potatoes in it and again, the flavor was nonexistent, and they did NOT put extra gravy as I asked. It was not good.\n\nOverall, they need to season the food better and ACTUALLY give people the amount of food they're paying for, the way that they like to eat it. I feel disrespected lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodl92RG5nRRAB",
            "text": "I was once a fan of this place but as of yesterday... never again. The food has really lost something. The chick peas was so undercooked!! The tamarind sauce on my doubles had large seeds in it... so every other bite, I'm fishing seeds out my mouth. I asked for 4 roti skins and they said they can only give me three because they only make enough skins for the curry... I said ok... so if I make a advance order of skins and paid in advance could I be accommodated... they said no, because they only make skins for the amount of curry they have... the backwardness!!!.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNk11Wkl3EAE",
            "text": "Great tasting roti! This was my first time eating here so I ordered two chicken roti and it was really good. Definitely recommend people give them a try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPb2M3ZW5nRRAB",
            "text": "I’ve been eating here since I was a child, my dad use to take me here and in return I’ve taken my kids.  The best food ever!!! 10/10 my favorite is curry goat roti. My kids love oxtail roti and my dad enjoys chicken and shrimp roti. Absolutely delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OU8tXzZRRRAB",
            "text": "Been going here since I was a teenager now I'm in my 40's food is always on point and always has been. I will always drop in here when I come to NY this will always be the best Jamaican spot to go to in the Bx"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX1ltV3dnRRAB",
            "text": "Shrimp ROTI only had 5 small pieces with 3 pieces of potato for $12 extra For a spoon of cabbage the portions are very small the prices are higher codfish fritters had no codfish $3 it smaller, and the son gives very small portions it's not worth the money anymore I love the mother and sisters but the new generation is messing the business up my family and I been a customer since 1992 The taste and quality is not there anymore"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1d0ktaHVBRRAB",
            "text": "I’ve been going here for over 25 years and yes the best roti in The Bronx\nI wish they has Callaloo and crabs tho that would be da best"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPZ2UzVXF3RRAB",
            "text": "Coming from Guyanese decent this spot reminds me of my mother's cooking. The shark is top notch. And the staff are awesome especially the elder wise mother. Bless her with continued strength"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eTd6VWFBEAE",
            "text": "Food is always really good!! I went early today because I've seen the rush that comes on Fridays. The shark roti is soooooo tasty!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoZ3BtWXJBRRAB",
            "text": "Oh my gosh my brother told me about this place.  I drove all the way from Connecticut to try Feroza's food.  It's the best that I've ever eaten in NYC!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSamFDYzlBRRAB",
            "text": "First time. Got beef roti and a double to go, and was in and out super quick. As far as the taste, we’ll as the kids say …”it slaps”"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X2V2SmRnEAE",
            "text": "I love the food there best in the Bronx except the hours and phone number is not listed on the internet which is bad cause for people that’s trying their food for the first time don’t know when they open smh I was standing there for half hour before they open not good for business"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MDlfQnpnRRAB",
            "text": "Food always delicious...service with a smile...they  make you feel like your home ..I have been going there for over 40 years"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoakotaTJ3RRAB",
            "text": "Let's just say there's no more long lines this place is absolutely falling off and I hate to see it go portions are way too (small )for the amount of money and somebody needs to let the meat marinade that home cooked taste isn't there fish…"
        }
    ],
    "reviews_count": 65
}