{
    "name": "Chic",
    "place_id": "ChIJ90w9d0bzwokRBhFOevbo8HY",
    "grid": "BX12",
    "address": "938 E 233rd St, Bronx, NY 10466, USA",
    "rating": 4.3,
    "user_ratings_total": 46,
    "phone_number": "(718) 708-4250",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZmVrTm1iWEJmVG1KUGRIUkxlWFZHUWtOVGVWRRAB",
            "text": "Place was not ready for customers, after 3 hours of being open. No menus, waiters show it to me on his phone, laughed so hard and paid for my drinks and left."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeU9HeHFRWFpsYzFOaGFVSXhOVmRQVjNwclltYxAB",
            "text": "First of all, your oxtails are 25% oxtails, 75% beef cheeks.  How would I know?  I portioned them.  Fish and shrimp are frozen products.  The jerk sauce comes out of a jerk wing bottle.  Plus they water down the wing sauces to “stretch” it.  Plantains are frozen and cut in half.   Tots are frozen and badly portioned.  The only thing fresh is the curry sauce, which some people complain it’s spicy.  Plus, they’re low on staff because they don’t want to pay.  At least not before my lawsuit.  Same lawsuit I had with Bokagua.  Ask about me.  I’m the Bronx chef that doesn’t like to get played."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdWRtWm5aamR4T0RKRWVsRkRTV2RUYlhsTGMxRRAB",
            "text": "Service could be a whole lot quicker…whole lot.. but every thing is delicious 👍🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Vk1VOVRTM0J1VVhrMWNIa3lOVzVaZEU5VmFIYxAB",
            "text": "Our second time around and it was just as great as the first.\nWe were four back then and we were seven this time. It keeps growing. Keep up the good work. A wonderful place for dining and relaxation.\nRecommend Radix highly."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVk9WVjZWbnB2UW04MFUzaExSV3hyYVV4bGNWRRAB",
            "text": "I went there and had a $50 order, I had 3 wings and some french fries left, I asked for a to go container and I was told that I couldn't get a container to take my remaining food home in because the food was on the $5 menu.\n\nIn response to the reply:\nIt was not a takeout order.\nWhen the customer sits in the restaurant and eats and drinks, it seems a little wasteful to force the customer to throw away food that they may be unable to finish.  The food cannot be resold, it is just going to be thrown away.  If a customer sits in the restaurant and eats they should be able to take any leftovers regardless of what menu it was ordered from."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVdIQnNlams0U1VVMWJEZFpUV0YwZFZoWVdtYxAB",
            "text": "The food is delicious. The atmosphere is refreshing. The staff is cool. The drinks hit. Jade makes a mean margarita. The neighborhood needed this!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOT2FUWnNTRkZYWmw5aVdrMHRWalptU1Vrd1QxRRAB",
            "text": "🌟 My family and I had a fantastic time celebrating our wedding anniversaries at Radiix Restaurant and Lounge located 233rd st and Edenwald, in the Bronx, New York.\nThe decor, dishes, and display all  breathtaking and delicious. 😋\nThe outstanding service by Joshua made the experience even more special. We all had a wonderful time and  highly recommends the spot! 💕\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV00xSnlaVUpWVG1rd1FVWllhSFpPTVZCa1gyYxAB",
            "text": "Loved the atmosphere of the restaurant and the live band entertainment was awesome."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVWR6ZGllamQzYzFKdGNYZGZabkJDVTNCaFdFRRAB",
            "text": "Love this new gem in the Bronx. Great service and amazing food. Rum punch is delicious. 5 Dollar Wednesday Menu has so many great options. Can’t wait to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFJYaGlVbWRDTUdaUWNFVnRja0ZzWHpGUU5XYxAB",
            "text": "Radix Lounge did not disappoint! The rum punches were strong and flavorful, just the way they should be. The jerk chicken was perfectly seasoned with the right kick, and the beef sliders with fries were juicy and satisfying—great portions too. What really made the night, though, was the exceptional service from our server Jade. She was warm, attentive, and made sure everything was on point. Definitely planning to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZWd5OXp1c2ZTX253RRAB",
            "text": "Food is good price is right. I recommend the place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMy0yN1dyOHVERGpRRRAB",
            "text": "I recently had my graduation brunch, I had over 25 guest. It was my first here and I am so impressed. The food was good, great service and a comfortable atmosphere. The communication with the Owner prior to the event was great, he ensured that I got everything that I requested. Thanks team. I highly recommend!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNHJHNnpRRRAB",
            "text": "Good vibes, good energy! professional service.. Place /rest room very clean..rum punch on point..food excellent ..Owner & staff  welcoming..  felt appreciated."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNk9UMkRnEAE",
            "text": "Everybody in the retirement party group was impressed.  Lloyd and the ladies were amazing."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3M3J2cWdBRRAB",
            "text": "Cool place to chill after work"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJak9xRmhBRRAB",
            "text": "The atmosphere, food, and service were all excellent—big compliments to the chefs and bartender, especially Mel, for making the experience so enjoyable. The only downside was that the owners just stood in the corner observing rather than coming over to introduce themselves or ask how everything was. A simple gesture like that would’ve added a more personal touch to an otherwise great experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJekllWThBRRAB",
            "text": "Beautiful atmosphere. Plating for my dish was perfect. I enjoyed my sweet and sour shrimp with mac & cheese and steamed veggies. Others had honey garlic wings and rice and peas no complaints insight. The owner was very nice and often checked on our table. The dj took request and played the greatest hits old and new school. We had a time"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NzRMaVJREAE",
            "text": "Every year we go out and I decided to bring my mom to this new restaurant for her birthday dinner this year. From making the reservation over the phone to the end of this visit, I must say everything went great. We went & were greeted at the door with a smile. We were late, so to not have someone with an attitude or to be rude because of my lateness was so wonderful.  It was nice from the front to the back of the restaurant. Very clean restaurant. The bathroom was clean & great looking. Everyone was friendly.  My server was Jodi. She gave excellent service from beginning to end. All the staff there were smiling and helpful and gave good energy the entire time we were there. I am pleased to say Yes, I will return. Yes, the food was great, and Yes, the drinks were awesome as well. I will definitely recommend  coming here to eat. No complaints from any of my family members or the kids about food or service. The music was awesome. Here are a few of the food dishes we ordered. Thank you for having us."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbzkzUHVnRRAB",
            "text": "Someone recommended that I try this spot out recently and I’m happy I listened. Really nice dining experience and it felt even better to support a local business in an area that I grew up in. There was a lot of seating to choose from and there was a more upscale look to the place. The ambience was calm and easy-going with soft lighting, it was easy to get cozy and enjoy an intimate experience where I could pay full attention to the person I was dining with. The reggae music didn’t overpower our conversation and it just added to the chill vibe. As recommended, I tried the honey garlic salmon and it was amazing. It had that nice char from the grill and it was flavorful. I tried some of the Escovich red snapper and that was pretty good too. I had ordered the fried calamari as an appetizer as well,  I was surprised and delighted when I saw that was an option. It had great crunch to it and again, it was flavorful. Although I’m not the biggest drinker, the occasion called for it. And it was well worth it, the drink wasn’t watered down at all. I’ll definitely be back there in the near future."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRa0tiMXJ3RRAB",
            "text": "You will have an amazing time. Especially when Ricky is playing!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnek1YZm9RRRAB",
            "text": "The food was exceptional the staff attentive and the ambiance was perfect for a cozy evening"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnck9IenhBRRAB",
            "text": "Great food great drinks loved the atmosphere  enjoyed it definitely recommend it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcjVIZ1RnEAE",
            "text": "February 1st my friends and I went there for dinner! And the foods we ordered were exquisite! Hats off to the chef whom ever he or she is!!! Coconut Martine was amazing! Space upscale and very cozy!! Live DJ was on point with his selection of music, just need to lower the volume when clients are dining as we had to keep talking loud when in conversation lol.  Overall a great experience and we will be back!\nPS: Keep that chef and pay him or her well! As their craftsmanship of tastes and presentation is A+\nI wish the owners a successful business for years to come! The Bronx needed this!\nWarmly,\nSweet~P"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMXYzN2x3RRAB",
            "text": "Had a ⭐️⭐️⭐️⭐️⭐️ experience at this new spot with my family! The dishes are bursting with flavor!  The service is top-notch, with a warm and attentive staff that makes you feel right at home (thanks again, Lisa!). Add in the live DJ music and modern yet \"island-themed\" decor, and you’ve got the perfect ambiance for a memorable dining experience. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMjRLemdBRRAB",
            "text": "Radix recently served as the venue for a business dinner I organized, and I was thoroughly impressed. The professionalism, the food quality, and overall atmosphere were outstanding. I highly recommend this restaurant for any event you might plan."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGFUVHBRRRAB",
            "text": "This new upscale Jamaican restaurant is an absolute treasure.  The atmosphere is the perfect mix of sleek and cozy, giving you that island vibe without losing any of the sophistication. The food is incredible—bold, flavorful, and very nicely presented. Plus, the service is top-notch; you’ll feel as if you are being treated like family. Can’t wait to go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbXVqcGdRRRAB",
            "text": "This place is fantastic! The rum punch and the food is 🔥🔥🔥🔥"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBd3BuZ2dBRRAB",
            "text": "I stopped by yesterday, and the food was amazing great place.. Rum punch was on point as well"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaE16TXlRRRAB",
            "text": "I had the pleasure of dining at Radix with some friends. It was truly a vibe. Everything was wonderful from the hospitality to the music to the food and drinks. The service was impeccable. The hostess greeted us warmly and our server was attentive. The music was grown and sexy. And the food and drinks! They were exquisite. I had the cod fish cakes, jerk salmon with rice and peas, a long island iced tea and a coconut margarita. You must go and try them. I already have plans to return soon and will be going again and again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa0lxbUR3EAE",
            "text": "i loved my experience at Radix. The food, the service, the environment, the music all was top quality. I will definitely be returning with family and friends in the future"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOTl6aURBEAE",
            "text": "Radix restaurant and lounge was a 10/10 vibe. From the amazing dj to the exquisite ambiance giving an upscale island vibe. I had the jerk chicken wings with Mac and cheese which was delicious. I will be definitely be returning."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOS1pcWhnRRAB",
            "text": "Amazing Jamaican restaurant conveniently located in the Bronx.  From the ambience to the decor, to the food and drink were all top notch.  When you go, make sure to try the platter that includes jerk pork, jerk wings, french fries and salt fish cakes.  So mouth watering. The vibes were unmatched.  Will definitely be back.."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOTZEV1R3EAE",
            "text": "Delicious food. Great vibes. I’ll definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMTluZG1BRRAB",
            "text": "From the tasty cocktails to appetizers and entrees filled with flavors flavor Radix is the new spot to be. Calm cool mature atmosphere that is also appropriate to have family dinner and Sunday Brunches. Come out and support this new Go-To spot."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbDcyTFJnEAE",
            "text": "Beautiful people and a beautiful place ! Stuff was so welcoming and fun . Drinks are delicious and the food was amazing.. the lemon pepper wings are so tasty. Very nice place to go and unwind. Definitely will be coming back soon ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfemJlRkhnEAE",
            "text": "I just had the pleasure of dining at Radix with my family, and I cannot recommend it highly enough! From the moment we walked through the door, the experience was nothing short of exceptional. The warm and welcoming atmosphere set the tone for what turned out to be an unforgettable evening. The unique design of the space is well executed - and conveys an aura of upscale and “island friendly” at the same time.\n\nThe service was impeccable—attentive without being overbearing, and every staff member we interacted with seemed genuinely passionate about ensuring we had a perfect experience. Our server, Lisa, was incredibly gracious and personable.\n\nNow, the food—absolutely phenomenal! Every dish we ordered was a masterpiece, crafted with incredible attention to detail and bursting with flavor. The ingredients were clearly of the highest quality, and the presentation was stunning. From the appetizers to the entrees (the portions were very generous, so we didn’t have room left for dessert), each bite was a delight, and it was evident that the chef put his heart and soul into every creation. The oxtail and the jerk chicken dishes were some of the best that we’ve ever had!  As for the cocktails, the coconut martini was my favorite.\n\nIf you’re looking for a West Indian culinary experience that will leave you raving for days, Radix is the place to go. It’s not just a meal—it’s an experience, and one that my family and I can’t wait to have again!"
        }
    ],
    "reviews_count": 36
}