{
    "name": "Triple Deuce Restaurant & Grill",
    "place_id": "ChIJudvGaXjzwokRfX6GljmrDGo",
    "grid": "BX12",
    "address": "3601 Boston Rd, Bronx, NY 10466, USA",
    "rating": 4.3,
    "user_ratings_total": 234,
    "phone_number": "(347) 899-8046",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGQwczNjak5NVjNaYWRFTm1URmhLZVVSbU9VRRAB",
            "text": "We came here for my mother's birthday and I must say it was a great experience! The service was A1 the food was delicious 😋 and the vibe was vibing...it was Saturday night they had a dj...all around great restaurant 👍🏽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTFNEbDZSWGgyU0VoMFpVMWhRbGxPU0Y4MlRuYxAB",
            "text": "I normally go to this restaurant either once or twice a week! On Thursdays is seafood platter! So I normally order on one side and the other side I would go pay! The young lady that was there today she was very rude and disrespectful, and it’s not the first time she’s been rude to me, but I never said anything! Today I had to say something because I spend my money at this restaurant she’s not paying for my food! Most of the time I spend over $100.00 because the food is good! But today might be my last day because of this rude individual! I never had a problem with the other young ladies there, they’re always nice and pleasant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeFRXeGlZekExUTA5M2NVUktWbEJuWlRKRmMwRRAB",
            "text": "Amazing food, great service and beautiful women!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aU1VVTk9UVGRDVlc1cFNISXlOVkl5WkV4TlVXYxAB",
            "text": "Very nice vibes and food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacWQweFJPVTU1U1ZJd05rMXRRMjE1YUZKTVlsRRAB",
            "text": "UPDATE: Some guy came and told us we had to move meanwhile three other parties who were at the establishment prior to us were allowed to keep their table.\n\nWe came to Triple Deuces Lounge with high hopes, and at first, it seemed like we were in for a great night. The atmosphere was vibrant, the music was on point, and the food started out strong—fresh, flavorful, and well-presented. It felt like the perfect spot to kick back and enjoy a night out.\n\nWe were a party of three, though two of us arrived first and the third joined a bit later. That’s when things took a turn. Not long after our friend sat down, our waitress came over and told us there was a 100-minute limit at our table. Seriously? Meanwhile, several groups who had been seated way before us were still hanging out with no issues. It felt random and targeted, and honestly, it left a bad taste in our mouths.\n\nService throughout the night was frustrating. We had to ask for water multiple times, and when the waitress finally came back—she only brought one cup. For three people. It was just sloppy and careless. No one checked in on us unless we flagged them down, and the vibe quickly went from chill to disappointing.\n\nBOTTOM LINE: If you value good service, this is not the place for you. The music and food might draw you in, but the service will make you think twice about coming back.\n\nTriple Deuces has potential, but until they seriously step up their hospitality game, we won’t be returning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVU5tUktZa1l5UlRsUFFtVkVjRVJZVkRCQ09IYxAB",
            "text": "TRIPLE DISAPPOINTMENT. Went on a Thursday - seafood night. Food took over 3 hours to come out and it was UNDERWHELMING! Seafood was overcooked. Mashed potatoes super salty. Vegetables flavorless. Not to mention  some of orders came out wrong. Service was poor! Waitress barely showed face, maybe out of second hand embarrassment. We were offered free drinks but even those were trash! Their only saving grace was the DJ - TCue. Save your time. Popeyes up the street probably got better food and service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNmIwTldVMkpGTFc5V2JrRlRVRTlxTUhoR2MyYxAB",
            "text": "The place is great! However your security was very rude! He checked my id and decided to call my age out, saying that “ i am old”. I was appalled."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbVNwYlR0ejlUQzJ3RRAB",
            "text": "The food is very good\nA little pricey but am ok with that it’s worth it\n💪🏾💪🏾"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWERtWlhLcGNhZDRRRRAB",
            "text": "Great food reasonable prices and great atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdmo5ZlB4bFpxXzR3RRAB",
            "text": "Everything was on point. I had the wings, jerk pork, mashed potatoes, and a couple drinks. The food came out quickly and tasted really good. The place has a nice vibe, and the DJ had the whole spot lit. The prices were very affordable. Definitely coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMW92ZER3EAE",
            "text": "Horrible food\nHorrible customer service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbjk2Vk9BEAE",
            "text": "First and last time. I placed my order with the waiter, got my drink but didn't get my food.\nThe waiter only came back to the table once with other orders that were placed before mine and everyone complained that their food was too spicy. I waited over 45 minutes for my order and that's only because I bumped into her by the bathroom and had to remind her that I had ordered food also. She said oh yea u ordered such and such right, I said no that's not what I ordered. I told her my order again and she asked if I still wanted it, I said yes I do I need to eat 🙄. That took a whole nother 20 minutes and  although I ordered plain wings they were dry. The rum punch was also weak. The waiter disappeared for the rest of the night, leaving the dirty plates and cups on the table. I had to order from the bar who then said they had ran out of rum punch so I ordered rum and coke and they said they had no white rum 🤦🏾‍♀️ I ordered the dark  rum and when I tried to pay the bartender in cash, he handed me a receipt that included automatic gratuity for 2 drinks. This is such a bad experience for a 1st timer and does not look good for the business, only good thing about this whole experience was the DJ. I'm a foodie and I know good food and good service when I see it, never again smh."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcTdiTk1nEAE",
            "text": "Bbq chicken was good but there was not much flavor in the rice and the cabbage with carrots were dry"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNmNuUE93EAE",
            "text": "Good food,good vibe,good service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmLXR2a2VBEAE",
            "text": "The best place for Food, Music Atmosphere is Amazing"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdC1laDN3RRAB",
            "text": "Love the food and music"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcl9DSlpBEAE",
            "text": "Service, food and atmosphere was top notch.  We had a group of 16 people and and the staff was very accommodating and professional.  The food was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLXJfaFdREAE",
            "text": "It was kinda cold when I went."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMnMtaFdnEAE",
            "text": "Kool place  to go for  Happy  Hour, bday  celebrations and more.. good food, dope music  and nice atmosphere 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuek5Day1BRRAB",
            "text": "I’m giving it’s 4 star ⭐️ if there was more then 4 i would give it’s a 10 i been coming here for almost year place is amazing food is good and don’t let me forget the drinks is on point"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaThHUFJnEAE",
            "text": "My first time at this restaurant, I ordered curry chicken and rice and peas and the rice and peas is totally spoiled. It smells so bad I can’t believe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuN04yejVBRRAB",
            "text": "Good experience at triple deuch, food was very good, oxtail  was very tender, good music, would recomend to others"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIajZxN0JREAE",
            "text": "The food, the service, and the atmosphere is phenomenal. They have traditional ways. The Jerk chicken with oxtail gravy hits so hard. To the soul you feel the flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUtuN1BnEAE",
            "text": "I placed my order online, they called, I told them what I wanted. The wrong thing was delivered! I called but there is always no boss to talk to! She told me to hold on, I was holding for almost 20mins then I hang up! So now I paid for something that I do not eat! Do better Triple Deuce!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cTliYmhnRRAB",
            "text": "This place needs major updates. The food was good, the staff was attentive, even the music was good. As you can see in my video they had all the lights completely on. The dining area looks like it hasn’t been touched since the 99 and 00s and the entire layout is just weird. They need newer cleaner furniture, better lighting, and decor. Once that’s done I can see this being a nice go to spot. Until then I won’t be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MHZXVlJnEAE",
            "text": "The high review is a lie. I will never come back here, because cranberry and vodka cost $16 and it was weak. You can find better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6djlEMXpnRRAB",
            "text": "Unfortunately, I wasn't entirely pleased given my first experience. I was meeting friends/coworkers who were already seated, and the waitress did not hand me a happy hour menu when I entered during that timeframe. I did not care for the seating where the bench was at a higher height than the chairs at the same table. I only purchased 2 orders of calamari with 4 rum punches (assuming it was a happy hour menu that I received) but my bill with tax/tip was $104. I honestly disagree with any required gratuity over 10%, especially if I have to flag down anyone and they don't willingly check on our table, or anything is removed without confirmation. Overall, I did enjoy myself even though I wasn't entirely pleased but I might give it another chance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5b1p2eFNnEAE",
            "text": "We had a timeeeeeee.. we celebrated my sister 40th n had a great time. From service to food it was all great .."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5am83NDBnRRAB",
            "text": "Food is great but they never pick the phone up and they basically told me a few times that they only doing catering and we can’t order when I’m already sitting there. Also told us once that we can only order and take out we can’t dine in. I’m so lost with this place as of late."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdWNlWDl3RRAB",
            "text": "We went with about a party of 15 and they accommodated us all in a good area to enjoy each other's company. The food was amazingly delicious, and they served a nice portion. The service was great. They were quick in getting our food and drinks on the table. I was very amazed and happy to have joined everyone at this event here at Triple Deuce. Forgot to mention that they have a live DJ on the premises, and the music was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNFpiejNBRRAB",
            "text": "Margarita Fridays"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkM3FIcmxRRRAB",
            "text": "Good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeDZtUTJRRRAB",
            "text": "Great place. Great drinks. Great people working there. So kind"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeDZxdjhnRRAB",
            "text": "The waiter doesn't have great hospitality. She was not welcoming at all. Seemed bothered by questions. When we arrived for lunch the place was empty not a single soul in sight. We wanted to sit by the wall as it was a group of 7 and didn't want to be close to the door and the waiter refused and said she had a party of twelve coming. Remind you the place was empty. Instead of placing the silverware in front of each person, she put it in the middle. Guess we have to get it ourselves. Her whole demeanor was off. We were provided plastic cups for water while a party of two came in and was served water in a glass. Customer service makes a huge difference in a business. Overall this restaurant has the potential to be a great restaurant with a booming business if service is improved. The food was tasty and presented well. Ending with we ate our lunch and the imaginary party of twelve never arrived."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NWFDYXNnRRAB",
            "text": "Especially love the jerk pork it wasn't season as it usually"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcC1DODNRRRAB",
            "text": "Terrible terrible service! I decided to dine-in with my fiancé and our two kids on a weekday afternoon. The restaurant was empty with a couple seated at the bar, so we expected to be served quickly because we were the only ones there. We ordered pepper shrimp and french fries as starters, which took 40 minutes to come out. Which is insane considering that those are quick to make. We then proceeded to order 4 different entrees, chicken sandwich, brown stew fish with rasta pasta , escovitch fish with rasta pasta & brown stew fish with rice & peas. After 1 hour of patiently waiting for the entrees to come out, my kids and my fiancé started to become impatient after we were told that the food was coming out shortly. The entrees still didn’t come out after 1 hour and 20 mins of sitting patiently.  We only got to enjoy the starters. I told the server we were only going to pay for what we ate, regarding the fact that we were not pleased with the service and the slow cook in the kitchen. The staff never apologized nor accommodated us for the slow service and only mentioned that there is one chef on the weekdays because those are their slow days. Our first experience at this restaurant was terrible. My family and I love to support carribean owned businesses but they showed us no consideration nor compassion towards the time we spent just patiently sitting around for food. It’s a shame we didn’t get to see what the food was like. I will never go to that restaurant ever again, neither will I recommend this place to anyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxN0tXRDlnRRAB",
            "text": "I would have to say that my experience was good I definitely enjoyed the food, drinks and the music. Weather it’s a date, bday party, or a girls night out I can say you will enjoy it  also try it out during the week and enjoy their specials."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeEs3VW9RRRAB",
            "text": "I was differently overcharged but the food was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMTlPdFN3EAE",
            "text": "Good vibes food sucks. Music is bomb"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Z2NqZlBnEAE",
            "text": "I went there for a repass and the food was pretty good."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabk9MemJBEAE",
            "text": "Not only was the food good, but the service was great. The young lady in the takeout that day was very polite and courteous. She's the reason why I would continue to patronize this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaclAtNkhREAE",
            "text": "So I only visit this spot on Fridays. After a long work week Triple Deuce is definitely the place to be on a Friday for their Margarita Fridays. Their drinks are amazing, food is amazing and the music by their in-house DJs is always on point."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMmJqQXh3RRAB",
            "text": "I order bang bang shrimp it was good . I ask the waitress if the Rasta pasta was spicy . She said no . It’s sooo spicy I can’t eat it! It was sooo dry , no sauce. I wasted my money ! Annoyed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3ZYMmZREAE",
            "text": "Great vibes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjhPeWtRRRAB",
            "text": "Food and drinks takes a long time to get to your table.\nBut Friday nights are until midnight are great for a good time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcUpmcXdBRRAB",
            "text": "Really nice Friday party from 4p until! Cute drinks. Food is okay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKXzRxZjdnRRAB",
            "text": "Came here for some food and drinks . Enjoyed ourselves from start to finish . Ronda was amazing customer service wise & The drinks were strong (2 for 1 Tuesday special). The appetizers were a 10/10 the bang bang shrimp & Mac are well seasoned and perfectly cooked . Dinner on the other hand was 7.5/10 both the pasta and curry goat were not the most flavorful dishes we’ve had . But still good  and the goat was tender ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMFlEcEZnEAE",
            "text": "Very enjoyable!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeHR6QmZnEAE",
            "text": "Great food and ambiance"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcFBhVjRnRRAB",
            "text": "Everything was good 👍🏾. I would go here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbHVYTkpnEAE",
            "text": "Food was good, a bit cold would have been better if it was hot. The atmosphere was lively, had great music (live DJ), a little too loud for dining. They also have hookahs available and we were comfortable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdHZfa3hRRRAB",
            "text": "My second visit here and I must say, I will definitely be going back. Exceptional customer service , great to place to dine in and great food. I must recommend the bang bang shrimp, sweet Chilli wings and the sea food platter.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobHVLY25RRRAB",
            "text": "Zaffie was a great hostess. She served us well.   The food and drinks were great and the music was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcVl6Rm1RRRAB",
            "text": "Ordered takeout from here a few times. The food here is hit or miss. I tried the stewed chicken today and the food was horrible. The chicken tasted spoiled and had no flavor. Definitely not coming back here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldU9ucVVBEAE",
            "text": "My family and I went to Triple Deuce Restaurant to celebrate my nephew and his wife's anniversary. It was at least 15 of us there. The server was very attentive. The music was good.  The atmosphere was nice...wasn't too many people there. The food was good. The bill was over $900.00. I would think since we spent all that money, they would have offered us a complimentary bottle of wine or a pitcher of margaritas, or even pitchers of soda.   Despite that,  I'll definitely go back to  Triple Deuce."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcGNyRlZnEAE",
            "text": "The decor needs some work, but the food makes up for it. Well cooked, seasoned and portions matched the price. Servers (Brianna), well trained and very attentive to guests. As for the drinks perfectly balance. Overall an excellent experience, a definite for a second visit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNExtdXVBRRAB",
            "text": "Great food and exceptional customer service!!! I will visit again!!!\n\nI visited the restaurant along with a few friends. For the appetizers, we ordered calamari, crab cakes, and wings. For the entrees, we ordered the lamb chops, surf and turf burgers, and the oxtails. The appetizers and entrees; were presented exceptionally well, and the taste matched the presentation. My personal favorite was the crab cakes and oxtails. The oxtails were tender and tasty. We ordered several drinks, and they did not disappoint as well.\n\nThe staff was very responsive and handled our needs as required."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOXVDNHVBRRAB",
            "text": "This place USED to be a great spot for lunch. The food is still good, however the portions have gotten smaller. The lunch special containers are smaller and the price has gone up (they also stopped giving a free soda with your order). When you order a large lunch and spend $23, you expect a decent portion. Unless you point it out, you will get the equivalent of a medium plate for the price of a large  - at least with the server I had. When people start noticing and stop going in, they will realize they ruined a good thing by cutting back. In the same area you have Country Time - another Caribbean restaurant, where a TRUE LARGE is $16. Guess where I'm going from now on!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MTd5M3N3RRAB",
            "text": "Upon opening the door of this establishment, you'll be overwhelmed by the volume of the music, the mix of genres, which was great except for the aforementioned volume. we then realized we had to seat ourselves. After choosing to sit at a table with high chairs. About a minute in we were greeted by a young lady who presented us with menus, but never gave her name. After browsing said menu we began with calamari, jerk wings and bang bang shrimp for appetizers, rum punch, dragon stout, Hennessy margarita and liqueur punch made with Appleton estate rum, only disappointment was the Hennessy margarita seemed to be missing something. However that drink was replaced at no cost. Entrees weren't voluminous. My wife and I had oxtails, with rice and peas for her, escovitch snapper with steamed vegetables for me. My bestie and her lovey had oxtails with rice and peas, brown stewed snapper with rice and peas respectively. Everyone's meal was well, tasty and flavorful, except my escovitch snapper was spicy as expected but not lacking in flavor and the food wasn't hot. Overall it was a good experience, but I strongly suggest lowering the volume of the music will make for better ambiance, plus easier conversations amongst patrons and with staff. Have servers identify themselves and I must acknowledge a gentleman who also did not identify himself, did stop by to ask if anyone was catering to our table."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaGFMX3lnRRAB",
            "text": "Security at the door is a plus!! The place is spacious... We went for happy hour, but the bar was already filled up... the drinks were ok,  but kept getting weaker throughout the night... the food was good...we had the wings & a chicken sandwich, which was very flavorful... the music & DJ kept us there longer than we wanted to...very good caribbean vibes!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodnZibXV3RRAB",
            "text": "Great tasting food. Probably one of the best tasting jerk pork I’ve had. Their fry chicken could be better. However, within a year their prices tripled. I guess they are living up to their name triple deuce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX05IbF9RRRAB",
            "text": "I came here for happy hour with a friend. The restaurant had just opened up, making us the first customers of the day and the first to be served. We had ordered two rounds of drinks and wings.  The second order of jerk wings we’ve ordered honestly tasted undercooked, resulting in us receiving food poisoning the next day."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdHZ1T2VnEAE",
            "text": "I went in based on a Instagram post I saw about seafood Tuesday’s. Got there around 2/3pm and the server said it wasn’t ready. I asked how long she said 20 mins. I ended up waiting for an hour or more. When they finally said it was ready they didn’t have any shrimp. The platter was fish and pepper shrimp w pasta or festival. Why offer and advertise something if you’re not going to have it available? To top it off the fish had literally no seasoning. I kid you not it had no trace of seasoning whatsoever not even black pepper nor did it have any taste. Once a fish is seasoned inside you can tell. All I could tell was it was fried. So I wasted my money and time trying to support people. I should have gone where I’d normally get my fish from on bronxwood"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcWRyWnNRRRAB",
            "text": "The food (honey garlic wings) delicious. Stewed chicken not so much bc I had to settle for that instead of jerk chicken which was on the menu but not available.\nMy hostess was very slow but trying her best.\nThe bar and the whole establishment needs a John Taffer reconstruction.\nMy LI ICED TEA was white. Really?\nAlso seemed like a homey spot not Professional at all. Kids (6) in the establishment with grown folk. Not cool."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdjVYM0JREAE",
            "text": "Seriously what good can I say about this place?! We ordered an order of mac and cheese and calamari for starters and about 10-15 mins after we ordered they said they didn't have calamari which in that case I ordered crab cakes and they NEVER arrived to the table. Ordered 2 servings of oxtail with rice and pees and guess what?! BOTH ORDERS had hair on them. I wish I could have taken a pic of them so I could show but I was so annoyed, upset and disgusted at the same time that I didn't even thought about it. No one came to the table to apologize for the inconvenience and not only that but they try ro charge us for the meal even tho we literally had only 2 bites of the food till we noticed the hair on the food. I was excited to try this place and it was my idea coming here but tbh it was a TOTAL disappointment.  Never again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdmEzRlR3EAE",
            "text": "It was ok kinda empty to the point where it was still standing dancing and walking room. I went on a seafood night on a Wednesday and what I wanted they didn't have so I was upset from then. I really had taste for some snow crabs and they…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNDdQUWx3RRAB",
            "text": "The food is always wonderful, it's the rude staff for me that never know what you're taking about!!! Also.....UPDATE YOUR PRICES ON WEBSITE for 2023!!! Brown Stew Fish is Not $15.99 now it's $26.00 for Lunch and Dinner. Thank you. (Take Out Customer)"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLd0txS25BRRAB",
            "text": "I'm sorry, but I will not be back.  The oxtail was horrible, the honey garlic wings were horrible.  The Mac and cheese, rice and peas, and fried chicken were great, but that's about it.   Maybe I should try again for the seafood, but I don't even want to."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNjZqaW5BRRAB",
            "text": "Do not used debit or credit card here!!!! My card was lost as the server said that took my card!!! Then  they call me 45 minutes after leaving the club saying they have it, I ask where they found it NO explanation and the last person to get my card was the server, then she came back saying my card lost!!! After going back to find out where my card was no explanation not even an apology! Plus someone used my card with a $1 first then a &190 after!!! THANK GOD FOR CHASE! I’ll get my money back and a new card overnight!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z2EtSy13RRAB",
            "text": "The owner is very rude.. His “employee” took my friend debit card and “supposedly” lost it.. as my friend left the establishment they called her back 45mins later telling her the debit card “appeared” when she checked her online banking she…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTa01ib2VREAE",
            "text": "This restaurant has the best food and service in the area. We had a private dinner there and the service could not be better. Everything was absolutely perfect.  The staff is great, the ambiance is nice."
        }
    ],
    "reviews_count": 71
}