{
    "name": "Flamez Cuisine",
    "place_id": "ChIJD1dL_3bzwokR7WkEmP2m1QU",
    "grid": "BX12",
    "address": "3728 Bronxwood Ave, Bronx, NY 10469, USA",
    "rating": 4.4,
    "user_ratings_total": 154,
    "phone_number": "(718) 994-0010",
    "reviews": [
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLNlEzN2pxdjd5R3lRRRAB",
            "text": "Highly recommend!  food is amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcXp5TEtYZ3VTZkRBEAE",
            "text": "This restaurant is the best in the Bronx hat's off.. This place is extremely clean. The staff is very professional, food looks amazing and taste even better I highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNmNYbjh3RRAB",
            "text": "Nasty nasty Nasty...the jerk pork was sakty and rasta pasta was rasta mash potatoes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXREcHpnRRAB",
            "text": "I used to order this exact meal. The large steam fish and rice and peas. It would usually come in the big silver pan and have a good portion of veggies and okra and pumpkin. Now they are putting the food in the cheap white containers that can’t even close back.\nThis is nothing compared to that. Now i will never buy this meal again. This dish looks tired and lazy. Very disappointed\nFood also didn’t taste appealing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveXNPTFlnEAE",
            "text": "I went there for my first time on 4/22/25 around 830pm.due to the review..\nThe staff was  on the phone she was eating..first off...then I order a pasta it was good.,but the chill shrimp was the worst tasted I ever in require..it was so chewing  I had to spit it out..I live in Westchester ny.if I was still in the Bronx. I would have returned back with food and throw it right in her face ...the worst 20 dollar I ever spent...\nMy first experience was the worst . Les Caribbean on 221 is the best food on bronxwood. The hype of this restaurant. Was the wrong hype.. chill chewy shrimp nasty as hell..I will return to tell them how nasty the shrimp was."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbjU3ZDlnRRAB",
            "text": "The best in the Bronx for authentic Jamaica 🇯🇲 food, seasoned to the born."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NUlPWkdBEAE",
            "text": "This was my first time trying their food. I had the Curry Chicken lunch and dumplings (they were tasty after I reheated them). The CC, sweet plantain and cabbage were good! But I don't know why Jamaican restaurants only give you a table spoon of cabbage 😁. The rice was okay but a little dry even with gravy.  The serve J. was nice!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d0liRTZ3RRAB",
            "text": "Don’t order online, the food is incredible here but don’t order online they will do you dirty and only give you the smallest amount of meat and steal your money."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMElPX0Z3EAE",
            "text": "Any time of the day it’s a Fantabulous treat. Just pull up Jermaine Got you 100 percent. Bring ur Family bring Queen n don’t be mean 😛👆🏼🇯🇲🇯🇲🇯🇲🇯🇲"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMXR1RndBRRAB",
            "text": "This restaurant is honestly a gem! Best Jamaican food I’ve had in a while. The food you get is well worth every penny!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeG9HeVl3EAE",
            "text": "The food here isb💯% on point. I Got the Garlic Butter & Jerk Chicken Rasta Pasta with a side of sweet chili shrimp. The atmosphere is therapeutic as they play Gosple music. If I can give them 10 statt I would. The staff is pleasant and Jermaine the owner is a friendly brother⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHV1Mk93EAE",
            "text": "Favorite spot in my neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdXNIa0t3EAE",
            "text": "Flamez Cuisine is amazing! Every dish I’ve tried bursts with flavor. The atmosphere is cozy, and the staff is friendly. My favorite is the Oxtail Rice and peas —it’s a must-try! Can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIemZ5OU9nEAE",
            "text": "They have the best food 😋\nService 💯atmosphere 5⭐️\nWhich they open on a Sunday when I get off work.\nThe friendly faces when you step in is a⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycVpHQ3BnRRAB",
            "text": "Food socks plus expensive\nNot a good Jamaican cook..\nThat was my first and last time at this location. Just keeping it real it's probably 1 or 2 good Jamaican restaurant's in the whole bx.\n\nNeed Kingstonian chefs..\nStew peas tasted horrible like they don't know how to put the stew peas together."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNS1lRXhRRRAB",
            "text": "I ordered fried fish, rice and peas two orders of plantain. The only thing good was the rice and peas with a little oxtail gravy. The fried fish was dry no season bland like hospital food and the plantains were all burnt and dried you people are not cooking Not all Jamaicans can cook"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODd1WnBnRRAB",
            "text": "I ordered a large chicken soup, jerk chicken and rice and coco bread. I really wanted the soup because my bf was sick and couldn't eat solid foods. The other items were just add-ons. The order arrived and the soup was missing. I called the restaurant and they said they were out of the specific soup I ordered and they tried calling me several times and I didn't pick up. That was a blatant LIE. My phone does not block calls and I had it in my hand the entire time tracking the order's arrival. At this point, I just wanted to get the some soup to my bf, so I asked them if I could get another soup? They said yes and asked how was I going to get it. I asked them if they could have it  delivered, since I already paid for Uber and tip and this want my fault. They said no but I could contact Uber Customer Service.\n\nI would be upset as it was if they just forgot the soup, but them lying and being so flippant about the matter made it even worse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbm9YVnBBRRAB",
            "text": "The Food was really good. Haven't tried the soup yet..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbTYteXFnRRAB",
            "text": "The best in the bronx!!!!! If you think a lie ask god😘"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOHNlU09BEAE",
            "text": "Best food hands down 🔥🔥🔥🔥🔥🔥🔥🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX3BHVVl3EAE",
            "text": "Flamez Restaurant offers an authentic taste of Jamaica that was bought to me for the first time for lunch. Hands down it was Caribbean with every bite. The flavors are bold, the portions generous. The oxtail stew, rice, sweet plantains & steamed veggies were amazing. Whether you're a longtime fan of Jamaican cuisine or a newcomer eager to explore new flavors, Flamez Restaurant is a must-visit destination.\n\nMarisol MC Jacobi"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNXFiYTdBRRAB",
            "text": "Rasta pasta was mediocre. Was basically pasta with a chicken quarter of Jerk Chicken on the side. I like my Rasta pasta with sliced chicken breast Incorporated in the sauce. This was rather dry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNS1LZ3VBRRAB",
            "text": "This is my 2nd time coming here I grow up in this area as a Jamaican this is the best restaurant I’ve been to in over 50 years everyone should know the food taste like authentic home cooked Jamaican food and the staff is also very kind and courteous I’m now going to be a regular customer 💖🇯🇲🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dlAtUmF3EAE",
            "text": "Ordered on Uber eats. All I can say is WOW. I got oxtail and it was so flavorful, very generous with portions and gravy ! Very fresh food and I am just amazed. I’ve had a lot of good Jamaican food and Flamez is the best! Thank You"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbXZtaERnEAE",
            "text": "I ordered a large Baked Chicken which is distinctly different from BBQ Chicken is it not? I don’t know if their version of baked chicken is to bake it and smother it in BBQ sauce; if so I wish the menu specified that. I was trying to make a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdWE2Z0pBEAE",
            "text": "I’ve only ordered through Ubereats but the oxtail and sweet chili wings is really good and the customer service is 10/10!! Thank you so much for everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMmFyQ0dnEAE",
            "text": "The young men serving and cashing were helpful, prices were very reasonable and food was really good. I loved the pepper shrimp the most. I'll be sure to stop in again next time I'm in the Bronx."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMXVldExnEAE",
            "text": "I went to the  restaurant on 11/18/23 and purchased a shrimp platter and large curry chicken. The server who is also the  cashier, prepared my meal without gloves. 2. Incomplete meal and gave me pepper shrimp that is not cleaned (I have pictures). I enjoy going to the restaurant however today was the worst experience, I even called and told the young lady about the situation and her dismissive rude behavior lead to this review hence poor service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGd1BQcHZRRRAB",
            "text": "Ordered delivery and I don’t know how this food get 5 stars. Most of the dish was rice no gravy oxtails was dry and 98% FAT, very disappointed!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaODhiN2VnEAE",
            "text": "I have ordered both in the restaurant which is extremely small with no seating.\n\nI also had it delivered the food was well packaged.\n\nAs it pertains to the food itself the food is well seasoned.  The only dish I would state that needs a bit of a change is saltfish, and ackee which\nwas a bit greasy and the dumplings needed to be fried a bit softer and needed a bit of seasoning. It is only on the breakfast menu, I would suggest to make this dish throughout the day.\nOtherwise, the food is great and I would highly recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacXZLcExnEAE",
            "text": "Food is always top tier, best I've had"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacExfSUZBEAE",
            "text": "They are an absolute gem ordered catering trays and the food was so delicious. Everyone was raving about the wings. They even accommodated some special requests which came in clutch and made the service impeccable. Highly recommend and would order again in a heartbeat."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKalBIZ2hRRRAB",
            "text": "Clean Restaurant! The lady that served me was very kind and wasn’t stingy with the chicken, how every restaurant should be! I ordered the Sweet wings and pasta. The wings were amazing but I will say the pasta should be cooked more and with less salt. Overall 10/10 though!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdHBhbzBBRRAB",
            "text": "Oxtail was really tough."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5M3UtaklREAE",
            "text": "Great spot to eat! The food was great!  Service, excellent! Nice clean restaurant! Check them out!\n\nI've gone to buy food just for me as well as hired them to cater for an event and it was great! They also deliver group lunch orders."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbXJfVld3EAE",
            "text": "One of the best Jamaican restaurants in the bronx perfect flavors for your oxtails shirpm or chicken. Dem ting litt like yard style straight.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM3ZpSW9RRRAB",
            "text": "Omgaaa best food definitely one of my top restaurants don’t mind the pic i already started eating it’s that damn good lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaUxmY0t3EAE",
            "text": "The restaurant has many different foods which are all good I would 100% recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocE5pYUZ3EAE",
            "text": "Best, best food.I got what I wanted in less than 4 minutes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocEtDS0VREAE",
            "text": "This is the best restaurant in the Bronx the food service is so good. Y’all should go try it out!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdjVUS3hBRRAB",
            "text": "...... the food in here is A1.. LOVE THIS PLACE"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcnFHSVhnEAE",
            "text": "Good food 🍲👌🏼…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlakotRS13RRAB",
            "text": "Never disappoints in terms of consistency with food. Highly recommend.  You will not be disappointed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla2JQYVhREAE",
            "text": "This is the best Jamaican restaurant I’ve been to an the food is really good for a really good price I love the seafood it’s well seasoned an that goes for the rest of the food all the food is seasoned perfectly an taste really good yall need to go try it asap an the setting of the restaurant is so cute."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aUpPRG5BRRAB",
            "text": "I Just Tried This Place For The First Time & Was Very Impressed The Fried And Sweet Chili Shrimp Was Perfect 🔥 And The Pasta Was Head Buss!! The Owner Was Super Nice I Cant Wait To Try Other Dishes"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeF9yblRnEAE",
            "text": "Ordered through Uber, t\nhe most nastiest food I’ve ever had, everything tasted like it came out the fridge or was spoiled. The rice and peas was nasty , salad nasty, potato salad nasty  .. everything was disgusting. 0/10"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc05YcHN3RRAB",
            "text": "I SAW THE CHEF LICK HIS HAND AND KEEP COOKING. I’m a grub hub and Uber eats deiver and the wait time is ridiculous.. not to mention I seen the staff lick his hand and continue his work. Disgusting"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdmFIc2JnEAE",
            "text": "Food was fresh and hot well flavored"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZy1YMHhnRRAB",
            "text": "Food is delicious and staff is efficient.  No long waiting in line. Presentation on point."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNmN1bEt3EAE",
            "text": "FLAMES!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Nl9hSXRBRRAB",
            "text": "Best food hands down! Rarely find a Jamaican restaurant that is ON POINT across the board. The moment I walked in I was taken aback by the vibrant atmosphere, warm and welcoming staff, and not to mention the display and variety of food. I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLWV1VEZBEAE",
            "text": "The $20 takeout Oxtail meal was a plate of rice with cabbage and sauce scattered on top of 5 pieces of tough, inedible meat. I will never order from this restaurant again. 2 stars because the flavor of the sauce was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyX0xqLW1RRRAB",
            "text": "Not bad at all. The food was pretty good even in an area known for high level take out it may be able to compete. I ordered barbecue chicken with rice and peas medium size at a reasonable price. Everything tasted good above average for sure. I gave it 4 stars for a very good first impression. I will know more after my next visit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ODhTb013EAE",
            "text": "This cozy and clean restaurant has left the best impressions! The staff is delightful and very professional, delicious dishes, beautiful presentations and wonderful desserts. I recommend Flamez Cuisine to everyone! I eat there every single…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MnJQMmt3RRAB",
            "text": "Flamez food is very very tasteful and additive. My compliment to the chef. The seasoning that the chef uses is excellent. Everyone who I purchased the food for at my work enjoys it and have nothing but great compliments about the food. My…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bXRiU2lBRRAB",
            "text": "Listen, I've been supporting before these MEN started this restaurant, and I must say di food taste nice and look good. Salute to the Chef. This is a highly recommended restaurant, especially on Fridays and Saturdays for seafood fest. You will not be disappointed. You get value for your money. Just try it!\nYummy 😋.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhb0pYLVNREAE",
            "text": "They don't have menus in the aspect of the prices. They don't weight your food, they value your order however they feel like it. Female worker had a smirk on her face and charged me $15 for a piece of salmon. Highly overpriced in fact prejudiced. Shame on them. Never again !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMWNPXzdnRRAB",
            "text": "Food is well seasoned and always fresh. The rice and peas is very flavorful and you can taste the authenticity of the coconut that they use. My favorites are the salmon, oxtail and curry goat."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5azUzT2dRRRAB",
            "text": "Great Jamaican spot for everything authentic. The seafood platter is well worth the drive from Queens to the Bronx. Great courteous staff in a clean friendly environment. You won't be disappointed!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bXRydmp3RRAB",
            "text": "Top tier service, AMAZING food, mind blowing ambiance, welcoming environment, and accessible. Would definitely recommend for anyone looking for quality food at affordable price and hassle free. If I could give more stars I would because everything was just that good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5LXFuMktREAE",
            "text": "If you’re looking for a great place to enjoy your Caribbean food, with a great and highly professional customer service, flames cuisine is the ideal place. I absolutely enjoyed every meal i purchased. Great ambiance!! I love it there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cnAzUXZRRRAB",
            "text": "Pleasanton & clean established. Staffing dressed appropriately and adhere to covid rules.Staff is pleasant and greet customers.\nTheir food will definitely change ur bad mood to happiness!! Food is freshly…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdjZhd19nRRAB",
            "text": "I’ll give it 0 stars if I could customer service is horrible ! I ordered oxtails and kola champagne (soda) and because they didn’t have oxtail instead of calling me to negotiate a substitute  they sent the delivery driver to my house with just the kola champagne (soda). Really and the manager name is BRYAN OR BRIAN . The whole place needs to close down. This was very very very very unacceptable. They really sent the delivery guy to my house with just a soda. Then I called them directly had the nerve to lie that door dash sent the order like that. No they didn’t how they know you guys don’t have oxtail, I can’t place a 2 dollar order . Listen I’m telling y’all don’t order here !!! Big scam!! SCAM!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMGZ6LWV3EAE",
            "text": "Want the best authentic Jamaican food in néw york.. this is the place to be .. customer service is awesome you will feel at home and the food .. perfection .. u won’t be disappointed. I eat breakfast lunch and dinner here so you know this food is no joke.. simply the best!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MDQySEVREAE",
            "text": "Its was magical! The ambience was on point! Staff 10/10\nThe salmon and the barbefry chicken (what unno put in there?) Was great.\nIf you are searching for an authentic Caribbean/Jamaican taste this is the place to go!\n\nTry it, you will delighted! #Flamez #AlwaysandForeverNUMBER1"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bnFQMWFnEAE",
            "text": "Very good place to eat the food is Awesome!!!  The place is very family friendly the ambiance is  immaculate the staff is well trained love the color of the place also  keeping guide line with health and safety protocol I would recommend…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMEkzSjl3RRAB",
            "text": "Good portion, quite tasty, excellent selection of breakfast foods. Ackee had too much oil, but very tasty. Staff quite friendly. Environment very clean. Will definitely go back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MDVYX2d3RRAB",
            "text": "Very clean restaurant impeccable customer service..the food is always hot 🔥 and bursting with delicious flavours 😋..my favorite is the garlic shrimp,pasta and crablegs..super juicy and yummy 10 out a 10..go check them out..u will not regret it!!!…"
        }
    ],
    "reviews_count": 68
}