{
    "name": "Caridad Williamsbridge",
    "place_id": "ChIJJRGyibL0wokRPvrqSB-yId4",
    "grid": "BX12",
    "address": "1436 Williamsbridge Rd, Bronx, NY 10461, USA",
    "rating": 3.9,
    "user_ratings_total": 857,
    "phone_number": "(718) 892-8322",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR01HOW5aMjVHV1VaZlNGQmZXbXh0YUVodmMzYxAB",
            "text": "Order from this restaurant twice. Over the phone and uber eats, the food was cold, and the beans spoiled. They also charge me $25 for each order and sent me the food in a $10 lunch container. This is a Scam, a threat to health safety and the delivery takes over an hour. DO NOT RECOMMEND. They don’t deserve one star."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFZUQjJUVTFCY0dZeVkwTkxVR1JHWjA1TlNuYxAB",
            "text": "staff members phone etiquette is horrible. Female receiving calls has a disgusting attitude makes you not want to call here to order food. get better with your service !!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNreDRpbnFnRRAB",
            "text": "Best Dominican cake"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RVUzcDVaMDVMVkVOa1RXVmFjSEF4VjBaT2RuYxAB",
            "text": "Order from this restaurant yesterday via uber eats and the food i received was abysmal. The rice was hard as rocks and the pernil tasted like it was soaking in some kinda weird oil. We know uber eats prices aren’t in store prices.  I know for the fact the workers would have served the food I got to their families so why me a paying customer had to receive it? First and last time ordering from this location"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM1ZHMHdWRlYyU0ZVNGNsZDNaamx1VVdrNWNFRRAB",
            "text": "Good dominican food"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVldIUkpjbUkwVEZWQmFGbGZRV3Q1YVZSU2NtYxAB",
            "text": "la comida que es buena, de ahí pa allá malísima atención."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdGVESkhUa05oUVdWb1UweERiRkpIUTNObllVRRAB",
            "text": "They cook super well and are friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUlpWTmhTVXBEVVhodVJHcFdlRGRyZVRSaE4yYxAB",
            "text": "Received this order crazy late and with just 3 pieces of chicken. Like wow !!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNGZqcl9nRRAB",
            "text": "Great Family Restaurant! BEST SANCOCHO!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdFkxWklWWEptT1UxTk5GUkRXVnBhWTJ3dFNFRRAB",
            "text": "Authentic and delicious"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhZzVhRHd3RRAB",
            "text": "Good food"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S1RXTlhPRTFoWDI5bGFHRm1hbE5uVkVkSk5IYxAB",
            "text": "Totalmente excelente lo recomiendo 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORWVWUjVXa0Z6WkhwaVoyd3hiWFJFUlhodFFXYxAB",
            "text": "Came to this caridad yesterday for first time thinking it would be good.but the food was warm not even hot the presentation of the food was horrible the waiter gave us the food and never came back check up on us to see if everything was good she came to bring us the bill and the place was empty."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLVZpdVdLc3B1LVpBEAE",
            "text": "Comida es deliciosa use este restaurante para el buffet de Los sweet sixteen de mi ni~a y todos quedaron encantado con la comida tanto Que se lo recomende a un familiar y toda la familia esta comentando lo delicioso Que todo estaba. Yo lo recomiendo 🥰🙏precio servicio y la deliciosa comida🥰🥰🙏"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOR1p6cWJxdV9LbkhBEAE",
            "text": "Unfortunately this was one of my top tier places for a authentic dinner I had the best meal from here ordered via Grubhub a family meal. Today I placed an order and due to carelessness of the restaurant someone else left with my order or Grubhub driver stole it either way I waited almost two hours for my food and received nothing and very disappointed with the way I was spoken to by the restaurant and shame that now I won’t be having their delicious food again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLMkItNVMweGVuRklBEAE",
            "text": "This has to be the worst spanish food I've ever had . I was missing items in my order , The accuracy of my order was bad . The pepper steak is so gross and has no sauce . Everything else was gross as well. I would recommend fixing the recipes because the food flavors are terrible.  Unfortunately this will be the last time I ever buy from this Restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb19QOXRBRRAB",
            "text": "Good place to grab a quick bite of Latin American food."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanJ2SHd3RRAB",
            "text": "My to go place  to order mangu!  Good prices and big portions.  Plus the staff is very friendly!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcXFIMmxBRRAB",
            "text": "I been going to this Particular place for 20 years family events always there buffet style they treat everyone as family. Highly recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaWVxNlR3EAE",
            "text": "I WAITED WAY TO LONG FOR MY ORDER #1 being the only customer inside the restaurant, MOST IMPORTANTLY THE MONDONGO I ORDERED WAS DISGUSTING IT TASTED LIKE TOMATO , MY SECOND ORDER WAS WHITE RICE AND UNION STEAK AND NASTY BEANS OMG THE NERVE . NOT GOOD AT ALL"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MmVhdkl3EAE",
            "text": "Delicious latin food .\nFriendly employees, Gente decente. Specially el muchacho que atiende en la registradora,de decendencia dominacana , muy amable y cordial. Por el es que yo entro…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NS1LSFRnEAE",
            "text": "Bad customer service I was sitting for 10 minutes and no one came to serve me"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbGZ1QVN3EAE",
            "text": "Very unprofessional for a restaurant that was featured on Univision and ABC news I just wonder how, First time I ordered food straight up attitude through the phone because they couldn’t understand what I was saying in English, I just figured it’s been a long day, and they were about to close too but, second time I went to call their store to inquire about catering they have hung up on me twice. First it was trying to get info from their website about catering they never got back to me so that was useless, then I called the restaurant got hung up on twice I mean no wonder why they have 3 stars, I try to give the benefit of the doubt but this cuts it, if the language is the barrier hire someone who can do the customer service for y’all on the phone in English. This is how you lose customers because I was willing to pay hundreds of dollars for catering for my daughters birthday and y’all just couldn’t even bother to take in the order or inquiry."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN05xcHhnRRAB",
            "text": "Food is cooked with perfection. Oh it’s so good."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBLU9iSW1BRRAB",
            "text": "Muy Caro y la comida que me lleve a casa parecia del dia anterior may Mala no me gusto"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOHU3cG5nRRAB",
            "text": "Foods always good here. I always come with my daughter and we get the roasted chicken with rice. It’s my daughter’s go to order but a side not it’s cheaper if you get a half chicken order. Service is good as well but you mainly coming here for quick bites and food usually comes out within 5-10 minutes of sitting down."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbDh1N3VRRRAB",
            "text": "Buena comida"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd1p6UWZnEAE",
            "text": "very great food I was impressed. love the tres leches and the pastelitos!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMHVmVEZREAE",
            "text": "Food was delicious and hot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N2NQUHBnRRAB",
            "text": "The asopao very oily I actually had to put water in the asopao, the platano maduros are cut so thick the inside is raw and I am so tired of dominican restaurants cooking how they want even though you ask them to give you a certain way.\n\nTheir rice is dry and no taste both white and yellow and it's just ridiculous you cook bad and have a restaurant.\n\nBTW, they took an hour and a half to come with the delivery."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNmJ5Rnh3RRAB",
            "text": "Got dinner there today can I complain food's always good I just don't like that after post COVID they close earlier now...."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMUo3RjdnRRAB",
            "text": "Food is good.   The ambience is nice.  The waitstaff was very nice and attentive."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbGRQSnBRRRAB",
            "text": "Food is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN3VIUENREAE",
            "text": "Wanted to have a good sancocho after a long trip and long commute and found what I wanted. Attentive staff and tasty food as well. Couldn't asked for more!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjeXFEcl9nRRAB",
            "text": "Everybody very nice and they welcome you so good i love going there i recommend the restaurant Carida."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN0p6NVZREAE",
            "text": "Ponen señoras demasiado lentas para tomar tu orden y de paso te llega el delivery 1 hora despues deplorable servicio"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjhEMXhRRRAB",
            "text": "Es un buen lugar con muy buen servicio, buena comida con sus excepciones."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaWNtU013EAE",
            "text": "Legendary service but I think they changed cooks. Food doesn’t taste the same like a few years ago."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaTRmV2NREAE",
            "text": "Very disorganized service. 5 people in the front and talking to one another and take forever to take your order. Take a long time to serve the food even when there is no customers. Food full of oil and when they charge you they don’t even give a recipt because they charge you what they want to charge."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieG92NHBRRRAB",
            "text": "Chicken was dry. But everything else was good. I'll give the 1 more chance before I take my business elsewhere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX1ppTXlRRRAB",
            "text": "Nasty waitresses and high prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybWEydGlnRRAB",
            "text": "If there was a way to give no stars I would. Great food but customer service is absolutely horrible don’t even bother ordering on Uber eats because what they will do is give your food to someone that isn’t your driver and tell you it’s your fault. I was told to take it up with Uber eats because they have my food to someone and then wouldn’t remake it because of their own stupidity because they were closing in two minutes meanwhile I ordered two hours before they closed. They don’t want your business just your money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb2ZUYkJnEAE",
            "text": "The rice smelled and tasted burnt. The beans were also very watery. I am a frequent customer and that has never happened. I have had other issues like mistakes with my orders. When I called I spoke to the manager and another guy who did not listen. He spoke as I spoke and I told him I was hanging up because he was not listening. They kept telling me to contact Uber but I was telling them it wasn’t Ubers fault the food was bad it was there’s. I am disappointed but I’m Dominican and I expected them to have better customer service. No apologies. No attempt to fix the problem for a frequent customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMLWZHTUxnEAE",
            "text": "The Rice and pea's were very good the fried pork chops needed a little more seasoning. My wife enjoyed her roast pork and beans and rice I would go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaU82TUVnEAE",
            "text": "I love there service to make my order cheaper explained the menu over the phone to me their chicken is fully cooked not like (bohio westchester square) under cooked I didn't have to pay an extra dollar for each garlic (like bohio)they gave me a little brown bag full with extra with the meal . Over all satisfied."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodWIzQnV3RRAB",
            "text": "Seems like quality control has been lacking. Always ordered from Caridad, however last 2 orders have been short of expectations. Received a medium avocado salad instead of a large ordered salad prior week. I gave them another chance today. Disgustingly, after nearly finishing my salad today, I found a fly at the underneath the last piece of sliced avocado. I called the restaurant to inform them of my experience without asking for any refund or credit with the hope they improve their quality control going forward. The manager was sincere and apologetic, however I will not be ordering here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhZ3RqbFRBEAE",
            "text": "Great simple restaurant that will satisfy your Latin-American food cravings.\n\nYou can’t go wrong with Caridad’s boneless chicken chunks and their Chicharron de Cerdo. Both dishes are a staple to be eaten with rice and beans.\n\nIts a perfect cozy spot for breakfast, lunch and dinner. Come visit and satisfy your hunger."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3X3JYXzNnRRAB",
            "text": "Had a great time! The food was delicious and came quickly. The service was friendly and attentive."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbWJxMkl3EAE",
            "text": "I went yesterday morning, entered upon seeing A rating. Waitress was professional, I had bacon & eggs with sweet plantains, very oily, which is 1 of the reasons I'm gave it 2 stars. My husband enjoyed his tripe soup. Cutlery is not…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENXFHQzNnRRAB",
            "text": "The  Dominican with light brown hairwaitress didn't pay much attention and had an attitude...her coworker served us and he was very nice and attentive."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNTdXUWRBEAE",
            "text": "I went here for lunch today and I ordered the lunch special with rotisserie chicken and white rice. The menu price is $6.99 until 3pm. My debit card was charged $8.10. So, I asked the cashier how much it was originally and she tells me $8.10 with an ATTITUDE. I could clearly see that on the receipt. I then asked again, how much was the food without the tax and she told me that she didn't know and walked away from me speaking Spanish. The sales tax for NYC is 8.875% which should have made my total $7.61. I would like to know why I was charged an additional .49 cents. To some it may not seem like a lot, but that is not the point. If you're charging additional fees, the cashier should be able to explain why. I will NEVER order food from here again. Horrible customer service!!! The food was just alright."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbzltVWRREAE",
            "text": "Our favorite place to visit when we go to NY. The food is real Dominican and delicious, we absolutely love it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aV9HWklnEAE",
            "text": "No way this chicharron is a pound and a half !!!! Not right, literally 5 pieces and mostly bone ! Dry, No Salt, Bland. Never Again, ZERO Stars. At Least Once A Month I Buy A Pound Of Chicharron. No Where Near A Pound And A Half."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZeWJLWTNBRRAB",
            "text": "Always good food here and great service. I've been coming here for years."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMWFEdnZ3RRAB",
            "text": "The food was pretty good and the service was fine.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMHNlSjJRRRAB",
            "text": "Customer service is horrible I stood there for 10 minutes the woman looked me in my eyes never acknowledged me she kept running back and forth another lady that ordered prior to had to call her and tell her I wanted to order when I was finished my order she doesn't understand English well when I finish my order I wanted to give another order and she didn't do it she had to come back and add the other order on there and she asked me was I finished and I told her no I don't trust their food so I won't eat their food because I don't trust her"
        },
        {
            "date": "8년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnazlUNi13RRAB",
            "text": "Esta bien él lugar dan comida rápida me gusto y te dan buen servicios"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX2V5WER3EAE",
            "text": "I ordered beef alcapurrias and the maza was still raw on the inside. Disgusting"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGNuN09BEAE",
            "text": "The food here is so authentic and delicious. The service is great and the staff is so friendly. One of the waiters brought a piece of cake because it was my coworker's birthday and she insisted on not charging us for the cake. They are kind…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENl8zTFR3EAE",
            "text": "Ordered oxtails with rice and black beans.  Oxtails were cut paper thin and meat was hard as a rock.  No flavor.  Rice was also hard.  Highly disappointed because I usually order soup from here and it’s always good.  Won’t be ordering from here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaEx1aFFBEAE",
            "text": "Unfortunately, a simple onion steak has become a challenge among Spanish restaurants, and this Caridad was no exception.  Terrible. My order consisted of simple items.  But once again, it was a lot to ask.  The yellow rice was terrible. Tasteless.  Maduros, it's hard to get those wrong.  And again, those were so hard that after biting into one, I had to poke at the rest to confirm that it wasn't just one, and they were terrible. Everything lacked in everything.   Taste was terrible.  Those maduros should have been discarded and not given to any customer.  So I did what they wouldn't and discarded them.  I gave most of the steak to the strays in my area and dumped the rice with the maduros.  Total waste of time and money.  Won't be returning, and if you're going to try, stick to white rice and good luck from there."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweUxuQ1lREAE",
            "text": "Horrible service decline over last year. $19 for Chicken soup? They’re quick to take payment and even quicker to have you wait for a simple take out order of soup. They’re reason for having me wait 10 minutes for said soup? They said they ran out of lids. NEVER AGAIN. Note to RESTAURANT MANAGER WHO DECIDED TO ARGUE WITH ME OVER HIS STAFFS UNPROFESSIONAL TREATMENT. THIS REVIEW IS HERE TO STAY. NO PHONY APOLOGIES NEEDED AT THIS POINT."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaHBxVWVBEAE",
            "text": "Good morning,  honestly I can't believe I'm even writing this review but it has to be done. I ordered catering order on 12/15th and the delivery was supposed to be @my house by 3-3:15. By 4 pm I called and spoke to someone who stated that the delivery guy had my order and was running late. By 4:45 we spoke with the restaurant again and they gave me the number of delivery guy as well. The delivery guy hung up on me 2xs!! And the restaurant kept putting us on hold. By 4:30 pm we spoke to a Manager who stated \" you must have ordered from a different Caridad\". And that he was gonna send us the order but they have nothing stating we ordered. I ordered online and the money was taken out the account asap!!!! Eveytime I called I kept asking if they wanted the order number from online but NOPE! NO one wanted to check or didn't know how to!!!! I've ordered from this place for catering for years. But this was unacceptable and to be told we never paid them and they had no order from us. It was embarrassing and I have all the timeframes of all the running around and confirmation text when the food was ordered and confirmed!!!! So last minute they delivered the food @5:41pm. The rice and pork were cold and needless to say I'm done!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNval8zTU1nEAE",
            "text": "Have eaten here many times. Sat down several times, to go several times, and delivery several times. Food has always been amazing and consistent in flavor. Service has always been polite and as expedient as possible. One time sitting down,…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjcXNfUmVnEAE",
            "text": "I really wanted to give this place a good review but my experience with them is just very bad. I ordered delivery and was given an estimate as to what time I will get the food. It never came. I called the restaurant and spoke to a lady who said the food is on the way and if I can wait a few more minutes. I waited 45 minutes before calling them again and I was then informed my food is actually still in the restaurant. What happened? Now I have to wait another 30-40 minutes for them to deliver the food. So you mean the first time I called you, did you really bother to check my order? Maybe not.\nI guess the stars on this restaurant should've served as a warning not to order from them. But then I really try to support local businesses but they also need to step up and improve their service.\nI wanted to review the food but guess what, I still didn't get it.\nNote: I ordered at 2:30pm. It’s already 5:30pm and still didn’t get the food. Amazingly slow and bad service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZ1BLek53EAE",
            "text": "The service here is amazing. I love the food, it always has the same taste. The people here are very friendly and the place itself is clean."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNva2RyQ0RBEAE",
            "text": "I love the food here. I always order my bowl of white rice and a bowl of yellow rice with one container of chicken gravy and one container of beans. I also add the whole or half chicken and plantains. They always treat me great here. I went…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhM3J2Rm5nRRAB",
            "text": "The food flavor was good, but I ordered a full chicken and only half was sent.  The food arrived very quickly but it was very cold.  I will not be ordering from here again.  I called the restaurant and they said that they could not deliver…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOXRUZjdBRRAB",
            "text": "Great experience. They were very attentive. We request to sit in the back due to having two new born. The food was excellent. They gave us dessert and 4 orders of white rice on the house!!. Would recommend for a place to eat!!."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROGNtandnRRAB",
            "text": "The food was easy better than expected. I thought I'd get the run of the mill Spanish food,  but this was a notch above. The staff was courteous as well. The restaurant was kept clean and so was the restroom (AMEN). Worth a stop by if you're feeling hungry. Or just for dessert. Flan was on point!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd3ZQbGVREAE",
            "text": "My job catered from here today and o.m.g. Everything was absolutely packed with flavor, it’s insane. We had pernil, arroz y gandules, chicharron, and maduros. Everything was perfect. Seasoning, presentation, and it was definitely made with love. I inhaled my food lmaoo. I can’t wait to order/cater from here myself."
        }
    ],
    "reviews_count": 71
}