{
    "name": "Triple J's Restaurant LLC",
    "place_id": "ChIJT41SPPfzwokRtQcPDiscG-0",
    "grid": "BX12",
    "address": "3563b Boston Rd, Bronx, NY 10469, USA",
    "rating": 4.9,
    "user_ratings_total": 76,
    "phone_number": "(347) 202-4682",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWFVHOHliMHc0UkZSMWFrMXFaV0kwWm5sSVZVRRAB",
            "text": "Food Was  Good . Tried The Oxtails And It Was Very Enjoyable. First Time Eating Here . Will Be Trying Other Stuff On The Menu."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVJtOVRSM0V0Y1RkUFRHRkdlamxEWkhSdVFXYxAB",
            "text": "Good food good customer service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kYWMwaEpSVVpvTW1aNmFYbzRSamsyYTFOek1VRRAB",
            "text": "Stopped by randomly, around 9pm. Nuff a the food were finished(sold out) but we got the pepper steak w/rice&peas and raw vegetables (shredded carrots and cabbage,love it!) and sweet chilie wings w/rice and peas. Firstly, rice and peas can eat by itself! Well nice!! She wanted oxtail but it was basically done but server(wish i got her name) gave us the few small pieces with the gravy to her rice. Looking forward to trying their curry goat. Represent Jamaican food lovely, support!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSFdfZDMyNXAyTWhRRRAB",
            "text": "We were in NYC for business and this place did not disappoint with service and the food was on point. Don't get distracted by where its located the food and the service inside is amazing to satisfy your carribean food craves. We had a personal driver / security so we didn't feel too awkward."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMjUtVnpRRRAB",
            "text": "All the way good service. Excellent food and great presentation… definitely coming back more often!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN2M3ZkZBEAE",
            "text": "Food is delicious and fresh👍👍👍\nNo restroom 👎👎👎\nParking space easy to find👍👍👍"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmN195blB3EAE",
            "text": "This review is solely due to service.  On 3 occasions I attempted to order an item on Uber eats, corn pumpkin soup.  On each occasion, Uber eats showed that the item was available and the restaurant accepted the order.  Once the order was accepted, the restaurant called to say they didn't have the item that day or time.  I then asked the restaurant, each time to go in and cancel the order. They replied \" we can't cancel the order on our end\". This meant I had to cancel it on my end. However uber only refunds the cost of the food, not the fees or delivery charges \"to compensate the restaurant and delivers for their time and effort\". This means that even though the restaurant knows they are out of stock they do not update the Uber eats page and this has cost me more than 30 dollars in fees over three attempts. This is completely unacceptable and unprofessional."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdVkyMXR3RRAB",
            "text": "Good people behind the counter and good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINE1tZkZBEAE",
            "text": "Great Food and Absolutely Amazing Customer Service!\n\nThe service alone would make me return but, food wise next time I’ll be trying the Rasta pasta and Stew chicken. The Oxtails and Fried chicken are amazing!\n\nSupport this small business!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibi1tUGtnRRAB",
            "text": "I just got back from having my lunch and I gotta say the pork ribs and oxtail was just fantastic. Will"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidF9uLXJ3RRAB",
            "text": "This was my first time ordering from this restaurant, and I thoroughly enjoyed every bite. I ordered the curry chicken, oxtail, and brown stew snapper. They were all delicious, and I will definitely be ordering again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycy1yQ1p3EAE",
            "text": "Food is delicious I'll be back here soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMzdIdnZRRRAB",
            "text": "Favorite Jamaican restaurant in the Bronx Right now. I will recommend anyone looking for good food to stop here and give it a try 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aHJUX0h3EAE",
            "text": "My go-to when I am in that part of the Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOUpxQVVnEAE",
            "text": "Delicious chicken curry — perfectly spiced and very filling."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaU1XUWZBEAE",
            "text": "The food is absolutely wonderful!!! If you’re looking for authentic Jamaican food, this restaurant is IT!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5XzhDNThRRRAB",
            "text": "delicious food and polite staff. Will come here weekly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OVp1VmZREAE",
            "text": "Great Fresh Food and Top of the Line Service....They treat you with Love!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNzVMdndRRRAB",
            "text": "Had chef’s fried chicken, fried rice and cabbage all of which were tasty, precise in seasoning and dining in for lunch was relaxing to jams. They had their own homemade juices. Pineapple ginger lime was deliciously smooth, not overtly sweet, just right. The spread available was well presented and looked tasty. Can’t wait to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZ3YzcHZRRRAB",
            "text": "I came here when they first opened and since then every time someone asks for a place for some Jamaican food this has been my first recommendation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbkpMeWZnEAE",
            "text": "Reviews were spot on, I was able to meet one of the chefs 12/23/23 (Ms.J ), I told her I am a high school teacher looking for a new spot. She was a complete sweetheart and helped me with my choices. I had the oxtail, boiled  dumplings and cabbage. Food was absolutely excellent, strongly advise!! The environment was super clean with areas to sit and enjoy. Will be telling my teacher friends\n\nThank you Ms. J!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGX2NiUGpBRRAB",
            "text": "THE BEST JAMAICAN FOOD IN NEW YORK!!!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bzlpdTlRRRAB",
            "text": "We were visiting NYC and stayed in an Airbnb in the Bronx. After checking in, I had to find an excellent Jamaican place nearby, and then this place popped up. I ordered Ox tail and rice & peas. The seasoning was perfect! It was super flavorful, and the rice was so delicious with a hint of buttery flavor. The lady also gave me two pieces of fried chicken to try for free. I wanted to go back before we left NYC. However, our schedule was somewhat tight, and we couldn’t return before closing time. I will go back next time when we’re in NY!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwczg2VlJBEAE",
            "text": "Had the brown stew chicken and it was great! My partner also loved his meal—vegetable Rasta pasta! We washed it down with their pineapple juice—mild pineapple flavor and more ginger forward.\n\nCute decor and the guy at the front was very kind.\n\nWas the highest rated spot around, while we waited to get out car looked at nearby too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcm9QWWNBEAE",
            "text": "Food was so good I am catering from here for my family party! 2 thumbs up!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdGJYWTZRRRAB",
            "text": "The food is amazingly good!! Great customer service and clean environment. I'll definitely be visiting again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdnJEMUdnEAE",
            "text": "Convenient location. Welcoming and clean space. I know this place is known for the delicious meat meals but I just can't get enough of the steam cabbage! This is definitely a go to spot for mama's caribbean home cooked meals."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXZydDNRRRAB",
            "text": "This is the best oxtail + rice and peas I’ve had in my entire life. Wow. The rice is seasoned so well I had to pause for a second lol. I will be recommending this place to everyone I know"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aktibnVBRRAB",
            "text": "Ordered a  sm Fried Chicken/ w mama sauce. Fried chicken alone is full of flavor combined with the mama sauce elevates the chicken to new levels..\n\nDefinitely will be back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMmEyWkpREAE",
            "text": "My husband and I tried it for the first time today and love it! Our son has Autism and is very picky! We gave him a bite of a beef patty and said \"Mmmmm YUM!!\" He never likes anything due to his spectrum sensory issues.  Let me tell y'all..he literally, tore it UP!🙌🏾🤣 😋 Was so cute to watch him enjoy!\nIt was so soft and fresh. I can never find pattys that don't crumble up all over my clothes. They just are not good anymore. Just dry and horrible!! I also purchased a spinach patty and a large jerk chicken and rice. I loved the fact that they used condules rather than brown peas. The food was fresh, tasty,  and amazing. Everything was delicious. Definitely going back! 🙌🏾🙌🏾\nSo excited to see a minority owned business that has this food integrity; and customer service, phenomenal!! THANK YOU! ❤️❤️❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbWVtQWFREAE",
            "text": "So I went here for the first time today and when I went it was breakfast.. I really wanted lunch.. butttt I didn’t want to leave empty handed so I bought an ackee and saltfish and boiled dumplings… it was so good. A lot of ackee.. and I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOEp6elZREAE",
            "text": "I had the curry chicken and must say, this was OUTSTANDING.  affordable.  Friendly.  Good service.  Perfect heat level.  Seasoning is outta control next level.  Portion was exactly what I needed for lunch.  Love it!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMzhLeGh3RRAB",
            "text": "Staff is friendly. The fry chicken and the Rasta pasta is very good. The place is also clean and run out food fast because of how good it is"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoODdDTUlnEAE",
            "text": "Amazing authentic food! Good service, great people!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaktYbHR3RRAB",
            "text": "The best jamaican restaurant I’ve ever been to in my life. The reviews do not lie. The employees are always so nice and treat you like family. Some things are made to order so be sure to call ahead. But wait times are never crazy. The rice and peas are SO good, like you can taste the silent spices and coconut milk. And its the right amount of moist. The chicken soup is slightly spicy, and seasoned to perfection. Everything is seasoned to perfection. You just know that the people in the kitchen are taking their time and actually care about people enjoying the food. Not to exaggerate but there in LOVE in this food. My go to for when I’m hungry and want take out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdmJmb1dREAE",
            "text": "😍😍😍That’s how I feel after mamas sauce…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdmRlamhBRRAB",
            "text": "I love the Mac n cheese it’s so real."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdlplemlnRRAB",
            "text": "Omg That fried chicken made me wanna slap my self…Sooooo gooood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCa3V1VGlBRRAB",
            "text": "Traveling through from 3 hrs away and was sent here by recommendation, and I'm mighty glad I went. First off, upon entrance, place is well kept, looks clean, smells clean. Customer service, impeccable. FOOD, my goodness, mercy me, well seasoned, tasty, delectable, and the portions are more than enough. The owner, Lady N, pleasant, mannerable and you can tell she/the staff put love and take care of how the food is prepared, handled, served and presented. I pray this business will flourish and an abundance of blessing will fall on all that is apart of and enters, pass by, buy, want to buy and have not what to buy with, bless them. I pray that all the pots, pans, water, ingredients, utensils, equipments be bless. I pray when you enter Triple J's the presents of God will be there, and you will taste the love of God in every bite. Continue supporting our people. One Love."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ04yMU1BEAE",
            "text": "Great spot to get food! A must get if you are in the area or even out of the area! Also, that fried chicken…WOW!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteTZleHZnRRAB",
            "text": "Empress loves ya food one night passing by every since then it’s been my spot so clean and tasty food keep up the good cooking may need y’all for catering one day 😀…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcGM2QTRBRRAB",
            "text": "My son and I stopped here for the curry chicken. The place is very clean, the staff ultra friendly, the curry chicken was so delicious, the white rice cooked perfectly (yes, ppl do screw up rice)  and the fresh juice (cucumber ginger & pineapple ginger) was delicious too. A new go to spot for us in the Bronx!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcGFMd21BRRAB",
            "text": "Great food! Ate here twice today!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtX043VU5REAE",
            "text": "Best Jamaican restaurant in the Bronx. The restaurant is clean and the food is really good👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteUs3VGlRRRAB",
            "text": "Best customer service great tasting food for the right price"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlel95RkdREAE",
            "text": "The best fry chicken better than Jamaican kfc. Come out and support."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldDZxSmZREAE",
            "text": "Good Caribbean food with great service!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleDdDeEV3EAE",
            "text": "Always a clean atmosphere, food is always on point.\nMy favorite meal from Triple J’s is turn cornmeal with fried chicken"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNjVDaWRnEAE",
            "text": "Excellent food..!! Delicious 🥰…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcV9iZ0tnEAE",
            "text": "Food is top tier. Favorite restaurant uptown right now!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMEk3TmVnEAE",
            "text": "One of the best restaurants on Boston rd rn. My favorite is the Sunday’s brunch.\nKeep it going triple js food nice 😊"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbjlYMmZ3EAE",
            "text": "This restaurant is my daily go to restaurant. Every time I go there is like the first time. The environment is clean, the food is great and the customer service is excellent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlamFQa1J3EAE",
            "text": "Drove an hour to get this food and it was well worth it. The food was amazing. The chef was welcoming and have great customer service that made the experience even better. The macaroni salad is a must have because it's the best I ever had.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNllMMWx3RRAB",
            "text": "I went here a couple of weeks ago. They were 10 min to close but J was awesome. Family run business, honest, passionate and super friendly! The food was delicious and place was clean. Love love love!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldlliem53RRAB",
            "text": "Great Food, This will be my go to spot for a great Jamaican dish always, positive energy"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMy1UVHF3RRAB",
            "text": "Best restaurant up town food is great chicken well done it’s a finger licking good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbjgtOENREAE",
            "text": "Hands down!!!! Best new restaurant uptown. Their food is on point 👌🏾…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbjV1QWhBRRAB",
            "text": "I love everything about the food! 10/10 you won’t regret it !!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOE9yQ0xBEAE",
            "text": "One of the best restaurant in the bronx there food always well done"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMzdDd3BnRRAB",
            "text": "One of the best restaurants in the Bronx. Amazing place to eat"
        }
    ],
    "reviews_count": 60
}