{
    "name": "Enzo's Of Williamsbridge",
    "place_id": "ChIJm0wf5qf0wokR8wUD2sL-fIA",
    "grid": "BX12",
    "address": "1998 Williamsbridge Rd, Bronx, NY 10461, USA",
    "rating": 4.5,
    "user_ratings_total": 755,
    "phone_number": "(718) 409-3828",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205d1dXOVRiVzgyZUZsYWN6QnpjM1JvZWxCSFlXYxAB",
            "text": "10 out of 10 I had a great date night and it was amazing!!! Coming soon!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVgxOURhVEV0ZGpsTGF6TjVaMkZWUkZSTmRsRRAB",
            "text": "Was here over the for the weekend for my sister's birthday and the food was amazing. Stuffed artichoke was the best I had in a long time.  The Chilliean sea bass over risotto was amazing.  Everyone loved the food . Great service.  Will be back for sure."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSmJqWkpNVGx1VFVrNFZHUnRSMWxhWlZkWFNVRRAB",
            "text": "I dont want to get into all the details, but when an asian male walks in and request a table for 2 in a more spacious setting and gets the smallest table in the corner, while the restaurant was only 10 percent occupied, and requested the wifi password only to be told the wifi was not working. Now my italian female friend walks in and gets our table moved and also gets the wifi password?? Needless to say, I will never step foot into this place again. The waiter was very cold to me but when my italian friend arrived, it was night and day.  Btw, the original greeter was the owner."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRU0yUjZkVU5XWDFacFRtaHRXVkkzTFdoRldGRRAB",
            "text": "Great place to go. Feels like home."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTlZYVkVTemR2Tm5jdE4wMVpRMk5HVVRWaWIxRRAB",
            "text": "Lived around here my whole life but never got to try Enzo’s. Honestly, way better than I thought. The service was especially good. The pasta was perfectly al dente and their bread is sooo fresh and soft."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dU5Ydy1BRRAB",
            "text": "Funny this should have posted a year ago. Don't know why it didn't, but it's posted now. Server's were very attentive. All and all a very nice experience. Price was fine and food very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZlIyTmpURGsyWjE5MWVHVllSakZuTVhCS1QxRRAB",
            "text": "First time very good, service very good food the best !! Nice people"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueDU3MFlBEAE",
            "text": "Absolutely Excellent!\nYou'll truly enjoy this Restuarant located in the Morris Park section of the Bronx.\nThe Food is fresh and might i say delicious!\nFriendly staff that will tend to all your dinning experience.\nTruly 5 Stars."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWWEwZ3haRUZQTFV4SFVGQnhTMHhoVmtneWFFRRAB",
            "text": "Amazing authentic Italian cuisine. One of the best meals I've ever had...😘"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV1VHeEZhM2xpTldsMVoyNVZhRzlsUVZST1RIYxAB",
            "text": "All I can say is delicious food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMFIwOXdWV1JOUWtOMVVtbFBXa1F4U1V4S1RFRRAB",
            "text": "Excellent service food is amazing . Staff is very courteous and very efficient . Food was served on time great place to eat great food . Thanks\n\nAgain"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZkxVRjNia0ZYTTNSTFEzSTJTSEJwY2xWdGQyYxAB",
            "text": "Burnt Caesar salad! The chicken and the croutons were burnt. Once I let my waiter know, he replied: “ I am not the one who toasts the bread”. Worst Caesar salad ever!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMmRVSlRSbFZWVGt0WFF6ZDNhMll3TjBadWVIYxAB",
            "text": "Terrible service unprofessional. When my food was burnt, I told the waiter and they replied to me. There was nothing they could do. I'm making this review because I don't want others to fall into the same trap that I did this place used to be good i came here with my wife and was terribly let down. We didn't realize that you could even burn a salad."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUFpGVk1kV1pRYld4cE5YVTRUMVp0ZEVKNmIzYxAB",
            "text": "While visiting my great Aunt, we had the best experience here. The food was fast and phenomenal, and the details were there! My Aunt ordered a cesar salad, that she ended up being too full to eat, and asked to have it wrapped. Our server, Frankie, had a brand new salad with the dressing on the side made to go. We’ll be back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZlkyZ3RUVzVDYm5CTlVGOUtPRGszUWxCa1ZXYxAB",
            "text": "Went there for a after funeral event. Staff was amazing as was the food"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKR1NsSmEzcU1UcWVBEAE",
            "text": "Delicious authentic Italian food, clams oreganato, liver and onions, calamari, fried meatballs, chicken piccata all scrumptious"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZlRIVlRObXBwZWpWV1MxOUVTSEpaWVMxVVZYYxAB",
            "text": "I like quietness when at the table end that is a perfect spat"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWGQwVnpPRGxKTjNKR2MwNDViamR1ZG05Uk0zYxAB",
            "text": "Truly a five-star business through and through"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV1EzZmU4LXVueUJREAE",
            "text": "Excellent Italian food and great service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS0xuOWZBOU9ETHhRRRAB",
            "text": "The food is very good. I have ordered take out only."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbW51c21MN3JlRkxREAE",
            "text": "We had an AMAZING experience. The food was amazing as was the service. Great dessert. Many menu options. Authentic Italian. The ambience could be improved with candles on the table and much dimmer lights, but this is only a suggestion because we loved the place so much and want to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNTEU3cC0zdVpXOS1BRRAB",
            "text": "Food was very good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ0V5TV9KeWJDNnJ3RRAB",
            "text": "They are a good person"
        },
        {
            "date": "6달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdllTR09nEAE",
            "text": "Delicioso!Delicious!!  Bravo!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTU3b2VnEAE",
            "text": "The food is excellent there. I had the veal chop with hot cherry peppers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNnVqdDZ3RRAB",
            "text": "Had one of the best experiences here a few weeks ago. The servers were all amazing and so attentive. They made the whole experience amazing"
        },
        {
            "date": "8달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXItRnR3RRAB",
            "text": "週日下午非餐點來用餐，店內還有不少組客人。餐點種類還算豐富，大致有開胃菜、義大利麵、雞肉、紅肉和海鮮，另外還有酒水及另一個特殊菜單。\n點完餐後先送上麵包，一共有兩種還附上奶油，麵包雖然不是熱的但吃得出簡單的美味。\n點了章魚沙拉和兩種義大利麵，餐點份量還不錯吃完蠻飽的，口味偏重同樣餐點吃到後來會有點膩，可以跟同伴分享會比較好。"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBci1la0hBEAE",
            "text": "El mejor chocolete martini"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNjdhTi1nRRAB",
            "text": "Nice place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNGI3N0dREAE",
            "text": "Everything was great!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNXJIc1FnEAE",
            "text": "If only I had the opportunity to rate the delicious smelling food!\nAnd service of the waiters…\n\nApparently our OpenTable reservation was not good enough to be seated.\nEspecially since there were reservations made in advance (earlier in the week) per host… why would that matter?\nA reservation is a reservation isn’t it?!\n\nAnyhow, my party of 3 walked in and was greeted relatively nicely and then things went a little sour… we were told we would be seated in about 15 minutes or so (once a table became available).\nHowever we watched about 2 parties of 4 be seated before us (that were not there waiting before us).\nWelp over 15 minutes after our arrival, we still weren’t seated and walked right out.\n\nAmbiance was nice tho.\nGood Luck and Enjoy!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNnJmRS1BRRAB",
            "text": "Enzo's of Williamsbridge is a hidden gem in the Bronx that combines elegance with exceptional service. Despite the restaurant often being busy, the staff manages to deliver a top-notch dining experience, making you feel attended to without feeling rushed. The ambiance strikes a perfect balance between refined and welcoming, offering a cozy yet upscale atmosphere that invites guests to relax and enjoy their meal.\n\nThe food is where Enzo's truly shines. The double-cut pork chop was absolutely remarkable—juicy, perfectly cooked, and topped with a delightful cherry pepper sauce that added a bold, savory kick without overpowering the meat. It's clear they take their time with each dish to bring out the best in the flavors.\n\nEqually impressive was the veal chop with vodka sauce. The veal was tender, juicy, and the vodka sauce was rich and indulgent, creating a satisfying harmony of flavors. Both dishes were expertly prepared, showcasing the kitchen's commitment to quality ingredients and classic Italian cooking with a modern twist.\n\nAll in all, Enzo's of Williamsbridge provides a dining experience that’s hard to beat, with incredible food, attentive service, and an elegant yet comfortable atmosphere. Whether you're a local or just visiting, it’s a must-try for anyone seeking delicious Italian cuisine in the Bronx."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bTRXb29BRRAB",
            "text": "The service was very poor. Last to be served and last to eat . When the owner asked what was wrong he tells me it’s Christmas holiday and busy . I even had to get up and get a glass of water from the bar because my waiter never came back . I think it’s horrible the business owner doesn’t even care  about his customers and says that he made a table leave to seat us despite having reservation . They need serious improvement on customer service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LWUyeHZnRRAB",
            "text": "This was the authentic New York food experience we hoped for."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2enNtSWZREAE",
            "text": "one of the best veal cutletparmesan in the Bronx.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMkpuMUlnEAE",
            "text": "I grew up down the street from Enzos.\nThen, one day, we moved away and it was sad. But we always come back because the food is awesome.  Their Polpo (octopus) is the best anywhere. Don't pass this place up."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQODl2THJnRRAB",
            "text": "The Italian food here is really good and authentic. The waiters and staff are super friendly and attentive. The cocktails are also delicious. It's a classic spot in Williambridge."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMXY2dmVREAE",
            "text": "Lunch will cost $60/person even if the appetizers and desserts are shared in the group. The price is steep. They always charge more than the menu price. Of course the explanation for extra charge is because of the sauce. The taste is okay but still, not worth the price. Not recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzejVLc1FBEAE",
            "text": "Great food, ambience, and service. The double cut pork chop was awesome!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOHUyLWhnRRAB",
            "text": "This was a truly fabulous dining experience.  A few of us old friends got together for lunch.  As I entered the restaurant I could smell the fragrant aroma.  The food was exquisite, the service excellent and the ambiance was wonderful.  The lunch menu is very well priced and we enjoyed a delicious meal.  I couldn’t recommend a better Italian restaurant.  Thank you Enzo’s."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOGN2alFREAE",
            "text": "Margherita"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud2FYUktnEAE",
            "text": "Made reservations 4 days in advance, we walked in 5:50 reservation was 6pm, there were 3 tables available and he sat us right in front next to waiter's station. I asked if we could sit at table in the back and was told they were reserved. I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuenE2VmJBEAE",
            "text": "By far the best meal of my whole life. Highly recommend the Caesar salad and Dijon salmon. I also tried of a bit of the baked gnocchi which was fantastic. Can’t wait to go back and try more items off the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbDRDeXp3RRAB",
            "text": "What a lovely place in the Bronx! We were visiting Bronx and Enzo’s was a recommendation from close friends. We stumbled in from the cold rain and wind and were warmly welcome, seated immediately and promptly served. Food was fabulous with generous serving sizes. We had calamari, 2x salads, 3 entrees, 2 lattes and 1 dessert. Price was a bit high with all of this for north of $150. But to be fair, the four of us could have ordered 1 less salad and 1 less entree as we had left over meals. Overall - Well done and a superb choice if you are in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cGM2LXBBRRAB",
            "text": "Nice Italian restaurant with made-to-order fresh food.  Terrific flavors are apparent in all their dishes.  The fish dishes and the pastas are all worth trying.  Nice wine list to compliment the food as well!  The staff is very friendly and accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbE0zblRREAE",
            "text": "Enzo’s restaurant in Williamsbridge is a stunning establishment. The staff is exceptionally efficient and welcoming, ensuring a delightful dining experience. The wide array of food options available is impressive, catering to diverse tastes. Moreover, the prices are reasonable, making it an ideal choice for family gatherings."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURCOEo4WBAB",
            "text": "bel personale. incredibile manu e incredibile cibo delizioso. il ristorante è ben progettato per far sentire i clienti a proprio agio e accoglienti. amo questo posto. Lo consiglio al 100%"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbThTUHF3RRAB",
            "text": "It was my second time at Enzo’s and once again it was a great experience.  Our waiter was excellent.  The food was delicious and the prices are reasonable.  I highly recommend you go eat at Enzo’s you will not be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MU1HdENBEAE",
            "text": "I can’t remember the last time I had such delicious chicken Francese. So why not 5 stars? The side veggies left something to be desired: more broccoli stalk than floret, too many carrots vs string beans and “two” few slices of sautéed garlic. Also, the iced tea has a strange taste. Chef needs to pay more attention to details."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHM2VHZDRRRRAB",
            "text": "As I entered Enzo's, I was welcomed by a family atmosphere: wooden window frames, wine bottles on the back wall, and family tables set up. It was early dinner time - I arrived at 5:40; I observed families and some couples already sitting and enjoying. After a vaccination check, I made it into one of the indoor tables. Immediately, a basket of fresh bread, butter, salt, pepper and olive oil was setup, and water served.  I went for the Baked Polenta for appetizer, their Classic Gin Negroni for a drink, and their Chicken Sorrentino for the main dish. I confirmed I am definitely not a fan of gin - I did not like the cocktail, although I did appreciate the mix of flavors despite my distaste. The Baked Polenta was definitely the star of dinner overall: soft, creamy and delicious - the contrast of the Polenta and bean textures plus the cheese and tomato on the sauce were a tasty combination. The Chicken Sorrentino was delicious - the sauce was definitely what stood out in this dish; the chicken itself was not juicy, but the sauce makes up for it very well. As I finished the Sorrentino, I was unable to reject the waiter's American hospitality with an Italian twist: \"I'm sure you have space for dessert!\" I replied: \"Well, I will have to see the dessert menu.\" A minute later, he brought a big tray filled with dessert samples - no paper menu, just choose from the samples, and they will give you a fresh dessert. I went for the Torta Della Nonna, which is similar to a lemon pie; I added a coffee to wash it all off.  Admittedly, I'm not a fan of desserts, especially in US because of the big portions - despite that, the Torta wasn't bad: the lemon filling was a bit light, while the sweetness stood out on the crust.  The coffee was just perfect, and a great way to finish this visit to Enzo's. As I left the restaurant, more tables were setup with many groups, mostly adult families - something nice to see, considering we are slowly leaving the pandemic crisis in NYC.\n\nOverall, great experience here: warm atmosphere, good portions, delicious Italian dishes, friendly hospitality. I would recommend Enzo's if you crave Italian and are particularly hungry, if you need a place for date night or a small family gathering."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbTYyc29BRRAB",
            "text": "Chicken parmigiana was DELICIOUS. This is the most authentic tasting Italian food. Table bread was delicious also. Baked gnocchi was very good too. We all enjoyed our meal. Also great place for dates"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LWJfMDFRRRAB",
            "text": "The place is really nice , food is delicious.\nBUT client’s are not supposed to call a server each time so they can take order or whatever they need, they need to pay attention. The proper way to treat a customer when they call you is not asking them “tell me” is disrespectful . Jorge was our server!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaElUa0JREAE",
            "text": "Exceptional food, amazing customer service and a beautifully clean atmosphere."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndWVYMnZnRRAB",
            "text": "Service was outstanding and the food was quite delicious! I've been spoiled ever since I visited Italy but I'd definitely rate this place as one of good Italian rests Ive tried in the US. I had Spaghetti Bolognese and it was good, the fried meatballs even better. The chocolate mousse was very very good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbmQ3SnZ3RRAB",
            "text": "Great place! The best meatball and polenta I’ve ever tasted. Friendly staff went out of their way to accommodate our needs. We will be repeat customers!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdjdtUlZREAE",
            "text": "Great times, amazing classic Italian cuisine! Awesome service, you are so taken care of here! Large groups no problems! Your gonna love it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3BMRkdnEAE",
            "text": "When you walk-in you are greeted with a server & they seat you immediately. The service was phenomenal and so was the food! I come here once a month and the food is always good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGX18zYVFREAE",
            "text": "Really good handmade pasta in classic dishes.  The porkchop was ENORMOUS! Tiramisu was light and delicious .  It's a keeper. Our waiter Frankie is the best!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeWN5WjZRRRAB",
            "text": "The food was average and the drink were regular soft drinks. I had a Jack and coke. I told the waiter that I want another drink but I wanted a real drink not the soda he served me. He insured me he will make or have a better drink for me.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNNGVqSC13RRAB",
            "text": "I absolutely LOVE Enzos if Williamsbridge and the one I Little Italy as well. They are so welcoming and friendly then service is always A1. J will always return again and again the dessert menu has expanded and becomes better the choco.miusse cheesecake was outstanding"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlalktYUVBEAE",
            "text": "I had the chicken Parmigian the sauce was watery from a can not home made the baked clams were not baked all the way thru still raw bur the service was great"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwME9iR3Z3RRAB",
            "text": "Great delicious food every thing I order taste great."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbnEtVHVnRRAB",
            "text": "Had our 40th grammar school reunion here! Great food, a little pricey but totally worth it!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3azZqMzdnRRAB",
            "text": "Nice spot the food was decent the service wasn't great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeExtN1NnEAE",
            "text": "Our annual memorial/holiday dinner was a big success at this Italian restaurant. We greatly enjoyed the traditional food and desserts. The service was also very attentive and accommodating. All 26 attendees were happy with the experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUemFHT2xnRRAB",
            "text": "Food was shockingly very bad.  I thought it would be so good.  Chicken was salty.  Shrimp was rubbery. Veal was burned. Meatballs were burned.  Mozzarella Calabrese tomatoes were so cold and hard.  Penn ala vodka was not cooked through. Such a shame as the meal was 285.00 for 3 people. Cannot recommend any  dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscnMya0ZBEAE",
            "text": "Enzo's never disappoints! I always come for the double cut porkchop, but there are so many other delicious menu options. Staff is always very friendly. The food takes a little while to come out, but I don't mind it. It just means they're making the food with love! A great place to go on a date or with the family/friends."
        }
    ],
    "reviews_count": 67
}