{
    "name": "Nick's",
    "place_id": "ChIJ6987v0vzwokR8WCCur-GzEM",
    "grid": "BX12",
    "address": "1356 E Gun Hill Rd, Bronx, NY 10469, USA",
    "rating": 4.5,
    "user_ratings_total": 1468,
    "phone_number": "(718) 652-6500",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVJVTlZhRWcxUjFvMExYTkthV3RYZFhkWVVYYxAB",
            "text": "Best pizza spot i know💯💯 and good services as well and the employees always friendly❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMFFrRTBNbVZKUXpCc1VuTm1iRk5oT0ZoM1oxRRAB",
            "text": "Best Pizza Place in NYC"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdmN1Z0FnEAE",
            "text": "Good food and good service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NWVqbGxORlZTT0RWakxWVTBXR2d5WWxRelJHYxAB",
            "text": "Updating my review after a recent visit. I heard about the staffing adjustments they made and I must say the place is back to being the Pizza place in the Bronx. One of the few places I actually sit down to eat their delicious food. Kudos to the store."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFRFVTRlRkZPTmxjemExZE5iVFV5YjNCMVYyYxAB",
            "text": "The pizza shop staff was very polite and caring.  He knows the children in the community,  so he gives them wonderful advice.  The pizza was ok.  I had a vegetable slice that had peppers and spinach because that was the only vegetables they have."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndnZlaWF3EAE",
            "text": "Love nicks. Open late, awesome service great pizza."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205V2NrMW9iMTlsZUV0eFZuZGxlSGREUkVOV1JGRRAB",
            "text": "Ahhhh nicks .. yes the only restaurants to claim their pizza is made from ingredients instead of frozen. The flavor is horrible,(taste frozen) the sauce is unbearable , and the size is large for nothing . Wouldn’t you want to make good pizza that big anyways? Also why is their employees always drunk, because plenty of times I went in there I smelled alcohol on their breath. Would I ever eat this pizza again ? No.\nWould I recommend this place? Not even if it was the last place on earth for food ."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcVl2QUF3EAE",
            "text": "The pizza nowhere near that good. Also they charge almost 6 dollars for a slice and they are RIGHT NEXT TO THE TRAIN STATION that gets a lot of people coming off it every single hour or so and pick up pizza before they go home. Also not to mention theyre open 24 hours right next to a train station and have 5 dollar slices.. the neighborhood is nowhere near a high class neighborhood. Most of the people in the neighborhood are just getting by. Those prices only make sense for a pizzeria in Manhattan here it makes no sense and gun hill road station is a popular station so they're basically robbing the neighborhood they claim to be serving...They make enough money and when I asked them why they charge so much one of the workers just told me to go somewhere else."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc1lPalhREAE",
            "text": "*9 years ago*Their pizza is hands down the best around in the Bronx. Just bring a fat wallet, you will be paying Manhattan prices here.\n\n*2025* I think they're no longer run by the same family that created this place. The pizza looks completely different and the cheese has a weird taste to it. They still try to do it in the Nick's style but with horrible ingredients. I ordered extra cheese and the pizza was not good. The cheese is cheap, it has a parmesan taste to it. Idk how else to put it it's just not Nick's anymore."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUU1uWnJiV04wY0Vvd2NXSXphR1ZDT1VGRVNtYxAB",
            "text": "Insane pizza. Insane vibes. The best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTWNraDVWVkJKYjBGRk5tWTVVMGxaVGpsMVkyYxAB",
            "text": "Not as good as years past but still good. Big cheesy slice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeFdFSldZWEZYY1c4d1QyazJUalp3Y3kwNWNsRRAB",
            "text": "GREAT SLICE! Have been coming here for 40+ years. Because of their proximity to the subway station you have a high likelihood of getting a fresh slice. Nothing fancy but great pizza!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveEt1RTNBRRAB",
            "text": "Local pizzeria jumbo slices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paM01GWkNhRGhtUVZWTVp6VkRNMVpxWVhCUVpIYxAB",
            "text": "Honestly best pizza I’ve had in the Bronx for a long time. A coworker raves about it so decided to give it a try. However most likely will not be back because the worker (who I see had many negative reviews) kept trying to flirt with me. It was just weird and not a pleasant experience at all. Do better with your staff Nicks pizza especially after so many customers have complained!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMFptSk1lR3BmY1VOeldWWTJOMUJqUjJ4d1owRRAB",
            "text": "Meat and cheese calzone is the best 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxclJHTlNXakppWTJaa05tcHFWM0kxYTBSaVpYYxAB",
            "text": "I just got a plain slice room Nick’s and was extremely disappointed. The pizza had zero flavor which is a shame because I’ve been coming here for over a decade & the pizza used to be delicious here. They must be under new management or have new workers because the pizza quality is not the same. I’ll be getting pizza from Prego’s instead."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVHA5YWkyaktLRTNRRRAB",
            "text": "Best pizza ever! Huge slices and very cheesy! The service is A+.. it's worth every penny!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX2RQaEJREAE",
            "text": "GREAY PIZZA! FIRST TIME HERE"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveHZhZ3hRRRAB",
            "text": "Still the best in the Bronx!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJckxTYVNREAE",
            "text": "Employee just finished using the rest room before he grabbed my beef patty out the oven with his bare hands. I told him I no longer wanted it bc of this and another employee thankfully remade a new one for me. However, I didn’t see either of them throw away the previous patty. Unhygienic ! Not only that but he continued to troll me after by trying to get my attention the second time around so I can see he grabbed it with the utensils."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcTlEQUZBEAE",
            "text": "The best pizza in the Bronx."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNFoyaHZnRRAB",
            "text": "Still a BX staple & Legend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMkptVFJBEAE",
            "text": "Top 3 best pizza in the city"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a3E2dmVREAE",
            "text": "Old school and Delicious!!!😋😋😋😋…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bzRhUFh3EAE",
            "text": "I love the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NFl2aWlRRRAB",
            "text": "The best pizza!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM2VMZFdREAE",
            "text": "These old places need to get updated and serve fresher food ....pizza never makes my stomach hurt like a pin in my stomach and had to run to the bathroom....I had a feeling since it just opened and already had pizza out nowhere ...maybe I ate pizza they had from the night before"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHRtRXlnRRAB",
            "text": "Nice 👍🏼"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBN1B6MTNRRRAB",
            "text": "Been going here since a kid never disappointed"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa3J6WHBBRRAB",
            "text": "The fresh and hot pepperoni roll was delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNXJhb1ZnEAE",
            "text": "Pizza used to be much better....idk wat happened and the cheese calzone was so dry"
        },
        {
            "date": "10달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGQtXzNBRRAB",
            "text": "Tolle Pizza wie eine echte italienische Pizza sein sollte. Richtiger Käse und tolle Tomatensauce. Auch der Teig wirkte selbstgemacht. Wir hatten jeder 1 Stück Slice was einer halben Pizza in Deutschland normalerweise entsprechen würde zu je 4,50 $. Sehr zu empfehlen der Weg lohnt sich auf jeden Fall. Ist auch gut mit der Subway erreichbar."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeWNmQ2JREAE",
            "text": "Used to be good,  now it isn't!!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM09DZ253RRAB",
            "text": "Best pizza in the bronx"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMHU3T1JnEAE",
            "text": "I call this pizza spot the Sleepy Pizza cause the slices are so thick lol no diddy.!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeG91OHRBRRAB",
            "text": "Excellent Sicilian pizza. The guys working the counter were terrific."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOWNyLUtREAE",
            "text": "Food is great here. Cash only, atm inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc3U2ektREAE",
            "text": "It’s quite disappointing to post this review as I have frequented Nick’s for over two decades. More recently, the quality has been inconsistent. Today, I called for a small pie, and when I arrived, the man who took my order quickly string tied the pizza before I could see the pie or add any toppings. Once I made it over to visit family, I knew why. The pizza was overcooked. It also tasted quite stale. My brother and I consumed 1-2 bites of a slice, but it was unbearable.\n\nI called the establishment and was told to come back. When I arrived, there was another pie waiting for me, which was nice; however, once I arrived back with family, it was clear that the second pizza was worst than the first. There was barely any tomato sauce and the cheese was of poor quality. I attempted to call back, this time, only to express my disappointment; however, no one will answer the phone the phone this time. I am more frustrated by how much time was wasted. I don’t get to see my family often, and this ate up a good chunk of our time together. Do better, Nick’s."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueTY3WUN3EAE",
            "text": "Good Customer service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRekl2UzRBRRAB",
            "text": "Been eating this pizza since I was in kindergarten. Never fails..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuekt6eC1nRRAB",
            "text": "Nicks pizza is the tasty, savvy pizza. I used to go there when I was pregnant with my daughter. Today my daughter Amy is 41. I never missed a day after I came from work. They are polite, attentive; the pizza and foods are excellent. I was there  15-20 years ago. Still living them. See you soon guys🥰…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb292Rlh3EAE",
            "text": "Pizza was fresh & hot."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcXQ3bEhREAE",
            "text": "This is the best pizza in the bronx,nick does not use cheap cheese,my friends and I have been going here for over 50 years now,the only thing changed is it was only two tables then,now it's six but the place and food are beautiful,thank you nick."
        },
        {
            "date": "1년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NGV2a09REAE",
            "text": "جميل"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibjQ3eFFnEAE",
            "text": "Great pizza ......im glad it's still there ......over 15th years going there .....I strongly recommend this place.....thats if u want really good pizza"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdW9IQWxBRRAB",
            "text": "I give this place five stars only because there's a place that I grew up eating in and of course the pizzas are good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidDZybnJ3RRAB",
            "text": "I have been visiting the pizza shop since I was knee high to a cricket. The pizza the food, the atmosphere , the service is excellent. I sometimes get a slice with extra cheese and mushrooms. Delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydzdDWkdnEAE",
            "text": "Solid pizza. I had a regular cheese slice. More cheese than sauce, I prefer a more even ratio. It’s right off the train which is convenient but the store could use a good wash. It’s $4.50 a slice, they make the price very clear. It’s a BIG slice. The price isn’t an issue for me but I can see how that might bug some people."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscUxQQUF3EAE",
            "text": "저렴하면서.. 아주 맛있어요."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjUzN1dnEAE",
            "text": "When I first saw 4.50 per slice I thought that’s a bit pricey but the pizza was thick and very filling.  Reminds me of pizzerias from my younger days.  The sauce and cheese were tasty and the staff was super friendly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0clAtOFdnEAE",
            "text": "Best pizza in the land. I feel cheated my whole life. If you love new york  pizza this is your place. I live in Washington state and I'm dreaming of going back just for that pizza!!! I tried others but this pizza is beyond delicious"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbVp1WDZRRRAB",
            "text": "Woke up in the morning after having a few bevs and in dire need of some greasy food. We were heading for a long day in Manhattan and before getting our subway (which ended up having no southbound trains but that a different story) we saw…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcjdfUk93EAE",
            "text": "My first visit was in 1999, my next visit was in 2022. Service is the same, restaurant looks the same and the pizza is just as delicious as it’s ever been. You’ll never had to ask for double toppings because double is basically the size of their normal sized toppings.\n\nI honestly believe this is the best pizza place in the country because they load toppings and the toppings are delicious and the slice sizes are humongous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcTZ1blNBEAE",
            "text": "Excellent pizza... strong appetite pleaser."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNFlTSTdnRRAB",
            "text": "$4.50 slice and square. $1.50 extra Tops.  quite big slice of delicious cheese and crust dough tasty. good chewable.  enough big slice size is equal to 2 slices. $4.50 is acceptable"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydFBESThnRRAB",
            "text": "Some of the best pizza in the Bronx. The slices are huge and very filling. Next time going to try the Sicilian slice as they looked good too. Just make sure you bring cash but if you don't they do have an ATM it is a little pricey but you get what you pay for."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dzRpdmRnEAE",
            "text": "I grew up in the Bronx and Nick's was my favorite pizza shop!  I left NY in 99 and I went to Nick's in 2019 and again in July of 22 and it tastes exactly the same!  Nick's please open up another location in Charlotte, NC. PLENTY of NYers here who would love a taste of home!  PS - truck in the water from NY. 🥰"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2N3BTQjN3RRAB",
            "text": "Best pizza in the Bronx!! Never disappoints. Plus, their open on the late night."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3Nl9DRkR3EAE",
            "text": "It is a small place in the Bronx neighborhood, but the flavor is big and the service was really good. I had two slices of bacon and garlic which I love and my wife had a slice of pepperoni. The slices are huge and one should be plenty for a regular size guy. Go over there and enjoy a big slice of one of my favorites NY pizza."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aGNLNDZnRRAB",
            "text": "Best Sicilian Pizza in the area! I first fell in love with their Sicilian Cheese Pie! Lordt the crust, the cheese, THE SAUCE!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdkt5TGJnEAE",
            "text": "One of the best NY style pizza I've had in a long time. It was nostalgic"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bjZYOTNRRRAB",
            "text": "I love nicks pizza. The slices are huge and when you get crispy slice it’s so great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdkxxTnVRRRAB",
            "text": "Got the chicken Parm sandwich and it was amazing. Pizza is bomb AF too and staff is kind and chill. Highly recommend for a quick bite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxc2RDT3JnRRAB",
            "text": "It's been here 55 years for a reason. Some of the best pizza in NYC. Yeah, it's more expensive than most others, but when they serve you, you'll know why. The slice is 50% larger than any other place. And it's not just more dough. It's more PIZZA & more toppings with quality ingredients. They are very accustomed to being asked to cut these slices in half.\n\nThey also know how to move things along with fast & friendly service. I think that's why they don't work with any of the food delivery services. It would throw a monkey wrench into the gears. A a true neighborhood spot that's also a NYC gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOElTaGt3RRAB",
            "text": "Pizza was great! Atmosphere ok. Would have given 5 for service, but they dont accept cards so that was very inconvenient especially since not too many people carry cash these days. Gluten-free would have been awesome too+"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMVl1eWJ3EAE",
            "text": "I go out of my way for this pizza. Here is a pic.  Aw shoot ! I noticed i forgot the crushed pepper. Try it! Speak of it and you will be surprised how many people you will meet who also jnow of it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemU2ZE5nEAE",
            "text": "I've been going to Nicks Pizza for over 20 years...since I was a kid, and the pizza has always been top-notch. In 2023, I will say their prices are little outrageous however, the quality is worth the steep price tag. They have large slices and the flavor is great. I no longer live in NY but Nicks will always be my go-to pizza shop when I'm in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcGVudWVREAE",
            "text": "This place sucks <3. I watched the Pizza guy- possibly even Nick himself- rip off a piece of my crust, eat it, then take the pizza off the pan- WITH THE SAME BARE HANDS THAT HE JUST ATE WITH- and throw it in the box. Absolutely disgusting... this used to be an establishment. Idk what's going on now- AND TO MAKE THINGS WORSE, the pizza was floppy and had waayyy too much cheese. Overall terrible, giving tourist cash-grab, yeah that's never happening again. Anyway, ya'll go check out Three Boys or Pregos. DO NOT put this bile into your body."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcGVINFZnEAE",
            "text": "I first went to Nicks about 2 years ago at 1:30am and the pizza was really good. I passed by today and stopped in for 2 slices. Definitely not what it was 2 years ago. The slice was very heavy, thick, and not very flavorful. At $4.50 a slice I will not be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMFlEbGF3EAE",
            "text": "Nicks is AMAZING and one of the Best NYC Pizza stores. I started eating their pizza in my teens, watching all the family working hard to please customers and making pizza that is thick with a great crust, and excellent toppings of choice.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcHRmRzdRRRAB",
            "text": "literally sitting here eating my slice now. I’ve been coming here since I was a child and needed a slice before driving back home. I’ve gone to live in other places and no other pizza compares. $4.50 is wild, but honestly I’m gonna buy it everytime. Just make sure you have cash when you get here. They do have an ATM though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdGEtTHVBRRAB",
            "text": "I love this pizzaria! I just wish there was a way I could move it closer to me. Unfortunately they won't deliver to Pelham Bay 😢😢😢😢😢 I first discovered Nick's in 2004 on a first date with my ex. The slices were huge and delicious. Whenever I get the chance I go here."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOEpfNi1nRRAB",
            "text": "Not as big as other jumbo slices, but that's okay. Seems they used about the same amount of ingredients, so the slice is a little bit smaller but the cheese and sauce and crust are thicker. In fact, there's so much cheese it more closely resembles a grilled cheese sandwich. I would prefer they cut back on the cheese and drop the price from $4 to $3.75.\nCrust flavor is mediocre at best . Only a slight hint of flavor. (guys, get a better flour, or season the dough up some, or brush it with garlic oil or something).\nSauce flavor was good but not exceptional, cheese flavor was....plain mozzarella. I think $4 is overpriced.\nA decent slice, but nothing I would want to gorge on."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaHJTLWhnRRAB",
            "text": "I grew up eating their pizza and it is amazing. However, the last time I was there visiting family I saw visible roaches crawling along the counter and floor. I was so disappointed in the sighting because I look forward to eating there every time I am there. Please kill the roaches and find the nest because there is food items out and this is unsanitary."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dGRXRzZnRRAB",
            "text": "Nicks is a top notch pizza place that has been in the Bronx since the 50s. It is the best, authentic New York style pizza, served by a friendly staff who seem to know everyone in the neighborhood. The owner, Nick, is from Naples, Italy and his nephew runs the counter. My son and I stayed in the area on a visit from Indiana to see the Yankees play. Nicks was our favorite spot and we took a large cheese on the 13 hour drive back home to share with the rest of our family. Well worth multiple visits."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNd052ZnR3RRAB",
            "text": "Absolutely love this place. My cravings for pizza always include Nick's! If you want great NY style pizza, you must visit Nick's. What's even better is, they have really late hours. I am definitely guilty of 2 am fixes😉…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcVBldE93EAE",
            "text": "Nah this chuck e . Cheese on a tuesday hit different . We had a time in the place . My baby turn 4 and it feel ao stressfree and all the kids had a blast . The african american girl with green shirt yesterday was so patient with me & my sister trying to find coupons.  She wont even understand how amazing she was . Just coming over to check on us to make sure were ok . And baby can we talk bout how fanastic the pizza is in chuckie now 10 out of 10 with those bone in wing [ jesus ] . Ill definitely returning back to gunhill for another playdate ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPZzR2ZnJRRRAB",
            "text": "Nick's pizza is out of this world delicious. It's everything you would expect from a slice of pizza. The place is clean and the staff treats each customer like they want them to return. The slices went up to $4.50 but it's still worth it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMTlLb2ZBEAE",
            "text": "After driving to NY from down south we could hardly wait for a good ole slice of pizza! Our cousin brought us to Nick's since it was after 1:30 in the morning when we got here. It was our first time and we are so glad she brought us here!…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNjZtTENBEAE",
            "text": "In town visiting,  the pizza was great, only complaint, they're are cash only😏, would i visit again YES!!!!…"
        }
    ],
    "reviews_count": 80
}