{
    "name": "Michaelangelos Wood Fired Pizza & Pasta",
    "place_id": "ChIJ-fm5aSrzwokRruHuJjLj8qM",
    "grid": "BX12",
    "address": "2107 Williamsbridge Rd, Bronx, NY 10461, USA",
    "rating": 4.5,
    "user_ratings_total": 148,
    "phone_number": "(347) 281-4537",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbmNqQlhla1pqV2xKYU5WaFlhRVJTVFdKTVNtYxAB",
            "text": "The service was terrific but I got really sick after dining in last night. As soon as I got home I threw up profusely. I don’t know what happened but I’m genuinely concerned. The owner and staff were great but their food has something wrong with it. Hopefully you have a better experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdlkxcHFVRFpMYkZsSFNETk9RbWxCTTB0d1kzYxAB",
            "text": "Nice set up here with both indoor and outdoor seating. They have a pizza oven in the back that is slanging some good stuff out. The pizza michaelango was pretty good. It had albanian sausage on it. It was a little oily for my liking but still good. The regular pizza was also good. They do a nice job with the crust here. The burrata to start was just ok so would probably just stick with pizza next time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelFreDVjRFkyVG1acFZYbElkRGxoUWpoNlQxRRAB",
            "text": "We dined in for lunch and the experience was terrible, seems like there is a new staff\nWe had the pizza and veal parm\nBoth were bland and had no flavor\nThe music was too loud\nAnd a long wait"
        },
        {
            "date": "2달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVlR5MXdURWgyUkU1dlkwTlBjMTlvUjBWWVdsRRAB",
            "text": "在Grubhub上點了一個瑪格麗特披薩$13，大約十分鐘就做好了，又快又好吃而且很大一片很划算"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMldGaHBPRlZaYzA0NVFWTXhYMWw1YjJGcFYwRRAB",
            "text": "Service was quick on a Sunday. Drinks were good, Vodka pizza hit the spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTGFEUlpRamxHVlhCZmFuaFJSMUpxYTNSRVpGRRAB",
            "text": "Second time eating here and the food was very good both times. Our table enjoyed appetizers, Italian dishes and the Albanian grilled chicken with roasted potatoes and sautéed vegetables (picture). Very good espresso and Sambuca. Our waiter was attentive and friendly. Music and atmosphere were upbeat and enjoyable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVHU0THEwcGVPUDFRRRAB",
            "text": "If you want a good pizza with your family or friends or in general a good wood fire pizza then this place is good. Mushroom pizza or just cheese pizza well done is on the spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdmV3SXZLdWYtWUVREAE",
            "text": "My server was perfect! Great customer service , food was fresh and made with love! First time here and I loved it !! Wonderful service , Anna"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRE9pWXlFdzlMb0J3EAE",
            "text": "A++ Pizza, Customer is Amazing, Pizza has Great taste\nThank You."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3RLR1hnEAE",
            "text": "Amazing food. The service was great and friendly. Highly recommend it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdGJXVlZBEAE",
            "text": "Delicious food, friendly staff beautiful setup! Definitely going back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeU5hUzJBRRAB",
            "text": "The extra ginger ale was perfect! I'll revise this soon but because I believe they deserve a much better review. But as always I must do my due diligence. 😊…"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaFl5YWJREAE",
            "text": "Updating comment ordered Magherita pizza at home delivery was fast, thin crust, small pie, good presentation and very delicious. Thumbs up 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MXVMRk1BEAE",
            "text": "I overall think the food tasted pretty good. However my mom and I have been throwing up on and off since my visit here. Idk what I ate that messed with my stomach. It is now Tuesday and I have had food poisoning since Saturday. Not recommended. Their service was really good and the owner is super sweet. Its a shame that I won't be coming back due to the food not agreeing with me or my mom."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LU55SWh3RRAB",
            "text": "Me girlfriend and I are regulars here seeing as we live in the area but yesterday 03/15/25 was my grandmas birthday and we decided to have dinner here. Needless to say it was amazing! The staff was great to us and the food was amazing they made her birthday so amazing and the rest of my family had a great time together. If you’re considering trying this place definitely do it! The prices are good and the food is amazing the portion sizes are huge also."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReDZ2bVNnEAE",
            "text": "I don't know how this place has more than 2 stars. Literally the pizza is tiny for the price. It's like getting half a pizza for full price. The garlic knots are hard as a rock and taste like absolutely nothing. They def forgot the garlic. I literally wasted my $."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb05tVDR3RRAB",
            "text": "Nice atmosphere, good wings friendly staff"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDdMYTVRRRAB",
            "text": "Food is always delicious, the service is top notch and it's always a friendly atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnd19fTExBEAE",
            "text": "Very beautiful family friendly"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbklhSXpRRRAB",
            "text": "This place is a fantastic choice whether you’re dining with family, friends, or enjoying a solo date. I went with my family for dinner today, and despite how busy it was, the team went above and beyond to make sure everyone was well taken care of. It was truly impressive to see them working so efficiently and with such dedication to ensure a great dining experience for all. The food was absolutely delicious, and the atmosphere made the evening even more enjoyable. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdjlLTHJBRRAB",
            "text": "We have been meaning to make it here for dinner and tonight we finally did. I’m sad we haven’t come sooner. This may be the best calamari I’ve ever had in my life, clams and bread top notch. Pizzas are amazing and pastas, fish, service is all amazing. Can’t wait to come back and try more menu items!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcHV6NUd3EAE",
            "text": "From all the penne ala vodka i've had this was by far the worst. I ordered online so I didn't dine in. The pasta had no seasoning whatsoever and the sauce tasted like nothing!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBallLYjdBRRAB",
            "text": "They are very genuine people. They have got amazing chefs and the best service. I have ordered different things from the menu and was never disappointed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODZmY2xnRRAB",
            "text": "First time in this place. For a place that was empty no one to greet you to take a seat. Service was slow. Food took a long time and they ran out of veal. Not sure about going back.  Was an ok experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdE1iRDZBRRAB",
            "text": "The worst 12 inch brick oven pizza in the bronx 2025 i ever ate.! You Need to add flavor to your pizza"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOGNYQS1BRRAB",
            "text": "I stop by on Sundays lately to pick my dad up something special to eat, he loves the food! Thanknyou for making my dad happy!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaElYdTVnRRAB",
            "text": "This is a beautiful place to enjoy with friends and family. All the members of the staff of the restaurant are extremely friendly and professional. I feel at home every time I visit this restaurant.\nI recommend everyone to visit it and check out the variety of typical food dishes. It's nice to know that someone listens to you when you don't like something or they simply missed something in season. Chef Alex is great and He is very receptive to suggestions, He is customer oriented and if you don't like something they will change it to accommodate you. The exquisite food served in this restaurant is of the highest quality. Come and check it out. You won't regret it.\n1.- location 10\n2.- cleaning 10\n3.- Staff professionalism 10\n4.- Delivery 10\n5.-food 10\nOverall Satisfaction 10/10\nThank you all for always making us feel at home."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxM091OF9BRRAB",
            "text": "New Family owned Italian, Albanian restaurant. Very Clean, classy, but comfortable atmosphere. You are greeted with a smile as soon as you walk in, you can sit at the bar, a table, or a booth un the back. Amazing woodfired pizza with plenty of pizza options, great happy hour if you sit at the bar. They just added a great selection of IPA and other beers, ice cold and fresh on Tap. A lot of beers on draft to choose from, they also have a very nice wine selection to pair with your food.\nFood is fresh and tasty, the fried calamari some of the best I ever had. The grilled Salmon is Amazing, as well as the steak.\nThis week I tried the grilled combo Platter, a lot of assorted meats, comes with a salad and roasted potatoes. If your hungry this will do, and if you can't finish it you will have left over for lunch the next day. Very generous portions. Also had the chicken Parmigiano with pasta. Delicious!!\nThe service is great, warm and friendly and if you sit at the bar, the bartenders make some great cocktail..\nGreat New establishment, right in the heart of morris park. Definitely give it a try. You won't be disappointed. I definitely wasnt."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N3J5cGhBRRAB",
            "text": "I was interested in attending this place so I called and the woman who answered the phone was very unenthusiastic, rude and not welcoming at all. This was my first interaction with the restaurant and that call certainly gave me a first impression, disappointing because online it looks great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQXzdQbFhnEAE",
            "text": "Margherita pie was 4 slices for 3 individuals - that needed to be reheated, burrata was overpriced considering little ingredients used. The order also contained mozzarella sticks. This was the most disappointing first impression for a $77 dinner. I ended up placing a separate order from a different restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdzZ6cDZBRRAB",
            "text": "I love this Place in the Bronx, great service great pizza."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMkxLSElBEAE",
            "text": "It feels so bad to pay over $30 (including tip) for a medium-sized pizza to-go, only to end up throwing it away at home because of the terrible taste. The customer service was good, but I wouldn’t recommend the pizza."
        },
        {
            "date": "11달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeGRqelJREAE",
            "text": "Accueil très sympa 👍le repas un humm du bonheur pour les papilles 😉je conseil à 100%."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzM3ZuaGp3RRAB",
            "text": "I ordered wings and pasta today and im so mad I’ve never ordered from here before😭It’s so goooddddd 😩it looks so clean too and got my food very fast !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNHFDVVJ3EAE",
            "text": "It was an accident we ended up here but I've not had a more gracious and attentive service and food that satisfied everyone (including the 4 year old and 11 year old with us). Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcVlyeTd3RRAB",
            "text": "I highly recommend this restaurant! Food is delicious, service is outstanding, and management is wonderful to work with! The owner, Simon, and management, Lela, were so great in helping me plan a luncheon for a group of 20 family and friends after my son’s baptism yesterday. All of my guests loved the food, service and ambience and plan to return on their own as well! 10 out of 10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbk82MWZ3EAE",
            "text": "Nick is amazing, he made us feel very welcomed and pleased! Food is amazing, drinks are even better. We will for sure continue visiting. Amazing place to visit in the bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbUxpaVV3EAE",
            "text": "We love everything!!!👍👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbUppX3RnRRAB",
            "text": "Great food and the owners came out to ask us how we liked the food. Great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbDRyNEpREAE",
            "text": "My husband and I happened to be in the area and chose this restaurant for an impromptu dinner. Service was attentive and friendly. Food was good and the portions were large enough to take some home. Restaurant was beautiful and clean. We enjoyed our experience here and would visit again if in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNThLZlVBEAE",
            "text": "Great long iland iceteas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTR1OVVREAE",
            "text": "Food was excellent and also the service.  Has a great happy hour and drinks were delicious.  Will definitely return and recommend to anyone looking for great dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuODdiMUl3EAE",
            "text": "I don't know what was better, if you have the experience, the food or the service. The dessert was excellent.\neverything was exquisite, Thank you Anna and Nick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc2NqU1BREAE",
            "text": "Food was super wack!!! I ordered chicken Frances and ask for mozzarella cheese over my chicken and the waitress stated she didn't know if they could do that... Like huhhhhh I'm the one paying I should get it however I like!!! My dish came with steamed vegetables and pasta and everything was under cooked I couldn't even eat it!!!\nI also ordered a glass of wine which I can say was the only thing I enjoyed about my meal!!!\nThe waitress was not attentive at allllll and never even asked if I needed anything else or if I would like a refill after she passed by numerous of times and seen my glass empty!!!\nIf I could I would give this place 0 stars!!! Heck they lucky to even had got a $10 tip!!!\nDo not recommend..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb1lqeVF3EAE",
            "text": "Stopped in after recognizing place from their commercials running on BX 12. I will start by saying it’s 2024. Stop seeming surprised that you have patrons of color. You have a restaurant in the BX. Not Montana. It shouldn’t be startling. And if it wasn’t startle I witnessed then staff should really have a crash course in restaurant hospitality and business management. Green is the only color that matters. Businesses that don’t display this off the rip are going to stop getting my money. It’s beyond exhausting at this point. I am in your restaurant because I like to wine and dine. Period.\nThe service was fine after the weird start.\nThe pizza is good. My husband enjoyed his salmon. I didn’t enjoy my scampi. Weird flavor and presentation was meh. Both of our vegetables were laden in butter and seasoning. Couldn’t enjoy them for all the butter. Roasted potatoes had no flavor. Linguini in garlic and oil was cool. Tomato sauce on my husbands linguini was tasteless. My caesar salad was gross. Bitter with a dressing unlike any caesar I ever had…basic croutons. A caesar salad should not be a miss. I was so disappointed. I love Caesar salad with pizza and this was just bad. Nice portion but inedible for me. Sangria was good but presentation could be better. Some fruit, a different glass. It makes for the experience. Aesthetics rule.\nVery clean restaurant and staff presents well. Bathroom was very clean as too.\nOverall it was an experience that lacked charm and great food. Something I need when it comes to the dining experience. If I visit again, I will order pizza at the bar with a nice glass of red. Easily one of my favorite meals and they do make a very good margherita pie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dF9YRnZnRRAB",
            "text": "Overall, it was a mediocre experience. Food was not exceptional, especially when you considered the price.\n\nThe waitstaff put orders in without asking deeper questions, so I had to wait for food to be fixed. (Specificially: Ordered chicken franchese that came with either a side of pasta or salad asked for pasta thinking it would be with the same sauce instead recieved a side of fettuccine with marinara) not with the dish at all but a seperate bowl. I was not interested in mixing it with the chicken that it was meant to be with.\n\nWaitress seemed irritated when I was confused by it being pasta with marinara sauce but did fix it but didn't seem excited to do so.\n\nChoose the spot due to it being close to a friend's work and ranked highly. Would not choose to go back here again.\n\nAlso, I wanted to point out that it is not family-friendly. In my opinion, I do not understand why there was no kids' menu. Most times, Italian/pizza is a go-to for families. I had to pay $22 for my kid to have spaghetti and meatballs because that is what she wanted, and it was only listed as an adult entree option.\n\nVery beautiful space thou, open space very empty thou the day we went in which based on food and service makes sense."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid1l6QXBBRRAB",
            "text": "Went here for a quick bite after a session at Jenifer’s nail salon. It may have been due to the time of day but I found the reception staff somewhat dismissive. The waitress and her manager were accommodating and attentive though. The drinks were a bit water down so I only had 2. The food was on the better end, properly prepared and tasty. I found it strange that they ran out of 2 items on the menus but the restaurant was basically empty at the time. Overall it was an ok experience the pizza was amazing and the      grilled calamari was excellent. I would say this place is worth another visit in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ0tMUTRnRRAB",
            "text": "Food is fresh & delicious.   Service is friendly & very welcoming.  Have been there several times & always leave happy.  Blackberry margarita is 5 stars on its own.  Fried calamari is coated in a light, crisp batter and served with a tomato…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb0pPY3p3RRAB",
            "text": "😍 BEAUTIFUL PLACE 😍\nAND DELICIOUS FOOD 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNXU3aGRnEAE",
            "text": "Such a nice addition to the neighborhood! I’ve been dying to come here since they opened and I finally was able to a few days ago… Had a great time and had amazing food and incredible white sangria! I’m very excited to go back tonight for dinner! For two of us, we got 4 white sangrias total, a chicken parm plate (with side salad) and the ravioli plate and split both. Check was $92ish I believe before tip. Not bad at all for the quality and service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGZHU1V3EAE",
            "text": "Service and the atmosphere is great.  The service is very attention to you but the food more like the pizza is trash. My wife got the chicken Pasta and it was great. I got the pizza pepe, with meatballs as an extra topping. This pizza has one piece of cheese, raw onions and barely any sausages. End up ordering dessert and the dessert made up for the pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bzRUSWF3EAE",
            "text": "Huge portions - the margarita pie was tasty - heavy basil taste but delicious. Heavy salt on carrots and on broccoli, which had a piece of roasted garlic 🧄 so I enjoyed the flavoring there. The potato was bland. The eggplant Parm was bland sauce was good but no breading needed more salt or something. Heavy smoke flavor in  the room periodically I guess from oven. They seem nice and really personable.\n\nMixed feelings the pizza was enjoyed more than entrees."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScXVyMkVnEAE",
            "text": "New Spot on Williamsbridge Rd, it replaced the golden eagle dinner. They just opened and it is noticeable when you dine there. It’s a open concept pizzeria/ restaurant. Table of three , ordered cocktails, pizza, wings , and ribs. Waiter forgot part of the order and didn’t realize until one of us was sitting without food. Cocktails were honest. Pizza is good. Wings are ok . If you want alcohol and pizza under the same roof , check it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkN3BLS253RRAB",
            "text": "I recently had the pleasure of dining at Michaelangelo's Woods Fire Pizza, and I must say, it was an exceptional experience from start to finish. The atmosphere exudes warmth and coziness, making it the perfect spot for a relaxed evening. The customer service was impeccable; the staff were attentive, friendly, and truly went above and beyond to ensure our satisfaction. As for the food, it was nothing short of outstanding. Each bite of the wood-fired pizza was bursting with flavor, and you could tell that only the highest quality ingredients were used. Overall, Michaelangelo's Woods Fire Pizza exceeded my expectations in every way possible, and I cannot wait to return. Five stars all around!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NjhyOXpRRRAB",
            "text": "Food was great! Service was a little slow taking our order, but I feel that was to not rush the kitchen.  Food was amazing! Drinks were amazing!! A little pricey but Def recommend giving them a try."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeUlmYjN3RRAB",
            "text": "They just opened up and have been there twice already. Amazing service, beautiful ambience . We ordered margarita and pepe personal pizzas both delicious. Also tried the appetizers and the sangria was so good. We will be back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd3ZHVk9REAE",
            "text": "Came here for dinner and so happy we have a new spot for great food. We got the meatballs, chicken parm and penne vodka. It was all very delicious. The meatballs were the highlight, so soft and over a creamy polenta. Can’t wait to go back and try the pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdHJpcGJ3EAE",
            "text": "The food is delicious, and the place is very comfortable. I missed their famous brick oven pizza because the oven was not working."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabE5xTlhREAE",
            "text": "Food was delicious and nice portion sizes. I had the Romeo & Juliet drink! Very tasty.  The restaurant’s decor is clean and modern. Staff was pleasant. Definitely will go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aE43TFZ3EAE",
            "text": "The food was amazing. Nice & fresh hot out the kitchen. Staff very attentive. The owner came over checked on us to make sure everything was good he was very friendly and polite. Definitely a 10 out of 10 if it was an option.  Next time am in the Bx will grab a bite to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMVptUnF3RRAB",
            "text": "Had a terrific time with my wife , family & friends ! Love the place , the staff atmosphere food drinks service are excellent!! The owners are so friendly & make you feel special & appreciate you being there . I highly recommend the restaurant. Everything is great from the Pizza coconut shrimp pastas etc ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMDRxRkt3EAE",
            "text": "We’ve been meaning to stop by since it opened a few months ago.   We were not disappointed when we finally dropped in.   The place is clean, spacious and very pretty!  I ordered the Snow White Cosmo, which was well balanced and delicious.   The Grandma Pizza was yummy and my husband’s salmon was great too.   The server was attentive and helpful.   We’re grateful for this new gem and look forward to exploring the menu further."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkcU1laERBEAE",
            "text": "Espectacular fin de semana.\nLas carnes las sirven en el término de cocción indicado. Deliciosa. El pescado rico, y un vino de 3 no recuerdo bien el nombre, pero es uno de los mejores.\nEl ambiente me encantó y la atención muy buena. Se demoraron un poco al llevar la comida a la mesa, supongo porque tenían un par de eventos.\n\nPero todo muy bueno, recomendado y si  volvería!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXVmT1JBEAE",
            "text": "Just re-opened under new management, and it is seriously a hidden gem! Excellent happy hour with a surreally thorough cocktail menu. My favorite part of the food menu is the Albanian food, which is delicious -- like, hard to stop eating. But also there are SO many options. Very friendly, welcoming vibe, with beautiful decor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdHNDaUt3EAE",
            "text": "Was there with a family of 4, and we loved it.  So happy that we have this type of place in the neighborhood.  The cocktail drinks had excellent selection and were great.  The pizza which we all had was different from what you are used to in the Bronx.  And they were fantastic.  We also loved the starters we tried (crisp chickpeas and ribs). Ambience was wonderful with an inviting bar and friendly staff.  We also sat near the window to the street which was nice so you can see what is happening on the street.\n\nThe minor observations that come to mind was that water pressure at the men’s sink was low.  I asked the staff if the could fix it and they took it well.  The last thing which I hope they change that tends to bother me is the maitre d’ appeared and felt like she had an attitude throughout the whole experience.  In short never smiled and was not helpful.  I written this before at other places and restaurants don’t get that first impressions do matter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROb29LV3FBRRAB",
            "text": "We came here for my moms birthday. We wanted to stay close to home and I am SO GLAD we did. The staff was so accomdating and so pleasant- answered every question and frequently checked up on us for any needs without being overbearing. The food was phenomenal! Big portions, so you def get quantity AND quality which is hard to find. We had a wood fire pizza, fried calamari, penne all a vodka, chicken Marsala and a chicken sandwich - and quiet honestly everything was delicious. And for dessert we had a few (all flavorful and fresh) but my favorite was their panna cotta.\nI HIGHLY recommend this place! Can’t wait to come back again (or order take out).\n\nAlmost forgot to mention, the decor and the interior, bar included, was beautiful. Perfect local spot for date night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMFlMc2h3RRAB",
            "text": "I absolutely love this restaurant and the service this restaurant is definitely upscale. Definitely a lil vibe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaFpYVmp3RRAB",
            "text": "2 stars for the service, 1 star for the food, 1 star for the space. Nice, clean spot to stop for a bite to eat when on Williamsbridge, plenty of space for large groups. Service was awesome and attentive. Classic pie is good, tortellini (pasta kinda too thick) was set off by the sauce with peas and bacon, yum. The grilled seafood combo was delicious and perfectly cooked."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSM2VXcDZnRRAB",
            "text": "Hey Everyone,\n\nThis spot is awesome!  The pizza is made fresh in a brick oven. The food is excellent.  The ambience is very nice. There is a waiter there who is very handsome and fit. Ladies when you see him, you will know who I am talking about. He will def keep you coming back. \"The Bridge\" took over.  Everyone is very friendly, & professional!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOa18zSEtBEAE",
            "text": "First time at Michael Angelo’s on Saturday night.  We were pleasantly surprised how good everything was including the spread/dip they bring with the bread.\n\nWe shared the clams posillipo in red sauce it was fantastic!  We haven’t had a good clams posillipo since Captain’s closed.  My son had the chicken Parmesan a huge portion, I had penne vodka and my husband had the Cevapa grill.  The side salads were delicious and nice size they also offer free soda refills!  We all enjoyed our dishes and the restaurant vibe.\n\nWe will definitely be back!  Next time I’ll take pictures before we start eating lol!  It’s nice to have another good local restaurant in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa3JhOXlBRRAB",
            "text": "OMG some of the BEST Italian food I have ever had the pleasure of eating. Calamari so light crispy & tender. The Frutta di mare seafood pasta was perfect fresh fish, al dente pasta & the red sauce, soooo delicious. The wife's chicken fettuccine Alfredo was very tasty made with fresh cream & perfectly grilled chicken. Our waiter & the staff were very accommodating, he blessed us with complimentary  deserts that tasted like they came from the finest bakery. Will definitely be visiting again & next time with friends/family & a big appetite 😋 P.S. drinks were tasty too."
        }
    ],
    "reviews_count": 71
}