{
    "name": "Original Joe’s Pizzeria",
    "place_id": "ChIJhdLZKfbzwokRx-WxkPywJUU",
    "grid": "BX12",
    "address": "2136 Williamsbridge Rd, Bronx, NY 10461, USA",
    "rating": 4.7,
    "user_ratings_total": 235,
    "phone_number": "(929) 600-5959",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSVJsSldORVJCZUVWbllURm5aRVJ5ZW01RU1GRRAB",
            "text": "Absolutely amazing pizza! The dough is perfectly crispy on the outside and soft on the inside, and the ingredients taste super fresh. The staff is friendly, and the place has a really nice, cozy vibe. Definitely one of the best pizza spots in the area — highly recommend!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTFQzWkdSMGxQUW1GSWQzaGhNRkJDYzFSek5VRRAB",
            "text": "I loved this place and ordered from them a lot. Today, I witnessed one of the owners calling a child stupid 3 times. I was in shock. I waited for my order because I had already paid, but I will never go there again. It's Halloween, and they had a bucket of candy on top of the counter. It seems like the little boy took too many candies, and they made him put them back and asked him repeatedly, \"Are you stupid?\". I think removing the bowl and simply telling him one candy is enough would've sufficed. It was intentionally cruel. My face said it all. Truly, felt the embarrassment and hurt that the little boy experienced. Unacceptable behavior, and I don't even want to say why I think he addressed this particular child that way. Done."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS0xWTnJXazUxYURWUVNFNU1VWFJRT0VjNVNGRRAB",
            "text": "The pizza was really delicious. Looking forward to ordering again. Great Jobs Original Joe’s"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMmJrZzBkRzlRVTJWekxVUk5aSFpRUW5kdlUxRRAB",
            "text": "VERY DISAPPOINTED I called 2 minutes before walking in for a cheese slice, then asked for a buffalo slice instead. The worker told me I couldn’t get buffalo unless I also bought the cheese slice because it was “already in the oven,” and even said I’d have to buy two slices to get one buffalo. That’s not customer service—that’s forcing customers to buy more than they want. Prices are already high, and the service was disrespectful. And their pizza is ok I had better TBH"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSV1VFaEVkVE5VYzJsRFpGVjVOR2RwVGtKSmNrRRAB",
            "text": "Large variety of choices of pasta to choose from and an Italian atmosphere."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRVZtZDVOMUpFV1hwekxYTnZPSFp6YlhCa2ExRRAB",
            "text": "Riquísimas las pizzas"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd1NtTlZUV0ZzYUUxbWVuWklVRUZOVHpWbWNFRRAB",
            "text": "Pizza was good but when I went to pick up an ordered pie the price was different then website. The guy gave me some b.s. story. Despite the good pizza I don't think that they deserve my business."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTWNrSlZWRVZVUjJac2RuazNaSFJhZFZsNmFWRRAB",
            "text": "The Food is great, pricess are affordable and the place is clean.  Try it and you will not be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNVJHMURRV3RvY1ZWVmEyNUVkVnBqYzBGbWRXYxAB",
            "text": "We have been getting food from this place ever since my Mom has been in rehab a few blocks away.  The pizza is good, the staff is phenomenal. They are so outgoing, friendly, personable and professional."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUWIwdENTVWxEZVRONWNHMVVNbmRRZEZBNVduYxAB",
            "text": "Today I ordered over the phone 2 cheese pizzas. There was a slight misunderstanding when I said that I meant to order two pies instead of 2 slices. When I arrived the man at the counter was super understanding and put the two pies in for me right away. Extremely kind and understanding staff. I will definitely come here again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMlZrdGtPVkZ2V1dreVJIVjJXR1ZYVjNGUlJuYxAB",
            "text": "A nice place to eat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNU0wNU9ObTl2Y0VoeFlUSTJWbU4xVUVSWFFXYxAB",
            "text": "Amazing Sicilian pizza! Hard to find bad pizza in NYC, but you go to Original Joe's for the amazing service. This is the looking if place every neighborhood needs! Everyone who works there cares that you're having the best experience possible. Bravo!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJd2JUbDRhbmhDVkU1Q1NtMWxPRXhUVkV4amEzYxAB",
            "text": "Excellent pizza 🍕 Excellent service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ05uZHZiVmhQWlRObE5UQnBaMWhDT1UweFZtYxAB",
            "text": "Stumbled upon this place driving home one day and decided to walk in. The staff was extremely friendly, they recommended a few different options and i left out of here with a cheesecake. The pizza was delicious, very fresh tasting and the place itself was so clean. Will definitely recommend 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNFgybFplVkZoTld4Zk5WaDJSWGhmTUMxb0xXYxAB",
            "text": "Really great!  I’ve been dying to find a place in the neighborhood that seasons their croutons! Ceasar salad was bomb, and the cutlet was so fresh. Kind customer service :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVWR6TlNjMHRmZVhkNGFqUklSRkZmZFdwNVZXYxAB",
            "text": "Crust with dry and dense had no flavor.  Atmosphere and customer service was amazing though"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ1IzSjBaR3BNZDFvMk1VVkhZMk16ZFZNME4zYxAB",
            "text": "Customer Service is always great. Very friendly and responsive people. Would 100% recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMVJHbG1URlpoZFVoNlFWOU5ZVWx2TVc4elRWRRAB",
            "text": "Delicious 😋 Margherita pizza 🍕.  Really the best i ever had in the Bronx.  Very beautiful  pizza parlor very clean. Very nice atmosphere.  Two very nice  friendly handsome  young men work in the front. I will always come back here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMXy1uckRZb3NTcmxBRRAB",
            "text": "Great authentic pizza... my family loves this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONkNsTlRXcmJIbGRREAE",
            "text": "I definitely recommend you going to this place.\nFrom the food, service and the atmosphere is absolutely amazing. i’ve been going to this place for the past weeks and I’m loving it. The food is really good. The place always it’s clean and they treat you so nicely, you can go with friends or family since they have a lot of space for it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX1UwdnFqbnB6M1dBEAE",
            "text": "Great pizza 🍕 good prices and amazing service and staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab2RXSlBjV1pJV1hCTmQwUjZkRlJNWXpBMk4wRRAB",
            "text": "We have drove past for years and never tried it. My cousin said it was a must try! I am so happy we did today! I ordered on grubhub and picked up. We ordered Chicken Parm, Chicken Francese, garlic bread , and a  regular slice. Omg 100000/10!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLR0VwckdlaC1qTnNRRRAB",
            "text": "I went close to closing time, and the Worker that helped Me with ordering was really nice and helpful, patient considering I was indecisive, which I was really grateful for as I was feeling nervous. He was very knowledgeable, outgoing, and the Pizza He recommended was really good! It taste good and You feel good after, not like some Pizzas that make You feel heavy. I got the Chicken Parm slice and Grandma slice. I will be back for Vodka slice!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaVluY0RHdGZ6UGRnEAE",
            "text": "Excellent pizza, great guys behind the counter, fast service, clean tables and nice atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcjNuXzMxMW9ENmNREAE",
            "text": "I loved everything about this place. Delicious food and great services 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHYyMGVnEAE",
            "text": "OmG Joe's is amazing. Pizza is top 5 and the food is amazing. They also did a reno of the dining room. Very Nice. Promise ...you won't be disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLXVyaWxnRRAB",
            "text": "Excellent pizza"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX0lEZHF3RRAB",
            "text": "Esta buena las pizzas"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZakp5cjl3RRAB",
            "text": "Stumbled in here yesterday randomly. Not sure why I've never been here but the food is SO GOOD. The guys behind the counter are super sweet and helpful. The place is IMMACULATE...so clean. Def have a new customer. Im usually all over Arthur Ave and walk to G& R regularly. But im definitely putting these guys in rotation. The food is outstanding 10/10. Highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX09LRWJ3EAE",
            "text": "Took too long to give the food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvby1UcWh3RRAB",
            "text": "Great people and great pizza"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaGNMX3ZBRRAB",
            "text": "My family and I did some pasta dishes to go. They both did chicken with alfredo sauce. I did the chicken parmesan  with penne and marinara.\n\nIt was dine in portions, particularly with the proteins. I'm almost surprised by the amount of shrimp, and it was buried in parmesan. The pasta was al dente.\n\nMy neice loved the garlic knots. Soft and good flavor."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMXFXdXRRRRAB",
            "text": "Amazing place . The best pizza ever . Highly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWViNFN3EAE",
            "text": "10/10- I really recommend the chicken parm & buffalo chicken\n\nThe staff are very endearing & they serve great food here - truly a crown gem in the willamsbridge area"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbXVIQldBEAE",
            "text": "Delicious.  Authentic Italian.   I love it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJckpHd1FnEAE",
            "text": "Great looking place with lots of seats, friendly and respectful staff, the chicken parm roll was delicious. Recommended"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJM2ZUVHVnRRAB",
            "text": "Great pizza. There dough is so good. I usually pick up their dough and maybe a side of sauce and go home and make pizza with the fam. Owner and staff always super friendly and helpful. You can feel the love."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbU5TZzhRRRAB",
            "text": "Someone at work ordered from this place and I really liked it.  Decided to order on my own.  Pizzas are great.  Large size is not as big as I’m used to but they are delicious so I’m ok with it. I also ordered spaghetti with meatballs. My son loved it.   Calamari was good but not exceptional."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NV96eWx3RRAB",
            "text": "They pizza is excellent. The crust is unbelievably great. The lasagna with the sausage was excellent. The two gentleman that was there on Friday March 21, at 11AM were super cool and welcoming. One of my new favorite places. Come here and get the food. Everything is made fresh. The sauce on the pizza and lasagna is amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMzdLN0J3EAE",
            "text": "Love this place ♥️ everyone is pleasant and the food is amazing 🙏🏼"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNlpPYTBBRRAB",
            "text": "I came here based on pictures and reviews hopeful to maybe come back the next time I was over here. My chicken slice with a very small amount of chicken on it in the middle? For the full price I paid l was expecting at least to get a full chicken slice. The crust was a little too hard and dry. Customer service was okay."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLTl5R0R3EAE",
            "text": "A Fan Food is good and the location and staff is great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOVphQWNBEAE",
            "text": "As I walked in I knew that I was not going to be disappointed, next time I am in the neighborhood will revisit"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd2ZtMlBnEAE",
            "text": "$3.75 is, quite frankly, too much for a pizza slice."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXEtZWpRRRAB",
            "text": "Lived up to be Mia Pizzeria’s successor"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmell6VktREAE",
            "text": "The pizza choices were good. I felt the crust was too dry and ok. The marinara sauce and patty with mozzarella were amazing.  Ordered through slice and everything got to us hot and in perfect condition.  Would try again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeXNTemt3RRAB",
            "text": "Best Pizza ever. The garlic knots, the calamari what a treat. The people was so kind and friendly."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLLWJmM2VnEAE",
            "text": "Excellent pizza! Not too sweet with a perfect traditional crust. Not in my immediate area, but I'll drive here if I'm ordering anything more than a slice. Big shout out to the guys behind the counter...courteous and most definitely professional."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Z2J1XzVBRRAB",
            "text": "Me encantó buena pizza buen ambiente y el dueño es demasiado amable y todos los trabajadores 👌🏼"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OE9teXh3RRAB",
            "text": "The best . I will definitely order again :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHb3B1X2hnRRAB",
            "text": "Came here after a day at the zoo with kids. Place is super clean, bright, with a very nice and cozy decor. The food was excellent. Diverse menu with lots of homemade items like the mozzarella sticks that are the best in town. The pizza is…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbFB5OHZBRRAB",
            "text": "The place is extremely clean, the gentlemen are friendly, and the pizza is delicious. I think it’s the best Sicilian/square I’ve ever had—and this is coming from a Queens native, born and raised.\n\nYou know what else is great? The son (I’m assuming he’s the owner’s son) is very handsome. Hehehe!\n\nI definitely recommend it!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaWEzQ1dnEAE",
            "text": "Excellent pizza, one of the best slices I have had in NY, the crust is delicious! The Spumoni Ice cream was amazing!! This will be our new permanent stop every time we are in NYC."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOUxHbDlBRRAB",
            "text": "We had a mini white with meatball and mushroom pizza ,my friend had a mini white pizza. It was an  EXCELLENT experience at Original's  Joe's Pizza on Williamsbridge Road  .  Both were excellent and good to the last bite. Exceptionally friendly, courteous ,respectful  family owns this pizzeria/restaurant. The food is outstanding.  you. My new \"go to\" place for Italian food. Large counter selection for specialty slices."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLa0llcVFBEAE",
            "text": "New Pizza on the block, large Menu, family Buisness . The grandma Slice was very good..crispy crust . Buffalo wings and cheese fries definitely worth a try. Eat by yourself or the whole team they have it set up to accommodate everyone..👍 🍕…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNFBlYTJ3RRAB",
            "text": "Well, $3.80 is a strange price point, but at least it's a decent slice.\nIn fact, it's a great slice.\nThis is pizza made the way it used to be made.\nGenerous coating of cheese and sauce.\nChewy crust, just thick enough to keep the slide from collapsing.\nGood flavor, with Italian style seasoning.\nTruthfully, the only thing I can make this the better slice of pizza, would be if it cost less. Giving it a grade of 96."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbjQ3RmRREAE",
            "text": "Went in today just to try the pizza.  First time I've sat in a place to eat since March of 2020.  Nice thin crust, great sauce and cheese.  Tore the two slices up!  Nice guys too, and the interior was SPOTLESS.  Good selection of drinks.  Great new addition to the neighborhood.  Welcome!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmJXazVRRRAB",
            "text": "This pizza store has great thin slices i keep forgetting about this place because the location is close to Pelham pkwy, But not today.\nI got 2 slices to go the staff was very friendly clean nice place to have pizza. A MUST TRY."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhejZhUzZRRRAB",
            "text": "Great experience dining at Original Joe’s Pizzeria.\nThe menu offers an awesome selection, the pizza is delicious, portions generous and ingredients fresh.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtM1BMOHNRRRAB",
            "text": "Not only was the pizza delicious but the place is super clean & the staff Super welcoming. The crunch on this corner slice! just perfect!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN3EzR0lREAE",
            "text": "Honestly this the most cleaned pizzeria i have ever seen. Nicely decorated. The food taste is a 10 and price is just right or i would say cheaper than others pizzeria around here at that level of quality. The only sad thing is they're closed on Sundays but they deserve it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcElQRG1BRRAB",
            "text": "Amazing Pizza! Very family oriented and they make you feel like home! Highly recommend this place, best pizza in the Bronx!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c0tPcWNREAE",
            "text": "Even when compared to the horror slices outside New York City, most New York City pizza is just okay and if you eat it often enough, you could be forgiven for thinking that's what pizza is: A mediocre food product that you buy because it's cheap and easy.\n\nIt's not until you have a margarita slice like the one I had at Original Joe's that you start to remember that pizza is a goddamn art form and the people that do it well are brilliant masters of balance and flavor. There's something really special about people who can do do the same thing with the same ingredients as a million other people and somehow managed to do it so much better, it's like they're making entirly different dishes.\n\nThey nail EVERYTHING. Leoparded char on the bottom of a flavorful crust that tastes like fresh baked bread. Tangy and clean tasting sauce, Delicious Mozzarella and fresh basil; it's stupid good.\n\nMy only hesitation in recommending the place is on the chance that hipsters \"discover\" it, causing well deserved lines out the door for a slice that the people of Morris Park have known for a while now was worthy of all the praise I could give it.\n\nA Bronx original. An actual masterpiece."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMUpLdkhREAE",
            "text": "Don't judge a book by its cover. I judge a restaurant by its restroom 😉 good pizza store with a very nice restroom. (Photos)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcUxuR3BRRRAB",
            "text": "I literally just ordered from Original Joe’s Pizzeria this evening and bought a large cheese pizza and the buffalo wings. Let me just say, THEIR CHEESE PIZZA IS WHAT A NEW YORK PIZZA SHOULD TASTE LIKE. I haven’t had a slice of pizza this good in a while. I’m glad I went with the large, but I’m sad I only purchased one order of the buffalo wings because they’re so good (should’ve gotten two). A lot of the pizzerias near me are just okay, but I’m really happy I came across Original Joe’s Pizzeria that’s not a far distance from me at all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieHRMVllnEAE",
            "text": "5 stars across the board. The service spectacular. The pizza? Even better. The slices were crispy and the perfect amount of sauce and cheese. The pizza didn’t even flop. You pick it up and it stays straight. So crispy perfect amount of cheese to t sauce ratio. These guys know how to make pizza. Best pizza I have had in a looooooong time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibHJydy1RRRAB",
            "text": "Good prices and generous sizes of pizza. Expect around $4-5 per slice. The pizza comes out very hot, hot enough to burn your mouth. Street parking is available."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHeTViWi13RRAB",
            "text": "Omg Best Pizza A New York Girl Can ASK For!! Great Customer Service!! Clean and Big Sitting Arrangement.. Thanks Youu Guys.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNELThQRmJnEAE",
            "text": "Ran across this place by chance, and my 2 year old insisted on visiting for dinner.\n\nNot only did the pizza have the perfect sauce, but my kid was also  enchanted by the atmosphere, just sitting quietly and taking it all in.\n\nThe staff was very friendly, and while it's out of my way, we'll definitely be back."
        }
    ],
    "reviews_count": 69
}