{
    "name": "Li's Kitchen",
    "place_id": "ChIJIwotclvzwokRXRlPXMNMG10",
    "grid": "BX12",
    "address": "2515 Williamsbridge Rd, Bronx, NY 10469, USA",
    "rating": 4.2,
    "user_ratings_total": 174,
    "phone_number": "(718) 519-1881",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbmVXbGplRzlrU0hwUGJDMTJVVk5CYVZaUk5HYxAB",
            "text": "Top terrible service and food around the neighborhood not sure why people hype this place up"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqci1PeHFnRRAB",
            "text": "Food is cold, food is not cooked well, if they tell you \" grab a soda\" is not free they will use that tactic to charge you for it while you think is free. Save yourself a problem and buy somewhere else."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZWZ0OUNydElISFJBEAE",
            "text": "This place has the best food in the area so glad my sis in law put me on to here me and hubby love the food so accommodating with every order sadly cash only and on rare occasions willing to take Zelle payments it just hard to ask for that option as the phone is answered at what seems to be a place they sit just to focus on the calls to make sure they can handle each customer order with out rush or being destructed by focusing on cooking not answering the phone witch is dope in its self so Shout out to Li’s Kitchen for the great food and service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVHFtcUhzOXVydlhREAE",
            "text": "Good food at decent prices! Came recommended from someone who's been going there for decades! Glad I tried it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKaWJ1UGJGN1pub1BREAE",
            "text": "My places. Fast, cheap, Good food, and there respectful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk4yeEJREAE",
            "text": "The customer service is always excellent and courteous. The food is yummy and arrives quickly. They are very nice and I appreciate their service. Thank you Li’s kitchen."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOXJiYXRBRRAB",
            "text": "Declined over the years and now has a C rating in the window. Not good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWJIVm53RRAB",
            "text": "Food is ok for a neighborhood place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3anNIdmlnRRAB",
            "text": "Meat was on the floor where they threw it and I had already paid"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnby1hRWR3EAE",
            "text": "It’s okay. There portions are very small for a 10-15 $ meal. So much broccoli and a few pieces of chicken. I don’t even think that’s chicken. That’s cat. It’s still delicious."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhN2FUVXRBRRAB",
            "text": "Great ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMFlDcHhBRRAB",
            "text": "Rice was under cooked and the food took 1 1/2 to be delivered"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLTVQQXJ3RRAB",
            "text": "I honestly don't think this place even deserves 1 star but I'm gonna say this; on Sunday the Chinese restaurant I always get food from Happy Garden isn't open and I tried this one and not just once but gave them three,,, yes three opportunities to get it right / improve but horrible,, horrible food!! Don't do it to yourself,,, get a sandwich or a slice because this place isn't worth it!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhaXFTUjF3RRAB",
            "text": "They got an answering service and it was all downhill from there. They kept screwing up my orders So eventually I stopped ordering. It's too bad the food was good. I just got tired of getting the wrong items , Getting overcharged because they added up the order wrong. Once they got the answering service it went down hill fast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcHZESlpREAE",
            "text": "I just got wings and Fries and the Fries are oily and not cooked well- This place needs to change their management and their parents need to come back and manage the restaurant better- this is not right at all- You should not mix how you feel about me to how you cook the food- it is ridiculous"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dnZXeVF3EAE",
            "text": "Best Chinese food in The Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNlpQUTl3RRAB",
            "text": "I placed an order for delivery 1 hour and 40 mins before closing and I get to receive my food I have kids to feed this is outrageous"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6a3R5UDR3RRAB",
            "text": "Amazing!!!🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNEpibWVBEAE",
            "text": "Always Great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeThERlFBEAE",
            "text": "Used to be very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdDVpZTlBRRAB",
            "text": "I waited 2 hours and 30 mins for your order and you didn’t have the decency to call me and tell me that the order was cancelled. I found out because I called and the restaurant was closed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOX011S1VBEAE",
            "text": "Lied about delivery to door ...all boneless ribs fatty not edible...delivery service the worst ...the worst Chinese food I eve r y have in 50 years in bronx"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1emF2M2hnRRAB",
            "text": "Best chicken wings and fried rice in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ2VESkR3EAE",
            "text": "Best Chinese food in the Neaghborhood 👍🏽👍🏽👍🏽💯…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4N3NDSWV3EAE",
            "text": "Great place to eat 😃"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4am95VHF3RRAB",
            "text": "Food was very good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocjl1d0F3EAE",
            "text": "Bought from there twice, didn't like their food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeWJfRFB3EAE",
            "text": "They have the best Chinese food in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoa2JQUXFBRRAB",
            "text": "I always have a good experience eating at LI's."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXVuOUN3EAE",
            "text": "THE WORST ESTABLISHMENT IN THE BRONX HANDS DOWN!!!!!!!!!!!!!!PLEASE ORDER AT ANOTHER PLACE!!!!'\n\nWORST CUSTOMER SERVICE, THE FOOD IS NOT HANDLED NOR WASHED PROPERLY-CHECK IT OUT ON YOUTUBE ITS DISGUSTING AND NYC FOOD AND SAFETY INSPECTION NEED TO SHUT THIS PLACE DOWN ASAP!!!!!!!!!!\n\nP.S- Look how it's cooked- The beak and it's head 🤦‍♂️"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbEp5N2lnRRAB",
            "text": "Always the best!!! my family has been ordering since 2006 🤍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCamJURG9nRRAB",
            "text": "Never disappointed.  When we get a hankering for tasty Chinese food, we go straight here!\n\nHas been in the neighborhood for decades actually. That tells you something...\n\nChicken and broccoli, sweet and sour chicken, fried rice, lo mein, egg rolls, etc- all very satisfyingly delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLXUzUzF3RRAB",
            "text": "The pork fried rice was fantastic, hot and steaming, generous with pork,great mix of flavors. Hot and Sour Soup here is great on a rainy day, great value for money, good amount of pork, tree ear and stuff. Steamed dumplings (8) at 6.75, great value for price, always tastes good. Delivery was fast. I always order from here, always get treated right. Fed 3 for about $7 each."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbktlRjVnRRAB",
            "text": "Very good people and friendly staff the young man at the counter very hospitable and handsome . Will be back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdUxIY0lBEAE",
            "text": "I am chinese. I know how is the food taste. It is terrible food. first time in my life I throw away everything after eating a little bit each one. I bought three. I saw letter A and 4 stars. That is why I bought. but not again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldm9UdEV3EAE",
            "text": "Ok Li!!! I see you. Generous portions, very tasty and good quality and I bought the sesame chicken and it wasn’t stale or hard. Sauce was fresh and glistening with the nice little sesame seeds lightly sprinkled across. I can appreciate when I see egg in Chinese rice. Great job. You got yourself a returning customer 👍🏼…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bDVPUTVRRRAB",
            "text": "Been ordering from my guys since 2013! Even though I'm not in the area anymore (777) I order for pick up! Food is always great never failed me. Staff there are always in good spirits! Best Chinese food in allerton and williamsbridge area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLWNiUVhnEAE",
            "text": "I love to eat there because they have the people that used to be there before and the very kind very nice and the food is delicious they had some new people working there but the older people that were there they back again thank you Jesus I'm getting my delicious food I love them"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd2V1NmZREAE",
            "text": "My family has been ordering here for about 15+ years.  The food quality has never changed and has always been delicious! My go to chinese food spot and they are very nice amazing people! May this business continue to prosper 🙏🏼🙏🏼…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydHI2MUl3EAE",
            "text": "I did not order or anything from this restaurant (I picked up an order for an Uber Eats delivery I was assigned), staff here was very friendly and without any hassles."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyckl1UmR3EAE",
            "text": "The food was very good. The rice could of been a little softener but other wise it was very good. I would order from them again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb0xpc0dREAE",
            "text": "Excellent.. and i dnt like eating out but i recommended this restaurant to everyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbDRXT2pBRRAB",
            "text": "The boneless chicken is very good so is there fried rice ⭐⭐⭐⭐⭐"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNTkzQnVRRRAB",
            "text": "Extremely HORRIBLE customer service and MONEY HUNGRY ! I’ve been a loyal customer for 3 years now back to back and honestly it’s not the same whatsoever on top of the fact that prices have changed which is no problem if your receiving good food and great consistent customer service that’s just not what they provide anymore the last two time I ordered I gave them the benefit of doubt food was not fresh barely gave any vegetables or shrimp in the “vegetable shrimp fried rice “ and tostones were extremely cold when we called to see what they could do there only answer was that it was made the same day no replacement no refund nothing ordered again and it was the same issue . When your ordering they’re money hungry they rush you off the phone you don’t even have the time to ask questions about the food you are spending money on PRICES WENT UP AND QUALITY WENT DOWN ! Makes no sense I thought it was supposed to be the other way around sincerely from a fed up loyal 3 year customer that’s never ordering again ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNGZiN29RRRAB",
            "text": "Poor delivery service! I can’t rate the food because they opted to return it instead of coming upstairs. The restaurant should stop using grubhub if they are not going to do contactless delivery.  They use a 3rd party who calls to explain they can’t deliver."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Nll1ZHVnRRAB",
            "text": "Food was really good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbThUSnJnRRAB",
            "text": "Excellent Chinese takeout food.  I've had food delivered from here for several years.  This was the first time I actually went to their location,  ordered and picked up my food.  Never disappointing....always great food.  Highly recommended! AAA+++"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bWR5Z3lnRRAB",
            "text": "The food is very good and taste I would order again from this place"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5b2RXTEl3EAE",
            "text": "Fantastic food. This exceeds the expectations of an everyday Chinese food place for a great price.  The staff is also amazing and friendly"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5el82eEJ3EAE",
            "text": "Hidden gem..house special fried rice and sesame chicken was amazing"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvOF9Ec3pnRRAB",
            "text": "The order was for Shanghai noodles which were tasty but I thought dry. Another order was pork egg foo young which was not outstanding in any way. The egg roll on the other hand was delicious. The employees very businesslike and I thought not very friendly. Since my last visit I found the food not as good this time\nHi"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndmJIWGZBEAE",
            "text": "Great customer service. Good food. Fast and reliable delivery.\n\nFinally opened after 9 months. Family owned business. I needed chicken noodle…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5NmIyVTlnRRAB",
            "text": "The food is good, but they keep cancelling my order on GrubHub. Three times they've cancelled my order because they're \"too busy.\" Today, I put an order in, I was informed that it would arrive between 7p-7:10p. I get a call from GrubHub at 7:08p saying that the restaurant cancelled the order because they were again, \"too busy.\""
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRX2Z2YkZBEAE",
            "text": "We order from Li's all the time. The food is outstanding. Try the happy family, it's got so much meat when other restaurant's just load it with veggies. I'd give them 5 starts but they don't take cards, only cash. Definitely will enjoy your meal"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbWFTYk93EAE",
            "text": "Been coming here since 1998. Friendly service & outstanding lunch specials. Family owned operated & funny how Li's kids are getting bigger every time you see them in the restaurant. 🍄…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRck1Pd1VREAE",
            "text": "Great Food!! Best Dumplings in the Bronx, their boneless spare ribs are the best out of any place. Very Polite on the phone."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cmUzZFB3EAE",
            "text": "I love this restaurant. They know me when I call lol. They do have quick service and food is delicious. Resonable prices and the only place for my Chinese food I go."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBckttSTJBRRAB",
            "text": "I love this place period. Good food and customer service. I pass by a few Chinese restaurants just to get my food here. Food is the bomb!!!! @iamkishajmcrae"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZemJIcUl3EAE",
            "text": "HORRIBLE CUSTOMER SERVICE- OWNER’s NEPHEWS VERY NASTY AND RUDE WHEN DELIVERING FOOD AND WILL NOT DELIVERY YOUR FOOD IF YOU ARE RUN 1-2 MINUTES LATE PICKING IT UP- I WAS THREATENED THAT THEY WILL BAN ME AND I HAVE INTENTION TO REPORT THEM TO…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROVlMbE1nEAE",
            "text": "Ordered online this time. Very late. Cold, bland and a waste of money$"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMllHdmVBEAE",
            "text": "Best chicken lowmein ever! If you're not into mushrooms, be sure to ask for no mushrooms. Wings are wicked too!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbEpmMkxBEAE",
            "text": "Horrible customer service...lady had an attitude....\n#customerservice #majorkey\n\nCalled again by mistake and ordered and the service has improved but i will stick to my guns and instead of 1 star they will receive a 4 star"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcHIzdVZnEAE",
            "text": "Authentic Chinese food. Customer service is outstanding. Will always be a repeat offender at this restaurant."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbGRURDNnRRAB",
            "text": "Excellent service - decent food. Always order from here when I'm in the area."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbnZDRkNREAE",
            "text": "Very good chinese food looking forward in ordering here again."
        }
    ],
    "reviews_count": 65
}