{
    "name": "Ali's Roti Shop",
    "place_id": "ChIJe5RAdCfzwokRu05x8JwxUBk",
    "grid": "BX12",
    "address": "4224 White Plains Rd, Bronx, NY 10466, USA",
    "rating": 4.2,
    "user_ratings_total": 732,
    "phone_number": "(718) 655-2178",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGZmQxUnlkVlkyZEMxeE5YcENURmxHU2twWWFVRRAB",
            "text": "In one word…NASTY! I ordered a curry goat roti which was completely dry with no gravy. The shell (I can’t remember what it is called) is also dry and crumbly! I can’t remember what kind of roti my aunt ordered, but she threw her meal away when she got home! Also, my aunt and I were having a pleasant enough conversation with the owner until it turned offensive. He felt the need to school my aunt and I on the “problem with Black people” which he felt was too much religion. I didn’t say anything because the food was already paid for. We are African American and the comment was very off putting. To the owner, sir…NOBODY ASKED! With that attitude, you would think the food was on point! Even if the food was delicious, apparently he has strong opinions about Africa Americans. That alone would keep me from patronizing this business."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdGVDMHpZVkZrV1ZkV1pYcGlObEJUVEc5RVgxRRAB",
            "text": "The roti taste like Ali roti’s personality less than to be desired. I ordered a simple chicken roti with pumpkin.\nI got a chicken neck bone stew wrapped up in flour roti with a half a teaspoon of pumpkin I needed a magnifying glass to find the pumpkin  and lots of chicken fat, when I clearly asked for no fat . and I also got a stomachache don’t need to come back here ever truly lousy.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TVFXNWhWamxWUzIxbWJXWmhPWEpOUzBKMmFXYxAB",
            "text": "Cash only!!! It's 2025 do better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eE5ESkJNMmxrWVhBM1drNXNWMUpmYnkxVmVsRRAB",
            "text": "Needed to get a catering order for work, they were so helpful went above and beyond. My job loved the food! 10/10 I’d come back and I will ☺️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRFJVWjJZbkJJT1hGTlFrTjJVazh4TUhGb2FVRRAB",
            "text": "Solid roti spot, been coming here for years. Mostly come for the doubles and roti. Expect a bit of a wait depending on the day and time you come, it can be a while. The cashier is also the food preparer so patience must be exhibited, there's always an angry bunch so hold your own."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WlZXVkhZVTVEWTB4UGVYVndhelZJUlc5eFFYYxAB",
            "text": "First and last time at Ali’s! Doubles is not authentic trini doubles the Channa tasted like it for roti not doubles! I was so excited to find a place in the Bronx for doubles because I moved from queens but since trying this place I’ll take that drive to queens when I want doubles! Also asked for bandania sauce and didn’t get any if he didn’t have he should have said something!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFNsTkdVVU50ZFc5SGNXSmliVzgwWlZWWlFsRRAB",
            "text": "I loooveee this place!!!! The doubles are delicious and so is the curry chicken roti and poulorie, the lady at the register is always nice. Whenever I go to the Bronx I have to stop for some delicious Trini goodies!!! The only negative is that they only take cash but other than that, this place is a 2 thumbs up!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFN6TjNlSHBQVjNsRWNqTlhaRll3TlRBeFlVRRAB",
            "text": "A bit disappointed with the dhal and dhal puri.  The shrimp was good though."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214alJHSndOR1k0VVdsb2JEQkRRazF5UzNaV1lVRRAB",
            "text": "Nasty nasty Patton roti stale stale one rotishop never again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSlkzWlVVMFJsY1MwNFVGWmZjbXBYYkdWMVdWRRAB",
            "text": "I love it! The food was great and authentic in every way. With Ten bucks can get you some nice treats and eats."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWlEzbENSbVZWTXpkMk5GbG9lV1JaUTNaSlJtYxAB",
            "text": "happen to be in the area from brooklyn. I ordered shrimp doubles and sorrel 😭 this was the nastiest doubles I ever have in my life boy. channa was hard and dry and d bara taste stale lol and 4 little piece of shrimp they put on the doubles. the sorrel was terrible also taste like they used a syrup and sweetener. this was not sorrel."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdGZIeEh3EAE",
            "text": "Rating based on 2018-2024 experience.\n\nThis is a fine Trini restaurant with authentic food from Trinidad. Their food tastes really good. Their double ups and roti's are practically legendary and vegetarian as well, if you choose the meatless kind. The prices are very affordable. Many who come here for a quick grab, from their appetizer menu like double ups etc, usually grab more than one. I do miss the older lady I saw here when I first came here, she has a beautiful soul."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU2FqSmhiMUF6VWsxamVuaERlV0ZuWW0xa01VRRAB",
            "text": "Would have been 5 stars if it was not cash only. The food was great, super tasty, and a lot of it for the price per item! We got chicken roti and channa and potato roti, it was so much food. Both were delicious but the potato and channa one was a little dry. Next time I hope to get some hot sauce to add to it. Everyone enjoyed there food and we will definitely go back. It did take a while to get our order, like a long long time. So next time I hope to call in an order, so I can get this food within my lunch break.  There was a ton of people in and out ordering. There are no places to sit in the establishment. It is only a take out place and it is cash only. The lady at the window was kind and let us ask all the questions. This place was 👍, try it out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMGFuSk1OMkpIVjA5U1pEQmtaMk5SUzJkalFXYxAB",
            "text": "The aloo tasted like reusable cooking oil. The Doubles tho was the bomb!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeGVIcHhObVl0YmpaRGIxWjROMGhvYzBKT1gyYxAB",
            "text": "Whoever rated the quality/taste of food above 3 stars, especially the basics like doubles and aloo pie is out of their minds or really haven't explored other restaurants or home kitchens.  If you know authentic, well-seasoned, flavorful food, don't waste your time or money to go here.   Sad to say, but agree with other reviewers, it's satisfactory if you're really craving sub-par Caribbean dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT2QzSmlOVWxOTmtvdFpWaGxXamhLVERsSVlVRRAB",
            "text": "Food is amazing! Friendly staff, new shop is beautiful, halal food! So happy to find that!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQmVHTldPWEJzYWpabVZUY3RVblZyYTIxb09GRRAB",
            "text": "I am not even from the islands and I love caribbean food. I grew up around trinidadian and Jamaican friends and lemme tell you... between me and you.......trini food better --- 🫣🤣...don't get mad!!!!  It's only because of the roti....😂🤣.\nI always came there for the roti with the curry chicken I will eat it boneless or bone in. Don't let me catch y'all eating with a fork eating the roti 👀😐🤨 . Listen I know I keep talking about this place and I'll stop but listen I will eat roti for breakfast lunch AND DINNER. Ain't no games out here.....trini food it's so soothing. I wish they had others stores. Roti is a lot of work to make so I hope this continues to do well thank you for your service !! 🇹🇹🇹🇹🇹🇹"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYlc3WXp3NG82WmFnEAE",
            "text": "Exelent lunch"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNbUtudEhZbk11eFRBEAE",
            "text": "I used to love going here back in the days, and now I went back for the first time in a while, and I see its in a new location newly renovated spot, and i love that for the couple. My only gripe is with the young lady at the counter. She can stand to use some patience when dealing with people and all-around customer service training. If I hand you my money in your hand, then that's how I expect it back , not slammed down in front of me and rushed out the way for the next person."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTEEzLWZZMUlUenlRRRAB",
            "text": "Curry heaven...n sweet breads too. Love trini foods"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKUElyckxVb3F2SG5RRRAB",
            "text": "It’s the BEST : MY TRINI 🇹🇹 FOODS ETC., SUPER DELICIOUS"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ2NQbzJnRRAB",
            "text": "They are so slow!!!! Bruh!!! The lady takes one order and goes back for ten mins then comes back take another order and disappears. Bruh you can’t be that ignorant to wait time and customer service. Make it worse they don’t take cards. 😩😩"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbE1YQVB3EAE",
            "text": "Love the roti, dhal puri and dhal from here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc1A3ekhBEAE",
            "text": "Roti was very dry and not tasty at all.  There was more potato than chicken.  Very very very disappointed!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcjlySnpBRRAB",
            "text": "The doubles were delicious and so was the passion fruit juice but lawddd, de boneless chicken roti was dry. No kinda sauce. I was so disappointed because I bought one for my mom, too. I'm going to reheat it tomorrow and hopefully it springs water."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGRpY1VBEAE",
            "text": "🥰🥰🥰🥰🥰…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLXZhc2tRRRAB",
            "text": "Food is great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMWVpUmF3EAE",
            "text": "Great food and fast service to make your dish"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bWVfeTBRRRAB",
            "text": "Great people"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b0w3Q25nRRAB",
            "text": "I brought food this evening, which is the doubles an roti an it was horrible the smell was horrible, it do not taste like Trinidad roti at all ,the Chana was hard in the double , the roti smell funny an taste funny an I’m funny with food it made me want to throw up . i recommend Queens an  Brooklyn Trini roti shop .come on nah man do better . I’m sorry but I won’t be buying there anymore ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNzlPZXZnRRAB",
            "text": "I bought a saltfish doubles ($5).\nIt was very tasty and (thankfully) NOT spicy.😃\nEven though this spot, Ali's Roti Shop only accepts cash💰, the line was lo-ong on Friday afternoon, 3-14-25.\nIt's very small inside, so be prepared.\nThe cashier was very pleasant\nI'm a 72 yr old Black American woman, and this was my FIRST time ordering Trinidadian food.\n😃I highly recommend this (tiny, \"store-front\") restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXZqNUd3EAE",
            "text": "Oh my goodness. Must try their Doubles and their double taste juice - mango & guava, made in house. Their Rotis are huge and good.. You have to try their tamarin sauce. They accept cash only. Their prices are inexpensive."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdkx1MHN3RRAB",
            "text": "i purchased several items, the doubles i bought the chick peas was not fully cooked , the salt fish double was dry, i almost choked. The curry goat roti, the curry taste was bad . I will never buy here again ill drive over the bridge to get consist good trinidadain food."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4N2ZHMTRnRRAB",
            "text": "Definitely not what it used to be"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOE9XMHNnRRAB",
            "text": "Neighborhood Business with loyal customers.  New location.  I've known this business for about 30 years or longer. Delicious authentic Trinidad 🇹🇹 😋 😍  food. Oh cash only"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMTlhTllnEAE",
            "text": "Great Mom & Pop Trini restaurant.  The food is 🔥."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudnVPU2hnRRAB",
            "text": "By far one of THE best roti spots in NYC yes I tired the others and can’t compete with the warm smiles and services at this place but a even warmer doubles dough and perfect combination of tang and spice if you choose to add the sauces / after that the rest is history the beef / succulent savory huge chucks the chicken the same way. I broke my fast to eat those meats to give yall this review 😂 so  I’m telling you this place makes sure to always take the extra step to serve superior Quality and that’s all we really need in life is love and good food 🙏🗽yall come try it oh and it’s cheep eats I bet Chaya I come here few times I month no cap 🧢🤷🏽‍♀️😎💰update with pics 💕💕"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXJPTzd3RRAB",
            "text": "Their food is so authentic and delicious, and reasonably priced.  The staff is very nice. And the place looks clean.  I highly recommend 🙏"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfek5DN1dnEAE",
            "text": "This is a hidden gem. If you like Caribbean food, specifically from Trinidad, you will love this place. There's a large selection of food. It is a takeout only restaurant."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUekt6LThnRRAB",
            "text": "If you want stale dalpori this is the place for you 😂 plus they don't have 2 cashiers so the line moves very slowly and builds up fast, you have to wait in one line to pickup or order food, would be a lot faster with 2 cashiers and 2 lines. One for online/pickup and the rest for walk in orders, also parking here sucks"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b2JlTGhnRRAB",
            "text": "Great selections , clean space, and fast service. My favorite is the curry goat roti."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bkwzMlBBEAE",
            "text": "The patato ball,dhal puri and chicken is sooooooooo delicious will definitely buy again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aEtxZEVREAE",
            "text": "The food is delicious!  Nice, clean, and bright atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLWVtR2NREAE",
            "text": "the chicken just needed a little bit more flavor but I enjoyed it. I’m happy that I don’t have to go all the way to Queens to get good food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNEp2V05BEAE",
            "text": "I was disappointed in the flavor of the curries and the doubles. The roti and the barra was good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbmNYdmd3RRAB",
            "text": "Food is very good wish I could've tried more .The worker is very nice and welcoming ."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydU1YaG9BRRAB",
            "text": "Nice upgrade from the previous location. I like to order my doubles from here. Yet, I which that they did not take the skin off of the chicken. This makes the chicken dry.  Also, the beef in the doubles could be better with a different cut of meat to ensure moist flavor. It is a good place in the Bronx, but could improve to match other great Trinidad spots."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdmNXbzlnRRAB",
            "text": "To greasy"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3a01Mc3p3RRAB",
            "text": "Good food nice people..a bit slow.. no delivery not good also no parking and close at 8pm now  not good... other than that best Roti shop...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucF92dUVnEAE",
            "text": "If you eat it Vegan food the Curry chickpea  roti was so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX3RiUEx3EAE",
            "text": "I am genuinely happy with the outcome of my visit here. I've tried many many trinidadian places in New York and so far this is up there as my number 1 spot.\n\nI went to get some doubles and pholourie first because we all know , if you can make good doubles, everything else should follow.\n\nThe prices are incredibly fair, 2$ for a doubles and 2$ for 12! pholourie ( Little fried bread like balls with a dipping sauce)\n\nThe taste of the food is great, It reminds me of home. I will definitely have to go back and try their other menu items in the future because their food is tasty, large portions and affordable.\n\nThe service is quick and friendly as well and the restaurant itself has a nice feel to it with the decor.\n\nA+"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdW9qUFhBEAE",
            "text": "I just brought this food tonight before closing. I came here by recommendation. The food was poor in quality. I brought a curry chicken roti. It didn't taste nothing like a roti. It was NASTY. My daughter had oxtails and white rice. She found two small pieces of hair and than a third large piece of hair. A waste of money and we placed our food in the garbage."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Mm9fdHFRRRAB",
            "text": "Worst oxtail roti ever. I even asked the lady before ordering if it was good. Oxtail taste boiled without any seasoning. Complete waste of my money. And they only take cash so so much for disputing and getting your money back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbGFuX2l3RRAB",
            "text": "Hole in the wall restaurant with limited seating but an absolute gem when it comes to authentic Caribbean food. We’ve tried the boneless chicken roti and it was superb! These are family recipes and you can taste it. Great place, definitely recommend it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcGNYbkd3EAE",
            "text": "I love the Doubles at the ROTI SHOP. The pepper n tamarind make it taste amazing. I always buy 3 or more. Everytime I'm on 233rd I make sure I visit the shop."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMDhXazlnRRAB",
            "text": "My favorite place away from home. The taste, the delicacy, and the most welcoming atmosphere I’ve ever been in. I’ve been coming here since I was a teenager just coming off the islands. The food alone will have you in tears. I remember when grandma was running the store (I use to call her grandma) and I was short on my money for a roti and grandma come darling it’s ok come get yuh roti. Family oriented is what’s makes this place great and the food nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNjR2YjBnRRAB",
            "text": "The curry had a chalky taste and texture. The portion of meat was a good amount, but the roti skin falls apart too easily. The doubles had a nice peppery flavor. I waited awhile just to put the order in, because no one returned to the front window after taking the last customer's order for about 8-10 minutes. Their menus are on a series of monitors but too high for me to see clearly, but I wear glasses so I guess it's fine for others. They have a lot of tall plants around the front windows for aesthetics but I don't see the point. It would have been better to have a bench for waiting customers."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aU51V0J3EAE",
            "text": "I've only had Doubles from here and they're amazing!\nUpdate: 11/6/23 went back for more doubles and they are STILL the best doubles you'll ever have in your life OK!! It was so filling, like a chick pea patty. Perfectly sweet, perfectly spicy, they have some type of relish-like stuff that adds a nice crunch.... This is really the best!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ1pIY0J3EAE",
            "text": "The boneless chicken roti wasn’t boneless chicken it was chicken breast roti. Not what I was expecting and to top it off the roti was very dry and the chicken breast as you would imagine very dry as well.  Roti was not the best. The tamarind balls I got I was not expecting garlic in regular tamarind balls. The tamarind ball wasn’t even sweet the garlic was over powering the flavor.  Never again. . I also ordered doubles and they were very good. The goat roti, the curried goat meal and the curried chicken meals were all okay. Overall, Food was okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MWZpTTZ3RRAB",
            "text": "Their menu is jam packed with various Caribbean delicatessens. Plus its affordable as well. There are meals, snacks, Caribbean juices, and lots more. I would most definitely recommend it as a must visit! Your taste buds will thank you later."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NE9udjNnRRAB",
            "text": "We have been going to Ali's for years, so long that we have gotten to know the owners and have became regulars on the occasional basis. Ali's have always been slapping, with great portions, soft Roti and great curry to go with it. Sometimes I've ordered just the Roti with the curry sauce (Minus the meat) and they have never minded accommodating that request for us, nor have they tried to beat us over the head with non-listed fees for ordering it that way. I'll continue to give them my hard earned money, as they have always treated us great and the quality of food is consistent. Furthermore, they have very reasonable prices and are not stingy with their portions. We are waiting for the re-opening! Please stop starving us and come back Ali!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiby0yeVFREAE",
            "text": "Great vegan and vegetarian options at this restaurant. The double ups are legendary. The prices here are exceptional as well. Whether you get something that costs $2 or $15 etc, I doubt you'd be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOLVltNWdRRRAB",
            "text": "Best doubles I ever had! We are from Brooklyn and had to make a drive up to the Bronx, we randomly stopped by Ali's Roti Shop and ordered doubles. Each bite got better and better. And Brooklyn has some good double shops but wow, their doubles are on a whole other category. I heard there is one location in Brooklyn, 🤞that they are just as good, if not we will definitely take the drive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidHJPQ253RRAB",
            "text": "July 2024: Curry chicken boneless, with Dhalpuri,  Curry chicken w bone in- extremely tasty.\nMust try both dhalpuri and buss-up-shut, very tasty.\nDoubles, with slight pepper, soft and my family loved it.\nAlloo pies are  massive ....like a whole meal.\nVery reasonable,  would definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N3Q2NFJBEAE",
            "text": "So let me start off by saying that there is no sitting area at the shop so if you really hungry and cya wait to eat the doubles and stuff, then too bad. Okay, now as a born and raised Trinidadian, I love Doubles and was very excited to try this, being that where I live, everything Caribbean is far from me, I was in the Bronx that day so I said I had to try it.\n\nThe doubles had a weird taste to it, and I fully understand that Trini have Indians and is they who usually make doubles and stuff, but it almost tasted like Bangladesh/Pakistan/Indian (from India itself) food, I have no issues with other culture foods, but that was NOT the taste I was expecting. And it was fulllll of chana, I asked not to put too much of it but the chana was very extreme. I ate plenty doubles in Trinidad where they did not put chana AT ALL, just the sauces and spices and it taste well good. I ordered pholourie and aloo pie as well. The pholourie was just okay with the tamarind sauce, but the aloo pie did not taste good and it was so thick and dry with a little bit of potato (aloo). Not to mention the solo, omg it was flatter than a pancake, no carbonation at all, it tasted like sweet water.\n\nI honestly wanted it to taste good but mighty God of Daniel, they need to do better. I will NOT be retrying them again, nor will I try their other locations. Food = 3/10. Waste of money!!! Thumbs down!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWNTlLc3h3RRAB",
            "text": "I appreciate the upgrades, but unfortunately, the quality of the food remains poor. Despite trying a variety of dishes over the years, I have been consistently disappointed and have waited for improvements each time I return, but to no avail. This restaurant can not be considered authentic, and if you are in need of roti, it may be your last option, but otherwise, it's best to keep moving."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREay1MYWVBEAE",
            "text": "The texture of the roti skin is unique."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cGJpbVdREAE",
            "text": "I love their doubles. 2 dollars for 1 double and is very filling. I eat the doubles for lunch when Im working in the area. I love the tamarind and mango pepper sauces. Great Trini food here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbEwyVDRBRRAB",
            "text": "De atmosphere was real nice, light, breezy, and clean. De service was cool but ah order one chicken curry wit channa and aloo and a buss up shut, and end up walkin’ out with three big ol’ orders dat cost me $40. Dat was real unnecessary but dey already pack it up, so ah just take it. De flavor was missin’ somethin’. Ah not sure if dey even cook de curry properly, taste more East Indian than Trini. De buss up shut was aight. Plus, had to sprinkle some salt and plenty spice. Trini food with no spice? And now ah stuck with three big orders. If  ya still want to go and you ain’t got cash, don’t."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINTdmWnVBRRAB",
            "text": "It's been a while since I've been here since they closed. I'm glad to see that they are open again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcDhHQ1NnEAE",
            "text": "Ordered doubles and saltfish and bake right when they opened on a Friday. Doubles had hard channa and barely any seasoning, also no Peppersauce when I asked for it. Saltfish was unseasoned and tasted like someone made it lazily just to say they had it.\n\nAlso ordered some peanut punch which was also lackluster. Overall I don't recommend.\n\nI was hoping to find a good doubles spot in the bronx but this was a huge let down. Definitely go to Queens to trinciti or Singhs for the best doubles."
        }
    ],
    "reviews_count": 71
}