{
    "name": "#1 Sabor Latino Restaurant",
    "place_id": "ChIJo4cYeifzwokR47ZEx-0_7GY",
    "grid": "BX12",
    "address": "4120 White Plains Rd, Bronx, NY 10466, USA",
    "rating": 3.9,
    "user_ratings_total": 346,
    "phone_number": "(718) 653-2222",
    "reviews": [
        {
            "date": "3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SVkydGljMUZmYUdoR2IxZDRaMXBDV21oM2FFRRAB",
            "text": "La comida super cara\nUn sancocho con  un arroz de vaso pequeño 11 dólares, el sancocho sin carne solo una alita y un gordo de cerdo y el arroz desabrió y apatado mas un mirisoñanfo que estuvo más o menos por $8 dólares… súper decepcionada, primera y última vez."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNGNEQmZMV3ROU21wak1XbzFRVlJVU21RMGFXYxAB",
            "text": "Comida deliciosa, las nenas que atienden muy amables !!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTE1uQkpSazh5ZWpaVlpGbE1iUzFFYnpKUFEwRRAB",
            "text": "Pedi un chicharrón de pollo malísimo y unos plátanos maduros ahogados de aceite  no me gustó nada"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veVRTMVpOSFpuVlRGaGFIVlBTMUpKU2t4NWNtYxAB",
            "text": "It had very friendly service and clean."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMmNteHBRVFZDVm1KNGMyb3hVUzFuVWxNeFdGRRAB",
            "text": "This is where I go when I feel like having some Spanish food.   Not pricey, and within walking distance."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKU1JFOXhWMlpFV1ZOVVFUazFOR1JRZG1rd2FFRRAB",
            "text": "Una vergüenza para la comida Latina, nada de Sabor ( habichuelas pura agua ) y el pollo Horneado apenas sabe a caldo de pollo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQWEF1X1RzNjdmNDhBRRAB",
            "text": "I ordered a basic lunch order white rice, beans and boneless chicken chunks. The rice needed salt and was mushy. The beans was had almost no flavor but the worst thing was the chicken\nChunks. The chicken was very oily, a weird light color and the texture inside the chicken was not cooked. The food was not worth it. I don’t recommend this food especially since is a Dominican restaurant serving Spanish food. Very disappointed. I ordered from uber eats and will not be ordering from here again."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQ296TWFpdWNLeHdnRRAB",
            "text": "Love it. Me encanta, muy buen servicio y buenos precios.\n\n5 stars"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHVHWlJBEAE",
            "text": "They have very good food. I recommend the $25 combo with  the rotisserie chicken"
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJX0luN19RRRAB",
            "text": "Pa no pasar hambre se presta"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cWVucHJ3RRAB",
            "text": "I'm noticing alot of Latin restaurants in the Bronx are slacking. It's obvious these people don't want to be there by how the food tastes. The food was not good at all, I threw out most of it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReEl1V1JREAE",
            "text": "I love the food here but the customer service is real bad this lady vivina G was very rude to me but the minute she seen someone she knew it was all smiles and hey and blah blah was ignoring my order and the minute i kept saying i want some she kept rolling her eyes and kept talking to the lady she knew im pregnant and i feel like being rude to pregnant women are very rude when i come here everyday i seen different womans the other ones ate very nice but this one is rude also music is way too damn loud they can barely hear people i get it at night but at 4pm is too early for loud music again i love the food here come here every day but she gotta respect"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMk1Mdk1nEAE",
            "text": "Yfood was good and the service was great and a very friendly atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbkxTWDJnRRAB",
            "text": "Their chairs could do with cushioned once and they need more heating during winter"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQb01mcVNREAE",
            "text": "Está demasiado rica la comida y me encanta comprar siempre"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuM19YTEFREAE",
            "text": "The food is good but they don’t give you what you pay for. One day they can give you more then what you actually paid for then other days it’s a total scam! I paid $12 for a pernil and got more then what I paid for, now today I pay almost $20 for a dinner and got a portion for one person!!!! Because I ordered as a pick up and didn’t realize until I got home I couldn’t do anything more than this review!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMFl5TlpBEAE",
            "text": "La comida de ahí muy buena tengo 7 años ordenando ahí, pero el tiempo es demasiado van varias veces que me la hacen y hoy llamo alas 3 y son las 5:57 y todavía es la hora que la comida no llega y llame alos 30 minutos que hice la orden y me…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLVpQQS1nRRAB",
            "text": "Best Latin food I've had in NYC by far. Brought back memories of my family and friends growing up.  Totally recommend for that #1 Sabor Latino! The flan was amazing, and the chuletas were fried like bacon, amazingly delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM3RhNkx3EAE",
            "text": "Got chicken in rice.it was like eating sandpaper the chicken was so dry and the rice and peas lacked flavor if i was blindfolded i would of thought i was eating plain white rice terrible please dont spend money on this food avoid this place please i spent $13.00 on it.THE WORST"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibU5yZFBBEAE",
            "text": "They a customer services course all those ladies on the front desk they never greet anyone perfect example today I walk in they are talking among themselves or to man then was my turn she said Que le sirvo y después que clase carne y yo ordene un pedazo de aguacate pregunto algo más yo conteste no gracias la otra persona en la caja le di mi tarjeta me cargo y no me dijo ni las gracias por vernir .llego a mi trabajo no aguacate después de $9.00 ese sitió necesita un customer services training but asap"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX0l5WG5BRRAB",
            "text": "🥰🥰🥰🥰🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbThlNkh3EAE",
            "text": "The food was seasoned very well & it's Tasty ...."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5enVfUDN3RRAB",
            "text": "buen servicio"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkM18tTi1nRRAB",
            "text": "Me encanta lo recomiendo y los precios muy buenos 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NGNmclBnEAE",
            "text": "Got some pepper steak and brown rice with plantains... $10 lunch special... Food was great and the price was good will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOLThlUHZRRRAB",
            "text": "I used to come here with my mama when i was little great food"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeWJIY0Z3EAE",
            "text": "Great attention"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbHZhQjdRRRAB",
            "text": "The food is not great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMmRxQXNBRRAB",
            "text": "Its a really nice place to go Very friendly n they treat you like family members"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOVpubU5BEAE",
            "text": "The food was delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcjVPakNnEAE",
            "text": "Food was good 👍  but price is litle high"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN19tblpBEAE",
            "text": "En este lugar no hay comida. Está vacío"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNW9YdkVnEAE",
            "text": "Great place to go Very friendly\nAnd they treat you like family"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXJyTWh3RRAB",
            "text": "Good food and fast delivery 👌"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eWM3bUZREAE",
            "text": "Buenos días no sé por qué cambiaron el horario no a afectados a todos los clientes que vamos hacia el trabajo el y vimos cerca del restaurante somos un grupo de empleados que no a afectado incluso Ee escuchado a muchas persona del área que dicen que a afectado ese cambio de horario eso le da un negativo al negocio pero tienen excelentes servicio pero daría pena que ustedes como dueño del negocio no se dan cuenta"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dklpWGNnEAE",
            "text": "Very nice place"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaGNlU1ZnEAE",
            "text": "El servicio mas horrible. Hay una chica con una cara de perro y una actitud que parece que le hiede la vida.  No quiso hacer nada de lo que le pedi y para el colmo nunca fue a mi mesa a chequear si necesitaba algo…. El peor servicio POR FAVOR NO VENGAN A ESTE LUGAR!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOU9UUktBEAE",
            "text": "Food delicious delivery fast Plenty of food with left overs Worth the price 😋 Highly recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOXRmT3p3RRAB",
            "text": "The best"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydDZIY2dRRRAB",
            "text": "😋😋😋👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMXN6M25RRRAB",
            "text": "Everything I’ve ordered from here has been delicious! Only thing I recommend is them updating their menu prices online. They do not reflect the current prices."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtajlHa0dnEAE",
            "text": "El verdadero sabor dominicano en NYC."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNk1YZ2RBEAE",
            "text": "Just ordered from this place (via grub hub) about a hour ago and felt the need to write this review about my experience immediately. Fried chicken chucks were hard as rocks, the chicken was clearly old and refried. Stew chicken had a pungent smell and tasted as if it been sitting out all day. My fiance had the Fried Chicken Chunks and shes seems to be fine, i had the stew chicken and I'm currently on the toilet suffering serious stomach pains. My fiance contacted grub hub and the representative didnt seem to care much. He kept offering a $10.00 credit to put toward our next order, we spent  $40.00 and gave the delivery guy a $5.00 tip (wasn't his fault they gave us old/bad food) we will NEVER order from this place or grub hub again."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBemNYZ0pnEAE",
            "text": "Ordered through grubhub today and it came quickly, hot and the super cool & friendly delivery guy even came to my door!! The portions was great and delicious for the price.. I'm glad I don't always listen to other miserable reviewers .. it's a hole in the wall Puerto Rican  restaurant in the BX what kinda 4star treatment and food y'all expecting! .......\n\nUpdate: I went in the very next day to get some more of that delicious fried pork.. I'm not Latin I don't know what it's called and how it's served so I said I want it however the Puerto Rican's eat it (some how I thought i saw somewhere that it was a PR restaurant). The old maid behind the counter says \"firstly were Dominican, second when u know what u want let me know\". I was so heartbroken and disappointed after such a pleasurable experience the day before then dealing with this today.. I just walked out!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReU1TR3R3RRAB",
            "text": "TERRIBLE DISGUSTING OLD CHICKEN! The chicken was so old and hard I could not even eat it. Wasted over 30 dollars on 2 orders. Chicken was also very brown inside, no pieces were white fresh meat only DAYS OLD REFRIED MEAT"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbDludFd3EAE",
            "text": "Went here for breakfast on Sunday Dec 1st, ordered the mangu with just onions, $3.25 for the small, so not worth it, the container was not worth that money."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Mkl2N1NBEAE",
            "text": "$9.75\nWith a drink,\nVery good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtczZ6enNnRRAB",
            "text": "This place use to be one of my favorites. I would come here after work and grab a bake chicken lunch special. For months now, the food is different. My portions are small, even served with more bone than meat. I live in the area and I thought this place was my to-go-to. Why should I get served very dry bake chicken. Looks like I’ll be traveling to the south Bronx now."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURraklTVkx3EAE",
            "text": "If I could give less stars I would. I ordered food from this place thru GrubHub and after an hour and a half of waiting (the place is only .4 miles from my home) I decided to call and check the status of my order. I was told by the…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvX3VER0pnEAE",
            "text": "They need to better their phone skills. The pick the phone up and usually leave you on hold and there is very loud music playing .The background music is too loud to be able to take orders over the phone.\nThe owner needs to spend sometime there to improve the service."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVeHRtREV3EAE",
            "text": "They urgently need a change of staff!!! I’ve attempted to purchase food from this place in various occasions and haven’t been able to due to the neglect from the women serving food behind the counter. I have attempted to order food to go from the a la cart menu and before I could finish the fat older lady says “we don’t have that right?” To her lazy coworker and sends me packing, as I make my way towards the door visibly upset another lady yells from the back “ we have to fry it for you” I guess she was the only competent employee working there(the slim attractive lady) at that point im over this place. the other two are terrible and look disgusting to say the least.  Please get new personnel!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN3QtZFZREAE",
            "text": "This restaurant charged me $19 for an order that I cancelled. Didn’t informed that at the time of cancellation. UberEATS said that restaurant was preparing my order (white rice, beans and bake chicken) food that they sale every day and…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMkxfWmhRRRAB",
            "text": "Mientras uno está ordenando el staff está por allá hablando de su vida personal, cuando llega el delivery me faltan jugos, siempre falta el limon, 15$ Por un salcocho sin arroz, la verdd no vuelvo a gastar un peso ahí. And for the ones that don’t understand if you order delivery in this place the staff is always putting you on hold when you can clearly hear them talking unnecessary stuff and when the delivery gets to you plenty of stuff are missing"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNElUNHF3RRAB",
            "text": "The service in this restaurant was horrible. When we where seated the hostes just threw the menu on the table and leave without saying anything. Then we sat there for 20 minutes without a waiter came and take our order. Then a latin family of 8 came and was seated. In less 5 minutes the waitres came and take there order and left us there waiting. While she standing there she looked at us in the corner of eye because i started to get up and to leave. I will not recommend any person that is non Hispanic to go there to eat. This restaurant is RACIST!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReE9EYzhRRRAB",
            "text": "This place seems to get a bad reputation for service but if you come in with the right attitude and not as a picky or demanding eater, you'll be satisfied. Keep it simple, order from what's right there in the steam tables and you'll be…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NW9QZ3JBRRAB",
            "text": "The food is fresh and the staff is very friendly. It's like eating at home with family. That's how they make you feel and there's not a long wait for your order to come"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvNV82dFB3EAE",
            "text": "I ordered the rotisserie chk and the chk was very hard not juicy at all seem like they had it for a few days or hrs. Didn't taste good at all had to give my dog who refused it also."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBamRLSld3EAE",
            "text": "Great food, wonderful service.. Just like home made. Love the people so friendly and food comes out tastes beyond superb."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Njh6QkZBEAE",
            "text": "My fav spot. Anytime I'm in the bronx I hit them up. Rotisserie chicken with rice and beans and ajo. Amazing. They are also very reasonable I get the lunch special no matter what time I go."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbTdyNFBBEAE",
            "text": "Good food customer service could be a little more pleasant. I just felt they just wanted me to hurry up and get out. It may have not been their intention but that's how I felt personally"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRLW9LUDB3RRAB",
            "text": "Very good food. Delicious!! Good price. And big portions.. They not cheap in amount of food they give you... Also very friendly staff.."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVZ3RPTVV3EAE",
            "text": "I live right around the corner from this shop & literally walk 4 block the opposite direction for another shop.The food isn't good , it has a weird after taste and smell sometimes. I left it as is after trying 4 times - newdish each time. Im good"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMTdpbFNBEAE",
            "text": "I have had lots of different dishes from here and I have always loved it!!! Today I got a cuban and a steak sandwich for myself and my gf. I took it to go and was happy to get home and try something else from their menu!! I already knew I would be upset When i looked at the packaging. The cuban looked to be a good size for a $7 sandwich, but the steak one looked flat! (Which was also $7) I paid $7 for a sandwich that was literally one flat piece of steak and a slice of tomato and a tiny bit of lettuce. Was definitely not worth $7!!! Then my gf opens her cuban, is all happy cause she had the urge for it!, then I see her face. Since when does a cuban sandwich have ketchup,american cheese, lettuce and tomatoes?!! And no pickle!??? 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️ They get 4 stars cause theyre normally great! And the staff is super friendly!! But they need to step it up on the sandwiches! I hope they read this review. Guys, a cuban sanwich is\npernil,ham, swiss, pickles and mustard!! PLEASE get it right! And do aomething to that steak sandwich to make it worth it.  Aside from that, I love everything else!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRckktTXhBRRAB",
            "text": "Coffee was bitter. Bacon was extremely underdone, basically raw. Eggs were supposed to be sunny side up, meaning the yoke should have been soft.. Instead the whole egg and egg whites were runny. Mangu was really dry and lumpy. However, thank you for your service. Stay blessed."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDM3VDNDV3RRAB",
            "text": "Las de la mañana son muy irrespetuosas. Cuando le dices buenos días se quedan callada. La mayoría de veces te toman la orden mal. Y cuando pides el mangu pequeño Te lo cobrar por el grande. Las joven dominicana de la manana es súper…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3amVuOXh3RRAB",
            "text": "I ordered food from this place they told me it's going to take 30 min. Food came after hour and  15 min later freezing cold. I called to complain and they said that manager is not there. I will never order from here again. Food was dry over saulty and cold."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjMzluaGh3RRAB",
            "text": "This restaurant has to be the most unprofessional\nRatchet unorganized establishment\nFirst when you call they love to leave customers ON SPEAKERPHONE while you hear the outmost unprofessional side conversations & them talking amongst each other as if I’m not waiting to order\n\nSecond: if you don’t guide them towards what u want they’ll literally throw whatever on your plate\n\nThird: EVERY SINGLE TIME they forget something and overcharge they don’t get the concept of certain things going together like sancocho and rice they’ll forget the rice even after you told them\n\n4th: the staff is just all over the place\n\nWhen I first moved around here they were a go to because the food and price were decent but now they’ve just lost it"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NnBIN0J3EAE",
            "text": "Bad customer service. I ordered twice from them and both times they left the same thing out of my order. When I called and asked about it, they blamed the driver (not likely to be happen from two different drivers TWICE) and then hung up on me when I tried to get it resolved. Won’t be ordering from them again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MXFDY0FnEAE",
            "text": "The food is fresh and hot The staff\nis friendly and the place is very\nclean. I love coming to this place.\nThere prices are reasonable."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdG9QeDJRRRAB",
            "text": "If you're not hispanic , expect to be treated differently. . And their drunk male customers taking interest in you. The females will stare nosily and do absolutely nothing about inappropiate remarks ... 3/4 ppl behind the counter and you…"
        }
    ],
    "reviews_count": 70
}