{
    "name": "Roy's Pica Pollo",
    "place_id": "ChIJp5qaq4v0wokRJ1a9RJ6cBWQ",
    "grid": "BX6",
    "address": "880 E Tremont Ave, Bronx, NY 10460, USA",
    "rating": 4,
    "user_ratings_total": 966,
    "phone_number": "(917) 471-8937",
    "reviews": [
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWVMxUnBjVXRxV2xCRmFYWlpaR2d6VUhkWmQyYxAB",
            "text": "El verdadero sazon dominicano me encanta."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdVQzTlhlVzFpZFUwMk5FUXpSVkpuVVVwWGNIYxAB",
            "text": "We got a whole chicken combo rice and beans were good but the chicken was so dry like as if it has been there since yesterday it was horrible"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeU16SlFPSEJFT0VOVFptMW5SVU5TVkZoSFZIYxAB",
            "text": "Fui con mi hijo a comer y la comida fría mala salada como vieja y me cobraron 68 dólar por un servicio que lo que valía como 30"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VWMxSmpiM1ZJWTA1Q2FVRkRRV2hLT1VkcFIxRRAB",
            "text": "Excelente lugar. Muy limpio, buenos precios, mucha comida y las meseras super amables."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVVpUZzNZblk0VjJScFIyeE5NamMxT0VoWllVRRAB",
            "text": "Este sitio debería llamarse los labrones de Bronx, un servicio pequeño de res 13, ensalada de papa pequeña 6 y vasito de habichuela 4(No Arroz!)  Aquí les dejo la foto para que vean klk"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNE5HaFhiRTlOZFU1NU4yNTNPRUZLVVdGQlVIYxAB",
            "text": "Pollo frio y tostones"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTlRraGlVMmxLV21aclRXbEhkR0pEZDI5blpHYxAB",
            "text": "New owners. Too expensive..I brought a  plate of rice and pepper steak and they charged me $30.00. Never going back there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT1NEQjRXVU5hYUZOTFpFcE5SSEpyYTIxZmRYYxAB",
            "text": "I was charged $2 for a can soda the food was warm and had no flavor $15 for nasty food customer service was ok cold be better"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd0xVUnVibTB4T0dSMFgwNU9UbVpQUjA0d2VXYxAB",
            "text": "Cuando abrieron excelente pollo ayer fui y estaba malisimo el pollo nada que ver super feo"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5YVYzaHpWelZoVms5dE1ISmpNbXMwWTFJeWNFRRAB",
            "text": "I ordered the res guisad/beef stew with rice for home delivery. Although the meat was somewhat tasty there was no gravy as expected from a stew. The rice & peas was overwhelmingly SALTY. In addition the rice was very undercooked. Not edible. What a waste of money.\nI was surprised of the poor quality of this order because I have ordered from here  before. I don't normally order spanish food because I love to prepare my own spanish cuisine. I should've stuck to my own kitchen."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSWMxRkVURU5oUVV4U2RHaFVMV2xUVFVRdGRWRRAB",
            "text": "Grandioso lugar divertido buena música excelente servicio"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreVFrb3dRVGwwYzJjMWRHTmZSM2d5TkhFMFFYYxAB",
            "text": "Muy buenas comida, buenas música y muy buen ambiente, 100% recomendable"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclp6ZFNXVWN0V1dsU2NHRkthRVprU0dWTFRrRRAB",
            "text": "Buen cervicio los maximo es roy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMWJXRjFNSEZZY1RKNVVXZEhPV1IwTTA0eVJrRRAB",
            "text": "I tried calling the number to confirm if there was an age requirement, no one answered and I drove an hour to find out that there was. So my little sister wasn’t able to go in. I respected the policy, however, they need to update their website stating the age requirement."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWlp6RXpWVXM0TWs5YWJWQnhNWFZpV0ZjMVYzYxAB",
            "text": "I go past this restaurant from time to time but I regularly don't visit the Bronx"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS2JtazBNVkpTVFVwTk5sQXpUbEptWlZWQlJGRRAB",
            "text": "Me compré el chicharrón de cerdo y es delicioso tenía mucho tiempo de no comer algo así, llenó todas mis expectativas, muchas gracias."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRldFMVBkMnR2WlVOMlZUZE1hMjVXTUVWQ1RGRRAB",
            "text": "Excelente ambiente, la comida es buenisimas y el personal es de lo más amable y atento."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN2EzZXVfLUtqUm53RRAB",
            "text": "La mejor comida y mucha variedad de exquisitos platillos, si quieres disfrutar de la mejor atencion y un buen servicio visita Roy’s Restaurante. Muchas gracias por hacerme sentir como en casa"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNYk8ydTZaMWQtTHlBRRAB",
            "text": "I used to love roys but i notice every single time i order from uber eats or door dash they never get my order correct today i ordered a chicken combo in the special notes i asked for arro morro ! What did i get ? White rice and beans (not what i wanted) , i also put in special notes for the soda (coke or pepsi) what did i get ? Sprite ! I ordered two CHICKEN pastellios they send me 2 CHEESE  ! Like bro is it that hard to read? !! Maybe they need to go back to school ! I called to complain and the manager and owner supposedly was not there and they “ didnt have anyone to fix the issue”  the guy over the phone instead tells me to come to the store to change it ! Like i clearly ordered from uber eats for a reason ( my personal reason i can not make it into the store)!\n\nTHE OWNER OR MANAGER NEED TO GO REEVALUATE THE EMPLOYEES THEY HAVE AND MAYBE FIND SOME PEOPLE WHO SPEAK ENGLISH OR UNDERSTAND ENGLISH READING !\n\nThis is not the first time this has happened to me last time i went to the store and flipped but i shouldnt have to do so !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMYk9ncUdOMmZmMlFREAE",
            "text": "If you guys don’t know how to make sancocho then don’t sell it it barley had any root veggies they literally just put one piece of half a yuca and a sliver of a platano with a slice of carrot if you guys know what sancocho is suppose to have then why do you send such a poor product to the customer I literally pored the stuff in a plate and that’s all that came with a whole bunch of broth and that’s it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUtUR0x3EAE",
            "text": "My family and I have been big supporters of Roy since they were a tiny chicken spot on the corner. Recently they raised prices and started skimping out on the food. We ordered 2 pepper steak combos tonight and the amount of steak compared to what they used to give us is abysmal. Spending $74 on two combos should at least have enough steak to cover us all instead we got skimped on the order. I’m very disappointed in this order and after a few other bad interactions (wrong items sent), we will be taking our business elsewhere. Good Luck to you all, make sure you double check the portions and quality of the food when you order."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGVyQmd3RRAB",
            "text": "Great service. The food was meh but the drinks were good. Bartender was great. Place was clean."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNG9uOUVnEAE",
            "text": "Went there once with the family to order out and there was a rat running through the food like he owned it.... NEVER AGAIN"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGFIcjVRRRAB",
            "text": "Good."
        },
        {
            "date": "수정일: 8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyamJ1Wm53RRAB",
            "text": "Cambiaron al Chef, La Yaroa no sabe igual que antes. El queso es diferente. Le hechan mucho maduro, poca Carne y Queso...horrible....no la compren. Y si el Jefe del restaurante Roy ve esto. Que le llame la atencion al cocinero!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOHBtTjBRRRAB",
            "text": "My husband stop to buy a quick dinner after work bought a whole chicken and beans. Well I was very disappointed as soon as I got home. First and last time buy food from here. Chicken mad old and dry. Beans don’t even look delicious. Never again"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb1puLVV3EAE",
            "text": "They charged me 9 dollars for a ham and cheese sandwich and it only had one piece of ham and I can’t barely see the cheese or taste it, mostly taste the bread. The cubano sandwich also barely had meat. Over charged barely any food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb2NqZ1Z3EAE",
            "text": "I order here a lot. I ordered mofongitos and they didn’t cook the plantain right at all it looks like they didn’t care and just made this however way. I call back for cooked food and they said no more delivery at 8:00 and that’s not when delivery stops."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQb3A2TkdREAE",
            "text": "Tiene una delicadeza  muy exquisita en todo ambiente"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNm9LbFZ3EAE",
            "text": "I gave them a call to ask about a rice they made, and when they will make it again. They said they don't now, I was not finished talking to them and they hung up on me! How rude! Plus I order from them alot! I'm very upset 😡."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeXN6N3N3RRAB",
            "text": "La Yaroa ta buena👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMjRuM0tnEAE",
            "text": "Food here is delicious and always they had different options 😋 I really love the vacalao guisado."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidzRlbVVBEAE",
            "text": "The formula has cut my hair, I am happy with your work, always perfect, fade juan"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaXJDR3h3RRAB",
            "text": "Good food for lunch"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURib01tV1dREAE",
            "text": "Es un ambiente bueno la\nComida también disfruten de algo caribeño a todo dar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeXIyamVBEAE",
            "text": "Very good food and delicious cocktails!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbDdudklBEAE",
            "text": "Roy's is an excellent restaurant in terms of both atmosphere and food. The restaurant has a section for quick take-out food at a cheaper price and a sit-down area for a more formal meal. The entrees on the menu are around the $20 range…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaUludmxRRRAB",
            "text": "I love this place, music is good, food is great. Food was ready pretty fast drinks are er reasonable price. Wish I could give more stars"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbXZha213RRAB",
            "text": "This places food is so good. But they lack organization and they never read the orders. Always forget something never give the sauce u pay for never give utensils. Never close the packaging correctly so there is rice all over the bag. It’s…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJX2YybXFBRRAB",
            "text": "I been in my neighborhood for ten years   Many restaurants in the area.  Today I ordered a Quesadilla Which is a Mexican dish. This place clearly do not know how that looks. Dominican restaurant should stay in their lane   no sauce no dip . This poor representation of Mexican food   Roy's do better"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcWJXZlNREAE",
            "text": "The food is not bad but they didn’t do the chicharon fresh did not like that"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MU5QNHpnRRAB",
            "text": "Supuesto chivo, 17 $ no tiene nada de delicadeza, el arroz horrible.. el bistec solo sabe a salsa china y la carne vieja"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeVBIZElREAE",
            "text": "I love the food! Great attentive staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MjVqWXRnRRAB",
            "text": "Ordered chicken, rice and beans for myself and the chicken was cold the sweet plantains were thick and hard. My daughter ordered pork chops and it was dry and hard. Would not go back. Change the cook and how they conduct keeping the food warm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NV96a0Z3EAE",
            "text": "I go pass here all of the time on the 36bus going to Westfarms in the Bronx , but I have never entered there.  It's a Dominican Restaurant and it is nice in there because I peak in the widow sometimes  , and lots of Spanish people be going in and out of there everyday  . I like it  👌…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bjdHaUpnEAE",
            "text": "Roy’s Restaurant is sooooo good. Everything on the ready-made line is super delicious and tender. I usually come for lunch and it can get packed but it’s so worth it. Mouth watering Dominican food right here 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCME82MVdBEAE",
            "text": "I went on a Monday for drinks only.  My margaritas were very nice (served from out of a machine).\nI noticed everyone else was just smoking hookahs.\nIt needs a little touching up - a bit outdated.\nIt's in my neighborhood, so it was a last-minute convenience."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dHF5ZXZ3RRAB",
            "text": "It was ok. Ordered a whole chicken combo with a large white rice and beans, salad, soda for takeout. They put everything together right in front of you like everywhere else. The food was...good...not spectacular but...good. Price was pretty good so no complaints there. It's also right on the corner so its easy to find."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOUpLVVJREAE",
            "text": "The food here is delicious. The staff is very cordial and knowledgeable about what they have to offer. Drinks are good. Hookah service and price is reasonable. I especially enjoy the presentation of the dishes once they arrive. Great environment and atmosphere. Management is also on point with customer service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtN0tDenZBRRAB",
            "text": "Used to be good. Now They forget items in orders and the delivery drivers act like they cant take the elevator and bring the food up to your door. Then have an attitude when you do. Won’t be ordering from them anymore ✌️ the salmon was disgusting (picture below)"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNVl1ZEJBEAE",
            "text": "The beers special is nice. The place overall has a nice welcoming but laid back ambiance. The prices were a bit overpriced for the place, location, service and menu. They doesn't have the best selection of beers but it is ok.\n\nRoy's in my opinion is more like a bar and lounge type of place, that wants to be a restaurant but doesn't offer a good variety of dishes nor drinks. Unluckily, they have poor service, extremely dirty bathrooms and a lot of room for improvement. And thankfully they had karaoke night, because the place was boring before the people started singing. I'm not the best singer, but I love karaokes and the host was very warm, friendly and welcoming, which I liked.\n\nI looked at a couple's dish and it didn't seem to be fresh, so I went to the Papa John's pizzeria that is -thanks to God- just a few steps away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeTh6NWNBEAE",
            "text": "Juicy, flavorful, tender. Perfectly seasoned. A must-try dish for chicken lovers. Satisfying comfort food experience. Deliciously satisfying!\""
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN3NtMV9BRRAB",
            "text": "I ordered beef stew. It was so salty and no flavor. Also paid for avocados which they didnt include, and the bananas were disgusting. Honestly this food was barely edible. I never write reviews but the food was so awful I had to. Also the reviews are inflated, there's a dude that writes \"great spanish food\" over and over."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOVBxVWtRRRAB",
            "text": "The service by Anna was on point. Spent $150. Ten minutes after I paid the bill, and my lady was enjoying the music the owner Roy told us we had to leave because he had other customers waiting.  Meanwhile others spending less on hookah were…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bE8tZm53RRAB",
            "text": "This place always has hidden fees! Make sure when u order from the menu they charge that price cause there are 3 different menus/prices and don't tell you anything! The food is just ok I've had better."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxal91MFRBEAE",
            "text": "Fue mi primera vez ordenando en este restaurante pero mala experiencia primero se tardaron 1 hora en traer el pedido a mi casa y 2 lo peor la comida que ordene terrible una sopa de pollo que lo…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxZy1Pb0tREAE",
            "text": "Their picaderas are delicious... Other platters too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGZ1Tk5nEAE",
            "text": "Horrible place. They have lots of hidden fees. They make you pay 15% tip mandatorily and even charge you service fees for nothing. Never going back there again. I also feel they racially profile customers based on my exchange with one of the guys there. I wouldn't recommend at all."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eTdLU2Z3EAE",
            "text": "Love the owner and the sheer variety of foods to choose from. Great community asset and popular weekend spot too. The owner is a young, responsible community entrepreneur. Great young man. Need more of him not just in the neighborhood but in the country. Please continue to support this business."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N2VLeFZnEAE",
            "text": "I've been ordering  from Roy's in uber eats. The food quality it's always on point. Always fresh, super tasty, big portions and the $$ it's right. For those who be looking for some good Spanish food and are a little skeptical about where to order from (like me) this it's the place you MUST try."
        }
    ],
    "reviews_count": 60
}