{
    "name": "Çka Ka Qëllu",
    "place_id": "ChIJddi0Qof0wokRQGSTDJMZzHc",
    "grid": "BX6",
    "address": "2321 Hughes Ave, Bronx, NY 10458, USA",
    "rating": 4.8,
    "user_ratings_total": 1343,
    "phone_number": "(718) 933-6194",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VWJFMTVZa1UxYnpSVlYwaGhXa04yVUhORFVIYxAB",
            "text": "The food was amazing. The place is very cozy and it is decorated beautifully. The staff is very nice. 100% recommended"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcGFGSlhhRTlpTms5eVprSlJZMVpHZFhOUWExRRAB",
            "text": "This was a surprising experience, as we had expected Mediterranean fare but discovered Albanian cuisine instead. Everything was fantastic - the food, service, and location. I recommend ordering a few plates to share so you can try a little bit of everything."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRmNYa3lUMEl6Y1hSQ2VUWlpjVzFEWVV3NWJIYxAB",
            "text": "We had never tried Alabanian food before so weren’t sure what to expect. The food here is so delicious, you can tell it is made with love. We ordered beef mantia, grilled lamb, and fasule. Every dish was amazing. Highly recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdVRqbEROemt0TkRsT1gwYzBWMGN3TkZoc1ltYxAB",
            "text": "The Good\nThe food: overall great - our first time eating Albanian, but we tried many dishes and loved some. Particularly, the lecenik, and the suxhuk + qofte from the grill were delicious!\n\nThe Bad\nHostess: Opentable had a million open reservations, so we just walked in Sunday 530pm. But the hostess said it was full with an hour+ wait, or we could sit outside. We chose to brave the cold, but she said she would bring us inside if anything happened to open up. That was nice! Except there were at least 4 tables that cleared and were given away to other parties before we caught one and asked, and THEN were finally moved in. Upon arrival and until we left, we spied quite a few other open tables that stayed empty. That honestly felt like shit.\n\nThen one time, she came by to get us fresh plates when some food arrived, which was nice, but then she took our dirty ones and fully disappeared - so we sat staring at our food with no utensils/plates, no sign of anyone, until she eventually walked back in, saw us, and then remembered. It also took her 10 minutes to get our check after we asked. Either she was very distracted or we had offended her, and I honestly don't think it was that busy tonight.\n\nKitchen: food was extremely slow - we waited over 30 minutes for the baked cheese, and another 10 for the lecenik, and another 20 after for our mains.\n\nOur Branzino was completely RAW in the center. Not even close to cooked. They did send us a new one, but it's just unfortunate since a whole fish takes time to grill.\n\nThe Baked Cheese dip is a whopping $16 for a tiny amount of feta + olive oil + seasoning. That's the entire dish - at most 6oz of feta. I've never sent a dish back to the kitchen but damn I was close.\n\nService: when we first were seated outside, no one came to check on us! We took our time lookin at the menu, but they fully forgot about us, so we had to go inside after 20 minutes to ask to order. We had to constantly flag people down to fill our empty waters or ask about missing/slow dishes. I don't want to be a problematic table, but it sucks to have to hunt people down for food and water in a restaurant. Obviously, a whole new grilled fish took time, but we weren't just leaning back, slowly dining and indulging. The entire dinner took THREE hours.\n\nOverall:\nFor me, food is the most important part of a restaurant, and I had high expectations coming in - and they were met! I would happily come back and eat, if not for the outrageous number of issues with service/the experience.\n\nI try to be understanding of when restaurants get slammed, but they didn't look like they were even close to capacity, so I don't understand what happened tonight, but we left pretty disappointed."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOamFVMVlTbWhTVEVOUmNETktjRzlZTm5GNVpIYxAB",
            "text": "My first experience with the Albanian authentic restaurant. Very nice atmosphere and vibe, very nice decorated, great personal. But probably Albanian cuisine is not my favorite. The food was extremely greasy, or may be I ordered wrong dish. My expectations were it would be something like mideterrenian but way far from it. Well bad experience it is still an experience. It's pure subjective opinion, it would be great place to visit, just be mo prepared. Coffee was just amazing!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cWVuWmFjMEpmT1VRdFNVZHRMWFZvVDBOMFRIYxAB",
            "text": "Northern albanian cuisine. Great food , great wine."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdGFXcFBjbHBVYlZwUWRGUndaM2xuV0VRMU1XYxAB",
            "text": "Great food, with great service. The ambiance, the interior of the restaurant is authentic making the whole experience extra special."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMVJrZDJSMFU0T1VnMVNrVjJVRXAyZFVkRGNFRRAB",
            "text": "This place was absolutely incredible. We will definitely be coming back here. They also have two other locations (which we haven’t been to, but will definitely go to).\n\nFirst off, stepping into this restaurant was like stepping into an old world restaurant. There’s a really rustic, charming vibe that is absolutely transportive.  We went for dinner in the middle of the week, so we were the old table while we were there, but the staff was so lovely and attentive. They definitely have a lot of pride for the restaurant and food and I get why.\n\nNow on to the food. Wow. The food was amazing and the price was so wildly reasonable. We started with the sausage dip, the pickled pepper, and the sesame baked cheese. The pickled pepper had the perfect bite to it and was a little spicy (think how a banana pepper is spicy) with great flavors for the veggies inside the pepper. The sausage dip was both familiar and interesting and so perfectly delicious. It came with these warm bread roll things that were steaming when we tore them open. The cheese was also nice, especially paired with the bread. We also had the Fli which is kind of like a baked layer pastry dish served with a feta cheese and was so good.\n\nThen we had the fasule with suxhuk. It’s essentially a white bean stew/soup with a type of sausage in it. This was so hearty and comforting. I could eat a bowl of it in front of the fire on a winter day. It was simple with a depth of flavor that was on point. We also had the grilled octopus, which was cooked well and very delicious.\n\nOverall, the meal was an absolute delight and we truly had a great time. Everything from the ambiance to the service to the food to the price point made this place an absolute must visit."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNmQyaHJXa3hSYlV4dU1tUmthVmRYZFZwdFUxRRAB",
            "text": "This place is cute and traditional but the food isn’t to die for. Try cooking the meat all the way through and tell the blonde waitress not to make eyes at people’s boyfriends. She’s gona get it next time it happens"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVVVsZHdjSGx5Y214MFVGaHZSMVEyVmpGMFYwRRAB",
            "text": "Great people, great service, best in NY"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CelMwMDVMVGMxWTJobFRIUkhNRTlFZFRoUU9GRRAB",
            "text": "Godddddd if I could give this more than 5 stars I would. LOVED EVERYTHING from start to finish. Fantastic. Thank you!!! Such amazing food and ambience and service - just everything"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVlYwWXlhWGR1ZW14WVQySnZRakE0ZEdSdFVFRRAB",
            "text": "Vibes were emaculate! Food was delicious and service was top notch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVU5uRlFabFJwTUUwNVh6Sk9lbVpZT0RsTWExRRAB",
            "text": "Holy moly! I really needed to get out of my midtown apartment, got on a random train, and somehow ended up at this gem. I had the pepper dip and stuffed cabbage. Everything was extremely good and all new to me, even the crispy and puffy bread.\nGreat decor. You'll want to add Albania to your travel list after this."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVlJtZHBaRmhqVWxwRU9YcFBTMmd6WVVVMlgwRRAB",
            "text": "Lovely place, amazing food and the personal is so polite and professional. I strongly recommend this place. Thank you guys for making us a delicious Albanian dinner."
        },
        {
            "date": "2달 전",
            "language": "zh-Hant",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTlZ6ZGFUVk15V0ZCcWMzVlVVMEpKWHpCbVgxRRAB",
            "text": "店內裝潢很歐風很漂亮\n食物口味都帶點微微的酸可能還是吃不習慣 甜點比較合我們的心意"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVlXTjBRVGRCVVVGNVdUaDVabkJtU1RCd1FrRRAB",
            "text": "Very expensive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab2FXRk1NMjFLU1daTVpVSldWWFJVY1VWRFdXYxAB",
            "text": "I am a regular customer and I was with a friend of mine for dinner at 9:40 we had dinner and I asked for coffee he said we are closed we don't serve anymore and in a high voice that waiter guy was from Albania not from Kosovo with long hair and a beard his name is Nick I remember and he answered a lot and in a high voice as if he was putting pressure. Albanian being Albanian and I was Albanian and at the same time the bar was full it's not that I was the only one in the bar I have never done a review but I am ashamed to have that because I don't find anything these kind of workers don't need a restaurant like this when I came out I asked the manager I said do you have coffee or do you have flour no he said we have coffee i.and in the meantime I left the guy even though he behaved like this with me I left 20% of the bill and this happens today at 9:40 minutes every Monday and this happened today at 9:40 minutes every Monday and this happened today at review to see the owner have respect for Albanian customers then there is no problem for me but I wanted to express this bad thing that happens to me that when it is open I am in the Bronx every week but what happens to me in this one in Manhattan that I don't go oft"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRGF6SjBjRkV0Y1d0b1RXczVNbnBqZW1WWU5YYxAB",
            "text": "Love this restaurant, the food was delicious and service was fantastic!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bVJVSkRXRzV1VmpKS1JUWmZWVVZZV1doR1pGRRAB",
            "text": "Amazing, dinner for two. Delicious flavors, familiar yet different. Excellent service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTVdHTTVaVlJNUlMwd1N6VllOR0pmTUZwaVYzYxAB",
            "text": "Food was amazing!! Felt like I was eating back home. The servers were very attentive and so kind."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdE5YVlpabmcyTXkweU5sSkpZbGhGU2xsNlNIYxAB",
            "text": "The food was spectacular! Loved the presentation as well as the delicious layers of flavors and textures.  The staff very knowledgeable and patient. We were there late beyond closing.  There was no hint of rushing us out. Very comfortable setting.  Not expensive at all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS1VIUlBWbHBKVG1KRWFtTkVTM1ZKYld0MlJrRRAB",
            "text": "Absolutely amazing meal! A gem in Bronx Little Italy, and not even Italian. Service was personable and on point. Food is an amazing value and delicious. A must hit when in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STk5EYzJRM1J5WTJGdU1YWk1VM2wwVVZFdFJsRRAB",
            "text": "Fantastic!  Great bread.  Terrific entrees.  Must visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SS2RsbE5PVVZHUWtKdmFFazRSMG95VkdFeE5HYxAB",
            "text": "Fantastic experience for the food and services"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcFNGVlZOVTlIU0RSUmNUbFpObUUzUlhJNVgwRRAB",
            "text": "Excellent cuisine, attentive service, beautiful interior."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUlJGWlhXRFpxTFhBNVRIUTVXWFUxWmtOUk5YYxAB",
            "text": "Great authentic restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU2JXRXhkVEowYjA1WU1scENOaTAzUWxab1ZsRRAB",
            "text": "This place is amazing. The atmosphere is homey and cozy. And the food is first rate. Rich and flavorful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dVVXOWFTbmcxYUdoaVh6UkNkV2Q1UWxoTFJXYxAB",
            "text": "Our experience was amazing! The place is very cozy and the food delicious!! Ema gave us the best welcome and service :) she is a sweetheart"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseGEzaEtRbnAzUmtKT1NFRmFiMUppU2s5RGFtYxAB",
            "text": "My friend introduced me to this Jen of a restaurant off the beaten path in the Bronx. The bread is out of this world fresh baked)! We had the grilled octopus. Grilled to perfection and a dish of cheese and meat , Qofte Shari.   Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVlVHZ3lkVU01VkdaSFpGWmpkbGwyWlRWd1pXYxAB",
            "text": "Hidden gem. Amazing. The did and service are great, and it was a surprisingly good value too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUmMzbEhWRU0xWlV0b2QwcGlSVzR4VEd3MlQwRRAB",
            "text": "This is the best find.  Amazing food, it's healthy and delicious.  Staff was amazing and accommodating.  Will definitely come back and bring guest.  Baby friendly ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMVZVcE5TWFpVUkVneFNqWlpka0p5YjBONWNGRRAB",
            "text": "Great place"
        },
        {
            "date": "2달 전",
            "language": "sq",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1JsSm9NQzFTWDE4d1gyZFFibXhEYkdWVU9YYxAB",
            "text": "Ky ishte hera ime e dytë që ha në këtë restorant. Herën e parë ishte në fakt mirë, por për fat të keq kësaj here mbeta shumë e zhgënjyer.\n\nTavë Kosi ishte ujore, pa asnjë shije mishi – kishte shije më shumë si qumësht sesa si gatimi tradicional që prisja. Edhe Tavë Dheu ishte një dështim; kishte shije si rikota me spec djegës të kuq dhe nuk kishte fare mish, aspak si një Tavë Dheu tradicionale shqiptare.\n\nPër më tepër, atmosfera nuk ishte aspak e këndshme. Stafi ishte mbledhur tek banaku duke qeshur me zë të lartë, dhe dukej sikur po gjykonin ose talleshin me klientët. Kjo përfshinte si kamarierët, ashtu edhe kuzhinierët, gjë që e bëri përvojën të pakëndshme.\n\nNë fund porositëm edhe Bakllava, por nuk ishte aspak e mirë.\n\nE vetmja gjë pozitive që mund të përmend është ambienti dhe dizajni i vendit. Përveç kësaj, nuk mund ta rekomandoj këtë restorant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMFkyVnpiSEJXTVdwZlNETmhXSGg0TVRsd2QwRRAB",
            "text": "Went here after work with a few coworkers and ordered a little bit of everything and it did not disappoint. We sat near the front at a beautiful round wooden table. They had cool leather-bound menus and a rustic vibe. The mixed meat platter was flavorful and perfectly seasoned. The grilled octopus? Absolute perfection.\n\nThe mantia was the STAR of the night for me, along with the olives! so fragrant with orange peel and herbs that I could have eaten them by the bowl. We also tried the Albanian beer that was smooth, crisp, and refreshing. The service was very attentive and provided some great recommendations. Would definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQlVYRndXV1o0VW5FdGJrWTRiMHBEZERNelpsRRAB",
            "text": "The service was exceptional and the food was delicious! Can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVdGSlhRalZHVG5oNk5HVTNZV3BHUTNOd2JXYxAB",
            "text": "wonderful authentic spot; definitely recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NlVscEVkelV4T0d0cVpsQjJibUZ2UzJac2VXYxAB",
            "text": "Amazing food and service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toME1GWmtTbXhsUjJvNWRsWXllbEZ6TlRaaFNGRRAB",
            "text": "All the servers were super nice, our food came out quickly and was delicious! The space is beautiful and was a lovely place to have lunch. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eWRsaDFNMFUyVkRkUU16TjNNRFZ2YlhjeFoxRRAB",
            "text": "After reading about this restaurant in NYC best restaurants I had to come and try the food.\nAs soon as you walk in you are embraced with the Albanian culture.\nThe food was delicious and the service was very good.\n\nI will be back for more."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNE5VWTFOalZJZDFRdGNtMU1TVWhFWmpkdWVGRRAB",
            "text": "So delicious. We enjoyed this meal so much. We asked for recommendations and took four of them. None were a bad choice. Highly recommend it here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NWNubG9iV1V0WWtsUGFtUkxaWGRrVVd0d1gzYxAB",
            "text": "Always great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMldDMHliR2huWVVWNFMydDFaM2Q1TTB0dE1sRRAB",
            "text": "Great bread and stuffed cabbage"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVllVNWlkMmhKVTBObWNHVktNMWxPTkZCcGNYYxAB",
            "text": "Such a great spot! The food is delicious, the wine is top-notch, and the whole vibe is cozy and neat  and welcoming. Definitely a go-to for a tasty night out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQ1NHMXhXUzFDVTIwMFNYbENkemhSVkZKck9HYxAB",
            "text": "ChakakaChelu!!  Grilled meats are excellent.  Salads are fresh.  Dumplings are delicious.  This is my first exposure to Albanian food.  We will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wM2FVd3lMVUZHU0Rrd2NtWXdlRjgzZVhKNFFWRRAB",
            "text": "Delicous food, friendly service would definitely recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdllWODVNV3hIUm5wdVpXaFFhbDh5ZEdWelRrRRAB",
            "text": "Really lovely atmosphere, delicious food, and reasonable prices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVFqSkZaRTlTUlRkeGEzUlVYMU5NUkdwc1EzYxAB",
            "text": "Food was great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTFdreEdRalZOTjFGcU0yeHhiM2QxZFhOeUxYYxAB",
            "text": "My husband and I came here for our anniversary dinner, and this place was absolutely beautiful and we had an amazing experience! We’ve never tried Albanian cuisine, so once we tried it here - we were sooo impressed! The food was SO flavorful and juicy and perfect!! The staff was SO hospitable & sweet (something Albanian culture really takes pride in their hospitality)! We would definitely come here again with family! Thank you for a great experience!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcVptSlhTVFYyYlhJNFZqRkJkVXQ2VkZkdGVsRRAB",
            "text": "10/10 - food, ambiance, service, decor…all of it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRk1rRnFVbk5PWjB3eVZGWmpORmd3V25wdGJXYxAB",
            "text": "LOVE this place. I am Albanian and I thought the Albanian food was wonderful here. Everything was super flavorful and plentiful and very affordable. The service was also lovely and the decor and music is very Albanian/homey."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPa3NHRTJRRRAB",
            "text": "모든 메뉴가 다 만족할만한 음식입니다."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYjUyS1hxMmZxWVl3EAE",
            "text": "We happened to be in the Arthur Ave area and stopped in here for some wine & appetizers because we saw it listed on the NYT 100 Best Restaurants list. It was warm & cozy inside and somewhat quiet (we were there early on a Sunday evening). They sat us immediately, so not sure if you need a reservation at other times…\nThe servers were very friendly and attentive and we enjoyed the food. Their bread is served warm and is very filling - so come hungry.\nLooking forward to returning soon for a full meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRE1scDFUSGN6VkRsdVUxaFZZbVJWV201UmIyYxAB",
            "text": "My boyfriend and I visited this cafe at 6 pm. It was quite crowded. I ordered green olives, they were with orange zest, it was incredible! We also ordered a main course, my boyfriend noticed that I am allergic to spicy food and for me they added less spices to the meat, it was great!! Beer, water, all Albanian production, it was a joy. For dessert, the waiter recommended a certain dish to me. When they brought my dessert, I refused to eat it because I saw a fingerprint on the plate (it was black), they replaced my dessert WITHOUT PROBLEMS. Thank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRlRsQTRURjlpTkVWRVJHNDFTbTFVWW5kTldYYxAB",
            "text": "My friend and I decided to check out Çka Ka Qëllu on a Saturday after doing a NYBG trip. We made a reservation for 1:30, and I would recommend making a reservation if you are going at a popular time. The interior of the restaurant is unique, almost like you're in a stone cottage. The decor consists of Albanian artifacts, which is always a cool touch to the dining experience.\n\nOur server was extremely helpful guiding us through the menu, as neither of us had a ton of experience with the cuisine. We got the smaller order of the mantia ($11), which were veal dumplings. The dumplings were good, I just wanted a touch more flavor on the meat and a thicker consistency of the yogurt sauce. My friend got the tava kosi ($24), which is a lamb dish. This dish is flavored well, but it is on the saltier side! I got the gulash ($23), which I had a similar critique to the tava kosi. Once I ate the meat and potatoes, the rest of the gulash felt like I was eating flavored oil rather than a soup or stew, so I didn't wipe the bowl clean. The homemade bread helped to balance out the saltiness and sop up some of the liquid. Overall, I thought everything was very tasty, and I would return to try other dishes.\n\nService was exceptional. From the moment we walked in, we were treated with the highest level of hospitality. Because we went on a hot day, we drank a lot of water. There was never a point where our glasses went empty! There were also multiple checkbacks. I would highly recommend checking out Çka Ka Qëllu if you're in the area at the garden or the zoo!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeElEUXpnRRAB",
            "text": "We stumbled across this spot by accident but I'm so glad we did!\n\nEverything was delicious, especially the mantia, which I highly recommend! The portion sizes are great and we were full by the end.\n\nThe staff was very friendly and we were served fairly quickly. It's a really cozy spot and tends to get busy, especially in the evening on weekend so reservations might be a good idea.\n\nI plan to revisit the next time I'm in the area!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RlZFeHlUbXhpWmxSbUxWbHdSV3hxVDBSallsRRAB",
            "text": "Wow. Expectations exceeded! Service, atmosphere and food were all fantastic. Emma took great care of us with menu suggestions and answering all of our questions. What an excellent dining experience. The dips were amazing- wish I’d taken more pictures!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZUFtY3ljZ1lxeGN3EAE",
            "text": "This restaurant tucked in the Little Italy (they say the original one😉) in the Bronx is gorgeous. Its rustic decor and Balkan culture clothing and ornaments adds to the beauty of this place. The food was delicious and the Albania beer was refreshing. The service was great. I recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcXNDYW53RRAB",
            "text": "Listen up, foodies – if you're in the Bronx and haven't checked out this hidden gem, what are you even doing with your life? Just a short jaunt from the New York Botanical Garden, this Albanian spot is giving cozy, giving authentic, and most importantly, giving delicious.\n\nFirst of all, the food? Honey, it's a flavor explosion. Every bite feels like you're getting a warm embrace from an Albanian grandmother who’s been cooking for centuries. The bread? Perfection. The Tava? Tender, juicy, and seasoned to the heavens. And don’t even get me started on the appetizers – you’ll want to order everything.\n\nNow, the decor? Absolutely magical. The place is an art piece itself with a vibe so welcoming and cultural that you'll forget you’re still in the Bronx. It’s like you’ve been transported to a cozy, cozy little tavern in the corner of  Albania. And the best part? Dua Lipa herself persinally recommended this place (okay, not really, but trust me – if she knew about it, she would).\n\nSo, go ahead and treat yourself. Don’t walk, run. The food is divine, the atmosphere is unmatched, and you’ll leave with your heart and stomach full. Five stars, no question."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNGVITjNBRRAB",
            "text": "It was a quaint cute Albanian restaurant, nice ambiance.  The salad was fresh and great tasting.  Octopus was ok, didn't leave a lasting impression.  Qebapa was freshly made to order, wished they had a charred smokiness to elevate the flavor, however, they were good.  It was an enjoyable experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bDZDYmx3RRAB",
            "text": "Literally felt like I was transported to Albania. Everything was incredible, including the bread, which is baked fresh there. Baklava is worth saving space for"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmamREelBBEAE",
            "text": "Excellent Albanian meal in a rustic atmosphere, and all so affordable. I love cabbage rolls because they’re so soft, homey, and comforting, like a visit to a grandma’s place. Here, the sarma felt like you’re visiting a grandma, but it’s the grandma from Dan Da Dan. It’s so punchy! Meat and tomato sauce come running at you in full force while swinging a bat.\n\nThe sausage dip tasted like dipping bread in queso in a really good way. The baked mantia are closer to pies than Turkish manti. Everything was great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MUxxbDlRRRAB",
            "text": "What a find!! First time eating at an Albanian restaurant and we absolutely loved it!! Food was fantastic, service was exceptional, and atmosphere was was cute and quaint. I can’t wait to go back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNGFxMXZnRRAB",
            "text": "This is truly one of my favorite places to eat in New York City. When you walk in, the entire staff makes you feel at home. The inside looks like you are actually walking into a restaurant in Albania. And I have never ordered the same thing twice and always loved my meal. The hardest part about eating here is not getting full off the homemade bread. Last but not least, Buki is the absolute goat. I came back to eat after not being there for over a year and he still remembered exactly who I was."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULUpibzlnRRAB",
            "text": "SAFE review.\n\nService: makes all the difference in an experience. The service didn’t disappoint. The server was ready to explain the dishes and ensured guests were well take care of.\n\nAmbience: It is like a dine-in museum. There is a lot of Albania on the walls and you walk away taking a little bit of Albania with you. It is very cozy.\n\nFood: The food is delicious. Enjoyed everything. Everything was very rich. The salad dressing was a little saltier for my taste but that’s because I don’t usually have salt much. We had the cheese Burek and it was really good. The kacmak would normally hold very well but everything else we had was so good that the kacmak didn’t stand out. The tradita platter was really good - even the roasted vegetables that came with it was outstanding.\n\nExperience: Outstanding. If you want some authentic Albanian food or want to try it for the first time, you should definitely check it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ3BleEF3EAE",
            "text": "What a hidden gem in the heart of little Italy in Bronx. I was recommended by a friend to try this place. Even though it was ride for me for Long Island , I made the trip and it was totally worth it .\n\nThis place comes in the Top 100 restaurants in NYC and definitely belongs there !! Food was phenomenal and the service was top notch.\n\nMust Try the Pepper Dip , with their fresh warm bread!!\n\nService - 10/10\n\nParking - Metered\n\nReservation Needed - I didn’t have one , but got seated in a few.\n\nAmbiance - Cozy and Reminded me of Medieval Times"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYmZsNFdHbGQycFpBEAE",
            "text": "We had a delightful experience. The food (olives and sesame baked feta for appetizers, mixed grilled platter and branzino for entrees) was delicious. The staff were really friendly and accommodating. Inside the restaurant is beautiful with interesting decor. I wasn’t a fan of the bathroom situation (the women’s and men’s room share a single sink) and have barn door style doors that don’t feel very private. Otherwise, it was a great experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnXzlUM2JREAE",
            "text": "Amazing ambience, freshly baked bread with that aroma and the yummy dip they gave with it! All the dishes we ordered had a distinct taste and perfection,  loved going to this place so mush of warmth in the decor and the hospitality👍🏻👏🏻"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dEoyWnB3RRAB",
            "text": "Was one of the best meals I’ve had in a while. Both ambiance and attention to detail were beyond expectations. Thank you for the wonderful service!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXFUd0pnEAE",
            "text": "Food was amazing! If you love meat, cheese and bread then this is the place for you. Plus the atmosphere is so charming."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OEl6ZkxBEAE",
            "text": "This is one of the most incredible dining experiences I've ever had in my life! I could not stop eating. Everything was fresh and absolutely delicious. The bread came out warm and steaming! This is probably the best authentic Albanian food you will get outside of Europe! I highly recommend making the drive out. It is worth it!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlb19uV2FREAE",
            "text": "If you wanna try something unique and new, then you should visit this restaurant.\nCozy place, with lovely atmosphere, a little spirit of Europe! I like to try new flavor but here the food, like something I never tried before. I don’t know if it’s the seasoning or the pan they use for cooking & baking. The bread with dipping was amazing .Hot and fresh.  The lamb meal for my kids, we ordered twice, I had the stuffed cabbage made with veal was very- very tasty! I love soups (especially fall and winter time) wish they had that night, but I’m gonna try next time ..\nRestaurant staff very kind,our server explained everything for us from the menu. Nothing crazy with the price..affordable restaurant!\nWe are definitely gonna come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcDhDTFFnEAE",
            "text": "I’ve been here over 3 times and I can’t get enough of how delicious their food is. It’s fresh, innovative, made with love and so addicting. The service is top notch and they make you feel so comfortable. I plan to make my way through their menu and try every single plate they have😍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaVNsSnlWMUJZYlMweE4wUXRiMnBoVnpoMk9FRRAB",
            "text": "As a Bronx native, I can confidently say this is some of the best food available in the borough. For appetizers, the pepper and spinach dips are both filled with flavor and come with fresh, warm bread. As an entree, although I bet their meat dishes are great,  do not overlook their Tava (clay dishes) section. The stews and soups are just warm and delicious and feel so cozy. They even have a vegetarian option!! The service was great as well, definitely recommend visiting!!! I would call ahead to see if a reservation is needed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcjUyLVVBEAE",
            "text": "We went here on a chilly evening, after visiting the New York Botanical Garden Train Show. It was so warm and inviting inside. I don’t know a lot about Albanian food. The bread alone was worth the visit. Big pillows of warm, freshly baked bread. Delicious with roasted pepper and cream sauce. The decor is very interesting. The staff was exceptionally friendly. This was a nice change."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURod1A3dDFBRRAB",
            "text": "This was our first time having Albanian food and it was so delicious we came two days straight. Service is outstanding. They all help each other and very knowledgeable about the menu. Would definitely recommend this spot. The restaurant is super clean as well. Why go anywhere else lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweGI2VlZnEAE",
            "text": "I went here for lunch for the first time — first time having Albanian food all together. It was very good and the atmosphere was nice. I have nothing to compare the food too, but I enjoyed myself.\n\nIt’s a 3.5 stars cause the food was very heavy for me and left me feeling incredibly full and bloated for the rest of the day, but thats a personal problem! Due to that it’s unlikely I will be returning, but I think it worth trying at least once."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dnRhNUtnEAE",
            "text": "What a gem of a restaurant!! Really great food for the most part, we especially loved the freshly baked bread and the veal dumplings! nice ambiance and really good service!! Reasonably priced in my opinion. I look forward to going back and trying more traditional Albanian foods."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOGRtd0V3EAE",
            "text": "The rare find! True gem! Beautiful place with interesting history. Coming here you’ll learn about Albany so much, dive into the atmosphere and vibrant culture.\nPeople here meet you with true warmth of their hearts, take care about you and treat like home! Don’t remember when I enjoyed food so much! Must have the Albanian coffee! Ask to make it traditional.\nThe place is very busy, don’t forget to make a reservation. Enjoy!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NWFGWkZaV3BZVERCaVdUZDBZMWhmWmtkeFltYxAB",
            "text": "First time here and really impressed. It was super busy so the food took a bit but it was 100% worth the wait.  Absolutely delicious service was great too. Shoutout to Peter for being extra attentive and super friendly made the experience even better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNTctaFZBEAE",
            "text": "All my dishes were OUTSTANDING. The Cheese Pickled Pepper dip blew my mind. The Mantis në tavë (veal dumplings) were a delight. The Mixed Grill Platter is always a home run and the service was outstanding as I was with a parent with a small child. Will be coming back again and again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdHJYV1RREAE",
            "text": "I think this neighborhood benefits from this amazing restaurant. It has a beautiful ambiance. It's like a museum or fort. The bread is fresh and delicious. It'd made in the oven to order. My beans were amazing. Tasty appetizers and meatballs. It's an upscale old world restaurant.  The dessert was like tres Leche but better. Memorable dessert. Great staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMjZXb2xRRRAB",
            "text": "This place is definitely amazing and best spot for dinner. The excellent vibes and service are all good, we really enjoyed it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObkt6NFRhdklUOUl3EAE",
            "text": "Everyone was so warm and welcoming from the start, the interior is just so beautiful, and every section looks unique. The front of house team was simply the best. The food is absolutely amazing. I can't wait to go back and try other dishes on the menu. Totally my new favorite restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMzVLbDF3RRAB",
            "text": "Food is authentic and amazing. Really enjoyed the bread. The server gave us excellent recommendations. Would definitely visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdGRPWmtRRRAB",
            "text": "Absolutely loved this place! First time eating Albanian food and was satisfied with every food item.\nStarted with pepper dip and burek (cheese) served with fresh bread.\nThen got Fasul and Qebapa, both so tasty. Too full for dessert but will definitely go again!\nWith only two people on the staff when we went, they were very efficient. Got a little busier as it got closer to 8pm so 6pm was the perfect time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEalBxX0ZBEAE",
            "text": "This restaurant's food amazing, every bite is better than the last one.  Staff is so personable and makes you feel like you're having dinner at a well welcome friends place.   Definitely a spot that is not t well known, but should be, I will go here anyday anytime, it's heaven on a plate!"
        }
    ],
    "reviews_count": 86
}