{
    "name": "Mario's of Arthur Avenue",
    "place_id": "ChIJSVkYXIf0wokReeN2qJg8Nwc",
    "grid": "BX6",
    "address": "2342 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.4,
    "user_ratings_total": 1008,
    "phone_number": "(718) 584-1188",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSlVuQTVUbXB2VFRSTE1GQmxNRGhGYUdsS1RVRRAB",
            "text": "I had to take away one star for lack of seasoning everything needed salt which was slightly annoying! However my mom’s dish was perfect and I lovedddd the Cesar salad you can tell the dressing is made in house. My clams also weren’t that fresh had a funky taste I could finished them, we also loved the bread we got 2 round. The service was great we were ah party of 5 and we didn’t need for anything just napkins lol. This place is ah family style place quiet and quaint however it was packed on ah Saturday tables full people enjoying themselves. The drinks were also good the pear martini was my fave but it’s not pictured."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUFRuUkhjek0wT0hBd01ETkpjR2MwTFd0c05YYxAB",
            "text": "I'm sure this is better than it was for us tonight. Inedible veal chop. Broccoli rabe boiled until it was gray. We should have just waited the two hours to get in across the street."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZlVFdHBOazFKTWxjeWJYQlVhMlJ1TjNOc1UxRRAB",
            "text": "Fantastic best atmosphere great food a class act"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVWEyVlhMV3gyYWpsNVFrZHFUeTFaU2kwNFMxRRAB",
            "text": "Such amazing service and when I say the food was great I really mean the food was to die for. SO SO GOOD! Our server chatted with us and gave us awesome recommendations of in housemade pastas and made the whole experience absolutely amazing, if you have a chance to eat here I would completely recommend it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CblVuRkhUVkZ4VEdGZlNFWkNlR2h1TWt0ZmMwRRAB",
            "text": "It was like stepping back in time in an era of  nostalgia and Italian food in an atmosphere of a time gone by with dim lit dining room, stories of stars visited and movie references.  The visit here was an experience, the food is great, old school traditional sauces, which u can tell were homemade.  The owner walked around greeted people had beautiful conversations gave us a little history Lesson about the neighbourhood and menu highlights."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka2JYWnVUek5NUjNGU1IzRTNTVUZaY0hFd2EyYxAB",
            "text": "Worst gnocchi ever!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSlJFUnJWbVI0U0hsUWMwbFlNVEpwVms1RVNsRRAB",
            "text": "Amazing place to take your family or just to go on a first date. Would recommend everyone to come have an amazing time with the family every one is very nice and they catered to the client so expect 5star service please enjoy and tell them I sent you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNVZFbEZObE5QUW0xT01scGhhbWhaZVRCcWEzYxAB",
            "text": "Fantastic food, it has become a tradition to come here after a NYBG walk"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMlZrVkNUMkUyWkRSQ2RIQldia0ZXYUVjMVRFRRAB",
            "text": "Best Italian restaurant in New York, the pastas were flavoursome and aldente, also great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeGF6QlVWR1kwVVUxWVZXRlRRMHBLYlV4UlNFRRAB",
            "text": "Mario's  is truly an iconic Restuarant location in the Heart of The Bronx’s little Italy Section, Rich in History and a Fabulous Menu.  Regina who's Family opened this establishment over 100 Years ago , has continued in their footsteps offering the finest in their Neapolitian dishes in addition to their exquisite Specials. Chef Massimo is a Master at His culinary skills and always on the cutting edge with His creations.\nIf you visit Arthur Ave then Mario's Restuarant is your place.\nAlso don't forget to get their Very own Sauces and Olive oil.\nMario's truly a 5 star Restuarant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eFZHeFVhbUZXVEhsTVJWcDRPRTFRZFRCVFNIYxAB",
            "text": "Great"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdE5sOURTbTAwTFZKbmR6Uk9hbmt5WW04NFYyYxAB",
            "text": "This was undeniably the worst dining experience I have ever had! We were 7 women friends looking forward to a visit to the Botanical Gardens and a delicious “Arthur Avenue” dinner.\n1. Once seated, our waiter greeted us with a question about where our husbands were.  For various reasons, we were all taken aback by this inappropriate question. Having been widowed a few years ago, I was stunned.\n2. As friends who often dine together, we are okay with splitting the check, but obviously separate checks make it easier. Our waiter said he would give us separate checks but that our meals would not arrive at the same time. Although we were confused as to why that would be, given that there were only 10 other people in the restaurant and at least 4 already had their meals, it did not seem like this would be a problem. But it was! Despite the fact that only 1 other couple arrived at the restaurant while we were there, our 7 meals arrived at our table over a span of at least 20 minutes.\n3. About those meals…Chicken Franchese, Veal Parmesan and a shrimp dish all were satisfactory. Two women ordered the salmon which on arrival was so overcooked as to be barely edible. I ordered the filet of sole. It arrived 20 minutes after the first of us had been served and it was not completely cooked. When I pointed this out to the waiter, rather than apologizing, he said “no problem.”  I replied that, indeed, it was a problem since several others in our party had already finished their meals. More than 10 minutes passed before the same piece of fish was returned to the table. I could only assume that it had been sitting in the kitchen growing bacteria while it waited for the chef (Was there one???) to finish cooking it. Of course I refused to eat it. The waiter still offered no apology.\n4. By then everyone else was finished eating and asked for checks. Despite the fact that I had had no dinner and received no apology, he had the nerve to hand me a check for the drink I had while everyone else ate.\nSmall wonder that the restaurant across the street was full,  yet Mario’s had only 10 diners other than us at 6:00 on a Friday night. Do yourself a favor and avoid this place!\nP. S. No, I did not pay that bill!\n\nFollow up to management's response:\n\nHow disingenuous of you to suggest that I did not seek to have the problem resolved that very night!\nI sent the undercooked fish back, requesting that it be cooked further. I would have been satisfied if it had been returned to the table in a reasonable amount to time so that I could eat it before everyone else in my party was ready to leave. It was not.\nFurthermore, you were right there in the restaurant when I expressed my displeasure with the long wait for my dinner and with the meal as served.  The restaurant was far from busy, yet you chose to ignore me.  If you were somehow unaware of my displeasure, shouldn't your wait staff have alerted you to the  problem?  It seems to me that that would be the prudent policy. And in case you choose to claim that you were not in the dining room at the time, then you would have to have been in the kitchen.  When a customer sends a meal back, it should be obvious that there is a problem.  Why then would you not have come out to talk to me. Wouldn't  you have wanted to  apologize and seek  to make it right?\nYou and your staff had ample opportunity to rectify this. My experience at Mario's that night was horrible and my review was honest, fair and accurate."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbmQxZGhkVFV4UzFOSFpHOUhUbkZGWm1kWmRWRRAB",
            "text": "Best Italian I have ever had, 10/10 food & service. Don't miss their penne a la vodka & margarita pizza!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ZlMxOTJVVWxPYTBkcmR6TmxUVTFyYlV4NE5rRRAB",
            "text": "Hi I went with my wife on Thursday evening places relatively quiet we have been there once or twice before and it was okay this time we sat down we had drinks had an appetizer and my wife found a bug in her glass The staff was very…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeWVpMTFkRkJqWVRORWVsRnJaVXRqTWkxVVUxRRAB",
            "text": "I don’t usually write reviews, but this was hands down the worst dining experiences I’ve ever had. We went to Arthur Avenue for an authentic Italian dinner before going to the NYBG’s Van Gogh exhibit. We were all looking forward to a wonderful dinner. If I could give my review a ZERO, I would.\n\nThe salmon was rubbery, the string beans were inedible, and the whole meal left such a terrible aftertaste that I couldn’t wait to get home just to brush my teeth. Truly disgusting.\n\nThe service was no better. On a Friday night, the place was nearly empty—which tells you something, especially since the restaurant across the street was packed. We asked for separate checks and were told that meant our food would come out at different times. Shockingly, they weren’t kidding. Our group’s meals were staggered, with the last person receiving her entrée a full 15 minutes after the rest of us had finished eating—only to find her filet of sole served raw.\n\nFrom the food to the service, the entire experience was rotten. I would not recommend this restaurant to anyone."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUU9YbHdSR1V3VWxSV1lsUnNaakZWUVV0dmJHYxAB",
            "text": "Great service.  Great food. Great atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVGJEQkJSazR6VFhGeVQxazJRVUZaVVdVMVJuYxAB",
            "text": "Excellent service. This was truly a dining experience. Enjoyed the food and ambiance!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMVRXWlNibVF3TUdKR1Mxa3RlbVJFUlV0dFRYYxAB",
            "text": "Hadn’t been here in years, had a few hours to kill and just had a Caesar, Chianti and cappuccino for lunch.   They do Caesar’s the right way, it’s so hard to find real Italian food now and these guys are the real deal.  Oh and the bread, I’ve missed real Italian bread.  My old Italian hood in Brooklyn has been gentrified and you just can’t get the classics anymore.  I’ll be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYVpqQkVTVEozZVZwNldqUkRhbkZXTTJsTVkxRRAB",
            "text": "I ordered the Magherita pizza and was attentively waited on! The recipe is 100+ years old and did not disappoint. Nice quiet place for lunch, would love to return with a group for dinner as it seems more of a family-style focused establishment than a place to grab a quick bite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYWVqUnNkMGRSZVMxbU4yRnNNSEJQYzNaWFdXYxAB",
            "text": "Amazing food. Pastas were out of this world. My three year old knocked so many things off the table and they were so patient and kind. Huge portions and very affordable and strong A/C!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTHUtSzNXaUxLWHpRRRAB",
            "text": "I always go to Arthur ave to eat and shop!!! This is one of the best Italian bites in the Bronx!!! I love their branzino and pasta!!! And there tiramisu!!! 10/10 def check out for ur next Bronx/nyc trip!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZWh6c3YxcDR1dEdREAE",
            "text": "We had our family reunion yesterday at Mario's and it was wonderful as always. Food, service and welcoming atmosphere. We love this place and it's our go to family restaurant. My all time favorite is the bracciole."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbVMyb3lSVEIzV21aWExYUnpNR3hoYzI1VE5tYxAB",
            "text": "I’ve been going to Mario’s with my family for over 30 years I cannot tell you how very disappointed we were today. We’ve noticed a decline in the quality of the food over the last years but today was just awful. The baked clams tasted like water soaked bread. The mozzarella was NOT fresh as it states, guaranteed packaged and low quality at that. The cold antipasto had huge slices of red onions, whole slices of red onions! The stuffed mushrooms were awful. I actually spit it out into my napkin. Eggplant rolls tasted like a dirty freezer. The shrimp was old and half cooked then buried under some acidy tasting sauce. The fried calamari was average but eatable. I had the pene a la vodka with shrimp, the shrimp was half raw, only half of the pasta was aldente the other half was so hard my fork couldn’t poke it. The shrimp Parmesan was not at all good. It tastes as though the shrimp was taken out of a fried shrimp basket and drowned in acid red sauce. The pasta with garlic and oil, the garlic was burned! The meatballs were definitely not Mario’s meatballs. Don’t know who made them but it was awful. I can go on and on….. the bread was GREAT! The oil infused with hot peppers was good. The dessert was good. WHAT HAPPENED!!!? So very disappointed….."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYVloTXJ3eV9MYnVnRRAB",
            "text": "Great experience. Went to a baby shower there and was pleased with everything from valet to the food served."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQRzRnS2U1bHVpRFR3EAE",
            "text": "The food was THE WORST Italian food I've ever had. It was actually disgusting disappointing and awful. What a waste."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNEtmNkZnEAE",
            "text": "They even sell their jar sauce to take home best pizza anywhere always fresh ingredients pasta dishes are good portions"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT3FqckxMbUxtRC13RRAB",
            "text": "Traditional Italian atmosphere. Excellent food and attentive service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaVlEWXhBRRAB",
            "text": "Stopped in after going to the Botanical Gardens. We had always wanted to try Italian on Arthur Ave, and a friend recommended that we go to Mario's for our first experience. I gave the atmosphere five stars because its a perfect throwback to time before smartphones, before computers, before table television. Mario's is the Italian restaurant in your town that your grandparents love. It was very busy, lively, but not so noisy that you couldn't speak. If anything it added to the charm.  I expected subpar Italian food, but I got the baked pasta with ricotta and mozzarella and a meatball and I was honestly surprised at the quality. It was really good.  Service was impersonal but efficient."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMGRyR0JREAE",
            "text": "I attended a 103rd b day party. Regina. The owner created a fabulous celebration.\n\nThe meal was of Roman times, it was a dream feast. The appetizers were superb, a medley of Italian classics. h\nHomemade gnocchi, caesar salad, it was a feast for the ages. The cod was fabulous. The desserts, espressos excellent.\n\nThe service was incredible.\n\nLive music amazing.\n\nRegina. The owner of Mario's went above and beyond to make a perfect celebration.\n\nMario's is sensational!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXY2aW1nRRAB",
            "text": "Excellent food and great prices, especially compared to Manhattan"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak9ILUJnEAE",
            "text": "It’s great pizza, for the neighborhood I would give it a 10 out of 10, I’m not one to stay in the neighborhood though and know of many other pizzerias whose slice and overall menu tops this one."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdXJUVGtnRRAB",
            "text": "Food was very average and service slow. We had to call over waitress to bring our menu and check.\nThey did have their own parking lot and that was very helpful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOGQzTDNBRRAB",
            "text": "Good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHZlMm1RRRAB",
            "text": "Mario's has been a family tradition since the 1960s. I have fond memories of large family gatherings at this treasure of a restaurant since I was 8 or 9 years old!\n\nMario's granddaughter almost always greets you at the door and makes sure that you're welcomed and cared for. Incredibly helpful and friendly!\n\nThe wait staff is very knowledgeable and can't work any harder to make your time there unforgettably wonderful!!\n\nIn the last few months, my girlfriend and I have been there several times and have chosen different dishes from their varied menu. Everything has always been prepared perfectly...so mouthwatering and delicious.\n\nI've had their stracciatella soup, which is incredible, as is their salmon, their pasta, and their chicken francese, to name a few. The bread basket is filled with amazingly tasty, crispy and soft sliced bread with oil or butter!\n\nNeedless to say - desserts....just great!!!\nI love the tartufo, but they have a number of other terrific choices as well. And...coffee!!\n\nThe interior is decorated with old-world paintings and soft lighting.\n\nArthur Avenue is always busy, but they have a parking valet who takes care of your vehicle and makes sure it returns in perfect condition when you're ready to leave.\n\nMario's is a special and lovely restaurant experience that we will continue to enjoy for years to come!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcXBiSDJRRRAB",
            "text": "Good Alfredo. Large portions. Servers were incredibly attentative."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OXVQR2xBRRAB",
            "text": "I had the Veal entree with Mudpie truffle and a Cappachino with a double shot of espresso.  It was delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnemMtamxRRRAB",
            "text": "A family Gem"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndElLRDNnRRAB",
            "text": "Loved our visit to Mario’s! Everything was great. Loved the Osso Buco and Calamari. Great generous wine pours as well, and friendly staff! Will come again when in the Bronx."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeGJ1Q2dRRRAB",
            "text": "Pasta was quite delicious. Service was excellent and atmosphere is very relaxing. Place is kept spotless. Try the spaghetti"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbHQzYVVBEAE",
            "text": "Excellent, tasty food; quality service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaFl2N2VBEAE",
            "text": "I ordered a ceaser salad and I was given the inner part of lettuce. My leaves were yellow not a green leaf on my plate .  I know I was given that because I was racially profiled.   If you are not Italian you are mistreated.  If necessary I do have the picture of my plate."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfci15WU9nEAE",
            "text": "Great experience having lunch with my family today at Marios.  Where other restaurants shut down today because of an impending storm, Marios was open and welcomed us with open arms.   We had the most delicious meals and the service was fantastic.   Ask for a table with Vale.   He was amazing giving us great suggestions and provided us unmatched service.\nRegina runs the family  restaurant and makes everyone feel welcome and checks in at every table with sincerity.   She really wants to make sure you are enjoying your meal.\nDelicious food, great service and cozy atmosphere.   Highly recommend"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaGFPc01nEAE",
            "text": "Food was average red sauce food. Over cooked veal cutlet parm. Live music on a Sunday made the evening fun"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcklLT3lRRRAB",
            "text": "Classic Italian spot that always satisfies. The food is consistently on point and the service stellar. The atmosphere is lively and the space can accommodate parties of all sizes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX2UtSXB3RRAB",
            "text": "Not crazy about the food. It used to be much better."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmamJLQ3lRRRAB",
            "text": "Please ban this restaurant. The Manager ran after me for more tipping. As I said that his requested amount was “suggested” he shouted with a nasty figure “Happy Hanukkah”.\nA big racist and rude person. He oozed racism. Do not spend any money there. Thanks."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmallTSk1nEAE",
            "text": "Food was good, but be careful ! If you ever under-tip even in the slightest, get ready to be insulted by the manager… followed us outside asking to increase the tip and as we refused shouted at us “Happy Hanukkah”. A racist behind a fake smile and demeanour, we will never be going again and hope the community neither."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bWN1U3pnRRAB",
            "text": "Celebrated a birthday there with a group of 9 adults and 4 kids (ages 8,6,3 and 2 years old). 1 kid had dietary restrictions and they were accommodating. The portion sizes were of good size and left you feeling full. We had calamari, coteletta, carbonara pasta, pizza plus more and dessert. Parking was easy enough during the evening."
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Z29LY2d3RRAB",
            "text": "Arrivato alla “vera” little italy di New York avevo proprio voglia di provare le famose fettuccine Alfredo (famose in America ovviamente) e mi sono imbattuto per caso in questo ristorante, che vi consiglio a mani basse!\n\nIl servizio è veloce e gentile, l’ambiente parecchio intimo e il cibo, almeno a giudicare dalle fettuccine in questione, molto buono! La pasta, in particolare, è cucinata al momento e a puntino (aspetto da non sottovalutare visto che siamo pur sempre in US!) e gli ingredienti sembrano di ottima scelta.\nMolto apprezzato anche che, nell’attesa, ti portino del pane e dell’olio italiano!\n\nPiccolo avvertimento: se pagate in contanti vi verrà applicato uno sconto, viceversa se pagate con la carta un sovrapprezzo!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cl82bWZ3EAE",
            "text": "Best pasta I have ever had. I write this as I sit here enjoying my rigatoni al forno leftovers. This place is amazing! Service was fantastic as well. Will be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteTVEZTBnRRAB",
            "text": "Big portions, friendly services, authentic Italian…. What’s not to like about this place? The bread was hot and fresh, the chicken parmigiana with spaghetti hit the spot and the tiramisu was light and airy. I loved the whole experience and they have complimentary parking. There is adequate outdoor seating too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoODYyd3BnRRAB",
            "text": "My grandparents used to come here for date nights back in the day. My mother and I decided to make a trip to their old neighborhood and visit their favorite restaurant. It’s exactly as expected with beautiful low lights, comforting music, and delicious food. I highly recommend the penne alla vodka and any glass of red. The pasta is fresh and the bread is warm. Make sure to order a bit extra bread to get all the extra sauce. It’s worth it. We will definitely be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2b01iNkh3EAE",
            "text": "This place was wonderful! The Al Forno pasta was really good, but the Alfredo was amazing! The staff were attentive and kind. And to add to the atmosphere, a group of carolers joined the restaurant which was very festive!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWUyZHN3RRAB",
            "text": "Not too bad, but had higher expectation since Mario’s had such a long legacy. The ravioli tasted a bit hard at edges and I noticed some part were still hard (not fully cooked or maybe defrosted? I’m not an expert)\n\nWorkers weren’t rlly friendly when we were waiting to be seated. We had to flag down many workers for them to tell us to wait for the host. Overall, service was good but not worth the trek that we made just to get to Bronx little Italy"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNTZILUZBEAE",
            "text": "Went for a bday. Staff is primo. All the food was good. This page needed a lot more pics of the dishes. You’re welcome.\n\nThe antipasto per person was a must. They got all the tastes on there. Calamari, asparagus, baked clams, some roasted peppers.\n\nI’m so stuffed. Thanks Mario’s."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldHJxS2RBEAE",
            "text": "Great food, live music and outdoor seating. My son said “I thought it’s just a regular Italian restaurant, it turned out it is over 5 stars!”. We had fun."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudHJYYlFBEAE",
            "text": "Really good. Reservations recommended. Live music-solo singer added a nice addition to the evening."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvc29mbGZ3EAE",
            "text": "WOW!! All I can say is, THE FOOD IS AMAZING!! Great place, great atmosphere! Our waiter was wonderful!! Very friendly and professional staff! We live in Brooklyn and CAN'T WAIT TO GO BACK AGAIN!!💙…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbHVmeVRnEAE",
            "text": "House made mozzarella, fresh basil, tomatoes, balsamic & olive oil, the calamari was crispy but melted in my mouth. Huge portions. Outstanding! As was our hard working waiter."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLS1fZ1FREAE",
            "text": "A friendly staff, crowded place, got the food to go, Fettucine Alfredo and Penne, alla Vodka.  I thought the vodka sauce was a little thicker and more flavorful. Alfredo sauce was a little watery. The bread was super fresh."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvbm9uQzl3RRAB",
            "text": "Food was yummy, above average, but not excellent.  Mario’s is a typical “local” Italian restaurant - noisy, casual and friendly. My friend found this restaurant on internet, and it was our first time to visit Bronx. Both of us were very…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaEpxMHlRRRAB",
            "text": "Was not impressed. We planned to go to another restaurant nearby but it was graduation weekend and they were booked. Our fault for not planning ahead. Mario’s managed to slip us in immediately which I was happy about. It was a full house so I was expecting a good experience. The server was not at all helpful with menu questions or recommendations and seemed agitated from the beginning. Food (pasta) was very average in my opinion. Server basically only returned at the end to collect his tip."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbDZEMWtnRRAB",
            "text": "A Classic staple of the orignal Arthur Ave restaurants.  This treasure opened in 1919 and has been serving large portioned meals with warm traditional hospitable service on the block for what feels like forever. A reservation is recommended to get a table in the classically decorated old school dining room . With cozy tables nestled next to each other you'll feel taken back as to what family style dining was, is, and should be. They have great staff that will make recommendations and tell you what they truely think.\nFor our appetizers I ordered a burrata plate which was soft moist and simply over flowing with taste. To go with that we also had a shrimp cocktail and a salad for 2. The fresh super light bread which was amazing was used to sop up anything left on the plate. Then we ordered for the 2 of us a\nA plate of Noki Sorrentina. Soften potato noodles with red sauce, ricotta, and mozzarella. Bursting with flavor. My wife ordered the chicken scarpiello which was tasty, well rounded and beautifully done. Chicken was soft tender, and not drowing in sauce. The peppers were so tasty. I had the real sorrentina which was wonderful. Fresh eggplant , and prosciutto and. a light crispy breading that flakes when I ate it. Wow.\nFor desert we had traditional coffee paired with a strawberry covered cheese cake tart, also added a rainbow cake which was epic as well as a chocolate whipped cream cake.\nMy meal was amazing naturally with left overs. All the foods we tasted were freshly made and had material from the neighborhood.  Great staff and a chef that walks around and greets people so he show his passion for cooking. Bring your appetite ,and doggie bag for left overs. A great place where food is made with  love and has been for 100 years strong. MARIOS GOTTA GO.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb3ZHRDJ3RRAB",
            "text": "The food was AMAZING!! And the service was fast and the waiter was so friendly and even did something special for my sisters birthday. The atmosphere was elegant without feeling uncomfortable. 10/10 place!"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheHY3U0xBEAE",
            "text": "Visita Dic 19 - Me gustó Mario's es un buen lugar de comida italiana. Estuvo todo muy rico y la presentación muy buena, hay pastas bastantes sencillas como bastante elaboradas. Me gustó mucho la sangría.\n\nRecomiendo hacer reserva porque si es bastante concurrido. El ambiente del lugar es muy bonito. Fueron muy amables en el servicio y cuando fui guardaban tus abrigos en la parte de adelante."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaHQtc1NBEAE",
            "text": "Famous Marios Restaurant - been a good while since I've been able to visit for dinner - Family owned - Regina has always been a fine host - experienced wait staff...try their  brick oven Pizza 🍕 for an 'app' - recipes off the  menue - on the money 💰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeGFXc0p3EAE",
            "text": "Delicious authentic Italian food! Freshly made when ordered. Penne Ala Vodka!!! OMG!!!! Then we also had the lobster ravioli!!! Delicious!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLaHRTcmlnRRAB",
            "text": "Where do I begin! First of all, service was top notch! Our server Dal was very attentive and very nice! Second of all, drinks were strong and on point! And lastly, the food! We started with the caesar salad. Best I've ever had! For our…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bjV6eU53EAE",
            "text": "Visited for a lunch meeting and would definitely go back\n\nThe service was exceptional - servers were very polite and passed by our table requently to make sure everything was alright.\n\nEven if I only have visited once and tried one of their dishes, I can say that the quality of their food seems to be very good.\n\nThey offer a very delicious warm bread with marinated carrots and olive oil as small appetizer - delicious!\n\nI was hesitant about which plate to order (lasagna or chicken parmigiana) and ended deciding to order the lasagna, as recommended by our server\n\nThe serving size was huge - and even if I was not in love with the meat filling (because I believe it was a blend of beef and sausage - not a fan of the last one) it was very good! The amount cheese, sauce and pasta was perfect and perfectly balanced - the unlimited parmigian cheese made it even better 👍🏻\n\nMy friend ordered Penne a la Vodka with with a meatball and she seemed to have enjoyed it very much since both plates were left quite empty\n\nWe did not order any dessert or coffee because we were sort of in a rush - but I would definitely be happy to visit again and try something else.\n\nThe place is perfect to visit with relatives - it's like a good restaurant to go to with your mom, relatives or just for a business meeting - its very quiet and very clean, with very beautiful interior design.\n\nIt seems to be a classic italian restaurant in the Bronx - Little Italy"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcU1uWEdBEAE",
            "text": "Had a medium margherita pizza and fried calamari. Complimentary toasted sesame bread. All satisfying, the pizza in particular. The basil seemed extra pronounced, in a good way."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaVBDMFJBEAE",
            "text": "Typical American-Italian cuisine, friendly owner and very good service.  Outdoor sidewalk dining available."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbXFyU3hnRRAB",
            "text": "The Fettuccine Alfredo was absolutely amazing. They were extremely accommodating for our 6 month old. Service was refreshing. Oh and the cannoli Gelato Tartufo, so good! Next time I'm in the Bronx, this is my go to place for Italian."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTUtODN3RRAB",
            "text": "Extremely disappointed in the service I received at this restaurant. My fiancé found hair buried in his food. When I approached the server about it he scoffed and told me “there’s no one in the kitchen with long hair, that’s not possible”. He literally tried to argue with me about HAIR FOUND IN OUR FOOD!! All that was needed was an apology.\n\nI’m disgusted and will not be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdmZld2VnEAE",
            "text": "Amazing restaurant!  Great vibe. Even during a first visit they make you feel like a regular. A go-to restaurant if visiting Arthur Avenue.  Shaqe and Regina are great !!    The bronzino was absolutely delicious"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJa29XRGdRRRAB",
            "text": "The restaurant has an Italian familiar environment that is really nice. No rush to pay the check and leave, which makes your experience pleasant. The food and the Tiramisu were good, but not exceptional as we were expecting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMlBxaVZREAE",
            "text": "4.5 Stars.  We had a table for 6. With reservations, we were seated immediately. Bread was delicious, olive oil very good. Calamari appy tender, fresh and lightly breaded. Each entree was perfect (photo is of Veal Marsala), and the highlight was THE best cappuccino any of us had ever had."
        }
    ],
    "reviews_count": 76
}