{
    "name": "Cakor",
    "place_id": "ChIJGQJYOYf0wokRPbD2_I3lDbI",
    "grid": "BX6",
    "address": "632 E 186th St, Bronx, NY 10458, USA",
    "rating": 4.5,
    "user_ratings_total": 304,
    "phone_number": "(718) 733-2300",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTVgyMXhSakk1UjNSUWVrdDBjMlpoZURoTlNFRRAB",
            "text": "I love trying new things, I came with my friend and we loved it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waU1tbHNUVzU1TUMxb1kzaGhiSGsyVTFOUGRuYxAB",
            "text": "Amazing food! Servers are so nice and gave good recommendations. Will definitely be visiting again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGclpFMXhVVGwwVG1veVpsOW1YMUZaYVZoeFlVRRAB",
            "text": "Excellent restaurant from the moment you walk in. Everyone greets u, the wine selection is endless and delicious. The speca djeks is amazing brought me back to childhood in Maqedoni, tasted just like my mothers. The shrimp scampi, the qevap, the suxhuk, everything was delicious and cooked to perfection. The atmosphere felt like i was in Albania as it should. Wonderful people, service, if y haven’t been run dont walk. This place is legitimate."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMVUyWlFUM1YyYVVFMlVEaExNMDV6TUdreFZWRRAB",
            "text": "Cakor is always a good place to grab some Albanian food if you’re in the author ave area. Highly recommend thier mixed meat dish."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPamgwTmV1a09EOEVnEAE",
            "text": "Nice restaurant"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVDE2cWFldksyNUdBEAE",
            "text": "Great Burek and great service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeUlrcnFka2MyVFF3EAE",
            "text": "Everything was absolutely delicious! I got the chicken parmigiana and my boyfriend got the eggplant parmigiana. They were both cooked to perfection and so so good. Everyone was very accommodating and extremely kind. The prices cannot be beat. I would definitely without a doubt recommend this restaurant to anyone who wants a good meal and great service. You will not be disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdVBlVzJRRRAB",
            "text": "Just walked out of the restaurant. It's 4am and I had to immediately write a review upon my exit. INCREDIBLE! I didn't expect what I was going to get into tonight when I walked in at 8pm for dinner... I came in expecting something average. I have never been so wrong about anything in my life. I walked into what felt like a second home. The warm ambiance, the amazing fresh smell, and the feeling of years of tradition all culminate in this space. I ended up tasting almost everything on the menu with the guidance of the owner, Kenny. Started with the Penne Vodka and 3 hours later I find myself sharing a freshly slaughtered lamb with Kenny himself. We were knocking back incredible signature drinks until I felt I was ready to drive. I started saying my goodbyes to the kind staff until they insisted that I stay for the live music. Incredible traditional Albanian singers kept us all entertained for the next 3 hours and I had, hands-down, the best dining experience I probably will ever have in my life. If I make it home, i'll be back tomorrow."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdU8yMllBEAE",
            "text": "The owner son gave us free Coca Cola. We had the ossobuco, the food was amazing definitely will come again 💅"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbG9QZUJBEAE",
            "text": "Great experience love the food love the atmosphere great service ! Traditional food at its finest! Italian food at its finest!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXFXRjlRRRAB",
            "text": "Excellent food.  In particular recommend the roast lamb."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc1BiNXR3RRAB",
            "text": "Amazing Cevape (sausages). Get the Feta and grilled peppers \"salad\" that comes with. Also loved the Pljeskavica. If you're tired of Italian on Arthur Ave try Albanian."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMGU3YVV3EAE",
            "text": "We will definitely visit again! Everything was delicious and the service was top notch.  My first meal of the New Year with my love 🎉🍾"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmejlLX0hREAE",
            "text": "Nice clean place , friendly stuff , delicious food fair prices 🫡"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHBLcjlnRRAB",
            "text": "Excellent! I Recommend this place. Food was good. The staff was very polite."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2djdxMVNnEAE",
            "text": "Amazing food, service and atmosphere. Thank you for welcoming Parashqevi, showing love, care and respect!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M09HdjJnRRAB",
            "text": "Best restaurant in the Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHFDNDZnRRAB",
            "text": "Possibly the most amazing slow roasted lamb in NYC.   It may not be in the menu. So you have to ask for the “baby lamb”Nobody does this like the Albanians.  And no Albanian place does it like Cakor.     They run weekly mixed  specials in a casual kitschy Eastern European Albanian atmosphere.  The lamb is to die for.  They have some amazing appetizers , pickled veggies, roasted peppers in cream."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMmM3emV3EAE",
            "text": "Food was OK. Prices are definitely a little overpriced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdDR1cjBRRRAB",
            "text": "Amazing food! We ordered the veal special and the penne vodka, both of which were excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdF9QV2xRRRAB",
            "text": "Always a great time here- food is so yummy!\nThe ambience reminds me of being just like in Albania. The staff are really nice and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcU1LRnNnRRAB",
            "text": "Food and service was spectacular. The lamb kidneys were succulent and fresh. The place needs to bump up the ac"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bi15S1FREAE",
            "text": "Buenos días el día de ayer pedí una pasta que valía 20$ g me cobraron 30$ y al día de hoy no me dieron respuesta del asunto es un cierto incomodo por que la comida es demasiado caro y no muy buena"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMDRmeEdBEAE",
            "text": "Very nice restaurant and nice service. Great food, very recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOXFyN1hREAE",
            "text": "Go to place for cevapi in the Bronx."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREejRxYTlBRRAB",
            "text": "Authentic food and decent prices. Calamari was a little overcooked but no other complaints.  If you're looking for an alternative to the nearby Italian fare, you won't be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREa2R6WEZREAE",
            "text": "Ordered chevape with \"lepinja\". No lepinja only old bread.\nThere was no salad, no feta , no pepper with my order. Its was very expensive and for what? My bill was 29 dollars!!!\nI will not order again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeUxhUER3EAE",
            "text": "Good food!!! Their kitchen stays open late!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkX3Jub0xnEAE",
            "text": "Love this place I had the grilled kidneys and it was great. People fed me and we're open when most of Bronx Little Italy is closed after 9pm"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROaDgtbE1BEAE",
            "text": "Nous y avons pris un café et nous avons apprécié cet endroit. Excellent accueil du personnel, une des serveuse parle le Français avec le sourire. Je recommande cet endroit. Une terrasse couverte et chauffée pour les fumeurs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdDRHa0hnEAE",
            "text": "The best , people there are very friendly and the best thing is that you feel home on this place , love to go there and dine in with my family and friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObGFmV2NnEAE",
            "text": "Nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcmZEVDVBRRAB",
            "text": "Very delicious proper organic food!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ3RyM2ZBEAE",
            "text": "Nicht seriös, zu lange auf essen gewartet. Kein frisches brot, fleisch nicht durch. Einfach eine 1 von 10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcFBmSFpBEAE",
            "text": "Top notch"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbUtINDNBRRAB",
            "text": "Food was good, I just wish they put the bread in some kind of a bag or wrap instead of just loose on top of the takeout containers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbVpXc2RnEAE",
            "text": "Reasonable prices, good quality food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMEliRk9REAE",
            "text": "First time to this restaurant with my family Food was delicious. Very impressive. Definitely well deserved 2 hr drive from CT to enjoy .Highly recommend 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGZzhTN1BBEAE",
            "text": "The best in Bronx the food is so delicious and they have both albanian and italian cousine! Just you need to try it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabllEUk1BEAE",
            "text": "Traditional Albanian food. It was awesome. Service was fantastic and after 10 there is live Albanian music. I’m not Albanian, but if you’re in the neighborhood, I would definitely recommend it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1LWJMeXJBRRAB",
            "text": "An unexpected surprise was remembering how much I enjoyed Albanian food and running into friends that told me they were going to Cakor, located in The Bronx’s famous Arthur Avenue. They offer both Albanian and Italian but I was all about Albanian last night, but based on my experience, I’ll 100% be going back soon to try their Italian as well. We started with Calamari and salad, which respectively, was some of the best I’ve ever had. Both were super fresh, calamari was seasoned perfectly and the salad was refreshing. My friend had the roasted potatoes which may look like wedges, but have a totally different taste and texture, and was fantastic. The highlight was the Mixed Grill plate which has all of the famous grilled meats and sausages, along with some cheese and more roasted potatoes. I cannot explain the scope of flavor in each type of meat on the plate, as you should treat yourself and anyone willing to all that it offers. The wait staff was phenomenal and courteous, treating my wife as the only woman there, as well as lady should be and serving her. The food does take a bit longer than you may be used to but it’s because of how fresh it is. You owe it to yourself to go and try this place, as it was exquisite experience and I cannot wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzZXX3p3RRAB",
            "text": "We were passing through and we stopped to give Albanian food a chance. Good impression! Very friendly staff, very good food (we liked the stuffed pljeskavica), but the service was quite slow. There were quite a few people in the restaurant and perhaps that is why they took so long to bring us our food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MVlDcEl3EAE",
            "text": "Real authentic albanian food with additional dishes that are a combination of Italian and albanian cuisine. Can't get better than that, thats actually an understatement because my second time was even better than the first time. Food is made with love and is so flavorful. This place is a must try and its open late. The mixed grill is my favorite and it's a lot of food, bang for the buck. Staff is very friendly and also very informative for anyone who is trying their food for the first time."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVOGJuOVBREAE",
            "text": "Delicious food,awesome wine,awesome staff,house welcome entree was super tasty loved it! Thank you so much!will be coming back soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaklxUzZRRRAB",
            "text": "Loved the music! Good budget for a family of 4. Served by an excellent waiter, all food came in a timely manner. And lastly the food was delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOG96b053EAE",
            "text": "Great food\nGreat service\nNice atmosphere\n\nThey stay open until late and they have really nice items in the menu. Fresh food. Clean. Tasty and good quality.\n\nVery hospitable and welcoming.\n\nWas here after midnight and service felt like in the middle of the day. 😄\n\nMultilingual service. Knowledgeable for their products.\n\nCozy restaurant with a beautiful decoration and traditional costumes.\n\nA very rich drink menu as well.\n\n10/10 would recommend 😁"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcXFfdWRBEAE",
            "text": "Great European eatery that offers Montenegran, Albanian, Italian, Bosnian and Serbian dishes. The food is freshly served with large family sized portions and affordable prices. The food is traditional and rich in flavor. You'll will get great service and enjoy a taste of Balkan culture."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOGZ1anNBRRAB",
            "text": "This place gave us a strange vibe. It's like Albanian place, the food seems to be Albanian but with menu pretending to be Italian. At the end of the day you get something that doesn't resemble either Albanian or Italian cuisine. Bruschetta was mediocre, cevapi was mind-blowing so I'd recommend the owners to proudly feature Balkan cuisine in this place. The lack of printed alcohol menu made us feel funny. It's nice to have a lecture from the waitress on different types of wine but at the end of the day we just want to order something that fits our taste and budget. The outside garden sitting was very lovely."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c2RlZTh3RRAB",
            "text": "I dine here 2-5 times a day after work. Omg so good best staff. Delicious drinks / cocktails look for the Viking  Girl with the red hair she is amazing lol that’s our inside joke she really Lola like a Viking lol I love her she’s great, an artist in cocktails under rated I swear,  The best ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdGRDX0xBEAE",
            "text": "I went there with people from work for lunch. It was for all of us our first experience at an Albanian restaurant and it did not disappoint. We shared the mozzarella plate as an appetizer and for the main course each of us got something from the grill section (highly recommend) and each item was fantastic. The service was top notch and there was warm bread served with butter on the house. At the end of the meal the owner offered coffee or cappuccino on the house too. The food from the grill was just perfect and there is no skimping on the portions. The mix platter is a meat lovers dream. I got the stuffed burger with dry meat and sausage( I cannot say or spell the Albanian names) and it was topped off with a yogurt sauce and was scrumptious.I definitely want to go back with my family."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMzZpdEZBEAE",
            "text": "Wow, this place was amazing. Stopped here late night after visiting the botanical garden and it was popping at midnight. Music was blasting and women were singing Albanian tunes.\n\nThe service was great. Super attentive and friendly staff made you feel at home.\n\nI've never had Albanian food so it was totally new and interesting to me. I had the pjelkvika (?) - kindof a sausage patty - and various other spiced meats. All delicious. They went well with the roasted peppers and huge half loaf of bread served before the entree.\n\nI left very full and would def like to go back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldUpMaUJ3EAE",
            "text": "Update: bringing down my initial 5 stars to a 1. So who on earth upsells by 250%???. If I am ordering a $20 dish and then you propose the special (without clearly stating a price) don't you think it's appropriate to mention that your special is sold for $50??? And for real how can a Pelham Village steakhouse (you know rich ppl pricey neighborhood) can sell ossobuco for $33, cause I had that there just a couple of days before you sold it to me in the Bronx for $50? Who do you people think you are to sell it at Manhattan prices? Yeah I think my business with you is over. You have become just another overpriced place and neither your food nor ambience justifies that. Bye bye!\n\nFood is always great. Definitely makes you feel like you are somewhere in Eastern Europe from ambience to cuisine. Been there numerous times and they have never disappointed me in any way."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvN05pVTVRRRAB",
            "text": "Ok where do I begin. First of all, I am almost always disappointed with my orders on ubereats. I don’t give reviews because I was told if you have nothing nice to say don’t say it at all. After my experience at Çakor, I felt compelled for the third time to write a review. I ordered the mixed grill, spinach burek, and the hot antipasto combination. Ubereats said the restaurant was out of burek so I called and they weren’t. Long story short I ended up with 2 orangina and a burek for free not because the restaurant made a mistake but because I couldn’t order it on ubereats. I really wanted to love the food after this nice gesture, but I was skeptical. I’m pregnant and nothing satisfies me. I have really picky kids and both me and my kids enjoyed the food thoroughly. The mixed grill was succulent, every single peace of meat. The mushroom stuffed with crab, the shrimp was amazing. If I could give it more stars I would. Plz don’t change chefs. This was wonderful. I will definitely be back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOHB5OTlnRRAB",
            "text": "A hidden gem. Outstanding food and outstanding service. Every time I come here to eat I am never disappointed. The mix grill is wonderful, the osso bucco is phenomenal and the stuffed pljeskavica is incrediblely filling.... 5 stars all the way! 🇦🇱🇮🇹…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cUwzWXB3RRAB",
            "text": "Great atmosphere,  service. My meal of eggplant parmigiana was outstanding. Had a cup of cappuccino after dinner which was also over the top."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoLUltOGVBEAE",
            "text": "The lamb was good and very well prepared. However, the mussels were served cold very cold. and broth was not  that well prepared"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbDZ1QkhBEAE",
            "text": "This place allows indoor smoking, which is nasty. The food is amazing though. But feeling like I'm in the 1950s because of constant cigar smoke was unappealing"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURreWF5RXR3RRAB",
            "text": "Last night  i order food to go around 10 o clock went in  was music live but There were only 5-6 people and  they didn't start yet  and an albanian guy between 50-60 came in ,he was friendly saying hi to some of that he knew and he sit on…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaGNyLXR3RRAB",
            "text": "Fantastic Albanian Restaurant in Brooklyn Little Italy with live albanian music performance of True Vocal Music...love it even on a Wednesday 23.30 I came in and they served me Excellent Balkan Food 😉…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeE5hQzdBRRAB",
            "text": "Amazing food. The pasta is fantastic and the bread is out of this world. Its a must go place to eat. Fresh food like no other."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMThqa2VnEAE",
            "text": "Very good Albanian food. Wait staff very friendly. Food was seasoned perfectly. Homemade bread was excellent."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMXFmYU9BEAE",
            "text": "Food was great, service was excellent. Music was a little disappointing as they did not play music at all. Very clean, definitely recommend!!"
        }
    ],
    "reviews_count": 62
}