{
    "name": "Dawny Jeans Diner & Miniture Golf",
    "place_id": "ChIJnSG4cKIZ0okRuOAnqgj7WhI",
    "grid": "BX6",
    "address": "5429 NY-19, Belmont, NY 14813, USA",
    "rating": 4.7,
    "user_ratings_total": 188,
    "phone_number": "(585) 268-8086",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVVESlNaakZ3UldSQ1RsVlViVTVwYjBoWU5WRRAB",
            "text": "Great food and wonderful service. I love the menu and the servers are always so sweet."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQlkwRklPRFpTYzNGc2VITXpRMUV6U2xsSVEyYxAB",
            "text": "Ordered a Philly Cheesesteak to go, it was amazing. Best I have had around these here parts. The fries which I didn’t even ask if it came with fries, were great big steaming hot and amazing. If you like McDonalds fries, you wouldn’t like these, these actually taste like real potatoes and aren’t dripping with grease.  I will definitely be coming back."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcFJEVlVPRlJLU0c5alRuRlRSMmx4Ym1kRmFuYxAB",
            "text": "I read several reviews about this place which were all good so we decided to try it.\nWe were not impressed….\nThe burger was big which is a plus but it wasn’t exceptionally good and the fries were a thick cut which is hard to get cooked just right.\nI told the waitress I wanted my fries cooked crispy, they were not!\nI asked what type of lettuce they use but she wasn’t sure, she said it came off a head. I said so is it Iceburg ? She didn’t know so I said put it on the side which she didn’t so the lettuce was wilted iceburg lettuce.. yuck!\nThe prices are too high for what you get and I do not understand how it has such good reviews."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbU5sSXRaa1pCU1dsSlNrbDNjM1p5ZUdOVFIzYxAB",
            "text": "Not much to look at outside but pleasantly surprised inside.  Food was good, I'll go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U1RrdFVhVmxwZUVSWE1sRmpXR1JMZDJWaGJtYxAB",
            "text": "Homemade pies. Very good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYWIyRnpOek0xUTJwalJsUTJORWhzWVVGUk5XYxAB",
            "text": "Have stopped several times and the food and service is very good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MFNHZzBkRWx1TW05blRsTjBkMmhGVFdGclptYxAB",
            "text": "Good food at reasonable price!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q09UZG5SVkpvWDFCT1gwaDVjalpVWldkd01FRRAB",
            "text": "Always a great, simple meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S1ZtY3llaTB0TWxCRFEzcDFWbTlmTmxGVE5XYxAB",
            "text": "Superb food quality and service. Definitely worth a stop! Our first time there, and we'll be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVR6bHlhMGxyUjNkVVZrWkpTbFJoWVZkMU9HYxAB",
            "text": "Stopped in of i86 west and witnessed the American Dream. Dawney Jeans mushroom Swiss burgers were on point, and the homemade real French fries were good too. Food was steaming hot but not too hot. Loved all the little signs and the American flag and the 10 point buck! Truly inspired to start a little place like this in our hometown. Lots of hard work I'm sure but this place makes it look so good. Very good roadside place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMGVWSmxZM1Z6TmtzMlkzQkhVbkZMVUhvMGEyYxAB",
            "text": "Stopped in for lunch. Good food at a fair price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1EzYzNOV2cwTUhRMlZHUmtPRTAzUlhwTFdrRRAB",
            "text": "Great place for breakfast or lunch! Great fresh menu! Great staff, great prices, and even better food! You have to try the fresh cut fries!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaVMyWnNOR28wYVZwck5XTXdWVzlWVkU1MU5WRRAB",
            "text": "Awesome food,  good service, good atmosphere!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKN2c4TEw2b1p5MEhnEAE",
            "text": "This was a nice little diner to go to for a late lunch/early dinner.  They have a small Senior Citizen menu.  They have some gluten-free options to choose from.  They have ice cream and several pies.  Including, Strawberry-Rhubarb pie and blueberry pie.  They had a good salad and crispy chicken sandwich.  The unsweetened ice tea was good, too.  They do have at least one bathroom.  You can charge your devices at some of the tables, I did.  😎 😀"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMF9iOVZBEAE",
            "text": "Great food great service great prices, and to the older gentleman sitting by himself, I figured he was a local, enjoy your lunch on me sir, happy Easter 🐰"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ZzQ3Q0h3EAE",
            "text": "Yum yum 🤤 just saying first time here drive by it all the time first time stopping definitely happy I did"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMXY2NGt3RRAB",
            "text": "Excellent customer service and the food was delicious and priced right."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbVpXVmNnEAE",
            "text": "Best homemade Red Raspberry pie I have ever had in my life! Everything was 5 stars. My husband had the pork special and I had the Philly. Outstanding food and great service! I will come back when we are driving through again!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtd2IzVG1BRRAB",
            "text": "The food was really bad. We ordered lunch, cheeseburger and a sub. It was so bad, we threw it out, thought it was expired food. Off the list."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNk5mSnZBRRAB",
            "text": "Excellent service love the food great atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmejZfNXV3RRAB",
            "text": "My daughter and I had lunch here today.  We both had the stuffed banana pepper burger with fries it was the special. The burger was juicy and the fries were delicious everything was very fresh.  We highly recommend giving this restaurant a try the staff was all friendly and made sure we had drinks when needed and made sure to ask if we were satisfied with our food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmejlINXF3RRAB",
            "text": "The food was very expensive for what it was macaroni salad potato salad were good macaroni salad was dry on top though as far as the noodles go The hamburger buns were very dusty and disgusting hamburgers were dry with very old tomatoes. They do however have amazing raspberry shakes."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmd2Riend3RRAB",
            "text": "Our total was $33.33! Happy 5 year anniversary being open!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdllyRS1RRRAB",
            "text": "Place we found taking a back road to our friends.  Wow! Delicious home made food and it reasonably priced.  Bummed we won’t pass on our way home.  If you are driving close it’s worth stopping."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMF8zZGhRRRAB",
            "text": "I ordered off the menu. Wasn't crowded.  Waitresses said 10 minutes. It was an hour and a half.  Terrible food. Lousy service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ09mRXhBRRAB",
            "text": "Great fish!  Choice of Cod OR Haddock!  Basic simple and excellent ! Good coffee too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudFplOWRBEAE",
            "text": "Great place to eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIei03UGd3RRAB",
            "text": "Great food and service, hometown atmosphere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMVBQRTN3RRAB",
            "text": "👍👍We love it at Dawny Jean's 👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM2JfRDdnRRAB",
            "text": "Scio Class of 74 just had part of our Reunion there. The food was Great, highly recommend going there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMjdMQm13RRAB",
            "text": "On our drive through NY, we decided to stop at Dawny Jeans for breakfast. This is definitely a traditional diner experience, with a pretty tight menu of different variations of eggs, meat, and French toast. The owner was great - very chatty and accommodating with our young kids, turning on Saturday morning cartoons to help them eat their breakfast. Place was very clean, and it was not too far off from I-86.\n\nWorked for us while we were in a bind for food; if you're passing through the area, it is probably one of the better options around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ29IempnRRAB",
            "text": "I have to say hands down this place has the best food in our area! Every time we go here the food is always made fresh and very delicious. Their employees are always nice and will answer any questions you may have about their menu. We can not wait for our next visit. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyblBYa3J3RRAB",
            "text": "The food is always amazing when you come here and you get more bang for your buck when you come in. The employees are always nice. Essentially, everything is 10/10. <3 We can't wait for our next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyXzVQZFhREAE",
            "text": "Had an excellent lunch here, an interesting menu with great food and service, plus the best collection of humorous signs we’ve ever seen."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMN0ozX3hBRRAB",
            "text": "Great food great service great location"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MFp6cjlnRRAB",
            "text": "Everything was fresh, good variety of food on the menu, and good service. You have to try the Cheesecake rolls. They are amazing!\nOnly negative was that there was a news station playing on the TV that took away from the homey feel of the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeDZqUkRnEAE",
            "text": "The service is always great and I love the milkshake and burger and fries. I try to go there when I can."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqei0ta3RBRRAB",
            "text": "The service was quick and friendly.  The food was really yummy. Definitely will eat there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdFB6ajd3RRAB",
            "text": "Great food. Very clean. Great talk with the owner!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURscnZIWlFBEAE",
            "text": "Excellent food! Friendly workers. HIGHLY recommend!!!!\n4/26/24 update: still excellent food and attentive workers. The cheese stuffed bread sticks are the best!!!! 😁"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMzd6RTdnRRAB",
            "text": "Great food. Friendly staff. Enjoy eating there and take outs are super fast . Very clean and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREN3V5NFhBEAE",
            "text": "Food was great, perfectly cooked burger, the printed menu didn't have many vegetarian options but there were some awesome specials.\n\nGreat hometown sort of place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ05YaktnEAE",
            "text": "Had pancakes and sausage and wasn't good, didn't even finish"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ODltMXhRRRAB",
            "text": "I Love this little Diner. The food is Great and people are so pleasant.  Would recommend Dawny Jeans"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OXJiN2RREAE",
            "text": "It was very nice to see a well put together menu and with great taste. Thank you for this experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ck1hVWVnEAE",
            "text": "Tried the Fish Fry a few days ago and it was excellent! I am very picky about fish frys , there are not many places I like, but this one will be put on our regular list. And oh my goodness, also tried the cheesecake rolls..mmmm so awesome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaExTR1ZREAE",
            "text": "We came for the fish fry last Friday night. It was by far one of the best fish frys I have ever had. They offered cod or haddock .A choice of baked potato or garden salad is the only thing that could have made it better. The coleslaw was excellent.  The staff was very friendly and attentive. I will definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbmYzMi13RRAB",
            "text": "Excellent service and food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGZ5TllnEAE",
            "text": "We love small family establishments and found ourselves in the area and hungry!  We read reviews and decided to visit,  and we enjoyed a nice late lunch.  Food was delicious,  service friendly and prompt and atmosphere was comfortable 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGLUlmSDd3RRAB",
            "text": "Great food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodjRPOWxRRRAB",
            "text": "We were just there and it was delicious!! Mushroom burger and BLT wrap, fresh cut fries!!! Delicious!! Maybe one more piece of bacon in the wrap!?? Please! The dessert, raspberry roll, was to die for! Yummy!! We will be back! Thanks! Price was comparable to most other places and well worth it! Waitress was friendly and helpful and very professional!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eEpfS3lnRRAB",
            "text": "Fantastic food, and great company! Had the mushroom burger with fries and both were homemade. The burger was huge with an ample amount of mushrooms and a large portion of hand cut fries that were cooked to perfection which is seldom the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeVpYLWlBRRAB",
            "text": "We get over to Dawny Jeans a couple of times a month.  John and his staff are very friendly and Dave and I have never had a meal we didn’t enjoy.  There’s always a chance to run into friends and even making some new ones.  We live in a very rural area and are thankful to have a decent place to dine out in our hometown."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXX3BmVXFRRRAB",
            "text": "WOW!! I just had the best fish fry ever!\nA battered haddock w/tarter sauce, potato salad, cole slaw, a roll. Delicious! That potato salad sure was homemade. The staff was friendly. Next time I will…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHckoyT0d3EAE",
            "text": "Excellent food. Reasonable prices. Fast service. Only 3 stars because after we were seated and looking at menus, we were asked to go move our vehicles. We hadn’t parked in the “lines” because they were covered in pine needles and were not…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eW9TbzFRRRAB",
            "text": "So Adorable The table and chairs are antique and so charming yet they are updated with latest technology with specials board and register capabilities. Food was so good. Can’t wait to go back for the he Brussel sprouts  yep I said Brussel sprouts. Clean quaint Friendly!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5bk5yN0lnEAE",
            "text": "Ordered the Chicken Club Salad  and Mushroom Swiss burger. Dawny Jean's did not disappoint, the food was delicious. Made fresh, and the portions were more than generous. Definitely will order again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaDZLSmNBEAE",
            "text": "I love this quaint little place named after our late mother Dawn Hall-Layman. It has been amazing watching you John find your niche in life and make your dream come to fruition.  Mom would have loved this little restaurant and anyone that…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMy1fYkNnEAE",
            "text": "Myself and a few friends of mine went to dawn jeans for lunch and choose this place because we had great food there but on this day we had gotten prime rib sandwich and cheeseburger all with fries and half hour later we are experiencing food poisoning we didn’t eat or drink anything after coming from this place. So not sure what had happened. Do you have a new cook? But will not be coming back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d2I3NWVnEAE",
            "text": "Great service awesome food I have been here many of times, starting to become a regular outing just can't get enough. The owner even brought my leftovers out to the car before I left when I forgot it on the table."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOGRiN1pnEAE",
            "text": "Awesome food, awesome prices. Fish fries Friday and Saturday,  prime rib every day.  My wife and I just ate and the bill was 20 bucks and some change.  My ice tea was only 1.90"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScFlpWFJ3EAE",
            "text": "Absolutely delicious.  Friendly owner and waitress, found this place by accident and traveled back almost 100 miles the following week. The food and prices are great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXLTgzQ1hREAE",
            "text": "Excellent. Awesome French fries and they were hot! Not our first time and we are always very pleased with our orders. Staff is so personable. A definite go-to!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2N3RYTHhnRRAB",
            "text": "Amazing..you do not leave hungry! Fast and friendly service. Homemade fries and good food. Very clean and from what I hear, this is only the beginning to a bigger dining area and putt putt golf is making a comeback. 😀…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMnFhdTdRRRAB",
            "text": "Fantastic lunch, comfy atmosphere, excellent service.  Burgers were delicious and if you like fresh cut potato french-fries, these are thicker cut and excellent!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5akpEZ0RREAE",
            "text": "Broiled cod on Friday is outstanding - homemade coleslaw very good, not too sweet.  My husband loves the REAL French fries, not processed from frozen potatoes!  Quick, friendly service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NjdiRnpnRRAB",
            "text": "Excellent service and food. Just passing thru and didn't want chain restaurant. Worth the stop for sure. We had the Mushroom Burger and sliced prime rib sandwich."
        }
    ],
    "reviews_count": 67
}