{
    "name": "Aqua Bar and Grill",
    "place_id": "ChIJK_KQ10j1wokRWcn0FUVAAXY",
    "grid": "BX6",
    "address": "2241 Washington Ave, Bronx, NY 10457, USA",
    "rating": 4.2,
    "user_ratings_total": 211,
    "phone_number": "(718) 450-8898",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU01XRkhVbEJGVlVKNk4ycG9UMnBUV1VwcVJuYxAB",
            "text": "Came on a Sunday night at 11pm and they were closed even though google says open until 4"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVU9ETlZOM0YxYVhoSk16aDFRMHBqTnpsVWNWRRAB",
            "text": "I’ll start off by saying I’ve been here several times and never had an issue until last night. The food and drinks were good. They play mostly Spanish music while the majority of customers are black. When the check came my friend and I decided to split the bill with two cards. The waitress charged both cards a service fee when we were paying for one bill. They try to find any type of way to get extra money because they’re not getting business unacceptable. Now I see why there was only 3 tables taken. This place went down hill and I will NEVER come back here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT3NuTE9zaC1Ua1V3EAE",
            "text": "Nice place and very nice services. Love the place and will definitely come back again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbDdIVFh3EAE",
            "text": "We had the blast last night the food was good the service was good the waitress is really attentive her name is Lina she’s really really good and friendly. We’re definitely come back to the place❤️❤️❤️❤️"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdHR2RS1nRRAB",
            "text": "Buena comida, buen ambiente!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdHV1U1d3EAE",
            "text": "Amazing place!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcEoyNEtBEAE",
            "text": "Food is great! This is me and my friends second time going there for the same meal. We always get the platter that comes with Tostones, Mozzarella sticks, Chicken Croquettes, Pastelitos, and Wings. It is sooo bomb! $30 on a happy hour day, which is everyday, plus its one of the few places in the Bronx that do happy hour late. Everytime me and my friends go, there are barely people there, maybe it’s fun on the weekends or at night … not sure, but we went on a Monday, then again on a Friday, literally only 2-3 other tables active. Service is okay. I always notice the workers are doing hookah with another table and barely paying attention to their tables, she did come a couple times asking us if we were good and food didn’t take that long to come. The atmosphere is great, looks super nice in there, they upgraded their seats, the outside area is very weary tho, dark, no one in the area, wouldn’t suggest you standing outside the place for any reason, call your Uber inside and don’t come out til its there because the area isn’t that good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bWNQSENnEAE",
            "text": "Aqua Bar and Grill... if you're driving, there's not much parking in the area. The location overall - it is a party vibe type restaurant, especially during happy hour times.  The music was loud. I do commend the waitstaff service of two specific working individuals, which was spectacular. The food and drinks were good (from what I was able to taste). There are only high-top tables available at the time we went - for those who have issues with that, and the spacing was more club style. The hookah was ok/good for the location but not the best for avid hookah smokers. The patronage of the area personally turned me off as it is treated as an IG spot, so everyone's constantly posting Tik Toks or on Live around you. The one bite I had of my empanada was good. I couldn't really eat my food or drink as much as I wanted, because the party behind me kept dancing crazy / over the top, therefore, kept bumping into me or my chair or had someone's extensions/braids swinging in my mouth. For me personally, it's a one-time experience location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib1p2RzdnRRAB",
            "text": "The music was very good and severance were very polite and kind. I will recommend anyone to come here as they will have a wonderful wonderful time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbUx6THVnRRAB",
            "text": "Service is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OGRtZjl3RRAB",
            "text": "Decided to try this place after work after seeing IG page!!! Im soooo sick of being bamboozed!!! The place was empty, dj was playing all spanish but did switch the music… service was on point so was my drink ( henny colado n henny sangria) but OMG that appetizers were HORRIBLE. We ordered the Buffalo wings. Calamarie, the mongo with shrimp n i asked for tostones with GARLIc sauce!!! EVERYTHING was soooo salty we could not eat it!!! They did replace the tostones n gave me more of this nasty salty sauce!!! I was OVER this place!!! We left hungry n i had the worst pressure headache. And the area is not the safest!!! Im still mad smh"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ek1PbjhRRRAB",
            "text": "First time experience. What had me sold was their happy hour ending at 9:00P. I didn't care for the atmosphere since the majority of the guests where \"extremely young\" and all you saw was this group or that group doing the latest viral dance or with their phones high in the air recording themselves singing a song (not even paying attention to their \"fake\" hair hitting guests multiple times). The closeness of the tables was annoying as well. I feel the DJ only catered towards the younger crowd, which was fine but when other guests enter the vibe should switch. We only stayed 1 hour before going elsewhere. Overall, it wasn't extremely horrible but it was far from the best and I'm unsure if I'll give it another chance."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cV9uOUpREAE",
            "text": "Gracias por el service, Mirna nos atendio excelente. Muy ambiente y excelente comida."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbC1DOWJnEAE",
            "text": "I had such a good time. I mean to come to a spot in the Bronx and actually have a good time is hard. From the walk in we were treated like family. This is officially my favorite spot in the Bronx. I’ll be coming back for sure."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeTl2LTdBRRAB",
            "text": "Execelente lugar muy bien ambiente muy buena su comida y sus variedad de tragos"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeTR1NThBRRAB",
            "text": "Me encanta la comida , muy buena! Música variable y excelente servicio !! Lo recomiendo 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeTQyQ0VREAE",
            "text": "The Card Machine is down. The food is sub par but now you’re charging high gratuity? You’re running an establishment and you’re not letting people know the card machine is down. And then the ATM is charging wHaT as a fee? I’m disappointed… on a birthday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdi1pRGt3RRAB",
            "text": "Great atmosphere, highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdGZqOG1nRRAB",
            "text": "Good for happy hour. The music is just disturbingly too loud in general. Wish the dj was more diverse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGODZpaTJBRRAB",
            "text": "The atmosphere is very nice, very clean. The DJ was great. The hookah was good. The service was not so good. My bill was over $395, and we didn't have any food. The waitress forgot to put the food order in. I didn't know how she forgot it wasn't crowded. She did however gave us  calamari on the house. They put too much  syrupy in the margaritas. The money spent on shots we could have gotten a bottle. I won't be going back there, but check it out for yourself. You might have a different experience ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MFp2TkhREAE",
            "text": "The food here is great ! I love the mozzarella sticks. Great prices ! They also serve hookah. Mario I believe he’s name was made mine that day. It was very good ! Will be telling my friends to come with me next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNTRHNEtREAE",
            "text": "Came here based on what I saw on Instagram. The Happy Hour drinks were pretty decent. We explained to the bartender exactly how we wanted it and he was able to accommodate. We also had calamari along with mofonguitos. They were good, just a bit small in portion. The chicken nachos tasted stale. The service was really good though. The atmosphere was cool, Instagram really enhanced the look of the place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcm9fRUZBEAE",
            "text": "Empty on a Saturday night.  Run punch tastes like dirt, but got me drunk"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcXVyNDBRRRAB",
            "text": "It was  pretty good. All though the  bar tender was rushing us to  pay as if we were going to run away with the money, but I the end, I found out that she just had to go home but it was great I'll definitely go back for a visit"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdDRfbmVBEAE",
            "text": "Food was good\nI order from Uber eats  the fish and chips and the Rasta pasta! Bussin we recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4a3ZqeHJ3RRAB",
            "text": "Food was okay, drinks were not as strong, had 2 Henny coladas left sober as hell! But the service was trash! Will not be going back ! Too bad they have good Djs because the music be on point. Everything else is a NO."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eWZUTGlBRRAB",
            "text": "this place serves undercooked pork and gave me food poisoning. don’t recommend at all unless you wanna throw up all day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ak1MOEpBEAE",
            "text": "Wish bartenders would pay attention instead of texting on WhatsApp esp if im sitting at the bar"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazk2QnNnRRAB",
            "text": "Food was amazing. The service on the other hand was not good. We were one of 3 tables but the server was much more focused on her phone. We asked for a box which she brought promptly and then proceeded to sit in her phone for 10 minutes. Eventually we were able to get her attention to ask for the check. She brought the check and immediately went to sit on her phone yet again; as if it takes longer than 30 seconds to get my card from my wallet. After waiting another 5-10 minutes for her to return to take my card I ended up walking it to her.\nFood was good enough that I would still go back though"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldGNLc2FBEAE",
            "text": "Some of The Best Food in The Business and On Top of That Some Great Music on a Tuesday Night 👍🏾 A+++"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScTY2MFlBEAE",
            "text": "Food was pretty decent, the drinks were also pretty good, and the service was amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNnVXS01BEAE",
            "text": "I came for that brunch sunday special and was not disappointed! The drinks were great, and they gave us the perfect amount of food.\n\nLoved the live DJ!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaXVPTUNREAE",
            "text": "Good music, good food and strong drinks.... all of this on a Wednesday night,  not bad at all.. I'll definitely be going back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMjRIN1FREAE",
            "text": "Cozy local Hookah and bar offering a nice variety of drinks and menu options. DJ was awesome. Kept the tunes trendy. My cousin enjoyed her birthday celebration,"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMUtuZHhRRRAB",
            "text": "I had a late appointment by in the area and was hungry. I did a quick Google maps search saw the food picture and yes the food is as good as the photos.  My pork chops were cooked perfectly. Side salad was fresh. Service was very good too. Good staff too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHLU5iQ1FnEAE",
            "text": "Ordered from the TACO TUES menu the drinks tasted like juice . It didn’t even taste like any kind of liquor, it tasted like someone just finished bartending school and made the drinks & added food coloring. The $3 tacos we waited a while for we received them cold. I also informed one of the employees it was cold he shrugged his shoulders. They should have options of the taco you want instead of just flour taco. The amount of time we waited you would of thought the tacos would’ve been good but I guess we got the 3$ worth ( HORRIBLE ). The hookah guy kept coming to us asking if we are done with the hookah or needed a refill every 15mins, that was very annoying. I would not come here again ( Tuesdays )"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPa0ppdVhREAE",
            "text": "It could be better. Service is average. Food and music are good. Would not be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbnZtZUhBEAE",
            "text": "The food was great.  The prefix menu had enough options for the price which was another great score.  Julio made perfect coffee each cup AND he sang his heart out the entire time providing live music,  gratis. Long live Julio. Maritza was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPLUtYa3NnRRAB",
            "text": "First time here and it wasn’t bad. The customer service was good. Paola and the hookah guy were very professional and welcoming. The music was great. The bathroom wasn’t dirty when I went there. The appetizers was small but I would still come back again. The drinks were on point."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Nzd2MWtnRRAB",
            "text": "Fair warning that my review is solely based on the nighttime activities held in this lounge. For starters the music is solid and the crowd is always a good time (although sometimes rowdy). One thing that really stayed with me is how serious…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcTQ3V2pnRRAB",
            "text": "Dope spot. First hookah is free for happy hour. The drinks hit hard too! Been there a couple of times. Well continue returning. Excellent, chill spot! We posted up for a lot of drinks and food, which was outstanding as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteHVmUjJBRRAB",
            "text": "I have been here many times but the other night wasn’t a great experience at all. The food was ehhh and the hookah wasn’t good at all. I felt it was very unprofessional that flyers was posted that you can get free hookah between certain times but they turned around and was charging for the hookah. Everyone should’ve gotten the free hookah and that other promote should’ve waited and started another day. Management unorganized and just need more training. Your Ig is promoting many things differently and when you get to the lounge your being told different things."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdmRQQ2tBRRAB",
            "text": "I am currently here with a party of 13. Absolutely disorganized. Music was good when it wasn't messing up. Food was meh...could have gotten better service at mcdonalds. Food service was painfully slow. Servers mixed up the guests food...like maybe service is better with only a party of 2 or 3. I'll come back with a smaller group hopefully it will be better.\n\n3 stars because this becomes a poppin lounge after 6pm on Sunday. Dj is great. This spots gets hot not enough ventilation...lol"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxM2JIQzhRRRAB",
            "text": "The place has a nice vibe, but the service isn't great. My party ordered food that took forever to get to us and also we never got our check. We ended up getting up and walking over to the cashier so we could pay and leave. Overall all, it's a chill place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHd3NpQzNRRRAB",
            "text": "We ordered for the first time last week. The churrasco was well seasoned, even the veggies were delicious. My husband shruggs with no commitment when you ask if he likes anything we order. Not this time, he actually liked his food so I was sold. Jump to today, I order again, there's a mix-up. Normally, there's drama, confusion, and frustration but Jose was beyond helpful. Jose figured out the issue and made sure to get the correct order to us quickly. I wish I had cash on me to tip the driver, that's how happy I was thanks to the way Jose handled everything. Also, the food was just as delicious this time. The tres leches, yum! I highly recommend this spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dl95elRREAE",
            "text": "We celebrated my son's birthday and we turned aqua out. The d.j. was great, everyone felt their drinks and the staff was great the food wasn't great but it wasn't bad either. It was definitely a good vibe."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eWRtVnh3RRAB",
            "text": "The first time I came here with my girls it was cool, great vibes good English/Spanish music. The second time I came here with others was a different story . When I first entered it was good music playing, I literally left to get the rest of my friends and came back and there was dembow playing so I ask (because it’s my friends birthday) are they going to switch it up throughout the night, they said yes . I notice they still didn’t change the music so I thought to myself it’s still other people here enjoying let me give it a bit. So fast forward 30 minutes later, we’re the only ones left in the bar we’ve already eaten food ordered drinks hookah  and they still haven’t changed music and now my friend is feeling uncomfortable (she doesn’t know Spanish) and I recommended the spot. So I ask him once again can he change the music? And he plays one A boogie song and goes right back to dembow music. This was clearly a party for the employees themselves (they were drinking enjoying themselves dancing to the music) and not for the paying customers who were the only ones in the bar. Then when my friend went into the bathroom she noticed a man that worked there followed behind her when she went. Twice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtX1Atd0Z3EAE",
            "text": "Dj was good & the workers pay attention to you so I gave the place a 4 for the service. Idk if I had a bad drink or not but I ordered a Long Island ice tea that was extremely watered down? First drink of the night & it taste like juice. Very upsetting as I never went back to the bar."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4NjVmR3JRRRAB",
            "text": "it was great! everyone was really helpful & friendly and constantly checked up on us even though they seemed to be busy. that’s how it should be. we weren’t neglected once, the food was good. only thing the hookah setup was trash, so that’s not worth it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXenA3UFR3EAE",
            "text": "They accommodated me and my friend with appetizers after throwing our food away. And had good hookah but their music? This is not a spot that favors American music. It’s a Hispanic spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOE95RUxBEAE",
            "text": "The drinks and music was on point!! And they got REAL mozzarella sticks y'all!! Lol they had flavor and they were crunchy and the cheese oozed out lol. I will definitely be going back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bk1qWFd3EAE",
            "text": "Prompt service and amazing music. Two dislikes though: they are CASH ONLY and the server is always looking to close the check. The hookah guy though, he was amazing!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMkstLTVnRRAB",
            "text": "Very nice place and atmosphere...only downfall is that the people taking the orders party more than they work. It took 15 minutes just to get the guys attention. On top of that...my order was wrong"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcVlDYXdBRRAB",
            "text": "The area isn’t great. The food was not good at all. The only that wasn’t awful were the service  and the music. It’s the type of place where people don’t care about the food only the hookah. Not worth it at all."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X0x5cmNREAE",
            "text": "first time going there andc really enjoyed the food and drinks.   the dj was pumping for Sunday brunch so i can imagine what a Friday night must look like!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhaE5Ic1RREAE",
            "text": "This place is fake they try to charge us $40 dollars each saying a celebrity was going to perform and it was a lie we was testing them all night ones I ask when the person that was going to perform coming they decided to give us out $40 dollars back be aware for this scam i don’t recommend this place to nobody I will make sure this place get shut down all night they keep lying saying the the person that was going to perform was coming first they say 2:00 in the morning then they say 3:00 in the morning they fake and scammers in the end they said that person that was supposed to come to perform not coming so they gave us our $40 dollars back they really thought we was stupid but we smarter we test this place all night they with they fake yellow wrist bands just BEWARE DONT GET SCAM"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcDhqeHh3RRAB",
            "text": "A very nice and cozy place to hang out, food is reasonable and tasty and service is good and I love the menu style."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdU5DYVpREAE",
            "text": "Taco Tuesday.....Amazing!!!! Staff were attentive and service was fast. Food was good. A nice little spot in the Bronx."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcTdDNllBEAE",
            "text": "I didn't give  5 stars since management was hostile and quick to call security when I claimed about the drink quality but the waitress sey was above and beyond."
        }
    ],
    "reviews_count": 59
}