{
    "name": "Wicked Wolf Bronx",
    "place_id": "ChIJ-ZqZEBiLwokR-F0TH-ryllQ",
    "grid": "BX6",
    "address": "4029 E Tremont Ave, Bronx, NY 10465, USA",
    "rating": 4.5,
    "user_ratings_total": 829,
    "phone_number": "(718) 829-4400",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MlJtNWFUbkkyU1RWd2VXeDJVa2sxYjJsNVlYYxAB",
            "text": "It was good"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSFpFNU1aRm93YVhCT1pYbHhPVlZmWnpsWmEzYxAB",
            "text": "Had a reservation/catering for a large group, for the price the service was terrible. Place seemed understaffed for a Saturday but still doesn’t excuse servers attitude. One literally threw a plate down on our table and walked away. Didn’t even let us make space for it. I wish I was exaggerating. We were there for an engagement and the atmosphere just felt hostile at certain points.  Bartender was overwhelmed too and it showed in quality of drinks. Food was good at least and our main server was doing her best. Don’t think I’d come back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFNFWkpjRTlaZUVWYVdFZFFVM2hhY2xvek9IYxAB",
            "text": "An excellent spot for a casual family dinner.  There were plenty of options for everyone.  The service was good and the atmosphere comfortable. The food was fine--not impressive but fine.  It was relatively easy to find parking on a Saturday evening and overall, a very pleasant experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cVNHdHJNbTFKYzJkMGExTmxaM2xtWTFWNVMyYxAB",
            "text": "Very nice place, food was filling, and music at an enjoyable level. Wolfarita good and strong. Great decor and ambiance. Would go again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSk0ySTBSVk5ZY3pKNFVWbHBhREZpVGtJMFRYYxAB",
            "text": "Went for a quick bite last night. The soda was flat. Waitress just looked at me when I commented. My friend and I didn't drink them. $6 each.\nThe food was good.\nNot thrilled."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMUpLQ09nEAE",
            "text": "Some good wings"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MmRGaDBVMDFHUVROalpXSTBjSE5uVVc5WGVHYxAB",
            "text": "Worth it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFJrTlljRTFOWms1RFRUQTJjamh3ZEdnME9HYxAB",
            "text": "One of my favorite spots Seamus is an experienced bartender that understands you can pour your own drinks at home and makes the experience and conversations worth the visit. Great environment and atmosphere bar / dining area split invites diners over to watch sports after their meals. Modern day Cheers folx; stop in and witness it for yourself preferably on a game night 😉🗽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWlFXbG1hbkpvZDNaNFVrNHdhamxEWmpOdVJFRRAB",
            "text": "Honestly, 10/10. I most recently had my son’s graduation party and it was a great space to host my closet friends and family. Destiny was great at solidifying the details leading up to the date of the party. Sam and Raquel were our party host and they did an amazing job!! The food was 10/10 and the service was a 10/10. I will definitely host more events there in the future."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsb2NuUnNSSGxVUW5aaFpUQXlNRk4zTFZoelJWRRAB",
            "text": "Good food, nice staff, big bar, parties in back, sports TV\nMusic too loud"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMMmN0TTNZNGRQa1ZREAE",
            "text": "Would not recommend. They do not answer the phone for order pick up or delivery. When you place your order, you will wait 2 hours for them to deliver your food. It's ridiculous. Call other establishments for better service and time delivery. I would recommend. HK kitchen on east tremont."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNcjJxb0NCbDlPbEJBEAE",
            "text": "It was long for the food but it was good the best thing was the burger"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2JxeVFnEAE",
            "text": "It used to be one of my top 3 places, but unfortunately it hasn't been up to par in the past couple of years at lunch time.  I can't review dinner or other times because I do not go at those times.   Food & service are both mediocre , at most lately"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcHUzcjdBRRAB",
            "text": "We had the best waffle fries with homemade gravy I've ever tasted in my life. The shrimp quesadilla were good as well. We came here because we were impressed with the food they donated to St. Frances de Chantal for the  Daddy Daighter Dance. We will continue to support our small community businesses, especially The Wicked Wolf."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaWEyRFJnEAE",
            "text": "I have never had a bad experience with the food in all the years coming here. Tonight it was not good. Ordered sliders that were med rare and the blood was coming out into the juice. Then ordered the irish nachos and those were super soggy, the cheese was barely melted and warm on the fries and there was practically no bacon. My friend and I ate it just bc we were starving but the food left a terrible aftertaste. Seemed rushed on not too busy of a night"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXy15X2dnRRAB",
            "text": "Nice atmosphere, good service, good food!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReDlLWUtnEAE",
            "text": "The Wicked Wolf had me at hello with the wonderful music, songs you can sing to! Our server, the manager Jen was a warm and friendly person with a smile that made you feel at home. It was a lovely menu with with large servings... enough food to take home! Great steaks and burgers, with fresh (hard to find) onion rings! Jen was really helpful and you can tell she cares about every patron that walks in... heck, they all did! It was a nice break for us, we'll definitely be back to try more items on that menu!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDlhMjF3RRAB",
            "text": "Ordered pickup 2 days ago. 3 of the meals were good! 1 order was the French dip  roast beef. Thought it would be great but the beef was rancid! Needs a lot more quality control! Absolutely no reason to serve rotten meat!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbGRQSjlnRRAB",
            "text": "The staff is courteous and professional"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLVAyME1nEAE",
            "text": "Had the Thanksgiving me or hear it was oh my God great so much food great time nice atmosphere The waitress was so nice My family I had a great time"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQME8yMWpBRRAB",
            "text": "Go to spot in the neighborhood"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdHRtdjZnRRAB",
            "text": "Great food and beer.... Bartender was great"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eWZ2cGFnEAE",
            "text": "The food here is exquisite. It's delicious on every level. Did you want really good food? You want to go to a bar and hang out with a good atmosphere and good people and good prices go to Wicked Wolf on Tremont ave in Throggs Neck"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWNUOEh3EAE",
            "text": "Really went downhill! Service was fine, nice people, but the food was awful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueGF5eGVBEAE",
            "text": "I was waiting to order food at the end of bar…  a dart game was played behind my head. When I noticed I asked them to stop and the reply was…. Well we are in the middle of a game."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaExySU1BEAE",
            "text": "My local spot does a good job on their dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cGNHdFh3EAE",
            "text": "Just threw a bridal shower here (Sunday Brunch Shower). Everything went so smoothly. Jen, the manager, is great. Very responsive and attentive  The private room was spacious, food was delicious, good wine, and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bDZYLUxBEAE",
            "text": "OMG THESE RIBS WHERE OUT OF THIS WORLD!!!!!\nTender juicey coming off the bone tender the baked potato veggies amazing this is my new favorite WOLFFFFF you guys ROCK thank you for bringing back ribs the way they should be ❣️❣️🍺"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bGZEWEtREAE",
            "text": "Great atmosphere. Lovely location. Food was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydTZhME93EAE",
            "text": "The place had a nice ambiance on a Sunday.   The service was perfectly attentive without being overly so.  The food was great. The sliders were delicious.  The shrimp and scallop pasta was amazing.  The slab bacon was very tasty.  My husband loved the Shepards pie.  I did not care for the clams casino but everything else made up correctly it.   Cannot wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM28yLVJREAE",
            "text": "Disorganized restaurant and incompetent staff; can’t even get their menu and opening times correct!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNXVXVXd3RRAB",
            "text": "Traditional pub with more offerings than most. Pretzel sticks were soft and buttery, Buffalo bites were crispy and not roo spicy. Everybody enjoyed a nice father's day meal and a cold one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NThMa2dRRRAB",
            "text": "Had a chance to check out Wicked Wolf in the Bronx recently and it was quite the mixed bag—but mostly good! My date ordered the Hot Honey Chicken Sandwich with steak cut fries, and honestly, it was a knockout. Easily one of the best chicken sandwiches we've had, with just the right kick of sweet and spicy. Definitely a must-try if you visit.\n\nI went with the Chicken Scarpariello, which, unfortunately, didn’t hit the same high note. The chicken was overcooked and tough, and the pasta was just alright. Not terrible, but not something I'd order again.\n\nOn the brighter side, the service was excellent. The staff was friendly and attentive, making sure we had everything we needed. Plus, the prices are pretty reasonable, which is always a bonus.\n\nDespite the hit-or-miss dishes, I’d definitely swing by Wicked Wolf again. That chicken sandwich is worth a return visit, and I'm keen to try some other items on the menu. If you're in the area, give it a shot—just maybe skip the Scarpariello!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b0tTY0d3EAE",
            "text": "I recently visited Wicked Wolf in the Bronx and had a fantastic experience. The atmosphere is lively and inviting, making it the perfect spot for a night out with friends or to catch a game. The multiple TVs ensure you won't miss any of the action, and the overall vibe is energetic and fun.\n\nThe food is excellent, with a variety of pub-style dishes to choose from. The wings were a standout, perfectly crispy and packed with flavor. The burgers were juicy and delicious, and the portions were generous. Every dish we tried was well-prepared and satisfying.\n\nThe drink selection is impressive, offering a wide range of beers and cocktails. The happy hour specials are particularly enticing, and the bartenders know how to mix a great drink.\n\nService was top-notch. Our server was friendly, attentive, and knowledgeable about the menu. Even as the place got busier, the staff managed to keep everything running smoothly, ensuring we had a great time.\n\nThe bar and dining areas were clean and well-maintained, contributing to the overall pleasant experience. Wicked Wolf in the Bronx is a must-visit for anyone looking for a fun and enjoyable night out. Whether you're there for the food, the drinks, or the lively atmosphere, you won't be disappointed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReXRmY0NBEAE",
            "text": "Always get a great meal, very cost effective, family friendly atmosphere during the day, lively bar during the evening and the service is superb"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbHZlb09BEAE",
            "text": "Staff was friendly.  Nice touch with bread basket.  As a note, it serves Pepsi products."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaU9YTHZnRRAB",
            "text": "Great place between Jay the owner & DJ Tony Sinapi playing great music the atmosphere and people were friendly having fun. The best part is that getting parking was the easiest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkOXB6dU9BEAE",
            "text": "Went for Valentine's Day. Service was very great. Risotto was amazing! Great quiet spot with good spacing and room where people don't feel on top of you.\n\nSpecialty drinks could have been better. Ordered my usual dark and stormy and .y date had the same and it was way better. So get your usual."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOElYTk9nEAE",
            "text": "Excellent! Looking forward to our next visit! Service was slow but the wait for the food was with it! We started with Mozzarella sticks & Calamari.. Delicious...He ordered Eggplant Parmesan with Salad. I had a Medium well Ribeye Steak with baked potato and Salad..My Steak was cooked to perfection! I'm not a fan of eggplant but they may have changed my mind.."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aDlPdnJ3RRAB",
            "text": "They get 2 stars because the music was good, the food was good but the service sucked. It took awhile before anyone came to tell us we can sit wherever we like, before we received menus, before the waitress came to ask us for drinks and before she came back  to take our order.  Then it was FOREVER to get my salad and then FOREVER to get the dinner. The waitress came back to ask us if we needed more drinks and that was before the food was served or even my my salad. She didn't inform us if there was an issue with shortage of staff or cooks or anything why the wait was so long. It was like that was a normal wait to get food. Waitress staff was Very nonchalant and unprofessional about how long it took to get service. We're good tippers but there was no way we could tip well although it was still more than what was deserved."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaC1ISktBEAE",
            "text": "A cool local spot that has good food!! There's a woman who is the Manager/Owner, not sure what's her title, but she's very committed in doing table touches with guest, asking is everything alright. Shout out to her, great job!! You don't see that as much as you should, especially with a small business. 👍🏾"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldDh5MlRnEAE",
            "text": "The Bartender Joe was great! The food was excellent!  I had the fried pork cutlet with a mushroom sauce with egg noodles.  Awesome!\nNot sure what the German name is."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdEt2NTFRRRAB",
            "text": "They Have a full bar area, and cosy dining. Not very noisy. Clean. Friendly and welcoming. Either walk in or reserve. With a reasonable menu for classy and casual dining. Really nice. I loved it. It was my first time and would not be the last."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeWFIVFVREAE",
            "text": "Great food good service and good atmosphere.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhazg3eU1REAE",
            "text": "Ok service. Excellent food and big enough plate for two. Definitely worth checking out if you're on a first date."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhOU1HRFBREAE",
            "text": "Had the pot pie and thick cut bacon. So delicious. Drinks are cheap. Bartender was great even tho she was super busy. Good vibes Irish bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcGFtT0lREAE",
            "text": "Went there with four friends. We ordered calamari, baked clams and mussels, as our appetizers. Food was so delicious. Best calamari I ever ate. The entrees were so good too. Huge portions and the waitress Destiny was friendly and professional.  Always coming back to  the table to see if we needed anything else. The owner Jay stopped by our table to say hello. He is so cool. I highly recommend this restaurant,  you will not be disappointed"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNHMyVmhBRRAB",
            "text": "Great food great service and a variety of drinks. I go at least twice a month to the bar and at least 5 times 1 months to get food. Happy hour is the best half price appetizers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONGFTbHdRRRAB",
            "text": "I live in Throggsneck and had a lunch with family and this was my first opportunity to eat here. My daughter and Son In law have eaten here before and highly recommend Wicked Wolf. There were 6 of us and we are big burger fans so we had the traditional Wolf Burger, The Irish burger, and the rodeo, and they were all Great. 3 of us had the French Onion Soup and wow it was awesome and large. The server and assistant were great, I wish I remembered the Waitress's name(sorry). The manager even came over to check up on us and it was all perfect. This may be a new favorite restaurant  for us all, and felt bad we never visited The Wicked Wolf sooner. Highly recommend the location for Bar Food, Irish Food, and Italian style food it all tasted great to our family. Again Thank You for the great servers, cook and great food. Visited on Saturday approximately 2:00 PM and it was very busy and a private gathering.\nTHANK YOU AGAIN\nPAT M."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLVpqTjd3RRAB",
            "text": "Have not been to the Wicked Wolf for at least 10 years. I have lived in this area for over 25 years and used to frequently go for dinner and drinks. Have been wanting to go as I always had a good time. I was extremely happy that I went. The place is just as amazing as I remembered. If possible, even better. The food was fabulous and the service impeccable. The pricing was extremely reasonable. Drinks were standard pricing but well worth it. You actually get liquor not watered down ice (Nice). The atmosphere is calm and you don’t feel rushed. I will definitely be returning more often."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWNDlIamxRRRAB",
            "text": "Pub food staples including chicken wings, potato skins, Sliders, disco fries and Irish Nachos, etc. Decent beer selection. Where this place stands out is with its service. They're a restaurant and pub all at once. Servers are Quick, attentive and make sure your cup is never empty. Great place to watch a game. There's a great, game-watching crowd."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOUsyLWZBEAE",
            "text": "One of my favorites spots to go to, where everyone knows, your name. Featuring the Wicked Asian Burger"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSZzRHS3dnRRAB",
            "text": "I haven't visited Wicked Wolf in a while but when I did geez was I blown away by the amazing experience I had. The staff was incredibly nice and welcoming, which really added to the overall ambiance of the restaurant. The food was absolutely delicious and exceeded my expectations. I was especially impressed with the quality of the ingredients and the attention to detail in every dish. The menu offers a great variety of options, which makes it easy to find something for everyone. I would highly recommend this restaurant to anyone looking for a great meal and a friendly atmosphere. Thank you to the staff at Wicked Wolf for providing such a wonderful experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKejdXWDB3RRAB",
            "text": "My friend and I have been there on different occasions and enjoyed ourselves. The hosts are friendly as well as the atmosphere. Did I tell you that the food is delicious, yes it is. I’ve eaten several things off of their menu and have yet to be disappointed. As a matter of fact, my dad is visiting so we’ll be taking him."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeDY3UkxBEAE",
            "text": "This was my second time dining her, but first time indoors. Although the curtains on the walls made me question their existence, the rest of the restaurant was so classy and great. It seems like a staple in the neighborhood, and it is! Before even dining here, I knew of this place only because of a celebration that had in a parking lot during 2020. There were so many people and it was such a delight to see the neighborhood coming together! Nevertheless, their service was outstanding (albeit all the servers were waiting on us), and they were super nice because I had ordered an off menu item by accident! Thanks for the snickertini! Luckily, I had checked their website before dining so I'm thankful they still had veggie burgers. The other patrons and I were very happy with our meals as we were super full leaving. Recapping how the afternoon went brings a smile to my face. We were catered to appropriately with our waters being filled, were treated kindly, and the place was clean.\nWould highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkak5DdnZBRRAB",
            "text": "Catered a tray of wings for my super bowl party the whiskey wings to be specific. Whenever you cater food it’s normal to be weary about the quality, wherever you go, not here and not with these wings. It is now a day after the super bowl and I reheated them, and somehow someway they were better the next time. Absolute 10/10 would recommend to a president."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazc3ekNREAE",
            "text": "Came here on Easter Sunday. Was accommodated even though we were walkins during there reservation only evening. They were pleasant and very inviting. Food was excellent and we thoroughly enjoyed our evening. The only hit was on the timing of the food at times was a bit off but it did not diminish out enjoyment one bit. The atmosphere was clean and typical of that type of establishment. Again not a knock, just what you expect.\nI need to reiterate that I will come back here when next in the area and needing good quality fare."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNFA2MUJBEAE",
            "text": "Please don't get the Oktoberfest special wienerschnitzel. Either they didn't have the right meat available and threw something different in or worse just suck at making it. I'm not sure how you can mess up fried meat so that it's tough. Coating meat in breading is literally the easiest way to keep it moist and soft. I did bring it home for leftovers and eating it was more difficult than eating jerky. Also lacks flavor (I added my own sauce at home).\n\nOn the upside, their other dishes looked pretty good (though nothing amazing). The soup was good. They seem to do a good steak.\n\nAlso strangely, they had drink specials but didn't have the alcohols available to make said drink specials. The food also came out super super slow. I'm not sure how that happens on a Saturday at normal lunch time.\n\nIt's a huge menu so maybe they have some things on there that are good, but be prepared to wait for the food and potentially be disappointed. The ambiance was nice though. Music not too loud."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd29uajZnRRAB",
            "text": "I’m always happy when I can make it there for prime rib and the bacon appetizer is incredible. I adore the staff there they are wonderful neighborhood people who care about the business. I was worried about what the new owners would do because usually people come in with big ideas and ruin a good thing because they think the know better but the heart and soul is still there with very minor tweaks which I think were all improvements. Well done! My husband’s heart will break if you ever change that steak salad."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxLVB1TEZ3EAE",
            "text": "5 stars for the service and bottomless brunch. 3 stars for the food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbTVyMlV3EAE",
            "text": "Probably my favorite new york strip from a bar,cooked to perfect(i had it cooked medium)and had a nice seared crust."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dUxUMzlRRRAB",
            "text": "Love everything about this restaurant: the food, the atmosphere, the hospitality and the great service. This restaurant is truly a gem in the Bronx. There’s quite no place like this. I have dined in twice here and ordered take outs numerous times and the quality and taste of food always amazed me. Writing this review as I am munching on my favorite dish from here: Rib Eye Steak with Mashed potatoes. Highly recommended and a must place to visit if you are in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOGJUVDJRRRAB",
            "text": "The new owners have really outdone themselves! The food is the best it has ever been- fresh and delicious. The drinks are amazing and the service is extraordinary. They are constantly having events to bring the community together and it’s always a blast! Definitely recommend"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbWEyR1lnEAE",
            "text": "If you are planning on going there for dinner, make reservations,  it seems to be very popular from 6 to 8pm. Food is good, although I was expecting more German dishes. I was surprised to see lots of Italian style dishes (?).  The place is…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX1lHLV9nRRAB",
            "text": "The food here is so delicious.  Today we tried the Thai calamari, it was really good.\nAlso had the seafood penne. That's my favorite dish here.\nService was great.  Nice and quiet ambiance."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM1piVHV3RRAB",
            "text": "I went to the Wicked Wof on a Monday night, venue was clean and welcoming.\nThe service received was good and the food ordered was really good.  The Wicked Wolf serves Italian cuisine.\nOn Mondays there is a tarot card reader at the venue who will give patrons a reading for $20.00.\nIt makes for an interesting night especially if you are on a date like I was.\nOverall, I enjoyed the venue and would return."
        }
    ],
    "reviews_count": 66
}