{
    "name": "Ajo y Orégano",
    "place_id": "ChIJU8OwcMP1wokRqVprhOTXg6E",
    "grid": "BX6",
    "address": "621 Crescent Ave, Bronx, NY 10458, USA",
    "rating": 4.4,
    "user_ratings_total": 2151,
    "phone_number": "(347) 918-9638",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKME4yZDZhMEpQUW1aQ2JWcFJSelJ5YVZONFExRRAB",
            "text": "Great experience and excellent service and friendly staff"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd05XeFdPSHBFYjNwWlQyRm5Wbk50UWpGT1owRRAB",
            "text": "Excelente"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFRWbHJRV1pmVTBvelZYVjFNVXgyTUdkVVJIYxAB",
            "text": "Simply delicious"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa1ExVnVSM0o0VFdkaE1HczViakI1WDFjNVYwRRAB",
            "text": "best Dominican food restaurant in the Bronx"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdE5tZGpUVXgwWHpWRVpHaGhkRGd0U0RCaFJsRRAB",
            "text": "Me and my Church came here and had an amazing meal! We all had different orders and all enjoyed. Their juices are also great. I will be coming back! On my own time! Thank you all!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeVoySm1jMlpMUWt4MlFrRjRObm96UVdGYUxYYxAB",
            "text": "Francisco, is the best waiter I love the place he recommended it to everyone he recommended us the dessert and it was great!!! Nice selection of wine, and great food. I recommend 100% 🤗❤️"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVoxRjBiMkV6UVhGMk9GaFdha3BZTUVoU1NsRRAB",
            "text": "Francisco excelente, muchacho cordial, muy atento simpático, todo super lo recomiendo todo!!!!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV2RuVjJWVGxETTFGcGRWRktRMFZqU0ZORmFIYxAB",
            "text": "Excelentes atenciones! Francisco, muy amable! Nos recomendó el pudin de pan, elegante de leche divinos ambos postres cien por ciento recomendado."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSFJVOUpjVGhEZFRoRlptbEdTbGRVV0ZKbWEzYxAB",
            "text": "Hoy estuve en el lugar, fue la peor experiencia, ni los perros se tratan así, llevé a mi amigas para comer. Ella eligieron comer de la comida ya lista,  no tuvieron la delicadeza de preguntar si íbamos a usar platos,  algo bien…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneVpUaHdTV0YyWmprelpTMW1TRlIxY1dSdlZGRRAB",
            "text": "Ordered the mofongo with pollo frito. And it was filled to the brim with meat. Delicious!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1MydFpPR0pGZGxKSU5DMVhVRkk0Y0VoYWNuYxAB",
            "text": "The food was amazing as always! I write this as im too full to get up from the table. Our servers name was Pedro but they call him Tio Pepe. He's awesome.\n\nMyself, my bestie and the hubby had the ceviche de cerdo, which is fried pork chunks and Maduro with onions, yuca, peppers and lime juice.  I get extra lime juice on the side with an order of tostones and fried cheese.  This appetizer is to die for in my opinion.\n\nWe then ordered a pina colada while we waited for our main course.  The drinks were good I think they may have made it with fresh pineapple.  I had the Boca Chica (red snapper) with rice and beans, hubby had the Rabito encendio (oxtail stew), and the bestie had Pechuga rellena (stuffed fried chicken breast, maduros, bacon, ham, and a Dominican twist on teriyaki sauce) we all shared and all 3 meals were perfect.\n\nThe desert we had the bread pudding and the tree leches.  It was so flavorful, and fresh.  There wasn't anything I didn't like.  I cant wait to come again to try the monfongo which seems to very popular at surrounding tables.  The music is good and not too loud and the ambiance is great as well.  Def a place to try if you already haven't."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU2MyTllMVk5zWVZSZlptZzRjV1UzU0RSNU5GRRAB",
            "text": "Francisco , our waitress was amazing !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWk1sSkdNR2M0VUdsYVNGcGpSSHAzV0RoVk5HYxAB",
            "text": "This was an excellent experience of Dominican cuisine the beans and rice and the churrasco with wasakaka was good but i feel it was too over priced for the food size  they need to bring their portion of food a little more it was about 200 $ for 2 people other than that i think it was good"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRGNuSlpTM051Y2s1bU1Hc3llRVJ5VFRSS2NHYxAB",
            "text": "Great food & good service"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNGNFUlpjVEJKUkRsR2JVdzJWa05mVEc1TlNuYxAB",
            "text": "Honestamente , el tiempo de espera es demasiado largo .\n- el El servicio , regular .\nEl lugar : es mediano\nPrecios : a mi parecer exceden los precios,\nComida : estaba rica , ( pero te cobran por cada cosa, ya que los platos fuertes vienen nada más con un acompañante )\nLamentablemente no volveré al lugar , por sus elevados precios .\nY por la propina incluida de 22% lo cual me parece un abuso . ( 4 personas )"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWFpHbENVbkk0VFdOVFRuUnZYMjg0V0dFMVYwRRAB",
            "text": "Spent 30 minutes in restaurant waiting for simple entrees on 6/29. You never get a second chance to make a first impression. My first impression is that customer service is an inconvenience and they don't have to worry about me or any of my constituents. The waiter was horrible and \"fired\" our meals without checking with the kitchen?"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5blRuUnhUV3RPTTB0MFVVNVRRMUpYVlhwaFNsRRAB",
            "text": "⭐ Reseña 5/5 ⭐\nDesde que llegué al restaurante supe que iba a ser una experiencia especial. El ambiente es acogedor, la decoración cuidada al detalle y la comida… simplemente espectacular. Cada plato refleja pasión, calidad y ese toque casero que solo se logra cuando se cocina con amor.\n\nQuiero felicitar sinceramente a los dueños por crear un lugar tan agradable y por mantener un nivel de excelencia tan alto. Se nota el esfuerzo, la dedicación y el orgullo detrás de cada servicio.\n\nY no puedo dejar de mencionar  al TIO, que fue quien nos  atendió, porque se lució por completo. Su trato fue amable, atento y lleno de buena vibra — hizo que la experiencia fuera aún mejor. ¡Gracias por hacerme sentir como en casa!\n\nSin duda, uno de los mejores lugares para disfrutar buena comida, buen ambiente y un servicio de primera.\n✨ ¡Recomendado al 100%!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eGRrNVROR1pMU21vek9HeFRNR2RtYzBSU1JGRRAB",
            "text": "The food is good. I don’t understand why there are a bunch of negative reviews about the food."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdFFtbHFVMUpMVTNac1VGOUNkamRsTURGQlgzYxAB",
            "text": "Creeme que si eres dominicano o latino y te siente lejos de casa, poder probar uno de estos platos te hará recordar casa, los mejores monfongo que he podido probar en el extranjero"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVGIySjRRa0pDTkdRdFJVTTBNRTF2Y2tKdmFGRRAB",
            "text": "Delicious food attentive and welcoming staff."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM1ZuQndRVVJuV0djNGVuUkNMVkoyVDNaUVRFRRAB",
            "text": "hay no ese mofongo duro se podian sacar los tostones sin majar dike de pollo le pone un pedazo dentro una salsa ranch como si fuera ensalada y pico de gallo hay no"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGblFqQjRiR2cxVVZOQmRFNUZhV0YyTFRKTGVWRRAB",
            "text": "Tbh idk how ppl still come here\nThis place od hyped up\nThe rice be mad dry\n\nYou can’t even find parking because of all the hype.\nYa not even real valet parking wthelly 😂"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twU1RVRkNPWGc0VkV4TFltOUJaVXhMZVRGMVNsRRAB",
            "text": "Mid"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRGNWODVibVYxUjFkQlNXdzNaa2h0WjNNMVZVRRAB",
            "text": "Excelente servicio!, en especial mil gracias a Yandra y Pedro R, ambos nos atendieron super bien nos hicieron pasar un momento muy inolvidable.Muchas bendiciones para ellos 💕"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFluQjRYMTlVYVhnM2MySkRSemRPZVhwclRGRRAB",
            "text": "Yandra y Pedro R son los mejores en el restaurante. El mejor restaurante en el bronx."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkc1dHVjZjREJSUjNGaldtbzFiRmhuWlRkVVprRRAB",
            "text": "I quite enjoyed eating here. Especially the mofongo de chicharron de cerdo. Also got the churrasco and the chimi tostones. Wish the meat on the chimi tostones was a little bit thinner but still good. The atmosphere was great, I felt like family members were asking me how everything was etc."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVVRUVnlWSFZxWWt0SWRuWXliVE52UkRkYWRXYxAB",
            "text": "Omg! This place reminds me so much of Dominican Republic. The colors, the design, the ambiance, the music, the beers, the food! I highly recommend this location to anyone who loves good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poT1oyVTJhMVpRUVRZeVN6TlVPVXB6T0VwVGVsRRAB",
            "text": "Absolutely delicious! Some of the tastiest takes on classic dishes. I had the tostone sliders and mofongo which was fantastic. Can't wait to come back and try more!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta3E2cFpnEAE",
            "text": "🌟🌟🌟🌟🌟\nOutstanding Service from Yandra!\nMy dining experience was absolutely wonderful, thanks to our server, Yandra. From the moment we arrived, she greeted us with a warm smile and made us feel right at home. She was incredibly attentive without being overbearing, and her timing was perfect throughout the meal.\n\nYandra was knowledgeable about the menu, gave great recommendations, and made sure everything came out just right. Her friendly attitude and professionalism truly stood out, and she made our night extra special.\n\nI’ll definitely be coming back—and I’ll be asking for Yandra! Highly recommend her if you're looking for top-notch service."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNdFpVUTBjVVJ5V1VseVJIZGxlVW80ZHpjMFpuYxAB",
            "text": "La mejor experiencia eh hidro varias veces . Yandra es una de las mejores . Siempre está atenta . Cualquier cosa que necesite ellas ase lo posible por ayudarlos .👐🏻💓"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa1MyeHRYMnRMVkZkWk5XWjNXa2hNTWxKVGRFRRAB",
            "text": "Francisco fue mi mesero fue muy servicial y atento la comida está muy rica y el servicio también gracias francisco.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTVZUUlljVGMyYzNOd1gycERiVmN6YjBSS1NYYxAB",
            "text": "The worst service ever. My family and I walked in and we weren't even acknowledged.  After the host sat us we waited 15 minutes then asked the host about the waiter, the waiter arrived and didn't introduce herself,  no smile, total attitude. After we looked at the menu, we had to wait another 15 minutes for water which we had to remind her. We decided on an appetizer,  she came and dropped off the utensils, did not leave any plates, we had to all reach over to the shareable appetizer. After another 20 minutes we had to call her over to place our order, which never arrived after 45 minutes of promising that it will be out soon. We asked if, at least they can change the channel of the TV and with a smirk she said that they were giving promotion to this program and we were all forced to watch from all angles of over 5 TVs the same program.  We decided to get up and leave and I asked her for her name. Elise is what she said. She is in the wrong profession.  Customer service first. Let alone the family I came in with came to visit from Santiago Dominican Republic. I was embarrassed they said I would rather go to a Mexican restaurant, which we did and got a great service, good food and ambiance. Thanks #RanchoEstrella\nFirst and last @ajoyoregano"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaE1uZHJiVWRXUW1SQlZGaEVkMHRuT0hkVmNrRRAB",
            "text": "Food was good. Loved the yuca mash with melted cheese and fish with coconut sauce... delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZek1uSjROSGwyTkZkdk4wbGFZMVV3T0dGNVZYYxAB",
            "text": "This place is good if you are out with friends to go drinking. I would not recommend for date night or with kids. It took us almost an hour to get seated, it took almost an hour and a half to get food. The seating is very uncomfortable. All in all the only thing that impressed me was the beans, the food tasted like typical Dominican food you can get from anywhere. Food really wasn't worth the wait. The music was good at least."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSmRHWXdUbEp4VFRWV2RHeFpPRE5xTkhWVFFWRRAB",
            "text": "Good Food. Loud Environment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WldXMW9VMmg2YVV4ZlZUTlpNMVJ2VlhoUU5sRRAB",
            "text": "I placed an order for rice, beans, and chicken, but received an entirely different order . The food was cold and look liked someone already ate from it , when I contacted the restaurant to resolve the issue the lady I spoke with was dismissive and unwilling to correct the mistake she was unprofessional . I dont recommend this establishment."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTFVXNU1UeTF5ZFdaR1dUZG5PVXM0ZDE4eU1FRRAB",
            "text": "Pagamos $52 por dos órdenes y la experiencia fue muy decepcionante. La comida llegó incompleta, las porciones eran mínimas y no corresponden al precio que cobran. La calidad del servicio y la relación cantidad-precio dejan mucho que desear. No recomendaría este lugar."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205c1dWWXhkRXh1YnpOcGNVdHJPRWd4ZEc1UlluYxAB",
            "text": "Una experiencia inolvidable😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveU9ESktZWHBvWmt0RGFFOWFkRTVSWVdOUGFtYxAB",
            "text": "Francisco is one of the best servers at Ajo y Oregano. My husband and I absolutely adored the attention and the delicate way he brought us our food. He’s incredibly respectful and attentive to his customers. We love Ajo y Oregano, but we love Francisco’s attention even more!\n\nKeep having such an amazing crew. You can’t go wrong with them! Make sure to ask for Francisco when you visit. You won’t be disappointed!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jM1RrVlpNRlJxZUVaQldtWlBkVkZQU214cmFrRRAB",
            "text": "Excelente comida y atencion"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sZk5VWjVTMnRTYTFVMFR6SlVSazVSTjFsTE5XYxAB",
            "text": "We hosted a private party for my sister's Bday and whatever I say will not be enough.  Amazing food, excellent service, great music. We just had an incredible night!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM05IWnVSRGwyVWw5Rk4xWmFla3BmVW10dVdIYxAB",
            "text": "So amazing and Joel was such a nice man he literally made sure me and my family were okay. The chicharones de pollo with rice is amazing and the chinola juice and lemonades are amazing as well. Come here if you guys want real good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRFlXUTRaVU42ZFdkUlVuWTJNVEV6ZEdKblNrRRAB",
            "text": "The service and food is above and beyond! The music, decor and warm staff made it feel like a slice of home. The food is delicious and cooked to perfection!! The atmosphere paired with amazing food and staff makes it an easy family favorite. I bring all my company here and they love it! Joel is super friendly and attentive, he’s a big part of the personable family vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdFlqUlJVMUpyVERFMFUySlpabU51TldveFdWRRAB",
            "text": "The food is good overall. Sometimes the service is slow because the place can be packed and the wait times really long.\n\nIt can be loud and slightly bougie but overall good. Food can be a bit pricey but it is good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSGEzRmplRWQwYkdoSVdsVnViVVl4WXpGME5HYxAB",
            "text": "The food was amazing! Everyone was so sweet. Photographer was absolutely lovely."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMU5sOVJPWEZGYURWc2FXUnNibUZ1ZWsxWE5IYxAB",
            "text": "Great Latin Food"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5YU1HaHNRa1pVWVRoSWVtd3RUMWxtZVVaQmJGRRAB",
            "text": "Este lugar es terrible, nada mas es presentacion,  comida arroz y habichuelas normal y el pollo sin sabor. Cobran carísimo por dártelo en un calderito"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MU1rbERMWFZtVERJMlJIcDNSRE5zYmxoNE1WRRAB",
            "text": "I love this place. It reminds me so much of Dominican Republic"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeFVEbGFkbTgyUTI5bk0yTk5XVTlZUjNodloxRRAB",
            "text": "Estuvimos en el lugar, sin embargo salimos decepcionados, el servcio desde la host hasta los meseros sin una sonrisa o una cara amable….no habían los platos  ni la bedida que queríamos….finalmente pedimos unos  aperitivos estaban bien…. Lástima nos habían recomendado el lugar pero no volveremos…."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbllrMUlUMDB5YUVaclRFNHdSbmg0ZURkeVNrRRAB",
            "text": "Delicious authentic Dominican food. Excellent pinto beans, excellent Mofongo, not dry, perfectly moist and seasoned.  Beautiful atmosphere.  Good prices."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMk8zOURBEAE",
            "text": "오늘 아들 생일로 여친 부모님과 만났는데\n이 곳 넘 맛있고 Frank 의 서비스는 나썬곳에서  음식을 편히 즐길수 있도록 도와줘서 넘 감사 했어요\n땡큐~~~^^"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc2VYVkZlakpCYWxkWlZ6TmFjM1psWWpkVWRGRRAB",
            "text": "Excellent Dominican food, and its name, \" Ajo y Oregano,\" lives up to its dishes. The place is a little small but very cozy. Mr. Pedro is always friendly and cordial. His mofongos are delicious with four cheeses, everything typical Dominican style, which will make you feel in  home. I recommend it 👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR0dwTEhLdi1xTHVRRRAB",
            "text": "I stumbled upon this gem with my family. The moment we walked in the hostess Jazmine greeted us and was very welcoming. Service was amazing! The food was great everything we ate was so delicious. We will definitely return when we’re back in town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU05IcENNVWRHUTA1UmQxSlNXV3QzTjNwb05tYxAB",
            "text": "Food was okay but my boyfriends pork chunks were salty, and my churrasco first tasted like it was burned but as I bit more into it, for the most part it was good. The coconut gandules were really good! Me and my partner agreed that for the price ($33 for churrasco and $19 for chunks), the food portion was too little. Even the chimichurri sauce, and the veggies they put on our plates were too little bit (refer to my pics). Our waiter was really nice and attentive so no complaints there. Where we sat, the music volume and selection was really good so that part we enjoyed. The little box they brought the receipt in was very cute!\nI don’t think I would eat here again. I did not leave happy from here, after spending $60. I work hard for my money lol I like to leave full and satisfied and I did not get that here. And we do eat out a lot so in comparison to other places, I’ll give this place a 4/10."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVYyWkxlV2xDTFhaSGJWQkJVMmg0YkdSTlRYYxAB",
            "text": "Awesomely authentic Dominican 🇩🇴 Restaurant with charm, Caribbean vibe and music 🎶 The staff are super helpful and friendly. We went there this week for a graduation celebration lunch. It was a party of 9 including 2 children and we only waited 30 minutes without making a reservation. Thank you! 😘🇩🇴💕👍🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUFd2OUN3Nm9QWmpRRRAB",
            "text": "Happy hour! Mojitos were great and food even better. The portions were bigger than I expected. Good music, atmosphere, and food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycDhPamxnRRAB",
            "text": "I’ve visited this location twice so far in late June and mid-July.  I’ve only been to the location on Crescent Avenue.  Each time I’ve visited they have not let me down. Both times they have been consistent with the service, hospitality, and especially the food.  The last two times I went to the restaurant I didn’t have a long wait.  The atmosphere is beautiful especially the bright colors and decorations.  Warning the menu is so appealing you won’t know what to order.  I’ve had the beef stew and the steak with white rice they were both delicious.  I’m usually not one to finish my food at a restaurant but I ate every single bite.  There was someone walking around taking pictures as well as another person walking around selling flowers.  I can’t wait to go back to try more of their delicious meals.  Try it I’m sure you’ll love it as much as I did.  They accept cash or card.  Everyone else also loved their food.  This location is accessible via public transportation.  The restaurant offers valet parking."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a3ZQODNnRRAB",
            "text": "I have heard about this place, but I will not come back again. Lunch time on a Monday, place had 2 other tables, but service was super slow, the order was taken right away, drinks and appetizer came fast, calamari was good but portion small. Then we waited about 30 minutes for food. My churrasco was tepid, also not medium as requested and the yucas was hot. Hubby’s food was warm, he thought rice was old and tasted off and the beans were barely ok in flavor. By this time more people were coming in but server only checked on us once, and we had to flag her down for our bill. The food looked great but the taste was not worth the price. It looks better on instagram and tiktok, music was good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbk5fRGFnEAE",
            "text": "Everything we ordered was super delicious. The tostones sliders are a must, and definitely don't skip dessert. Both the pudin and the tres leches cake were bomb!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaGNIeVJBEAE",
            "text": "Res guisado & pernil lunch specials were so good and affordable! Portion size was perfect. The drinks and chicharrón appetizer was also very good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcUhqSlRVLS1qYlF3EAE",
            "text": "Ajo y Orégano – A true Dominican gem! 🇩🇴\n\nCinco estrellas sin pensarlo. Ajo y Orégano really captures the heart of Dominican culture, and MyCultureDominican did an amazing job bringing it all together. From the moment we walked in, we were greeted with super cute decor — I mean, un calderito con un garrito? ¡Demasiado lindo! It’s those little touches that make it feel like home.\n\nThe food? Absolutely delicious. Not one dish disappointed. Everything was packed with sabor, and you could feel the cariño in every bite. My family had an amazing time, and my sister already said she’s coming back — and telling everybody to go. She even said, “Ajo y Orégano te llena, y nunca falla con los platos dominicanos.” Period.\n\nIt does get a little crowded (porque todo el mundo quiere sus comida, obvio), but honestly, it’s worth the wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN05pNVhBEAE",
            "text": "We were seated immediately at the bar so no wait, but food took roughly 30-40 minutes to be served. Understandable considering it was Sunday evening and it was packed, but once we got a bite we understood why. Steak was cooked and seasoned perfectly, pork was nice and crispy— all the sides and sauces were amazing. Plus, the drinks were strong and tres leches not too sweet. The perfect end to our evening. Our barista was also so nice and serviced us well. Just make sure you take note that they automatically charge 20% tip on the bill. Thank you for a great time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUME9lMHpBRRAB",
            "text": "Nicely decorated, some waitresses are rude and passive aggressive. I prefer the male waitress. It gets so pack you may be seated at the entrance with no privacy. Some things lack flavor and can be improved. They can be pricey but it’s ok to go like once a year."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bXBudFRREAE",
            "text": "Very delicious Dominican food!\nAnd this spot is clean, great service, great ambiance, attractive.. all that!\nNever had mofongo until I visited here and it is really good. Simple, but flavorful. We also had the octopus a la brasas appetizer which was really good... both were just a bit small,  wish we had more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeXJXMHFnRRAB",
            "text": "Location: located in the little Italy part of the Bronx by St. Barnabas hospital.\nParking: street parking available(paid parking meters) can be difficult to park as area can be busy!\nDidn't see valet parking available when we got there.\nFood: 4 people/had 4 different orders!\n1.Mofongo with 🍤 shrimp\n2. steak with rice/beans/ plantains\n3. Fried chicken with rice/beans\n4. Baked chicken with rice/beans\nFood was delicious! We all enjoyed!\nFlavorful and good portion size!\n\nService: waitress was nice but not attentive!\nShe gave us our drinks and never came back to table to check on us for anything!\nFood wait 20 -30 Mins!\nWe wanted drink refills. Had to ask at counter to get refills!\nAtmosphere: restaurant has a cute feel. But music was blasting and was too loud!\nCouldn't hear each other talking. Don't know if we were by a speaker but it wasn't pleasant to have music that loud!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb29taUdREAE",
            "text": "Went here with my siblings and we all loved it! There was no wait time but we all had to be there in order to be seated, luckily we were able to sit in the bar until the rest of my siblings arrived. Frank was our waiter and his service was…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcExTQmtnRRAB",
            "text": "Great place, food & service. Love it!. Although they made me wait a few extra minutes, because it seems someone scratched my name off the waiting list."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTWEwNVpja2RuVTNCd2RUTkJVSE5ZTm10c2JFRRAB",
            "text": "Food was really good! Everything came in an expected time and hot. You could tell all the ingredients were fresh! Unfortunately the service wasn’t that good but I couldn’t expect anything coming from servers that think they’re too good for being servers. While we were eating our server was taking “bartender classes” at the bar. Never asked if we were ok or if we need anything else. Which I have to ask for it. Overall for the food and drinks it was a nice experience but the service needs some improvement related to professionalism."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOHJPVkZ3EAE",
            "text": "You will definitely notice the colorful outdoor seating as you pass by in Arthur Avenue area of the Bronx. The decor here is beautiful and will transport you to rural Dominican Republic. I loved the details like the metal cups for water and juices, the multicolored wooden exterior and interior and a case of traditional ceramic figures. I arrived just before opening and there was already a line !\n\nExpect the traditional rice and beans with every meal and many plantation based dishes at this Dominican restaurant.  Even the white rice has a delicious and rich flavor to it. The daily special was oxtail and they were so soft they melt in your mouth.  This is one of the more noteworthy Dominican restaurants in the Bronx for great drinks and Dominican fare."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dV9TbGZBEAE",
            "text": "This place is amazing, the food is great and the service is even greater. There are two bathrooms in the back of the restaurant. It has outdoor seating and an area for a photo opp if you choose to, I recommend their virgin Pina colada for those who do not drink alcohol. After eating the appetizer, I found it hard to eat anything else because u get full from the appetizer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuODl5MVlnEAE",
            "text": "We sat at the bar and Ada was great!! She really knew her stuff and gave AMAZING recommendations of items to try off the menu that I never would have thought to order. A true gem. Please go on the weekends and sit at the bar to experience her great Hospitality."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKN3JiNnhRRRAB",
            "text": "The wait wasn't too crazy for 2 people. We waited about 20-25 minutes.. The restaurant had some nice old-school real Spanish décor vibes. If they had more space, they would make a killing. The passion fruit drink was very refreshing. The salami with tostones was on point. I would tell everyone to try them. I enjoyed the spot and their food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bDRuVDhnRRAB",
            "text": "The food is always amazing and the only reason I come back often. But, on days when they are busy, be prepared to wait over an hour for a table and get mediocre service. The servers are overwhelmed and most of the time have an attitude. I would recommend coming here as SOON as they open, around 12:00pm or 12:30pm and the service will definitely be different in my experience and opinion."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaU9hLU9BEAE",
            "text": "Por primera vez visite el lugar. Me llamo mucho la atención el nombre y por supuesto las fotos y la presentación de la página de Instagram. Estaba anticipando visitar y probar la comida que se ve tan rica. Lo que pedí estaba sabroso “el rabo encendió” mi esposo pidió el mofongo de cerdo, pudo ver  estado mejor ☹️ (tenia mucho grueso de grasa en ves de masa de carne).\nEl concepto típico está Precioso, me encanto el uso del jarro para servir el jugo de tamarindo que pedí (estaba rico). El servicio al cliente fue excelente\n(las meseras muy amables).\n\nDentro mi revision para este lugar,  esta la poca atención del baño. El baño estaba sucio, un olor a orine sumamente desagradable ( el olor se sintió antes de entrar al baño). No tenían jabón para las manos y el piso estaba mojado. Por esta razón no le di 5 estrellas. Es importante mantener el baño limpio.\nGracias.\nAri~\nNJ"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiODVEX1lnEAE",
            "text": "Amé este restaurante una muy buena experiencia I highly recommend going there food was good y el servicio al cliente ni se diga quedé fascinada tanto con la comida y el trato me sentí muy cómoda y la vibra fue la mejor , gracias a Pedro que fue el mesero que me atendió y otra muchacha güero muy servicial . Loved it and is totally affordable ❤️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOWVHRk13EAE",
            "text": "These pictures speak for themselves. They have outside sitting, Fresh juices, great variety in their Lunch menu and drinks. Their food has always been on point and I have no complaints. Some of their staff are awesome and very attentive. The bill comes inside the little box exactly as the one I posted in the pictures. Reasonable prices. Strongly suggest making reservations, since it does get extremely packed. Definitely one of my favorite places to share with family and friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1azRUWkt3EAE",
            "text": "I would have to say for the price point the food is very good and the service was great! This restaurant treats its customers very good! The portions are huge so hope you have a appetite!! I wouldn’t know we’re to start in recommending any in particular dish because all the food there is excellent and it taste so rich and seasoned very well. The drinks were great, they bring them in this old style tin cups, that brings back memories when I was a child, very nostalgic for anyone who grew up in a Latin family or the Caribbean!! Only left to say is go try it out.. sometimes there’s a little wait the place isn’t that big but it’s worth the wait, enjoy!!! 🇵🇷🇵🇷🇵🇷🇵🇷🇵🇷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeXFpMGR3EAE",
            "text": "I want to start off by saying the bartender was amazing and her customer service was impeccable. Sadly, the food was a different story. I ordered the rib eye steak and was really disappointed. As pictured the steak was 60% fat & inedible. Literally like eating slime. 0 sear, 0 flavor, almost like they didn’t even try. I didn’t want to pay $38 for a plate of raw fat 😭😭. Probably will never come back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNnYyX3F3RRAB",
            "text": "I love this restaurant the food is amazing! The people are so nice and attentive! Especially my server MANUELA she was so nice and served me quick and gave me attention, she is very patient and helps me pick out the food with ease. She’s a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMzczWXVRRRAB",
            "text": "By far the best Dominican restaurant in the NYC area. The food is amazing, the service always on point and the decor is just beautiful. Our server Frank was on top of everything and made our dinner even more enjoyable. Omar the bartender really knows how to throw a great drink.\n\nThe prices are great for the quality of the food and the portions you get.\n\nOverall great dining experience every time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa05xbEZ3EAE",
            "text": "Terrible arroz Moro and terrible beans. All Waiters had attitudes. Steaks were cooked perfect and well seasoned. My drink “ el popi lychee” tasted like rotten milk. adding an automatic 20% gratuity is a joke should be 15% to have the waiters try to give a good service. That’s why they act the way they act cause they know regardless they’ll get the 20% tip."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdGNUOHR3RRAB",
            "text": "I eat homemade Dominican food all the time and I must say the food here is outstanding. They do not take reservations. For a part of 4 the wait was 40 min. If you have a larger party the you can expect a longer wait. Staff was friendly. Food took about 30-40 min to come out. If the addressed the long wait I'd give them 5 stars. Suggest take out instead."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXA3LTVnRRAB",
            "text": "El ambiente es super chulisimo cuando no vas en un día feriado (los días feriados se pone super super lleno y la espera muy muy larga), me gusto la decoración tan campestre, uno se siente en un restaurante de un campo de RD, muy limpio, higiénico, muchas decoraciones que son reliquias, dan mucha nostalgia. El servicio al cliente muy bueno, la comida tremendo sabor! El servicio regular es mucho para una persona regular... Lo único malo es el parqueo, que no hay (algo común de NY)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMzdtS3ZRRRAB",
            "text": "It’s amazing when you find a place you can go over and over again :) order the appetizer of the Mofongitos and the Mar y Tierra if you love steak and seafood but I have been here before and you can’t go wrong with the other entrees to share with another. I recommend ordering and doing everything family style. Entrees are generous portion so worth every penny. Drinks are delicious 😄 I could write a longer review but clearly I recommend to give it a go! Try it you will love it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVmVraE5jbmx6VlhCTlRVbExVV2xGYmxkWUxVRRAB",
            "text": "Very nice atmosphere but the restaurant prides itself in selling some dishes as authentically Dominican. However, the Mofongo is NOT authentically Dominican. Just give credit where it's due my friends. Overall a nice place to check out!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaUxyX09REAE",
            "text": "Food was great as always. The wait was super long but honestly, it was worth it. Had the sliders and res guisado. Also had the oxtail and sancocho. All of the food was great. We had a party of six and everyone shared. The outside dining is chilly so dress warm. If you have the right clothes you will be fine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcWFxdy1nRRAB",
            "text": "Came here for lunch with my neighbor and wife. Everything is simply delicious when you come here you leave full and satisfied. First and foremost my favorite is the passion fruit juice. Secondly all the lunch specials are great. My favorite is the churrasco with the rice and beans. This place is busy so no there will be a wait depending on time."
        }
    ],
    "reviews_count": 87
}