{
    "name": "Fiesta Lounge and Restaurant",
    "place_id": "ChIJsxetRX70wokRcmWCG7z-2c0",
    "grid": "BX6",
    "address": "4640 Third Ave, Bronx, NY 10458, USA",
    "rating": 4.2,
    "user_ratings_total": 227,
    "phone_number": "(347) 591-0415",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4elAzcFB3EAE",
            "text": "As a person that lives in the neighborhood, the restaurant itself has good food and customer service. But the bar early in the morning allows it's customer or it can be their employees to fight and play loud music with no degree of empathy for the children and babies that live there. They have customers or employees scream and ride mopeds on the sidewalk. It's 5am and they have a car outside the business playing music so loud you can hear it 2 blocks down, if the owner wants evidence we have it."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORGJrdGxhR3MzWTJkUWEzRnZORGM0VEd4NWVHYxAB",
            "text": "No tienen bun servisio\nLa Camara no son amable"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNVYxSTNMVEU0ZW04MGNVSmFZVFJhTkd4SVNsRRAB",
            "text": "atención al cliente la comida la higiene rápido lo recomiendo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR0t0NEs2aEx1TTRBRRAB",
            "text": "Great thank you"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeWRTYjFRRRAB",
            "text": "The place was remodeled with modern touches. The sofas are stylish & they have dark hues all over. The food is okay but they take their time to serve & attend you.…"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNVp2UmtnRRAB",
            "text": "Mar servicio de la persona que despacha la comida"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a056aXJBRRAB",
            "text": "Atención pésima, la chica que estaba al entrar parecía molesta por algo, a todo me contestaba de mala forma y me repetía si paga con tarjeta le cuesta más, si come aquí adentro le cuesta más al final me atendió otra chica porque ella no quiso y la actitud no era muy distinta a la primera, pensé que así eran pero curiosamente a dos hombres de otra mesa los atendieron con mucha cordialidad y luego a otros 4 que llegaron, supongo que tienen sus predilección, total cobraron una propina en la factura del 15%  obligatorio aparentemente, pero no la merecen lo siento"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bDdfVFR3EAE",
            "text": "AwesomeFood definitely can't wait to get back to it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOFkyREdBEAE",
            "text": "I gotta say I've been a fan of Fiesta for 16 years. A Dominican 🇩🇴 restaurant that has lived to what I enjoy. As far as the bake rotisserie chicken and beans, they are on point. The maduros are always fresh. The fried yuca is criispy. Rice is always good, and the dying dreaming drink that we all know as Morir Soñando is really to die for 🤤. I always tell the people to go here. I'm a 5 star Michelin 👨‍🍳type of eater. I judge taste and textures. If you wanna dine in, they do have tables. Service is excellent. They give you a nice tiny basket of garlic toasted bread and proceed with the menus. 5 mins later, they ask what you want. With a smile, they bring you your food, or it could just be me smiling as soon as I see my order, I can't remember. Again and again I go. I say it's the only good one around the 10458 area. Take me with you if you decide to go. I'll help you😁 but ya paying."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNS1Qam5RRRAB",
            "text": "Muy buena comida"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcUt5Z2lRRRAB",
            "text": "It was a great place!\n\nNow it’s just a regular club. Very expletive! Regular customer service!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa29EREpnEAE",
            "text": "fiesta Lounge and restaurante"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbnJ2SndRRRAB",
            "text": "The Drinks are great, the food is okay and the music is too loud"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREejZiNkVREAE",
            "text": "Love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaUsyT2p3RRAB",
            "text": "I have never given 5 stars to any business because they just don't deserve it. But this place is the exception to the rule!!! The food is amazing, the service is fantastic and the  ambiance is out standing!!!! I live in Manhattan and I go to the Bronx for this!!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5X2FQVXBnRRAB",
            "text": "Por que cada vez que llamo a este restaurant me cuelgan la llamada"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUMxN1pGMxAB",
            "text": "Es un buen lugar"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdE5yYnlRRRAB",
            "text": "Chulada de comida 😋 y las que atienden 👌😍…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsM2Jfdk5nEAE",
            "text": "Me encantó"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOVp6dktnEAE",
            "text": "Amazing food excellent"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNjRfTUxREAE",
            "text": "The ucar and pork so delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadzduTTJnRRAB",
            "text": "Newly constructed club atmosphere behind the restaurant in the front entrance VERY NICE"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaWFXVS1RRRAB",
            "text": "Love it"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKalpXcmZ3EAE",
            "text": "Luego de su cambio de administrador, este restaurante se a convertido en un excelente lugar; la comida es muy buena, el personal es muy amable y el ambiente es muy agradable!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMW9tUWd3RRAB",
            "text": "I went to this restaurant with my daughter and stood there for 10 minutes. No one even acknowledges you. Then some random guy walks in and skips me in the line. They took his order before mines. Definitely will not be going back there again.JJ restaurant on east 183 is way better service. I will not spend a dollar more in this restaurant. The servers need to learn better customer service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcXZPV193RRAB",
            "text": "Great place the food is good prices are fair and the workers are very good."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdktYa2V3EAE",
            "text": "Exelente lugar, tanto para comer como para tomar algo. Buen ambiente y las chicas con muy buen trato, especialmente Criss, nos brindo un trato inmejorable."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aDZpaUZ3EAE",
            "text": "Buena comida"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eEotSjJnRRAB",
            "text": "I love it!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaVktbGtRRRAB",
            "text": "Comida bien atención bien pero te obligan a pagar la propina la inclullen y en el Ticket"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSc2ZPV3JBRRAB",
            "text": "Muy bueno todo"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNktiZ1J3EAE",
            "text": "Exelente lugar"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoc29fVzVnRRAB",
            "text": "I love this place, the price, the food, the service,the place, everything is amazing and they have delicious Hispanic food.\n\nEste Lugar me gusta mucho, las que trabajan aca son amables, atentas y es UN precio justo por lo que uno come."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob0pMWWxnRRAB",
            "text": "Really 3.5 stars. This lounge is very nice. The staff are very friendly. Prices are reasonable. My only critic is the music was too loud. I couldnt hear myself think. I left the place with a headache please tell the DJ to bring it down a bit. Please explain to him louder doesn’t necessarily mean better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMWZXMTF3RRAB",
            "text": "Under New Management. The food is fresh and delicious. My favorite is the fried chicharrones boneless 😋"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCc3FqN1hBEAE",
            "text": "Muy bien ambiente para disfrutar el momento"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLXRpeWF3EAE",
            "text": "Excelente... 😃"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxd1p1UTlBRRAB",
            "text": "Amazing food great but slow service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHal9iNzN3RRAB",
            "text": "Food Quality is not Good my chicken was dried  not fresh,  salty a%$ beans they Got one job don't waste your bread getting this , go over review before getting anything..🤬."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NWJ1Z0x3EAE",
            "text": "Normally, there service is pretty good. But today, around 12:00 p.m, Fiesta Cafe and Bar kind of forced me to rate and review them. Never in my life have I've ever been to any restaurant and had my plate cover and eating  utensils taken away from me and given to somebody else who wasn't even seated yet. Are you kidding me??? Then asked \"are you going to take it to go\" several times after I stated I'm eating here... both waitresses were older females. The Indian looking Hispanic woman had a horrifying attitude. Couldn't even look me in the face. It was almost as if she was disgusted to provide service. Same goes for the other  female server there. I still tipped out of courtesy and did not receive one thank you. Bad customer services gives you bad reviews. At the end of the day it's about respect and I completely lost it for Fiesta Cafe and Bar. Just totally disgusting and disappointed."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwcDhYSFh3EAE",
            "text": "My favorite food in the area for years and years now.  Consistently amazing.  It's always the best when you go for lunch,  but even when you show up after 10pm the food is still SO good. Better than any other Spanish places for miles.\nOrder anything they have in the steam table. You cant go wrong.\nMake sure you get the rice and beans and a delicious salad from the kitchen. Salad comes with corn, beets, watercress, lettuce tomato and cucumber.  So refreshing.\nMy favorites are the beef stew and goat stew, but the chicken stew, baked chicken and baked pork are equally as good. This place is the BEST.\nLate night they have a dj and awesome bar."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZeU1YbmR3EAE",
            "text": "This place is so stupid I was ordering food when the lady ask if I was finished I said yes ,so I said I'm going to give you my credit card she said WHAT!!!!!! , I never heard of someone buying food with a credit card. She replied I I said what do you mean you never heard of someone ordering food with a credit card what rock did you crawled out from , that is crazy , so this was last week ,so today I ordered from the same place 45 mins past and I call to see why my order was taking so long she said that there isn't any delivery today , I was like what kind of business is this , so I want to talk to the manager and she said that so manager is present at the time, I said sure there isn't a manager present like really . So I was thinking that imagen if they did took my order what DISCUSTING things they wouldve done with my food , so there you have it nasty service means nasty people."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbnRucm9RRRAB",
            "text": "Este lugar era uno de mis favoritos con muy buena comida, hace un tiempo lo cerraron para remodelarlo pero no se si cambiaron de personal oh lo traspasaron , hoy pase a comprar pollo guisado con arroz moro y maduros y déjenme decirles que…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbWFHVEl3EAE",
            "text": "Food is good. Kitchen open late on weekends. Mature and safe bar. Music is great. Bar is well stocked.Good prices on bottles and beers. No beer on tap"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcDRmV3NRRRAB",
            "text": "Excelente lugar para compartir o para ir solo después de un día largo de trabajo, muy buen servicio y muy buena Musica. Es un lugar que esta ubicada en una buena area dónde las personas pueden ir en tranquilidad. Diferentes tipos de platos…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcEpTRDFBRRAB",
            "text": "Staff is very attentive. They make a great effort to keep you comfortable. Good food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNF9lUUpREAE",
            "text": "SERVICE IS TRASH , WENT WITH MY FAMILY TO HAVE DINNER . WE SAT DOWN , NOBODY CAME TO GIVE ME MENU ,NOBODY EVEN BOTHER TO APPROACH MY TABLE .AFTER WAITING 4 MINS , I HAD TO GO GET THE MENU, SO WE READY TO ORDER BUT NOBODY COMES ,THEN WE SAW…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMTVhR09BEAE",
            "text": "Food okay, service is given with attitude and over charge. They are not specific with prices ask for price before buying. You might end up paying $34 for take out. Never again"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbGVMSzlRRRAB",
            "text": "Very good food and friendly custumer service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlb3RxUmZnEAE",
            "text": "Great food for the price.not Dominicos but you won't leave hungry and empty wallet"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDM2EzazB3RRAB",
            "text": "Para mi fiesta café bar es un lugar familiar el cual se lo recomiendo a todas las familias que quiera compartir un momento inolvidable en familia es un lugar acogedor y de muy buenas atenciones de su propietario dionis Ruiz y Eloisa Molina"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNlozZkh3EAE",
            "text": "Excelente servicio, comida para chuparse los dedos y muy buenos precios, lo recomiendo ciegamente."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcnFtTHZRRRAB",
            "text": "Very good food and great service"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5MHZydlpREAE",
            "text": "Muy amables sus trabajadores. Buena comida criolla. Very kind worker people’s and good Spanish food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdkx6bkFnEAE",
            "text": "Great food, friendly staff, all around a good time! 🤠…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRX3NHcnlBRRAB",
            "text": "A quick bite of this great tasting sancocho for lunch, fast service and flavor is always on point 😋😁…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNrdVBpZjlnRRAB",
            "text": "It's food is wonderful and very good !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVbE12Zk5REAE",
            "text": "Love the food and awesome staff"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cU1TMWJnEAE",
            "text": "Muy buen lugar para disfrutar un rato la atención es muy buena"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NDVUSmZBEAE",
            "text": "Great service and even better food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNDVLRGdnRRAB",
            "text": "Great place, good food and really good music!"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxM3NxVGZ3EAE",
            "text": "Excelente servicio y buena calidad de comida"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcTVUQUF3EAE",
            "text": "El pollo está dañado y aparte la carne es muy mala calidad"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOTdqb1pBEAE",
            "text": "Great vibe, great company, and fantastic food! Go here primos"
        }
    ],
    "reviews_count": 64
}