{
    "name": "El Nuevo Bohío",
    "place_id": "ChIJqYkxbYr0wokRiecSneReu8M",
    "grid": "BX6",
    "address": "791 E Tremont Ave, Bronx, NY 10460, USA",
    "rating": 4.1,
    "user_ratings_total": 1877,
    "phone_number": "(718) 299-4218",
    "reviews": [
        {
            "date": "3주 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU00weHZSbk00Tkd4VU1scEJkbk0xWlU5R1VtYxAB",
            "text": "Garçonete muito gostosa"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNVQxbENVRGx3TkU5SGFGVTFkMUp0VW1aaWVsRRAB",
            "text": "I was disappointed more than a year ago by the lechon.  I decided to give it another try.  Once again I was disappointed.  The pork was dry and unseasoned.  I will not be going back for lechon.  I had potato salad and it was good.  I order pulpo salad for my husband.  He hasn't tried it yet."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNU5qQTBSamxrYW10dk5rY3RNekJKVjFoa2JVRRAB",
            "text": "Worst food ever. The blood sausages were dry, old, and falling apart. The rice had no flavor, and the pork tasted spoiled. I complained immediately and was issued a refund. People, if you enjoy bad food and wasting your money, this is the place for you!\n\nPlease note: No employee there is Puerto Rican.   They are just using the name!!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRGFFbGlkek5EUlc1bFNHaDBObGt6UkdKTFpuYxAB",
            "text": "Mi primera vez en ese lugar  todo los servicios de comida son grande pedí pequeño y la joven me dijo que no venden nada pequeño incluso hasta los jugos grande de esos vasos donde ponen las sopa"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS1ZXUjZUVU5sWVU5eGFERXRjR3AxZG5aMk9HYxAB",
            "text": "Worst experience ever\nYup that’s hair. It comes free of charge!\nWon’t recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkclUxTklZV3A2ZHpCclJISjVaVzB0VDJKTGJHYxAB",
            "text": "I've been going to this place for over 20+ years with my family! It remains one of the best places to get crispy pork and rice and beans in the bronx! New owners have come along and  other dishes they sell dont really hold up to the level of the pork. Stick with the crispy pork and you will be in 5 star heaven!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZeExXVjdnRRAB",
            "text": "Always yummy! Chicharron de cerdo, the rice and beans, the mofongo, all yummy and wash it all down w an ice cold lemonade."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OME5GSTFjM0V6YlRrNVdFUkpNMWhmUTBsSFRuYxAB",
            "text": "So upset with how the fell off smh"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUVlsZGFSRFJsTmxwWU9FbFBRVVkwVUhvdFMyYxAB",
            "text": "delicious pizza! At location"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWME1qRlBRVGRVZEZWcVZWVllTelpTZHpKaFgyYxAB",
            "text": "Awful service and food is not good. Would not recommend coming here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTVgwcHNja3N0WmpSc2N5MXpORkI1YW1KYU1FRRAB",
            "text": "Very Nice Help Food Taste Amazing 🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFh6VnNhVFV0VFdkNE1HUnBkVmR3V0VZMlQzYxAB",
            "text": "The food is not the same don't dine in the place on east Tremont has a lot of fly i found a gray hair on my plastic fork"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMWFraFROemcwZGtsYU5GQnZkME5SZVMxSWExRRAB",
            "text": "Should of listened to the previous reviews. There seems to be a salt shortage at Bohio. The pork had no flavor, just dense dry pork, that seem to be overcooked by a lot. I tried to eat the skin and my teeth hurt afterwards. The pasteles were flavorless. For people who eat this style of food, you will be sadly disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTk1HNURUVlpPUW1VMVdXVndMV2gwWkcwelQyYxAB",
            "text": "I'm from Brooklyn and I live out here in the Bronx now but I love this place is so Puerto Rican style food the real stuff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMllWUTVaMVJhTVV0TlkybHVZV1ZHTm1OVExYYxAB",
            "text": "I was disappointed. It's not as great as I thought."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFdXUllkbkI2VUROclFUZEJXVlIxWkRkV1lVRRAB",
            "text": "A nyc hidden gem"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTUxYQlZNVkZzU1c1eFNrOUdjVkJNWjBKUE5GRRAB",
            "text": "No está rica la comida, cerdo seco, los platos donde sirven la comida son desechables y poca cantidad.\nLa atención no es buena"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTVdsZGFTbUpzU1dkd2VuSmpZMnN6Y25GTFRVRRAB",
            "text": "I have been coming to this place for years. They have the best roasted pernil and roasted chicken around."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReVpFNTRhbEZFWTJWc01FdGlSM042YjFrNFlVRRAB",
            "text": "I ordered delivery, I 1 lunch of mangu, salami and fried cheese and a lunch of roasted chicken with white rice. When the food arrived, the rice was hard and tasted funky, the chicken was dry, and the maduros tasted as if they went bad. Now the mangu was disgusting the plantains weren’t cooked properly nor throughly, the cheese looked like melted plastic with A-lot of grease not cheese with mold, and the salami tasted dry and expired."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMUxXUk9iVWhJUkhwV00yOHpZVjlFU0hCR1ZuYxAB",
            "text": "Back in 2015 was the last time I went to this restaurant, they had delicious food the employees were friendly and were always smiling the tables were decorated with the puertorican flag and old San Juan it was a very happy place i went a couple times before that,anyway now it's July 2025 and everything changed the employees are all male and not happy to take your order they be rushing you to order, no decorated tables anymore the place was empty, anyway we was hungry i wanted Latin food because i don't cook as often only on special occasions, my daughter wanted food also i ordered arroz con gandules and pernil with some steak sauce on top i wanted sweet peppers over my rice also employee said they weren't allowed to do that but he did anyway if I'm paying why not i don't understand, so we pay our food and we put the food in the car we had to buy something across the street took 10 minutes, we go in the car the smell was so bad like something rotten,i open a window i got nauseous it smelled inside the bag and it smelled horrible i opened my food it didn't smell i tasted it no taste at all pernil either i get home start eating all i can taste is vinegar in everything, I think they tried masking the smell from the pernil by letting it soak in vinegar and what it did was made the pernil so dry i couldn't even swallow it, i asked my daughter when she arrived home if she tasted anything on the food she said the same thing no flavor at all even the mojo they gave was just vinegar, my food is still in the fridge $15 for garbage and that's my fault because i never eat out or order food but didn't feel like cooking for myself never again. 😡🤬🙄"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKelVIVkVkVlV0UlVGbE5sQllVWFJ1ZGxGdlFtYxAB",
            "text": "I would not eat nowhere else El Nuevo Bohio is the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQ1owSmZSemxLV2tOS1pqRjJRVEZ0VTI5SVozYxAB",
            "text": "Stomach hurt after eating the pork but the morro and the Anjoli juice were amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFVsbDVaelEzUld4T2NEYzRja1JJT0c1UlFuYxAB",
            "text": "I think I saw a roach"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQNzRpLVNzM2M2Tnh3RRAB",
            "text": "They had no service for tables food did not taste as I remembered from last year"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPeUxvNmUtblAyMXh3RRAB",
            "text": "This used to be a great restaurant with very good service. The food can not compare to before. We drove in just to go there and to our surprise it has turned into a take out. Still have tables you can sit and eat with the tiny plastic fork they provide. Bland food and no table service I wouldn’t waste my time to go again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWWQycE5VVGhSTkRodmRVbzJVVlpSWDBOVlVIYxAB",
            "text": "First of all it's no longer puertorican second they are making food they have no idea how to make and selling it false advertisement. Food is not good !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdlJ6Ty1TOTZPSlpBEAE",
            "text": "Good Fresh Food 😋"
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5aUlMLUNREAE",
            "text": "La comida es riquisima"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKT3g5NUNoNHJHOXhBRRAB",
            "text": "I usually eat Dominican food more than anything else. This was my first time eating Puerto Rican cuisine, and it was incredibly delicious. I even took home a whole chicken. If you ever pass by, don't leave without trying their natural juices. They are out of this world. They make them perfectly, with just the right amount of sugar! Enjoy!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNU5QdXB3RRAB",
            "text": "Compre empanadas y pense Que eran fresca despues mismo dia y saben como si fuesen de dos Dias Vieja waoooo bad test duras"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcDhlM1BnEAE",
            "text": "The food was delivered cold! The blood sausages were stale and old the chicken chunks were soggy!! I paid 57 dollars for garbage! Very disappointing never going there again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWNfdmh3RRAB",
            "text": "Food and service was great!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN00zbHRnRRAB",
            "text": "This is not a restaurant. It's more like a mess hall. A restaurant will wait your order to your table as opposed to a mess hall. Then they expect a tip."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNXZtUHlRRRAB",
            "text": "Restaurants has changed so much. Service is not the same. Food is not the same"
        },
        {
            "date": "7달 전",
            "language": "gn",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd0plNmR3EAE",
            "text": "Pedí pernil y estaba viejo y horroroso. Tuve que botarlo."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aU1yRUJBEAE",
            "text": "La comida es excelente 👍 buen sazón y lo mejor te atienden muy bien en los dos locales 💝."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cGZmRG53RRAB",
            "text": "The people were very rude and had very odd demands on How you can order you're food. If you ordered a Specific meal you weren't allowed to eat it at the restaurant. I came with a hungry group are you serious? Also,We were told we could order some thing but not others (that were clearly there and available- It was literally infrontof mein the food display)I find this business practice Very odd ! Finally, Ijust ended UP buying Alcapurria's & leaving due to extreme hunger. They had no taste, Barely any meat & was PURE MASA 😬😬. EPIC Fail. You can Find much Better food & Experience elsewhere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cnZmRmp3RRAB",
            "text": "I bought Pernil to go and it’s 13$ a lb. This pork must be the driest pork I ever had, half a tray of dried pork !!! If you want pork I wouldn’t come here. Don’t add the skin if it’s not crunchy !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRb1l5VmJBEAE",
            "text": "So very disappointed with the quality of the meal. EL NUevo Bohio has been a staple in the Bronx for so long.I was super excite to take my sister for the 1st time she wanted to try the modogo when i tell you the container was filled with…"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM00tYkpREAE",
            "text": "Las mujeres que cojen la orden no escuchan, mandan otro comida y no tienen respeto ni educación para los clientes"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMC16dUZREAE",
            "text": "Este lugar es repugnante. Me dieron tanto arroz blanco que podría preparar comida para una semana. Pedí arroz con guandules y ensalada de papas. No sé quién come arroz blanco con ensalada de papas. El pollo guisado no tenía sabor. Este es, por lejos, el peor restaurante español en el que he comido en Nueva York."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdWJhS3dnRRAB",
            "text": "El Bohío food is delicious, the service is excellent they have takeout and lunch specials"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOWNUTElREAE",
            "text": "First time ordering here, unfortunately The baked chicken was nasty, look at the skin. You can imagine how chewy and gamey it tasted.\n\nParece que no lo cocinaron completo y le hecharon achiote por encima para darle color."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfczRXMzFnRRAB",
            "text": "Disappointed with the lechon I purchased today. It had no seasoning and the mojito was bland. Seems that the new owners are not PR ."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNHV2Y0VBEAE",
            "text": "El peor servicio al cliente que he recibido y y me engañaron con mi orden  fue la orden de pernil mas cara que he comprado"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOUtPTGhBRRAB",
            "text": "This is the go-to place for mofongos.  They are full of meat and fill you up. Great flavor and the gravy is delicious."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdHNXVEdnEAE",
            "text": "La comida que pedi no tenia sabor el pastel de cerdo sabia a pura agua no tenia ni sabor y trajo mas masa que cerdo estaba muy fea esa comida"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNGZPczN3RRAB",
            "text": "On 12/29/24 I went Bohio to buy some food I live a distance from there ordered Pernil Arroz von gandules sopa and two Pasteles at home I unwrapped one pastel thd top had a blackish material I thought it was the bannana leaf it wasn’t you couldn’t cut it with a fork ate small pieces from each end the Pasteles had  no taste at all the soul was salty  I have been coming here for over 30 years but I have not been there for years reading the reviews I read the owner died now this new owner I don’t know who you have there cooking it don’t taste Puerto Rican and the fact you don’t have waitress and the staff is rude I c add lied snd someone picked up the phone if I lived closer I would of taken back that nasty Pasteles I wouldn’t service this yo my worst enemy I flushed if down my toilet hoping it doesn’t clog my toilet whoever the cook is go in tik tok yo learn to make Pasteles and those people given high reviews they must be the owners family no wonder new owners people don’t travel so far so far new owners quality of food not up to par I should of gone to Mcdonalds"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcHZ2TWRnEAE",
            "text": "Good place for Spanish food, large variety"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNExTYzVnRRAB",
            "text": "Don’t waste your time coming here. This was my first visit, and the service was terrible. I was charged $16 for a lunch special that was advertised as $10, and to top it off, I was given the wrong order. I asked for chicken, but they gave me pork. When I went back, they gave me the chicken, but it wasn’t even a proper portion—barely any chicken with a whole bowl of rice. The staff was rude and did nothing to improve the situation.\n\nSince I don’t speak Spanish, I felt like they purposely took advantage of that, which made the experience even worse. I would not recommend this place to anyone—paying $16 for what I got is unacceptable, and being misled about the price makes it clear that this is very bad business."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMM3NlcVpBEAE",
            "text": "We thank El Bohio restaurant and their delivery guys for sending us an excellent one, accepting our suggestion of the pork chop portion. Combo #2 and Chicharron de Cerdo. They took us there the first time we ordered, finally perfectly cooked food, congratulations to that new cook! Delicious, just the right flavor, fresh and well made food, thank you! No more salty, burnt, tasteless or half cooked food.\n🥇👏🏻\n\nThey don't cook well all the time, nor are they surprising when everything is fresh and with the authentic taste of PR and RD food. It's sad that they dare to send poorly prepared food. I placed the order through Uber Eat and it didn't take more than 30 minutes to arrive. The bad thing is that the Pernil, the most desired protein, arrived cold, dry and with hard skin, the meat was white as if it were chicken. The truth is, it's not what it used to be. The food in general was very well cooked and delicious. They really are bad at making excuses about everything now. And they dare to say that one is the only one who has problems with food and no one else complains to them, yes of course!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaVlhT2ZBEAE",
            "text": "The food was horrible 😫. My wife ordered pasteles, bacalaoito, alcapuria and chicharrón de pernil. The alcapurias was okay. The bacalaoito was like something that I had never tasted. The pasteles was the worst out of all we bought. I remember how good the food used to be back in the 80's and 90's. What happened to this restaurant? The food is not good and I would never ever go back there again. This place should get new cooks!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNDhidjN3RRAB",
            "text": "Was walking by and wanted to try something new. Spanish food isn't new to me but the restaurant is. Everyone cooks differently and I would like to give each place I go to a try. I didn't get the usual pollo, I went for the beef stew. The atmosphere was very welcoming, you feel as if your in puerto rico. The food was delicious, filling and it hit the spot. Felt like a good home cooked meal. Staff is friendly and there  is a n option to eat in or take out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cDZUUWNREAE",
            "text": "Best Spanish food in the Bronx hands down , this place is consistent . They will always have a customer with me"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndk9iUFRREAE",
            "text": "I absolutely loved it! I had a nice tender steak and salad with a side of tostones. And a associate had shrimp mofongo. Also absolutely fantastic."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnc2FQejFBRRAB",
            "text": "Amazing food , awesome staff and great price I would highly recommend this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcU5IaDZnRRAB",
            "text": "The food was horrible….. the rice was okay but I ordered steak with onions and it came in a white sauce which looked disgusting. When I called to complain the lady Teresa said that’s how they do there steak. Never ever will I order from them again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZd05ybXhBRRAB",
            "text": "I visited for the first time today walking in reminded me of my grandparents house with the Puerto Rican decor I loved it. My mofongo was good the ajo was perfect that's my favorite part. I wished my cuerito was crispy it was greasy and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhME1fTzBBRRAB",
            "text": "We were visiting from OK and tried Puerto Rican food for the first time. It was so delicious! I can't speak for its authenticity, but I ordered in Spanish and heard lots of others do the same. The chicken breast (pechuga de pollo) was good,…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRZzhDS0RBEAE",
            "text": "Neighborhood place with great service. Puerto Rican food that is really good. Extremely busy, with seating and take out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1azRDV2JBEAE",
            "text": "This places sells uncooked chicken. It took me two days to get a refund because the staff kept saying the manager wasn’t there. Unprofessional and very disappointing."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdE82UTlnRRAB",
            "text": "Amazingly authentic Puerto Rican food at an extremely affordable price. Tasted like my grandma's. Food came out extremely fast. Loved everything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2RpM2pBRRAB",
            "text": "I’m so upset; I get charged for a large pan of white rice i called for order pick, come to find out in my bag it’s a small container, I was so upset I’m coming a 45 minute plus drive from work to home to pick up food and they can’t even get a order right! Absolutely ridiculous and I got charge what I didn’t get, absolutely ridiculous, when you guys pick up the phone YOU NEED TO HEAR PEOPLES ORDER CLEARLY and not give them the wrong thing"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjMFpDcXR3RRAB",
            "text": "Always good food there.. I don't have any problems with the service there 👍🏼🇵🇷"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacDQ3blRnEAE",
            "text": "I ordered los 3 golpes instead of mangu I got yuca the yuca was so dry and hard the eggs wasn’t even fully cooked the salami was overcooked I had to throw the whole thing away if u guys don’t want to work go home instead of messing people food up I will never be ordering from here again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OHRxc193RRAB",
            "text": "I don't know. It's like hit or miss with El Nuevo Bohio.\n\nWe've ordered food to eat in, and all was fine. The food looked appetizering and tasted like it was seasoned well.\n\nWe ordered a few times to take take out, and things were off.   Are there different people cooking the food for takeout versus the food behind the glass for dining in? It seems like the taste of the food is not quite right or is very salty or overcooked.\n\nThere's also almost always something missing or not cooked right? Was missing the beans one time, then one other time, we only received half of the rice portion. Come on. I do hope it gets better. I like coming here."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbjQya1pBEAE",
            "text": "Tu pagas por un lonche que aparte de malo y seco no basta ni para un niño de 6 años y el servicio al cliente pésimo e los que atienden pésimo . Y aparte de todo un tipo que no sabe cómo tomar una orden decente\nmente con las personas . Pésimo 👎👎👎👎👎👎👎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURua1otUDBBRRAB",
            "text": "This restaurant must have new owners! Their food use to be delicious!! NOT ANYMORE!! I ordered a porkchop combo with rice with guandules through Uber Eats and it was TERRIBLE!! The rice  was pale and tasteless the porkchops tasted like they were seasoned with salt and had anything but a fresh hispanic made taste!! Everything was GROSS!! The only thing that was good was the pepsi that came with the order, dont waste your money the food is not what it used to be!!! NASTY!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4MzlYOFJnEAE",
            "text": "This place NEVER disappoints! Love their food, their service, and all 9f the art they have hanging around, not too crowded, best Spanish food hands down in The Bronx,..ight I even dare say...NY period! It tastes just let someone's abuelita cooked their food... yummy 😋😋😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsM2Mtb2hnRRAB",
            "text": "Ive only given 4 stars because only had  fried pork, which was delicious, I bought 2 pounds, well seasoned and not dry and overcooked like most places. The rest of the food looked delicious. Multiple people to wait on you. Very clean, large variety. Food looked fresh. I can't wait to go back, then can give 5 stars."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNU5fLUpnEAE",
            "text": "Vine desde Connecticut y la comida súper buena me sentí en guavate PR"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNUxyTWJREAE",
            "text": "I order pasteles to try them and they turn out to be black i call the restaurant and they told that they make them like that, they need a new cook in the kitchen"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtM3Z2WmN3EAE",
            "text": "Totally disappointed! Cuban sandwich had no taste...pasteles looked like mush...no salt taste or meat and the ensalada de pulpo had no taste!"
        }
    ],
    "reviews_count": 73
}