{
    "name": "Lena Trattoria",
    "place_id": "ChIJA4JRKzCLwokRHBTppuJxhpg",
    "grid": "BX6",
    "address": "3470 E Tremont Ave, Bronx, NY 10465, USA",
    "rating": 4.7,
    "user_ratings_total": 340,
    "phone_number": "(718) 239-5362",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdFlsUnVkVGhETFdaNVFtUlBZVFJoU1hsVVYxRRAB",
            "text": "Lena Trattoria is one of my favorites places in the bronx. I have ate there or ordered for delivery many times therefore I consider to have enough knowledge to make this review.\nSome of my favorites are; clams Oreganeta. Egg plant Rollatini, Filet Mignon, Creamy Polenta, Brick Oven roasted Branzino, NY style cheesecake, Chocolate Fudge Cake, and the complementary focaccia bread that they usually provide with olives and olive oil. My least favorites; are the margarita pizza, and the pastas; Lobster Ravioli, Pollo Francesse served over Linguini and the penne ala vodka. I believe that the pizzas and pastas can use some improvement. For instance, the lobster Ravioli tasted mostly of lobster, and wasn’t as creamy as it could be, the pollo Francesse wasn’t coated fully and was slightly oily, the pizza was lacking in flavor, and the crust could use more work (more flake) lastly, the penne a la vodka with grilled chicken was slightly disappointing because they just added the grilled chicken on top with not much flavor. Overall, I would still recommend this restaurant to people, and would continue to eat from there occasionally. 4/5 for me."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbFFVVkJWRlJFVkZwclJVZHBTUzAyYzJKUlNGRRAB",
            "text": "The place is a gem to be honest and a cozy fancy little place to wine and dine. The service, drinks and food are delicious!! I want to give a special shoutout to Michelle her service was great and sweet gal."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eFZIcEhiRkJ0ZW5abVIxTm9jMVJVTFhGRWEzYxAB",
            "text": "Went there tonight, excited to try a new restaurant! I am currently extremely pregnant, and upon arrival I was greeted at the door by a tall gentleman ( lovely) he greeted us and also let me know that there was a dress code. I completely understand and respect that, me being super pregnant I had Uggs on. And if he would’ve denied me, I would’ve respected that since it is a rule set for everyone. Him being so kind he stated he will allow it tonight since I am visibly pregnant and uncomfortable. I thanked him and let him know next time It won’t be a problem. We turn to the hostess, when she came and looked me up and down in disgust. I was shocked but fine, then she did it again very rude, making me feel horrible about my presence. I have never been somewhere where a hostess has made me feel so uncomfortable. My friend and I turned and walked out the door. Unfortunately we will not be returning to try this restaurant. The gentleman who may or may not be the manager was professional, kind, and polite. Unfortunate the young woman working hostess ruined that experience for us."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSGFHOTJNamxEUkZKVVZ6WlZabGt4TURNNGExRRAB",
            "text": "Good service good food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeVFuUlJWV2RTVnpKV01XdGZZVmx2UjNObVNrRRAB",
            "text": "Outstanding!\nFirst time dining at Lena Trattoria and would definitely visit again, wish lived closer.\nI had a butternut squash meal prepared with sage and other seasoning and friend had a Bolognese parpadellapasta and both were excellent."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTVlqTlNka1F0ZVd4U1pVNUpia2RyWjFsdWFtYxAB",
            "text": "Definitely one of the best restaurants in the Bronx if not the city...... The food is amazing. I had the NY Strip Steak 🥩, and I have got to say it was one of the best steaks I have ever had. Also the shrimp scampi pizza is a must have. Plus most of the pastas are made fresh to order."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobGFHbHJMV2RmY210UVVWRktSa2xwVVRnM05WRRAB",
            "text": "First time dining here, food was amazing! Great ambiance, service was 5 stars and the food was simply delicious! Will be back again!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRk1qVnFiVUUzVEZSeVgzaDNkaTEzTmt4eVFXYxAB",
            "text": "Excellent food and drinks. Our waitress Ines went above and beyond for us and was very professional ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcVlqSmxZemx3VW5wNk9GbGtMWFJsVVc1T2JYYxAB",
            "text": "It was a wholesome experience at the restaurant, first time there with my wife, Ines described the menu and helped us find the best ribeye steak with spice rigatoni we’ve ever had, 10/10 service, really kind and easy going, she recommended an awesome Italian Cabernet Sauvignon, there was plenty of variety tho."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxclNuRkdSbXhTVHpreGVYUk1Ra0ZrWWpOUE5VRRAB",
            "text": "How to start of .. I extremely recommend this modern italian restaurant!!!\n\nFrom food atmosphere serves , I had a last minute event and I love how they took the time and dedication for every little detail to make us have an amazing experience  and after my event finished we ended up in the bar after our brunch!!Thank you to angel Cristian and Ines excellent serves as well as Emily she did an amazing job coordinating my event!!!\nDefinitely will be back soon ,thank you"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd1EycE1Sek4zY1dSdFEwOVRVRlZzVFZONFVuYxAB",
            "text": "First time here, exceptional food and staff…Joseph is great..try to catch him in hos cashmere blazer 😎"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRlFVdG1OelZWVkRoNWFqUTVjbTlQZVc5RWRVRRAB",
            "text": "This was my first yelp event. I must say that it was cool to see people that comment on your reviews. The restaurant is gorgeous very grown and sexy. This was my second time going to Lena's.  The food is very good and fresh, service is great and atmosphere is a grown and sexy vibe.  I recommend you come out and try it for yourself."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNFZIWmtiRXB3YUZvMmIxQnpVRXBDU21KV2NHYxAB",
            "text": "The food here is 10/10! The crab cake is out of this world good. Meatballs and polenta beyond exquisite. Butternut Squash Agnolotti, might be one of the best dishes I’ve ever had at ANY restaurant I’ve been to."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVFZuSldWakEzZGtJNVVEZ3pNbmt4VWtVNFNuYxAB",
            "text": "I always love my experience at Lena.  The menu never misses for me from appetizers , to salads, to entree, to wine and cocktails.  The atmosphere is a fine dining with a NYC vibe and I love that’s it’s close to home!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbU0wSjRNWE5pTXpKb1J6TjBXVlpFU0hCeWQwRRAB",
            "text": "Thank you MELODY! Excellent service!! She was great!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRGJUbHVhV1ppVWsxalFUbElYMDFrWlZGWmJrRRAB",
            "text": "Food was delicious, ambience was 10 out of 10! ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFkwUnVNR3RQUjJGemMxZFZPWGd6WTE5R1YyYxAB",
            "text": "Great place, I mean it."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXFiT1dnEAE",
            "text": "Extremely good food, amazing vibes, good music, aesthetically beautiful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVQyeHJSRkpYWkZFM1ZuZFJXWEpqVFZaNlRHYxAB",
            "text": "Had a reservation for 9:00pm for my best friend’s birthday, we arrived at 8:45 and were told they overbooked the night and that we wouldn’t be seated until at least 45 minutes after our reservation time. We asked to go next door to get drinks while we waited since the bar was completely full, they told us that we needed to wait there. After some back and forth with another employee they told us “you can leave but if you don’t answer when we call we’re giving your table away”. After 50 minutes of waiting next door at Mama Sushi (great service, great drinks, highly recommend!) we decided to eat elsewhere. Very disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxclJYcEJjalE0VldSdmJGcHBNRUU0WTBZeWFHYxAB",
            "text": "Loved the service, the waitress was super nice and friendly. The food was amazing as were the drinks. I was overall pleased."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU1pucHVPSE5PT1Y5Q1NWZDRjbGhFU1dOeFoxRRAB",
            "text": "Great service, food and atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KZlQwcGtOVGxoTUUxUlVURTVjME5XTWswMlVGRRAB",
            "text": "The atmosphere was outstanding, truly a 10/10 creating an inviting and enjoyable setting. Service was attentive and professional, and the drinks were excellent — both deserving a 10/10. The only area that fell short was the food, which I would rate a 7/10. Overall, this is a wonderful place that delivers a great experience, and I would certainly recommend it. The clams were the star."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTGRrbHdkM0JET0dWNmF5MXFlbGxoWmpCaGMxRRAB",
            "text": "I have visited this restaurant twice this Summer. I had an amazing experience each time. I have only tried the bar seating and drinks. I look forward to trying the food next time. The bartenders have been friendly and great at making cocktails. I saw them interacting with other guests and they are very accommodating even when guests come in near to closing time. It is a great place to meet others at the bar and mingle."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QkxVaFVZbGxQZWpKeWVUaHFNaTFRTlZaeE4xRRAB",
            "text": "Lena Trattoria is an Italian Restaurant which outshines most, if not all here in the Bronx and, I might add, that is quite hard to do.  About a month ago, we had my wife's 40th birthday party here.  The staff, especially Joe and Angel, went out of there way to make us feel like family.  The food was excellent and we had an outstanding time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneE4yMVJhMjlzVW1RdGNEUlBMVm93WjBWWk5VRRAB",
            "text": "The manager is a narcissist. He said something extremely rude about me to a person I was having a casual  conversation. Food and drinks are overpriced. Bartender and greeters were wonderful ! I was extremely disappointed. Won’t recommend this place to anyone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcWFUZFlOVmxaVkVOc1pVbG1OekYzT0VaS1ZVRRAB",
            "text": "Wonderful food, perfectly cooked and beautifully presented by knowledgeable personable staff.\nOur drinks were fabulous too! We will be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdFRtSnBNa1F6VFRoMk5rSlVUR3hsTTI5c2JsRRAB",
            "text": "Service was slow and we were the only ones there. Had the clam dish with the spaghetti and the clams tasted spoiled. Some other dishes were bland. They are extremely expensive. A glass of wine will run you 15-20 plus dollars. I would have liked to have a glass of wine with my food but not at those prices. I could just go to the liquor store next door and buy a bottle or two."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kU1UwdExlR1ZwVW5CclFtNTVZbFY1U2s4d09WRRAB",
            "text": "Very small servings for the pricing. Adding insult to injury, I was there for dinner and they were even training new staff so servers were highly incompetent and slow beyond belief. Drinks were not enjoyable. I can’t recommend this restaurant to others - would try another place if you have an option.\n\nInterior is very nice if you are there for photos though. Place has a very nice aesthetic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORlZIVkRaV1ZDZEVGRVExVndkV2d3YWxaR1JWRRAB",
            "text": "First time I leave a review! The attention to detail was exceptional, by Cristian and management. I love what they are doing with this place, truly bringing fine dining to the Bronx. Spicy rigatoni has great flavor and drinks were great as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTmQwMHljRjlpWmxKc1lVMDRkVkJxVm5KbVYxRRAB",
            "text": "Beautiful spot, great food! But the service lacks much to be desired!!! Food took too long to arrive!! Work on that and I'll make another trip!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wdk1HbzJaR1I1V1d4d2JVZDZVVFJLYlRCSFJuYxAB",
            "text": "Lol sorry for the picture, as I decided  to put a review after I finished my food. It’s always a pleasure to be here. Wonderful customer service and more."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVlZGTmlOMnQ0ZVhwalRIRmthREZtTUdOQ2IxRRAB",
            "text": "The mushroom risotto was great. Didn't miss the protein at all"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeWFWVTVZM3B3V0hSWVNUTk1NWFJQT1ZoYWNYYxAB",
            "text": "This is a must go spot!!! It's my second time going, and didn't disappoint me at all."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeFZsOUVYMU5NTWpWeGJVSmhWMnRSYVdkMWRHYxAB",
            "text": "Went here to eat and I  can’t wear regular sandals I have to wear crocs due to my disability and inability to wear regular sandals and the hostess turned me away at the door I explained to her my situation and she wasn’t receptive to it and said they can not serve me I will not be returning to eat there as it was my first time here. Please speak to your staff and be a little understanding. Zero stars for compassion .i would have spent money at your establishment also. There were other people there with sandals I feel she discriminated to me because of my race ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WmJsTklkM1JVTW5kSWJXVllaVmRoT1dKcVVFRRAB",
            "text": "I made the mistake of booking a hotel in The Bronx when I was actually looking for a hotel in Brooklyn and the hotel turned out to be in a shady neighborhood but what a find this restaurant is!  The food, the service, the atmosphere, everything was so good.  I ordered the chicken marsala which was so creamy and delicious.  I would definitely come here again if I were ever in The Bronx again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMU0ybEdZbVJZYkZGZlZYZHFjMnRtZEdwNmNVRRAB",
            "text": "It was a little discerning when we were watching others receive their meals before us, but the server did inform us that the kitchen was slightly overwhelmed (although they didn't seem too busy or crowded). At least they noticed, the food was delicious, great ambiance... It's definitely worth another visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVmRYVllWbTVNTm5STVZXMDBWME5VY1RoT1dFRRAB",
            "text": "Very classy place.. they treated me and my wife like special guests. The server had great attention to detail, even though it was his first day he still went above and beyond to make sure we had the best service. The portions are not over the top. They’re just right and very flavorful. The environment is very pleasant and perfectly lit for a date night. I would definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treVpYTkhjRWR2T0VOMmN6QkdSa3RPVlhBMmNHYxAB",
            "text": "I’ve have been to Lena’s three times so far. Each time for a different occasion. And each time it was a 5/5 experience. The food is delicious. The servers are excellent and the atmosphere is lovely. Lena’s is authentic fine dining. Not Patricia’s that’s also on Tremont. Two very different Italian experiences. Few people leaving bad reviews are used to family style, quick Italian.  Lena’s is not like that. Every course of food we received has been delicious and fresh. You can definitely taste the difference. Lena’s is also very accommodating as my father wanted a specific dish not listed on the menu and the chef was able to make it for him. That alone deserves a 10/10. The cocktails are also amazing as well. I look forward to stopping by again soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdWRFNUNhemw1V2tobFQyNU9SVnBNYzFCd1ZVRRAB",
            "text": "I had Nonna’s meatballs and the chicken scarpariello, both were excellent. The atmosphere was very nice and relaxing, and our server, Michelle, was outstanding."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaVozWnNNMGgxZUd4dlMwUlpia0ZXYjNWcldYYxAB",
            "text": "I went to this place with hight expectations but unfortunately it was a bad experience . To begin with  I order a Negroni  which was bad prepared, then we ordered a chicken Frances  and a rigatoni pancetta no flavor at all.  The rigatoni I ask with chicken but the chicken was not even a portion just tiny 3 to 4 pieces and the pancetta was invisible...The Chef needs to improve in  his recipes with more flavor because Italian flavor was  not  in this dish as well for the chicken Frances . They only have nice decoration and high prices . Ah I forgot the bred ... 2 small cold pieces of focaccia with a mini bowl of olive oil & olives.....\n\nthe 3 small pieces in the left side of the dish is the chicken!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweVdGZzViR0owVFdwWmJYQlhaVEEzV0RaclVrRRAB",
            "text": "The service was ok and the place itself is really nice, but the food just didn’t do it for me. It looked good, but there was no real flavor. Definitely not what I’d expect from authentic Italian. Kind of a letdown"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRUxWOW5PRTR6V1d4WmVtTkJZMUpzWTNGVk5YYxAB",
            "text": "Great service 👏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNFdYUm1VbEZPV0hsMFdHZHBhMUZzUkVWd2RGRRAB",
            "text": "It was a good experience overall, we were seated right away, and the servers were prompt and got our apps and dinner orders in. The food was good and my favorite dishes ordered were: spicy rigatoni, the pizza, and the cream brûlée. I got the lobster ravioli I wasn’t crazy about it but the table loved it. The drinks were good too, overall I would return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUE1tTTRhVGxaT0UxS2NqaERjMmsyWm1WemEwRRAB",
            "text": "Class are delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac01FUkpNRU4wYWtKMlQydHdZbUpaWmpGaWEyYxAB",
            "text": "First time eating there. Angel waited on us. He gave us a wonderful service that really deserves acknowledgement. Never been to a restaurant that actually cleaned the table fully after appetizer & before our meal. He explained about a mocktail that we ordered & tasted as great as he said. The place is beautiful inside & clean bathrooms(a plus for me). Will be visiting again & perhaps keep room for desert.\nThank you Angel for making our little graduation lunch special."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMk4yVnlRMjlvYkc1SlRucFhUV3c0V2tGeFNsRRAB",
            "text": "Excellent food and customer service. Lena is a gem in the Bronx not to be missed!  Highly recommended."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmNEUldjbU5LYVZsNU9UTXpaVGt3TVZkaVgyYxAB",
            "text": "Desde que entra puede disfruta de el buen trato brindado por (jey) el servicio super eficiente, la comida desde mi punto de vista en la ciudad de New York tiene que estar entre las primeras de su clase ,trata que no sea andy qué te atienda ,el trato que te da es para quedar consumiendo   es muy profesional y atento ,increíble lo recomiendo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1kxTmZVRTF2VnpaMlh6ZzROWGd0ZVdGaGQzYxAB",
            "text": "My first time here. Food, atmosphere, and customer service was great! My friends and I will be back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbmNtUlNWWFJZTFV0YVdubDRiSGx4WjBGdWIwRRAB",
            "text": "excellent food and strong drink.  Music was too loud."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTFVHVkpRVTVKVkd4b1dqVm1USFZHYmpsNk1HYxAB",
            "text": "Michelle, our waitress was amazing! Such good food and warm hospitality!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVozWkZVamRGYTFwQ1VsVjFla015VmpsNkxXYxAB",
            "text": "We are so happy we found Lena’s during a quick visit to NYC! The ambience was amazing and everything we ordered was exceptionally delish! The manager Joseph as well our server went above and beyond to make sure we felt taken care off. We can’t wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbnM4LU9ycG9QTFdnEAE",
            "text": "I had such a lovely experience here. Alberto and Anise were so kind and attentive—the service was truly above and beyond.\n\nFrom the greeter to the wait staff, bartender, and chef—everyone did their big one. I especially loved the tiramisu martini and the lobster ravioli; those were the standouts of the night. Definitely try them if you go!\n\nIt was a pretty busy night, and yet they were still incredibly attentive and timely. Also you know how some restaurants have that over-the-top posh decor, but the service feels cold or pretentious? Lena had the same luxurious vibe without the snooty energy. The staff was warm, present, and checked in on me with genuine care—not in the rushed way you sometimes get at places like Carmine’s, Tao, or STK—or even other spots I’ve visited around the world.\n\nEven the valet was lovely. Your whole team made my night. Thank you again from the bottom of my heart. I truly had a beautiful time.\n\nTo many more wonderful years of service—I’ll definitely be returning."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeC1pZ3R3RRAB",
            "text": "I recently dined at Lena Restaurant, and I can confidently say it was an unforgettable experience! From the moment we walked in, the beautiful decorations set a warm and inviting atmosphere. The sophisticated yet cozy decor adds to the dining experience, making it a perfect spot for any occasion.\n\nThe restaurant's cleanliness was impeccable, which is always a plus in my book. Our hostess greeted us with a smile and promptly seated us, making us feel right at home from the start. The customer service continued to impress us, especially our server, Andy, who was attentive, knowledgeable, and friendly throughout our meal.\n\nNow, let's talk about the food and drinks! The wine selection was absolutely delicious and paired perfectly with our meals. The martinis were refreshing and crafted to perfection, setting the mood for a delightful evening. As for the steak, it was nothing short of amazing! You could tell the chef took his time and truly cared about the quality of each dish. Each bite was bursting with flavor, and my guests couldn’t stop raving about how incredible everything tasted.\n\nOverall, Lena Restaurant exceeded all expectations. The outstanding service, beautiful ambiance, and mouthwatering food left us all incredibly happy. I can't wait to return and indulge in their delicious offerings again! Highly recommend! 🍷🥩🍸"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMVBMczlBRRAB",
            "text": "Loved everything about my experience here. I set up a birthday event for my sister and it turned out amazing. Everyone loved the food, from the appetizers to the main course and the desserts everything was delicious and the portions very generous. They even went so far as to decorate the table for me with the decorations that I had dropped off for someone to decorate that by the time they arrived everything was already set up and ready for my sisters surprise! My compliments to the chef and all the staff especially our server Marisol and the manager Joseph for making my sisters birthday an extra special event!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNjR6SHBnRRAB",
            "text": "Lena’s Trattoria is a culinary oasis that promises an unforgettable dining experience, and it certainly delivers on every front. From the moment you walk through the doors, you’re greeted by a warm ambiance and an inviting atmosphere that sets the stage for a memorable meal.\n\nTo start, you simply cannot miss the rosemary seasoned bread. Served warm and fragrant, this delightful bread is a harmonious blend of crustiness and softness, infused with aromatic rosemary that tantalizes your taste buds. It’s the perfect way to kick off your meal, making you eager for what’s to come.\n\nNow, let’s talk about the entrees. The pan-seared scallops are nothing short of extraordinary. Each scallop is expertly seared to perfection, boasting a golden crust that gives way to a tender, buttery interior. The dish is beautifully presented and bursting with flavor, showcasing the chef’s skill and attention to detail. It’s a seafood lover’s dream!\n\nOn the other hand, the NY strip is a standout option that is equally impressive. Cooked to your desired temperature, this steak is juicy and flavorful, with a perfect sear that locks in all the natural goodness. The rich, meaty taste is complemented by the chef’s special seasoning, making every bite a delight.\n\nPair your meal with the signature Amalfi Sunset cocktail, a refreshing drink that brings a vibrant explosion of flavors to your palate. The tropical notes and smooth finish make it the ideal accompaniment to your meal, leaving you feeling relaxed and satisfied.\n\nAs you indulge in these culinary delights, you’ll also appreciate the exceptional service at Lena’s. The staff is attentive, knowledgeable, and genuinely passionate about the food they serve. They go above and beyond to ensure that your dining experience is nothing short of perfect, making you feel valued and cared for.\n\nAnd don’t forget to leave room for dessert! The tiramisu martini is a decadent way to conclude your meal. This innovative twist on the classic dessert combines coffee liqueur, creamy layers, and a hint of cocoa, served in an elegant martini glass. It’s a delightful indulgence that will leave you dreaming about it long after your visit.\n\nIn summary, Lena’s Trattoria is more than just a restaurant; it’s a treasure trove of culinary experiences that will linger in your memory. With exceptional food, great service, and a welcoming atmosphere, it’s a must-visit destination for anyone looking to savor the best of Italian cuisine. Don’t miss out on this dining gem—you won’t regret it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNlFtZFVaakZLVEhSa1dYbzNjRE5uVmpKcmExRRAB",
            "text": "We recently celebrated our wedding at Lena Trattoria on June 4, and the experience was truly unforgettable. From the very beginning, the managers were incredibly helpful in working with us to create the perfect prix fixe menu. They took the time to understand our vision and made the planning process feel seamless and personal.\n\nOn the day of the celebration, the service was outstanding. The servers were attentive, professional, and warm—always there when we needed something, yet never intrusive. Every member of the staff was polite, accommodating, and genuinely kind, making our guests feel welcomed and well cared for.\n\nThe food was exceptional, the ambiance was beautiful, and the entire team at Lena Trattoria helped make our special day feel effortless and full of joy. We’re so grateful for their hospitality and would highly recommend this restaurant to anyone looking to host a meaningful event or simply enjoy a wonderful meal.\n\nThank you for helping make our wedding celebration truly memorable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeFpiQVVREAE",
            "text": "Loved my Brunch experience at Lena, from the beautifully decorated space to the innovative brunch menu featuring Italian themed dishes — everything aspect is thoughtfully crafted.\n\nLove a menu with multiple eggs Benedict options and a nice brunch pizza. This pizza is legit, made right in front of you in a wood fire oven, it’s outrageous!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6a2ZLV1VnEAE",
            "text": "This place is awesome. From management to wait staff, they are top-notch. Extremely attentive. They definitely want to make sure you have an awesome dining experience. We had a reservation for a party of 16. They sat us on time and got us set up with fresh bread & drinks quickly. Everyone enjoyed their food. Great music and ambiance. Keep up the great work, guys. I will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb291M3lBRRAB",
            "text": "Wonderful experiences both times I’ve gone. The second time I went with a reservation. On the way there my party size grew and the staff were more than happy to help accommodate the change even on short notice. The food and drinks are fantastic and the staff are truly exceptional at what they do. The manager is very kind and attentive to the guests. So glad to have this perfect gem here in the Bronx!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbk1xLXFRRRAB",
            "text": "I had an amazing time at Lena. The customer service and attention to detail was great, they gave pitchers of water for you to fill up your own water cup but they never let our cups go empty and made sure we had fresh water whenever it finished. The food was 10/10 everything we got was amazing. i would recommend making a reservation because we did walk in but the wait wasn't too bad for a Friday night. ill deff be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaHQtMkd3EAE",
            "text": "Had a lovely dinner at Lena Trattoria! Walked in around 7:30pm on a Thursday evening and got a table outside in their patio area…service was great! The food was really good, my spicy rigatoni was delicious and not too spicy (it is served with parmigiano cheese and chili pepper flakes on the side so you can adjust the spicy and cheesy levels to your liking). Pasta was perfectly Al dente and the vodka sauce was creamy and delicious. My dining companion had the scallops which were good but she didn’t love the accompanying summer vegetables (they tasted canned). She got a side of truffle fries which we shared and which were the highlight of my meal: soooo freaking good! We also shared the charred octopus appetizer which was a bit bland and nothing to write about, neither one of us really liked it. We split the mango mousse dessert which came with coconut sorbet and was the perfect end to our meal. The owner or manager (not sure because he didn’t introduce himself) came around to each table as they were wrapping up their meals to offer complimentary housemade limoncello which was a nice touch and my friend enjoyed! We enjoyed dining here and would definitely be back to try more of their food. Nice addition to the neighborhood! Street parking can be hit or miss in the area."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb1lySk5nEAE",
            "text": "The risotto with the short ribs was amazing. The meat was super flavorful and tender. The turkey with Brussels Sprouts and Polenta was excellent. The mezcalitas were amazing. The attention was amazing. The music was amazing. The place is super recommended. We were here for thanksgiving and we had a great time. They had a fixed menu that day but I will be back to try other menu items. Great place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM2FPamhRRRAB",
            "text": "I went for my birthday and never expected the excellent service, food and ambience of Lena Trattoria.\nAlberto was amazing with the service and the chef Erickson was incredible.  I recommend the stuffed eggplant and the clams.  You can bring all family here.  They will love it and leave the plates clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdUtMR3BnRRAB",
            "text": "It was my first time at this restaurant. The service was excellent. Our waiter Robert was very attentive and professional with us and always following up on our food and service. My son had the parmesan and linguine and I had also a pizza of shrimp scampi. The food was good so I can’t not complain. The only issue I had was when I ordered the octopus, it was seasoned on one side and overcooked. Other than that in all it was good. I talked to the manager and investor, Taner Yigiter, who listen to what I had said and was happy brought it to his attention. Mr. Yigiter gave my son and I a in-house drink from their company as well. I can say as someone who travels and goes to many restaurants and write reviews, I will return again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcWJnWUNEcjhXWjh3RRAB",
            "text": "My friend and I were there this afternoon for\nHappy hour and it was so amazing! When we arrived the manager or owner helped us with our chairs when we sat at the bar. He was so kind to help us and made us feel so welcomed right away! Our bartender Elizabeth was so nice and attentive. We enjoyed the espresso martinis and they were elite! We ordered the spicy chicken pizza and it was so fresh and tasty. We also had the Cesar salad and as someone who loves Cesar salads it was one of the best salads I’ve had in a long time! The atmosphere was calm yet fun. Between the service, the food and atmosphere it surely made me feel like I will definitely be a regular at this establishment!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc2RDVU5nEAE",
            "text": "Brand new restaurant & it didn’t disappoint! I came here for my birthday recently in the summer and there was outside dining available but I had made reservations to eat indoors and I’m glad I did! The decor was beautiful and very elegant but not too elegant where you’re forced to dress in formal attire. I decided to try out the Pink Lamborghini & it was good but could have been better and with less ice (I’m assuming it wasn’t great because the bartenders were new & reading the ingredients off the menu to make the drinks🙃) I then sat down and wow let me tell you! The seats were so comfortable and I love the lights on the table where the customer can personally change the dim lights at the table. The menu was amazing!! Our table tried out a few dishes. Their Margherita pizza was amazing & the best one I’ve ever had in NYC. Their fried calamari & burrata were tasty!! Their rose wine was really good! I had their filet mignon dish was great the second time. Sadly I had asked for Medium and it came well done so I had to ask for it again and wait for it all over again! Good thing the second time it came out the dish was medium and def not over burnt at all! I didn’t like their cannoli but their ice cream was good! Next time I’ll def try their gelato! Can’t wait to again and have more pizza honestly, ever since I had it I’ve been craving it like crazy! Lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUd2ZfNDBnRRAB",
            "text": "I recently celebrated my mother's and my birthday at Lena Trattoria, and it was an exceptional experience from start to finish. Every dish we ordered was a culinary delight. The burrata was creamy and fresh, the fritto misto was perfectly crispy, the pizza was delectable, and the two pasta entrees were nothing short of perfection. It was my first time having lobster ravioli and I can say I would go back for just that. But each dish was a 10/10, and the drinks complemented our meal beautifully.\nOur server, Aziza, was spectacular. Her attentiveness and friendly demeanor truly enhanced our dining experience. Additionally, Alberto provided great support, ensuring that our needs were met promptly. The service was impeccable throughout the evening.\nA special mention goes to the manager, Joe, who went above and beyond to make sure my sister had a fantastic time. His efforts did not go unnoticed and added a personal touch to our celebration.\nOverall, the combination of outstanding food and exceptional service made for an unforgettable evening. We will absolutely be returning to Lena and highly recommend it to anyone looking for a top-notch dining experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cmVtREpBEAE",
            "text": "This restaurant has literally become my FAVORITE spot in the Bronx. The decor is so beautiful. Everyone who works here is so pleasant and the owner personally came out and introduced himself and even talked to myself and my company for a few minutes before assisting his staff in servicing the patrons.\nThe food is simply amazing with so much flavor. I didn't order anything to drink besides lemon water, but they have a nice selection to choose from.\nI can go on and on about this gem, but THE BEST part is that they're located in MY borough, THE BRONX!!! ❤️❤️\n\nAdvice: VISIT, EAT, DRINK, Enjoy!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMHBXY3h3RRAB",
            "text": "Worth every penny !!!!! The service, food and drinks were delicious. Such a beautiful place we will definitely go back. We had calamaries and shrimps for appetizers. Then pizza and caesar salad for main and sangria. Everything was amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadE5ibFBREAE",
            "text": "It's like I went into a blackhole and was in Manhattan. The ambience here is 100%. Intimate, classy. You'd forget you're in the Bronx. Service was fantastic and so was the food. It's a little pricey but I felt okay with it given then ambience and service. Can't wait to go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5blBxelVnEAE",
            "text": "Lena Trattoria offers an exceptional dining experience with its impeccable service, inviting ambiance, and delectable menu offerings. From the moment you walk in, you're greeted with warmth and hospitality that sets the tone for an enjoyable meal. The drinks menu, in particular, stands out with its creative cocktails and extensive wine selection, providing the perfect complement to the flavors of Italy.\n\nWhile most of the dishes exceeded expectations, one slight disappointment was the taste of the grilled chicken. It seemed overcooked or perhaps lacking in seasoning, which detracted from an otherwise stellar dining experience. However, this minor flaw didn't overshadow the overall excellence of Lena Trattoria. Whether you're savoring a cocktail at the bar or indulging in a hearty pasta dish, Lena Trattoria remains a top choice for Italian cuisine in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZ1lYdm13RRAB",
            "text": "The place is amazing! It’s very aesthetically pleasing! The general manager is a gem! We went on NYE and it was a little busy! He brought us our first round of drinks due to us having to wait and that was just so sweet! Everyone was so warm and welcoming! I ordered penne alla vodka with grilled chicken and while it was good, it was a little under seasoned for me. The pink drink was so yummy! Everything else was great though! Would return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROM2RlRzVRRRAB",
            "text": "I can’t speak on the main courses because I only had appetizers. Went with some friends and had a nice time. The tuna tartare was probably one of the best I’ve had in years so I’ll go back for that alone. I also really loved the ambience and the music. The servers were nice and responsive."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dnRxdjBRRRAB",
            "text": "Leña Trattoria, ubicado en el vecindario de Schuylerville en el Bronx, es un restaurante de estilo informal especializado en cocina italiana. El ambiente es acogedor, con una propuesta de comida auténtica que incluye platos tradicionales como pastas y pizzas, y un rango de precios de $80 a $100 por persona. Abre todos los días desde el mediodía y tiene un código de vestimenta casual de negocios. Aunque aún no ha recibido muchas reseñas, puedes hacer reservas a través de plataformas como OpenTable para asegurar tu lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6a2Z5cUVREAE",
            "text": "My husband and I cannot thank this place any more. We had a wedding dinner and they put our ideas to life. They were respectful, helpful and were involved with our experience. We are so happy we chose this restaurant to celebrate our moment together. Truly amazing to many celebrations at this restaurant. I hope they expand and grow as a business"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEb3VDVUZnEAE",
            "text": "From the outside it appears to be a nice restaurant, however once you get inside you truly become captivated and lost in the ambiance. The atmosphere is breathtaking, the decor is simple yet elegant. You 💘 will love getting lost in here. I highly recommend Lena Trattoria as a go to restaurant for individuals, groups or family gathering."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaakxYRHZnRRAB",
            "text": "The Best Upscale Italian joint has arrived in the Bronx🤌🏽\n\nThis new upscale Italian restaurant that just opened up on Tremont Avenue is bringing a whole new vibe!\n\nFrom the moment you walk in, you’ll be transported to a new world filled with modern beauty & delicious aroma. The drink menu is phenomenal with the Tiramisu Martini & Pink Lamborghini & the food menu is mouth wateringly delicious.\n\nThe Clam oragnata is fireee & the Eggplant Rollatini is a must! The steak is made to perfection & cuts like butter. The pastas are great & the chicken is flavorful.\n\nDon’t skip out on dessert! It’s the best donuts you’ll ever have cuz they are so soft & fluffy paired with melted chocolate & jam.\n\nEveryone here is friendly & attentive. The best service I’ve received & can’t thank them enough for such great hospitality.\n\nGreat place for date night, celebrations, special occasions & so much more!"
        }
    ],
    "reviews_count": 77
}