{
    "name": "Pasquale's Rigoletto",
    "place_id": "ChIJydy7i330wokRgSBbs9mCM4o",
    "grid": "BX6",
    "address": "2311 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.3,
    "user_ratings_total": 625,
    "phone_number": "(718) 365-6644",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRmRVVkhPV3h2WTBSVWJpMVBRVTE0WkVVMVZtYxAB",
            "text": "Owner is nasty and rude\nThe place doesnt even have a rating i would not eat at place with no rating or less then a A.\n\nHealth department shut them down , and that should tell you enough"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1VuQkNYMVZxTTJSVVF6ZHpObFIxTURCV1QxRRAB",
            "text": "My wife and I have not been to the restaurant   due to health challenges in a while. But now that we are well and back this is the best place to have a great meal. It was so nice to see Vinnie and he was the greatest host as usual! If you have never been to this restaurant you are missing this jewel!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaFpESkNRVTlXZERsTVFtWkZXR0ZrV2pRMlIyYxAB",
            "text": "An expensive restaurant that uses frozen food out of a bag for appetizers is crazy to me! Do better, I could stay home and eat better and spend less."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNFZ6QnlObkI1Y1RSZllWOXRUREZDVVVOVlJsRRAB",
            "text": "Food was fantastic! Service and atmosphere was top notch. The braciole was fork tender and flavorful. The sauce and pasta were made with love."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKV3VvZlM5dnJhb213RRAB",
            "text": "I had the Chicken Parm! I was spoiled I can't eat that dish anywhere else but at this restaurant from now on. We will be there in September! The service was fantastic. Hats tip ! 🎩"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOdm0tdmlCcU5lUTVBRRAB",
            "text": "We had a large table for an Easter lunch only to find out to find out that there were no prices on the menu, the bread was beyond stale for starters. And, we come to find out that for six tiny pieces of ravioli they charged us $26. The lamb was beyond unchewable, beyond disappointing for the price and not cool to hide prices from customers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJX0xHWU9REAE",
            "text": "Looking for the best Italian in NY? It's right here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X0xiejVRRRAB",
            "text": "Pasquale’s Rigoletto – An Authentic Italian Gem in the Bronx\n\nPasquale’s Rigoletto is hands down one of my absolute favorite Italian restaurants. From the moment you step inside, you’re transported straight to Italy. The ambiance is warm and inviting, with pristine white linen tablecloths, elegantly contrasted by dark napkins, and a beautifully designed bar area that sets the perfect mood for a memorable dining experience. The staff is incredibly polite and attentive, making you feel right at home. Nicki, in particular, is the epitome of hospitality—welcoming, engaging, and ensuring that every guest feels special.\n\nLet’s talk about the food—because that’s where Pasquale’s Rigoletto truly shines.\n\nAs soon as you’re seated, you’re presented with an authentic Italian dish that immediately sets the tone for the evening—roasted red peppers paired with sharp provolone cheese, all drizzled with high-quality olive oil. Enjoying this with a glass of perfectly paired Cabernet Sauvignon is the ideal way to begin your Italian culinary adventure.\n\nMozzarella in Carrozza – I couldn’t resist this classic dish, and I’m so glad I didn’t! This perfectly fried mozzarella sandwich was golden and crispy, reminiscent of an Italian sunset. The mozzarella stretched for miles, and the marinara sauce was fresh, aromatic, and bursting with balanced flavors. It was so delicious that I devoured it before I could even take a picture—a true testament to how amazing it was.\n\nRavioli with Pesto and Shrimp – This dish was pure perfection. The ravioli was fresh and delicate, enveloped in a creamy, nutty pesto sauce that was vibrant and packed with flavor. The generous portion of shrimp was cooked to perfection, adding a delightful seafood touch. My husband couldn’t resist scraping the plate to get every last drop of the pesto—it was that good!\n\nPollo e Gamberoni Alla Francese – The balance of lemon and white wine in this dish was flawless. The chicken was tender, flavorful, and cooked to perfection, while the shrimp added a delightful twist. The portion was so generous that I had enough for a late-night snack—always a win! Served with perfectly cooked penne, al dente and seasoned just right, it was a dish that left me completely satisfied.\n\nTo end the evening on a sweet note, the homemade Tiramisu was the perfect conclusion. Creamy, with the perfect balance of ladyfingers, mascarpone, and espresso, it was a true dolce delizioso. Not overly sweet, just the right finish to an exceptional meal.\n\nPasquale’s Rigoletto captures the essence of authentic Italian cuisine, delivering a dining experience that feels like a journey through Italy. Whether you’re a local or visiting from out of town, this restaurant is a must-visit. If you’re looking for top-notch Italian dishes, attentive service, and a warm, welcoming atmosphere, look no further. I can’t recommend Pasquale’s Rigoletto highly enough—you’ll leave with a full heart and an even fuller stomach.\n\nBuon Appetito 🇮🇹"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcGNldU1nEAE",
            "text": "Wonderful Italian restaurant.  Superb service.  Excelkent food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeHZfdFN3EAE",
            "text": "I went here last night with my friends and the food was delicious.  The service was great as well. Definitely coming back again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MlkyTTVBRRAB",
            "text": "Really great atmosphere, food, service, and people in all. Thank you for the family feel. Thank you, Franco, for the amazing service"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcUtXZ0hBEAE",
            "text": "This place never disappoints.  Great food and reasonable prices for the amount of food and more important, the quality.   If they have the fried zucchini flowers you must try them as an appetizer."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeXA2Z213RRAB",
            "text": "Was even blessed with holiday carols"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMS1Ia1lREAE",
            "text": "Best Italian restaurant, The is no words to express what I just lived there. The food was fantastic, portions just perfect, drinks amazing & the entertainment was just out of this world, I felt I traveled in time. Such a gem in New York City, thank you !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMkwyR3VnRRAB",
            "text": "Pasquale's Rigoletto in the Bronx offers a classic Italian dining experience, but unfortunately, it falls short of being truly exceptional. The food is more reminiscent of a frozen meal than a homemade Italian feast.\nThe pasta dishes were cooked al dente, but the sauces lacked depth and flavor. It was as if the entire meal had been pre-packaged and microwaved.\nOverall, if you're craving Italian food, don't expect anything extraordinary. It's more akin to a Chef Boyardee dinner than a gourmet meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdzVHc2VnEAE",
            "text": "Our meals were delicious, nice size portions. The Staff was pleasant.  We didn't feel rushed, we were able to sit and enjoy the afternoon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2FYcU93EAE",
            "text": "Unbelievable experience fake Instagram reviews made it look good. We came in on a Saturday. It was empty for a reason the waiter scolded at us we didn’t get menus. We ordered food and when it came, it had zero flavor I mean, you could empty out a can of tomato sauce and put it on I don’t know anything a piece of white paper and that’s how much food that’s how much flavor food had do not go here no matter what."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucWNxNGxnRRAB",
            "text": "Locale ok"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubXM2YmtnRRAB",
            "text": "Great place for dinner and the atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ajl1dFF3EAE",
            "text": "I hate to give them 1 star HOWEVER customer service is the name of the game .\nI go to the website the website states you can order online through CAVIAR or DoorDash. I place my order through CAVIAR ,  pay my money and I wait for 30 minutes as it states . I walk inside of the restaurant and I’m greeted by a man who ask me what I. Needed (Not even hello nor welcome ) I tell him I have a to go order to go order through caviar - he immediately tells me ‘no you don’t , we don’t use those apps’ . I showed him my phone with my Order, his restaurant , address and Phone. He was Very dismissive  then he proceeds to say well 4 people came in yesterday & we turned them all the way. Supposedly they will have to look into this issue .  I stated I waited for this food,  I told him I heard  the food is great!  He proceeds to ask me what I ordered , I answered and then tells me oh well the kitchen is getting ready to close . I stated the time which was at 7:45pm & Google states 9pm . He says oh well, that’s incorrect too . He should’ve offered to make my meal really quick for the inconvenience (Penne Vodka). My first job was a waitress. I’m also a nurse I do customer service every day. I think this was a hint of prejudice !!!! I was very pleasant throughout  the mishap , but I’m very disappointed and I’m hungry. I won’t be back just off the conversation and dismissive energy ! SO BEWARE AND DONT ORDER ONLINE . I will be contacting my bank and caviar for this and I should also  sue the damn restaurant for not fixing the problem. Knowing they have an issue. !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibDh1cjB3RRAB",
            "text": "Food is great service is better. Love that you feel right at home. Manager is this best you need it just ask...love the place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMTdlQnpRRRAB",
            "text": "Excellent service food and atmosphere affordable and family"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6b3F5TmZBEAE",
            "text": "Post game meal with the guys. Pasquale’s lived up to and beyond my description to my guy’s of the food, service, atmosphere, prices, and friendliness. Parking is challenging but not impossible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUX0tXMlJREAE",
            "text": "Visited here recently for lunch while in NYC for work. A beautifully decorated traditional Italian restaurant with great food and excellent service. I had Veal which was delicious and a couple of glasses of red. Definitely worth a visit if you are in the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ1l2ZDh3RRAB",
            "text": "On journey from SC we had to stop on the avenue to see old friends and eat fabulous food. An Arthur Ave staple that everyone needs to try at least once. Highly recommend"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbHZXQTFnRRAB",
            "text": "You can't miss reserving and eating dinner here. Authentic Italian food at its best. Chef specials. Bar 🍸- private party room. Entertainment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMFluVF93RRAB",
            "text": "One of the best dining experiences I've ever had in New York! Excellent food and service, wine and desert. Atmosphere is wonderful. We ate here with a large group of more than 50 people and the staff did a great job of keeping up with great service. Eight course meal including breads, cheese, pasta, greens, ravioli, chicken and more. Looking forward to my next visit. Thanks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqanJiRHpRRRAB",
            "text": "They very nice to accommodate me when I walked in without a reservation but the main reason why I walked in was the Carbonara Dish we saw on the Menu they have displayed on the window.\n\nBeing that this place prides themselves on authentic Italian food I was expecting real carbonara, instead I got a plate of overcooked Spaghetti drenched in Heavy Cream, no Pepper and cheap bacon that left a horrible taste in my mouth.\n\nI ordered a glass of Pinot Grigio that was served to me in a dirty and oily glass.\n\nIt was a busy afternoon and I am not a complainer so I just paid and left.\n\nHopefully they see this and review it so that no other guests have the same experience. The host was a man that was very nice, friendly and helpful. They just gotta tweak some things around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcHJxSEhREAE",
            "text": "It was very busy Saturday evening, and I really appreciated that they could accommodate us without a reservation, but I was hoping to try some traditional Italian cuisine.\n\nInstead I got overcooked pasta with cheap bacon, drenched in crème. I left hungry and disappointed, I wouldn’t recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREanVqQmNnEAE",
            "text": "Dinner with friends really good food service was very good have been here many times and will be back and recommend . In the heart of little Italy in the Bronx great to come to as well as Ck out the great shops along the avenue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5czVuenZ3RRAB",
            "text": "Had such a great date night with my boyfriend at Pasquale's Rigoletto. The calamari we had melted in our mouth. The stuff sole was amazing it had shrimp and cram meat and was cooked to perfection. The mixed vegetables were al dente and very juicy. We had Crissy as our server who pleasant, accommodating and prompt!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdnYtaUpBEAE",
            "text": "You guys knocked it out of the park last night. Valentine’s day couldn’t have gone better. Thank you guys, she loved it❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROOF9PblhBEAE",
            "text": "This place is hands down the best go. Been going here for 14 years now and won’t go anywhere else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNXFYanh3RRAB",
            "text": "Pretty good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxN0tDMU13EAE",
            "text": "Food was a bit bland, sauce lacks body, meatballs were decent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbklXYWd3RRAB",
            "text": "Surprised this place was pretty empty. Staff, food, and drinks were amazing. Don't sleep on this restaurant. They even have their own parking IN THE BRONX. I'm glad we had the place to ourselves but they need more business. I had Bolognese and it was easily the most delicious Italian meal I've ever had. BOLOGNESE! Anyway, def give this place a shot."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmN2ZzBRRRAB",
            "text": "Comida exquisita, atención muy buena."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmVmTTdBRRAB",
            "text": "Excelente lugar. Impecable!! La atención es de primera!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmFxeUJnEAE",
            "text": "Llegamos a 10 para las 9 pm y ya estaba cerrado...\nDos pazos mas adelante cenamos en Enzos...\nExcelente!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwejh5WDBBRRAB",
            "text": "Delicious"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbDhmbmpRRRAB",
            "text": "Mi sono sentito come a casa ma non c'era mi padre a prenderme a cinghiate."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdmNyWU9BEAE",
            "text": "No idea what these raving reviews are. Vodka sauce was extremely weak, pasta dish was tasteless. Tiramisu was absolutely from the day before. Tourist trap is correct"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweElHZkNBEAE",
            "text": "I camerieri ispanici parlano italiano, sono molto gentili, il cibo è molto buono. Hanno saputo accontentare anche i vegetariani."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcmR5dzV3RRAB",
            "text": "Nothing but good things to say. It was a weekday, so the restaurant was not crowded. The food was fantastic!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaXI2QXFBRRAB",
            "text": "Nick was great. The food was excellent. Great atmosphere. Easy parking in the lot right behind the restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOV9MNGtBRRAB",
            "text": "Very nice place and food. Very accommodating as well for our 3 year old."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcHJubUdREAE",
            "text": "My boyfriend and I went to this restaurant because of an Instagram reel. We were so excited but at the end it didn’t live up to any expectations. The food was mid and the ginocchi was horrible, horrible and it also was on their “special” dishes. The waiter and everybody gave off a weird and sort of mean vibe to the dining experience. 65 bucks for the food, so mid I probably could’ve made it better at home."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMjllSVd3EAE",
            "text": "The food was adequate, staff was kind. However I would not recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MzZEU21BRRAB",
            "text": "💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dDRtaTNRRRAB",
            "text": "Been a regular here for 20 years, always the best"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNThQTTdnRRAB",
            "text": "Just absolutely the best Italian food and experience I’ve ever had. We came to visit NYC from Memphis and we wanted an authentic Italian experience. We were definitely steered in the right direction here. It was about a 15-20 minute walk from the nearest subway stop but well worth it. Save room in your stomachs because everything here is awesome. The staff was very friendly and accommodating to us even though we were quite obvious tourists."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXa19DUFB3EAE",
            "text": "Great Italian food! Arthur Ave is home to so many great ingredients and restaurants. The service is always top notch and their food is always exceptional. Worth a visit if you are ever in the area"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbnBEMEJ3EAE",
            "text": "Really disappointed, not sure how they have this high rating. The prices don't match the quality. Took my mom and friend expecting an Arthur Ave experience and was let down. The bread was dry, the service was slow and not very friendly. The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNob0szQ3Z3RRAB",
            "text": "If you are seeking to dine at an Italian Restaurant in Bronx, then I highly recommend the Pasquale’s Rigoletto restaurant. There was no waiting time and were seated as soon of the arrival. The waiter was very attentive and provided…"
        },
        {
            "date": "5년 전",
            "language": "it",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaE5DSXNRRRAB",
            "text": "Siamo stati in questo ristorante perché la guida di New York del National geografics lo consigliava come tra i migliori ristoranti nel Bronx.\nUna delusione, una vergogna per la cucina italiana.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaDRHdzFnRRAB",
            "text": "This is my favorite restaurant on Arthur Avenue. The pasta with garlic and oil and the Chicken Parmigiano are fabulous. The people working there are also wonderful. I've been going there for decades and will definitely go again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLck1ELXZnRRAB",
            "text": "Franco was an amazing host and waiter, and the soup was beyond delicious, definitely coming back, I've lived here for 5 years and this is my first time here& not the last!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLekphMlZBEAE",
            "text": "Pasquale's Rigoletto is always DELICIOUS & Amazing. You can never go wrong here. The meals are a 10. Family owned Restaurant & Wonderful Friends🤗😘. Please give them a Chance. You will be Satisfied & Return Again!!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycDR6aGpRRRAB",
            "text": "Staff is very friendly but the Italian food is noooot good. Suppose to be shrimp penna vodka sauce, and carbanara. Woof not good."
        },
        {
            "date": "3년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtN2J5NmNREAE",
            "text": "Ci siamo fermati per un aperitivo con il nostro socio ed è stata una esperienza vera e toccante. Lo spritz Campari era migliore di quelli che bevo in Italia e Phil e Vinnie ci hanno trattato come parte della famiglia. Sono persone meravigliose e soprattutto vere. Grazie e torneremo per una cena molto presto!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeGJhX05nEAE",
            "text": "Excellent food and service. Fun atmosphere. Live band on Saturday night that plays great music."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDcmVDUDZ3RRAB",
            "text": "Famous Arthur Ave classic. Very traditional American Italian restaurant with good service. Food is simple, straight forward. Not sure if it is a come back to, but worth trying for the experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NHJfOXZnRRAB",
            "text": "Great place! My son and I had dinner together before the Yankees game… everything was excellent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaHViTVZ3EAE",
            "text": "Good menu including seafood and vegetarian and chicken options. And great cannoli!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOUxxNmZBEAE",
            "text": "Excellent food, so tasty everything, the place it’s wonderful, I’ll come back so much times!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMjZPSW5BRRAB",
            "text": "We went to this restaurant because of the good reviews.I am a mediterranean and i appreciate italian food.The pasta was okay(i expected more being an italian restaurant).The house wine was good but glasses were dirty.\n\nThe service unfortunately was not good at all.We were scarred to ask our waitress (who was a blond old lady) cause she gave us an attitude and NEVER smiled.We were helped from the busboys and they were very nice.\n\nBtw tip start at 20%. Personally i will not be back at this restaurant."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeDRMbzhnRRAB",
            "text": "Great food. Right near all the stores. Definitely going back there soon"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNElhMllREAE",
            "text": "Patsy my king! Riggy my queen!  Great apps, great entrees, great desserts, great service!\n\nCome on a Saturday night enjoy the food, the wine and the entertainment!\n\nHave a grappa on me!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMDRlamRBEAE",
            "text": "Old School Family Atmosphere, best selection of wines, beers and liquor. The Food is Straight 10's all around."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4eHZ6NTV3RRAB",
            "text": "This is a great place to visit on Arthur Avenue. Bring the family or bring a date. The service is excellent and the food is spectacular. It's been family owned for many years and it's consistent in its delivery of great food. It's the last restaurant on the right on Arthur Avenue. I've been coming here for many years. The portions of food are huge and the variety of Southern Italian food is unsurpassed. They have a small bar when you walk in and 2 large dining rooms to enjoy. The specials are also very good so make sure your waiter tells you about them or look up on the board.  They have a great staff and the best person to ever wait on us was a man named Alfred.  He spoke beautiful Italian and was always kind and courteous. I don't know if he's there anymore. Call to find out because he certainly worth the trip.  Put this place on your calendar."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeEpyZkxBEAE",
            "text": "Had the branzino served whole... amazing.. everyone in our entire party had clean plates by the end of the meal!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJam9icldnEAE",
            "text": "This is my first time eating here. The wait staff was very attentive. The menu is very traditional."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbjlhbnBnRRAB",
            "text": "They seem to be riding their laurels of history here. The food was good, but the space desperately needs some TLC.\n\nThe service staff was very nice. If you have a story about going to Italy, they’ll talk to you for hours. To the detriment of other tables. They are slow to refill water and bread. The food didn’t take very long to come out, it was well prepared but didn’t have much in terms of presentation. It wasn’t grandma’s cooking, but it was good.\n\nThey have valet parking, which is a huge plus, but the lot is small, so be prepared for it to be full.\n\nI would go back if I was in the area, but wouldn’t go out of my way for it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtODVlRXdnRRAB",
            "text": "Freshly prepared food great atmosphere fantastic service.\nSpecials are always exciting the quality of the food is top-notch.\nFranco our server was fantastic providing great comic relief and explaining all the specials in great detail.\n\nIt was a great visit and definitely will be back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJX2ZHMktBEAE",
            "text": "Good food in a nice family setting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNWJmVTFBRRAB",
            "text": "I wish I had taken a photo. This place was amazing. We had hot sausages for the appetizers. I have never seen this as an option. They were amazing. I  had the ravioli with sausage and meatball. The sauce was incredible. By far the best. The staff was fantastic and I will definitely be returning!"
        }
    ],
    "reviews_count": 76
}