{
    "name": "Yopcity restaurant",
    "place_id": "ChIJyfhM1If1wokRu402B8Yc0UM",
    "grid": "BX6",
    "address": "2324 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.5,
    "user_ratings_total": 310,
    "phone_number": "(631) 561-2518",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFpqQjZiRVF6ZFhGb1NGRlhVR0pOYUZodVdWRRAB",
            "text": "My family and I visited Yopcity all the way from South Jersey and it was difficult finding seating for 6 people but FANTA , our waitress came and did her magic by finding a place for us. She was an excellent waitress, smiling and always checking to see if we needed anything. The food was so good we had to take some home. We all had atiteke ,some with tilapia which was well seasoned, the fried croaker was good too and the lamb chops omg was perfectly well done and seasoned .\nOverall, it was worth the drive from South Jersey to Yopcity Bronx and kudos to FANTA , the waitress. Look for her, she is good.\nI will be coming back soon."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM2NsbzJSMkV3WTIxemJEZElla0Y0UzA5TE9VRRAB",
            "text": "I called ahead of time about 40 minutes,placed my order and got there and still waiting another hour + for my food  and a lot people were coming to get the order before me . That was really upsetting and disappointing . No complementary to apologize for the extremely long delay or whatsoever…on the other hand the food is good .\nDo better on the service!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVVdXZEZURzFtVkZSeVZuTkVWMHBIVDJkek1YYxAB",
            "text": "Food was so delicious, Nice location."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVWRFcEVjRk4wV2t4UFMyaEhWMU5oZVRoRVVGRRAB",
            "text": "Amazing Food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ1ZsbE9RVlIzYlMxek1XNTVXa3B4VkhCMWRHYxAB",
            "text": "Great African cuisine and great service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SGVXVnBkWE5oVVZCelgyWXdVVzVLUm14dWVFRRAB",
            "text": "Excellent food large portions great prices"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUU9GRmZZbTFzTWxKNlpuSndiMk5sUTNaUFUzYxAB",
            "text": "Cool place to visit !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdGFWVlJiRVYzUzNWSmVHRm5ObkJTT1ZWaFJsRRAB",
            "text": "The food is very good but the service is very very slow so it's not worth going if you're hungry."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNGJHZFBaV2xQYjBSdVduZG9TSG8yVG14bmRFRRAB",
            "text": "This was my second visit to Yopcity. Needless to say my second visit was just as amazing. The food was incredible 🤤, my entire party had an amazing experience. It has definitely become my new go to spot whenever I am in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTE16TjRibHBOTkhwMVNETnpVMVZ4VEd3eWVHYxAB",
            "text": "Great place for acheke. The tilapia and dibi (lamb) are well seasoned and delicious. Will definitely return when I’m in the Bronx again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jelMxRmxVelJHZWpBeFZrMUZVbEZNT0dGS1lVRRAB",
            "text": "The flavors make me close my eyes to focus on tasting. The culinary direction shows courage and flavor awareness. The bills make sense, the service impresses, and the food satisfies. The workers here are friendly, too. This place has me planning my next local trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ob2QyNDFkbG8wYm1FM1NHSnNMWFE1ZERWNFJXYxAB",
            "text": "Great food especially the chicken.."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd1ptUlRiVGRvVVhWSWRtSlFTWGxvTWpkNU0xRRAB",
            "text": "A lady walked in here and asked if they served jollof rice and fried fish and the 2 servers just said no, no warm invite or even a gesture of “we don’t have jollof but we have these other things instead”\n\nThe owner of this place needs to watch out for his staff cause they don’t care about your business. They just want their money.\n\nI waited 30+ mins for my fried fish and the fish was not hot. It was luke warm. That confused me. They either forgot about my order or idk. The servers are kind of nonchalant, they didn’t give me fork or knife, I had to ask for napkins. The food is good though!\nI’d go back to try other thing and give them another chance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR1VURTRiV1psY0VaelowRkpaWHBwUlVKQlVYYxAB",
            "text": "Food 10/10 this is the best dibi and attieke I’ve had so far. Food portions are great and very filling. We had to take some home."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdE5sVjBPR3hyVEZwSWVFbE5TSHBqUkd0MGVuYxAB",
            "text": "YOPCITY owes me nothing! I LOVED everything about it. From the delicious food to the welcoming atmosphere. I had the grilled lamb and my aunt had the croaker fish. We thoroughly enjoyed our meals and will definitely be back! Shoutout to the wonderful server we had and the owner for making sure our experience was perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSmF6QjFReTFZVjNGNVUybGpPRjl3VVVwbU1tYxAB",
            "text": "Absolutely love Yop City Restaurant! The food is fresh, flavorful, and I can tell is truly authentic because there was so much African there,  from the perfectly seasoned grilled fish to the crispy alloco and fluffy attiéké. We did wait a little to be seated but not long . The portions are VERY generous, the vibe is lively, and the staff make you feel at home. A must-visit !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWWFHZEVZelZWWDB4TlN6VnpTbVUxVEZKTU4xRRAB",
            "text": "The food here is packed with flavor.  I had the fried croaker.  This fish was fried crispy and was seasoned well.  I rarely eat a fried fish these days, but it was a delight.   On the side was cassava cous cous.  That was a first.  It's flavorful on its own however adding the onion and fish to it make it a nice combination of flavors in your mouth.  The cous cous come with a bullion cube for you to add like seasoning, but I only sprinkled a little as I enjoy the taste of cassava with the onions.  My guest had the lamb which was smothered in the most delicious sautéed onions.  The lamb was tender, juicy and seasoned for a delightful flavor.   On the side we enjoyed the bowl of sweet plantain.  If you desire west African cuisine Yop City hits the spot.  The atmosphere is chill, the service is great, and the cost is affordable.   Enjoy!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORlpIWk1OQzFKUW0xNFJHSjNZemhMUlZGcmIyYxAB",
            "text": "Overall great experience. The customer service, cleanliness of the space and amazing food. Would rate this a 10/10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWlp6Qk5aRjlhUlhGa09XTnNWVk41ZW14U1pYYxAB",
            "text": "I had a really great experience at this restaurant. The customer service stood out right away. I was seated promptly without having to wait, and the waitress was very kind, attentive, and checked on us often to make sure everything was okay. I’m usually not a fan of tilapia, but theirs was so good well seasoned, fresh, and paired perfectly with the pepper sauce. I also tried attieke for the first time and, although I was hesitant, it surprised me with how delicious it was, especially when I sprinkled a little Maggi cube over it. The plantains were cooked just the way I like them, slightly overripe and sweet. I wanted to try the sorrel juice, but since they were out, I went with the ginger juice instead, which was refreshing and full of flavor. The atmosphere was lively with great music, and the prices were very reasonable for the quality of the food. Overall, the food, service, and vibe were excellent, and I’ll definitely be returning to try the lamb and the sorrel juice next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1dGQjNaVVJ3UzJadFRsUk1VMG93YjJ0d2JuYxAB",
            "text": "Best restaurant in the Bronx"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMmFpMXRZMGR3ZGtkM05VNXZRMnB1TkRSUGFrRRAB",
            "text": "Great Foods, I love the fish"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nNFFrVmpkek15ZVRGQlZHdHhjQzFYY1Y5elRrRRAB",
            "text": "Best African restaurant ever. We loved everything. Add some cocktails to your menu. Thanks ❤️❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSVVGTmpiR00xWkZWcFJtWlZVVGRXVW1WaFlVRRAB",
            "text": "I ordered two fried fish and attieke meals for pickup, and honestly this was one of the most disappointing experiences I’ve had with this restaurant. The order was ready in under 20 minutes, which already raised a red flag. When I got home and tasted it, it was obvious the fish was not freshly cooked. It tasted like old fish that had been fried before, frozen, and then refried to pass off as fresh and it was super dry not crispy but dry.\nThis is completely unacceptable, and my money was wasted. If I wanted reheated leftovers, I could have made them myself at home. What’s worse is that this isn’t the first time I’ve received food here that wasn’t fresh — but this time was by far the worst. I didn’t realize until I was already home and eating it, and by then it was too late. Other people have also told me from their experience that the quality of their food has gone downhill.\nServing customers old, refried food is careless, dishonest, and shows no respect for the people spending their money here. If you value fresh food and basic quality, think twice before ordering from this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RVYxODVaV2xWT1ZwRWJVMHRhSEZ5UmpOb1VGRRAB",
            "text": "Food is excellent,  portions are sizeable, service is great. Atmosphere may feel somewhat noisy especially on weekends. Definitely recommend 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeVZra3hjVzV4ZEhwWVdYWklRblZaV21STk9FRRAB",
            "text": "perfect spot right near the park for a lovely brunch, we enjoyed the greenery view and hustle-bustle vibe, it's a must-visit for a relaxing meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFJYUjZOVlZSU21GZlpFUlpVMHBTYVVkU2MyYxAB",
            "text": "I truly enjoyed myself. The food was very good and it doesn't break your pockets.  Went back 2 days later to enjoy something else on the menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbFMySnNhMlIwU2pOTGNHbHhiMFJJVDB3MmNGRRAB",
            "text": "Food never disappoints! And affordable for the portion sizes you get. Thw staff are nice and the service is fairly quick. Cool, laidback vibes, a hand washing sink is available, in addition to the  bathroom. The space is a little tight thou, and parking can be scares...but then again....thats NY for you. Sometimes you're lucky to find a spot right infront of the restaurant and its great! The bathroom is not clean, for a food facility, it should be better. Other than that, I've been there twice, and i live in RI...but ill gladly drive there just to eat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRmVVY3RTREJVY2pRNE1YcG1iRlZUYUZCdVprRRAB",
            "text": "The food is good ngl.everything about the food is good.The costumer service is just horrible.But the place looks very nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFZFRjZibDlMTFRCZlN6aE1VR1kxZWpFNFVXYxAB",
            "text": "Walking into Yop City felt so warm and welcoming. We even got a chance to speak with the owner, who was super kind and passionate about sharing Ivorian food and culture. The food was incredible — the attiéké with fish was perfectly seasoned, and the alloco was fried just right, crispy and sweet. Portions are generous, and you can really taste the authenticity in every bite. This spot definitely makes you feel at home, and I’ll be coming back again and again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UGJFeExSMUZaYTJoamNVaE5VMnh2TUhwMWIxRRAB",
            "text": "Great service and hosting . I always bring big parties and we always leave satisfied and full. We’ll Definitely be a soon!"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aE5VZEVjRVZZVTFkSWIwODVNazVaTUVFdGRYYxAB",
            "text": "Très bon restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWExYWlhUM2xhVUdsSk5tSkpSalpvTURSUFRVRRAB",
            "text": "Boiled meat ✅ - Dibi ❌\nVery expensive\nToo salty ✅ - Tasty ❌\nSmall quantities\nI DO NOT RECOMMEND this place"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preWMweFZaazlOY2twRlQycDFSMFJTVXpnMlRVRRAB",
            "text": "Très très déçue par ce restaurant :\n1 : Ce n'est pas du Dibi mais de la viande trop salée, sans goût et BOUILLIE !\n2 : Le supplément d'alloco est de très petite quantité pour $12\n3 L'atiéké n'est vraiment pas de bonne qualité.\n4 : le prix ne vaut ni la qualité ni la quantité : $47,50 pour une commande Dibi-Atiéké avec supplement Alloco dans de petits conteneurs ronds en allu.\nJe NE RECOMMANDE PAS cet endroit et regrette ma commande.\nD'autres restaurants dans les environs sont de bien meilleure qualité des prix raisonables et justifiés.\nSeul l'accueil reste correct."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGeGEzY3pkVzl4YmxwSGNWWlBSamMyTmxrMGRHYxAB",
            "text": "The food is not good to much salt and expensive"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aFlraE9SMHhyZW5VMWNtMUdVVzlhUkhoSmFWRRAB",
            "text": "Authentic Ivorian Flavors and Good Vibes at YopCity – Arthur Avenue, Bronx\n\nI recently visited YopCity on Arthur Avenue in the Bronx with friends and family, and it was such a vibrant experience! As a fan of African cuisine, I was excited to try this Ivorian spot—and it did not disappoint.\n\nI ordered the grilled fish topped with onions and peppers, paired with attieke (cassava couscous) and sweet plantains. The flavors were rich and satisfying, though I found the food a little on the oily side for my personal taste. Still, the seasoning and preparation were excellent.\n\nOne thing to note: my friend’s daughter has a peanut allergy, and when we asked if any dishes were made with peanut oil or peanut-based ingredients, the server wasn’t quite sure, so she played it safe and ordered French fries. It might be helpful if the staff were better informed about allergen information.\n\nTwo of the ladies in our group ordered the Dubi with sweet plantains and really enjoyed their meals. We also had bissap (hibiscus juice) and ginger juice, both of which were refreshing and delicious!\n\nThe music and atmosphere at YopCity were definitely a highlight—great energy, friendly vibe, and a space that made you want to dance. It’s a wonderful spot to enjoy a taste of West Africa right in the Bronx.\n\nOverall, I’d recommend YopCity for anyone looking to explore Ivorian dishes and soak up good vibes. Just be sure to ask about ingredients if you have food allergies."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVkxWbEhNbmgxVXpsMExXNVZOVWhpVnpoMmRVRRAB",
            "text": "⚠️Warning: this place is CASH ONLY!\nBelieve the hype!! This place is everything I expected it to be and more. The food was sooooo good. The music was even better. The endless bowl of plantain was a dream come true. My dibi was smoky, juicy, and PACKED with flavor. My sister got the big sosso which was soooo crispy on the outside and moist on the inside. Everything was soooo well seasoned. The onion salad was what tied it all together. It didn’t have that sharp onion taste, it just added texture and another layer of flavor to the meal. TRUST I WILL BE BACK!"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NE1UVkhSa2RaV0VobmJreDNPVnBYZEVoc1ZIYxAB",
            "text": "La nourriture était cool hein.\nOn a prit Sosso avec attiéké et alloco.\nC'était bon hein?\nChacun trouvera ce qu'il veut."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VON3FfcFhRN2FuSUhREAE",
            "text": "Boil meat instead of fry or grill, nasty taste and very expensive compared to other African restaurants that serve better food, I’m not recommended this restaurant to anyone"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNE5tVmhiRFpQTFZkU1dtUklZMnhmUzJaaWMzYxAB",
            "text": "The food was deliciousssss, atmosphere wonderful. This is Africa 2.0!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU1pHZFJUVFkwWTIxbFFYVnBibUZZVG5nNFRtYxAB",
            "text": "Food was so Gooooooddddd!!!\nMusic was great , felt like I was in Africa!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX1dzcEtZeDZQWTJBRRAB",
            "text": "The food was excellent ! But what set it apart was the service : 20/10, I’ve rarely given this rating to any restaurant but I can’t give anything less as everything was amazing.\nWe were attended to like we were family. Everything we ordered came fast and hot. Everything was kept extremely clean\nThe food selection is minimal but I understand it’s too keep the focus on the freshness and quality the ingredients. Portion were huge !\nThe owner is very lowkey but he greats you and check on your experience when you leave.\nMy only suggestion would be to expand the drink menu to offer more varieties of wines, beers and even cocktails…\nI’ll be back again and again to the best African restaurant in NYC"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLMlo2ODZlbXBIeHVBRRAB",
            "text": "It's the airport vibe.  You get what you get."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJX1dwS18tMVA2aW1BRRAB",
            "text": "The tilapia was to die for!! Flavor in every bite & the lamb !!!!!!!! *chefs kiss* I HAVE to come back! The portion sizes are VERY large so come with a big appetite or be ready to take some home !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUHM3LXJUbkt5UFhnEAE",
            "text": "The staff at Yopcity was awesome; they were courteous and accommodating. We contacted them for our party of more than 30 at the last minute (2-3 days). They accommodated us comfortably without interrupting services to their endless flow of customers.\n\nThe food was delicious and reasonably priced. Their services and food were beyond our expectations. I recommend this restaurant. It is cash only; bring some cash with you.\n\nI will dine there again when I visit  Bronx, New York.  Bon appétit!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN0kwY2VFaHZtRmRBEAE",
            "text": "We had the pleasure of celebrating our son’s  graduation from Fordham University with lunch at YopCity – West African Restaurant, and it was an unforgettable experience for our group of about 30! We reached out just a few days before arriving in New York from California, and they were incredibly responsive and accommodating.\n\nThe food was absolutely delicious—everything from the fish, beef, and chicken to the fresh salad, attieke, and plantains was perfectly seasoned and beautifully prepared. There was more than enough to go around, with plenty of leftovers to enjoy at our Airbnb the next day. Our guests couldn’t stop raving about the amazing flavors.\n\nTo top it all off, the service was outstanding. The team was warm, professional, and made sure everything was just right for our celebration.\n\nThank you, Yop City, for helping make such a special occasion even more memorable. We highly recommend this restaurant and will definitely be back! MM"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT3NpTzd0anIya0V3EAE",
            "text": "🌟 An Unforgettable Celebration at Yopcity! 🌟\n\nMy family, loved ones and I (30+) recently celebrated my son’s graduation at Yopcity in the Bronx, and wow—this West African gem.\nThe lunch buffet was planned in few days and every detail was on point.\n\nThe STAFF went above and beyond to make our celebration special. They were attentive, genuinely kind, and professional.\n\nNow, the FOOD where do I begin? Every bite was mouthwatering.The portions were generous, and the prices were affordable for such high-quality, authentic cuisine.\n\nThe lively Afrobeat music, colorful decor, and the sound of happy dinners.\n\nYopcity is a must-visit.\n\nThank you !!\n🎓🍛🎉"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWHB3cnVMMy1IRldBEAE",
            "text": "We had a fantastic experience at YopCity West African Restaurant while celebrating my nephew’s graduation from Fordham University. The location was perfect, the atmosphere lively with music, and the staff incredibly welcoming. We were a group of 35 and everyone—from kids to seniors—was well taken care of.\n\nThe food was amazing! We enjoyed fried fish, chicken, lamb, plantains, attiéké, rice, salad, and fries—everything was full of flavor and perfect for sharing. Don’t miss their hot sauce—absolutely unforgettable!\n\nSpecial thanks to Ade, who arranged everything last minute and made it all happen, and to Fata, who went above and beyond with her service. Thank you to the entire team for making our celebration so special. Just remember—it’s cash only. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLT1M5OVRqLXZyR0xBEAE",
            "text": "I've been here twice now, and each time, I was never disappointed. The food is great. It reminds me of being in Abidjan when I was younger. Great atmosphere 👌🏿\nI drove there there from RI just to get food for dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VNM1otWnU0eW9NVxAB",
            "text": "Food was great but the service was mediocre. I guess they were overwhelmed by the Mother’s Day crowd"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMlcyNERUejRQTUR3EAE",
            "text": "Overall experience was a 10/10. Had bibi, alloco, and garba. Felt like I was back home all over again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOHJPRlV3EAE",
            "text": "Huge fish, more than enough for two. It is cut in a way that is not too hard to take off the bone. I like the veggie that comes with it; it tastes really good. The sauce is super spicy. Food comes out kinda slow."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcGIzcDlBRRAB",
            "text": "I visited this restaurant with my wife on her birthday and we not disappointed. Ordered grilled fish , chicken and fried plantain. Their food added gari 👌. It was a special day and for $80 we had more than enough to eat and drink. The Ghanaian staff on duty did her thing. Very friendly and professional. The place was clean and the atmosphere chilling. Few things I noticed that were not ok with me was no Cameroon flag in the midst of about 50 African flags. That Mede me little disappointed. Also non customers walked in and out which was not good. In all, the place was good and I strongly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjdldEJREAE",
            "text": "This is my first time to try out the Authentic West African food. Very impressed by the quality and flavor. Highly recommend the palm soup made with cow feet, fish, crabs. Intense flavor. The portion is very generous. Service is nice and they offer delivery. I highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMXAyaWtBRRAB",
            "text": "Good food, good service, I’m happy that we have more mid range African restaurants in the Bronx. I love their aesthetic and the food doesn’t disappoint. It gets popular on the weekend at night. You can’t go wrong with the dibi or the attike and fish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaWRtcXZnRRAB",
            "text": "A Must-Try Spot for West African Food\n\nIf you’re looking for bold, authentic West African flavors in the Bronx, Yop City is where you need to be. I went in with high expectations and left completely blown away. The grilled lamb is out of this world—juicy, tender, and packed with flavor. The onion-pepper relish that comes with it gives the dish just the right kick to balance the richness of the meat.\n\nAnd if you’ve never tried roast guinea fowl, this is the place to do it. Think of it as a mix between chicken and duck, but with a flavor that’s all its own. Every bite is better than the last. Don’t even get me started on the sides—alloco (fried sweet plantains) are crispy on the outside, soft on the inside, and downright addictive. Pair that with their super refreshing ginger drink, and you’re in for an unforgettable meal.\n\nThe vibe here is just as good as the food. The music, the friendly staff, the laid-back atmosphere—it all comes together to make you feel like you’ve stepped into someone’s home for a meal. You’re not just eating; you’re part of the experience. Honestly, Yop City is one of those rare places where every dish is a hit and the service makes you want to come back again and again.\n\nTrust me, you won’t regret checking this place out. It’s a hidden gem that deserves to be at the top of your list!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPd0xQNWp3RRAB",
            "text": "So delicious. I feel like I just traveled to Abidjan and my grandma cooked all of my favorite foods. This food is authentic, the service is phenomenal, and the owners are so sweet. If you’ve never had west African food, this place will make you wonder what you’ve been doing your whole life. GO IN THERE, YOU WONT REGRET IT!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcm9UTjN3RRAB",
            "text": "This restaurant is a must! The food is simply amazing! The portions are huge as well woww! Perfect restaurant to share food with your friends and family since the portions are so big. Big Sosso (fried fish) was so delicious and well seasoned and went perfect with the fried sweet plantains. Their homemade ginger and sorrel juice was so delicious when combined together. The whole experience was so worth it. ♥️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKakpTTHZnRRAB",
            "text": "Authentic, delicious West African food with tons of flavor, variety (8 main dishes and regional drinks), decent prices and very large portions (each main dish is enough for 2 reasonably hungry stomachs). They have ample indoor seating and are a hidden treasure in Little Italy. Definitely recommend.\n\nWe got the Guinean fowl (pintade, exceptional and our favorite) and the grilled lamb (dibi mouton, very good) with fried plantain and couscous as sides. Both required our hands to eat them. Will definitely be back to try their fish dishes. They also have a salad. Our waitress didn't speak much English and mostly spoke French but it was manageable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NGVlSmN3EAE",
            "text": "I’ve never left a review before, but this special little restaurant is such a GEM that I want to give it the attention it deserves.\n\nImpression: Yop City serves a small menu of lovingly prepared West African dishes in a sweet little restaurant nestled between so many Italian spots along Arthur Ave.  I wasn’t super hungry walking in, but I got the feeling from speaking with the owner that this is the kind of place that takes real pride in what they do so I wanted to try the food, hungry or not. I’m really glad I did.  The meal and the vibe were on the money.  We ordered the grilled lamb with white rice and the ginger drink.  It was a beautiful dish… well seasoned and exceptionally tender chops (and an excellent portion) with an onion and pepper relish that added a good deal of heat and acid, perfectly balancing the richness of the meat and rice.  It was a hearty meal but we devoured it all.  This was an impressive dish and good enough to recommend the restaurant on its own.  The ginger drink was made with lots of fresh ginger and citrus, just a little sweet with a hell of a gingery kick.  They had African music playing that got us moving in our seats and laughing with the other customers (all west African but us) who couldn’t help but move to the music while they waited on their orders.  We left feeling full, happy, and like someone’s mother had cooked a meal just for us.\n\nRecommendation: Make this a destination or check ‘em out if you’re in the neighborhood."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmejZ5MWNREAE",
            "text": "Food was nice, well seasoned and tasty. The service was a bit slow when the restaurant wasn't at full capacity. Also, it was cold in there as air from outside came in as people go through the doors. The restaurant is not energy efficient.\n\nI'll definitely be back for the food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdXNxeTBRRRAB",
            "text": "Do yourself a favor and visit this lovely restaurant in the Bronx NY!!! It’s the cutest little spot with amazing food. This cozy restaurant has left the best impressions! Hospitable hosts, delicious dishes, beautiful presentation.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoN3FmTnR3RRAB",
            "text": "Can’t even begin to describe my experience at yopcity restaurant. From the food to the music to the service everything was a 10/10. If you are looking for authentic Ivorian food in NYC this is the place to go. The Garba was chef’s kiss, the lamb so succulent, the plantains just right, the chicken juicy. Every item I had was memorable. Portions were great as well, more than enough to share or eat alone. Can’t wait to return again."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycDhTNjNRRRAB",
            "text": "Les plats sont excellents et les portions sont énormes. Super restaurant. Service rapide. À tester absolument"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdGV6VGFnEAE",
            "text": "The service was great. The music was wonderful. The food the food was out of this word.  I’ve been to so many Ivory Coast restaurant, but nothing like this. The Chef is amazing it’s just like getting a test of your childhood all over again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMTZPaFhnEAE",
            "text": "One of the best meals I’ve ever had in New York. Roast Guinea fowl with rice. Could serve two, I ate the whole thing myself. Go to this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcWJhV3VBRRAB",
            "text": "This food was very delicious. Very tasty. The best I have had in a while. I travel all the way from Connecticut. I will definitely be going again. Everyone was friendly and welcoming and the service was amazing. Definitely definitely will recommend this to a lot of people."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyb2JfNmtRRRAB",
            "text": "Absolutely delicious.  One of the best meals I've ever had.  The main issue is that I ate too much because it was so delicious!  That's my fault, obviously. 🤣 The guinea fowl was like duck and chicken combined with a unique flavor. Sooo…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb3Eyak1nEAE",
            "text": "I visited this restaurant and had attieke with Guinea fowl. The meal was well seasoned and had an excellent taste. The portion size was too big though (and I had to take part of it away). My only feedback to the caterers is that they should chop the Guinea fowl meat into smaller pieces as I struggled to eat the larger chunks and made some mess. Overall a great experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc3Yyd2FBEAE",
            "text": "Four stars is only four the fried fish and Attieké. It was amazing. I also ordered lamb and salad and chicken and salad. The lamb seem like as if it’s boiled versus grilled. The chicken just wasn’t appealing. I will definitely give them a second try though"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbmVydlJ3EAE",
            "text": "Food was delicious!!!!!!! Ambiance was just as good! The staff and the clientele feel like family!!!!!! Can’t wait to return!!!!!!"
        }
    ],
    "reviews_count": 70
}