{
    "name": "Fogon Restaurant",
    "place_id": "ChIJ94XbwHj1wokRqOj8F4QzP0E",
    "grid": "BX6",
    "address": "2728 E Tremont Ave, Bronx, NY 10461, USA",
    "rating": 4.5,
    "user_ratings_total": 73,
    "phone_number": "(347) 293-5228",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRWJITlBaVk5WUjJVeFNVcHlTMmR0Ym5aMloyYxAB",
            "text": "Great place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM2FVUjJkVmhDVW5wRGJWZHZTSEJpU0ZsUlNtYxAB",
            "text": "Had a great time at Fogon. Jillian was awesome and very attentive. And she makes very good drinks💯 Def recommend 👌"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaWIycFdRM0JUZUZWM1JFcEtTVFZCYmpVdE5uYxAB",
            "text": "We stumbled in looking for a new spot and this place did not disappoint. Food, music, and service was great! The bar tender Jillian was A+ making sure our drinks were on point and checked up on us on multiple occasions! Def recommend for anyone looking for a good vibe!\n."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeVdtdGZhMGR3UTNCSGVWbHVURjltTFdnNE9YYxAB",
            "text": "Excellent addition to the neighborhood. Great food, drinks, and people."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWFJsOVNUVmRXY1ZKaWFsSlhMVXhPVVc5RlQxRRAB",
            "text": "As someone who visits this restaurant often, I wanted to share my perspective. I have always had wonderful experiences with the owners, the staff, and the overall atmosphere here. The food and drinks are consistently excellent, and the team has always treated me and the people I have come with with respect and kindness.\n\nWe have never seen the staff be afraid of their managers. In fact, we have seen management step in to help their staff during busy times and also protect them when needed. They have even made sure that I got home safe, and they have always made my sister who has special needs feel extremely welcome. That kind of care shows how much they value both their staff and their customers.\n\nOf course, everyone’s visit can feel different, but I know firsthand how hard the staff work and how much the owners care about this place. That is a big reason why this has become one of my favorite spots. I just felt it was important to add my voice as a regular customer who has consistently seen the best side of this restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZlJFUk9aWE5YY0VVNWEybGtOMEZoTFZSM2JXYxAB",
            "text": "Great specials after 3 pm. Food is meh.  Honestly this place is more of a bar than a restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFRYWjVURU5sY1hFNFdsQTVWbXB2ZUZkR2FWRRAB",
            "text": "The food here was great! We got several dishes between the four people I went out with and I was not disappointed with anything. The wait staff was also very friendly and funny."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRlExcEtNemxaUjA1WmEyTlRUVk5KU2t4d0xXYxAB",
            "text": "Food very great, not too much staff for a busy happy hour area seeing thag another big happy hour spot just closed. The manager (had black glasses hair in a bun black tank top and jeans on a Friday afternoon ) sat the entire time I was there (Almost 2 hours) with a favorite friend of hers whom she paid for her drinks a food. Not saying that isn’t ok but you should want to make sure all patrons are happy not just your friends. Also when I asked the bartender if I could get a to go drink she became very scared as said manager was right near me. I looked at her concerned and just told her to forget it because I didn’t want her to have any issues ( even though to go drinks are said legal with food purchase in nyc). There was only one bartender and waitress , the manager watched them di everything and she still sat with her friend ( even at 5:27pm when it became full). The manager continued to sit next to me with her friend at 5:29 pm and say how amazing she was as a manager even though she was not assisting with anything as the bartender had to do everything herself.  But I will give amazing customer service to the bartender she was absolutely amazing. She was so sweet and accommodating. Amazing drinks. Food also was very amazing . But their a management team needs a fix I feel bad for the staff. As the manger stated she doesn’t know if she would keep this job as she sat next to me at the bar with her friend. I’m sorry I’m just a big advocate for the service industry as someone who watches wat happens to them. This place has great food and drinks! I’m just reviewing the overall experience and ambience as a professional coming in for happy hour. Definitely a go to for a happy hour moment !\n\nUpdate : at 5:47 pm the wonderful bartender had gave me a check without me asking and I told her I wasn’t done. The manager and her friend both looked at me started speaking in Spanish , but I’m also Spanish so I understand. The manager said in Spanish “ sometimes they act black even if there Spanish “ which is supremely ignorant. And continue to speak nasty as I sat there as if I didn’t speak Spanish. When I had stared at her for saying such she fake smiled at me. They definitely need someone who isn’t a narcissist to manages a location"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1RYSnZZMmRYWXpSQlpVbEZaSGhtYTB4a1FYYxAB",
            "text": "I was there last night just walking around my neighborhood. I was looking at the menu outside when someone invited us in. Amazing environment, great music, drinks and hospitality. Our bartender was so sweet. We tried every drink on the happy hour menu. It was an unexpected outing for us but experience far exceeded our expectations."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWGVWOUdaRlJQYlU1aWVHeHBVMWx5YVdwdGVVRRAB",
            "text": "My favorite place to be! The food, the vibes, and the drinks are off the charts! I usually go once or twice a week"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214amRrNW1kbk0zTjJKNmJqaENRWEIyVVhOUmRrRRAB",
            "text": "Excellent food Excellent service. Owner and servers were very attentive. Great atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTmQzQm5WR2h3WDI1cFdFSnpNbmhqWWxrM1VHYxAB",
            "text": "Came in for the first time, had a lovely server and I met one of the owners also.. Theie service is excellent! Food was delicious! Happy hour on point! They canso better on the margaritas but I’m not complaining it’s happy hour! The long Islands were spot on! I highly recommend to come with family and friends! Oh yeah and the music was a super dope vibe! Myself and my team will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q05YaHdlWGN5ZVhGd2FFWnJXRU0xVVd0UFoxRRAB",
            "text": "They have happy hour Monday-Friday from 3-8 pm. $7 drinks and $10 appetizers"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMVHUzOWpYcFl6QU9REAE",
            "text": "The food and drinks were okay, but the DJ was wack as hell. No blends, music randomly cutting off, then playing another song, and entirely too loud. I'll try this place again, but if the same DJ is there, I'm out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM3gyOG1JamZQOWVREAE",
            "text": "Food is great, and I loved the atmosphere, but I have to say the servers service really sucks. I tried to give her the benefit of the doubt! Regardless my husband and I still find there because of the great food and I’m not sure if the owner or the chefs customer service. Than you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLTRfdHl2eTd2YXpBRRAB",
            "text": "Great lunch specials, and staff are nice and friendly.  Music is nice, the place is clean. Plan on going to Happy Hour soon."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYVE3NGI0XzdtU2F3EAE",
            "text": "Me encantó el servicio, hay un joven que trabaja allí el cual sabe atender a la gente y sobre todo hacer que uno quiera volver, mi esposo dijo \"encontramos un clavito aquí en el Bronx \"."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcW1rX2ZEaThDNXBRRRAB",
            "text": "I ordered to go  chicken mofongo\nAnd chicken montaditos and waoooo that was really delicious 😋☺️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNjZxWEl3EAE",
            "text": "It's a Spanish restaurant and bar great music and service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcjRQVkJ3EAE",
            "text": "We had a blast at your brunch ( $40 all you can drink plus 1 appetizer in one full entry) So glad I came. The host and server was so classy and so accommodating!I have to say your calamari is the best I've ever had! The salmon and yucca fries top tier!! I normally don't order salmon at a restaurant.Because they always overcook it, but you cooked it exactly perfect... Is still moist in a little pink!!.I've never gotten that in a restaurant before. I've been to many all You can drink places and normally they do it by the glass... You give each person a small caraft ( 2 drinks) which is great because I don't have to bother you every five minutes for a refill ...lol love the white sangria!We definitely we will be coming back again!!!....April 7th birthday month!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNjhDd2RREAE",
            "text": "Food was delicious, vibe was unmatched, great energy, & amazing hospitality. Overall I had an amazing time with my girls 10/10. We will definitely be coming back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcTUtLWJBEAE",
            "text": "I went for a night out and this place exceeded my expectations…. the food was amazing , staff was friendly and the vibes was great… i recommend to come here with friends and family , I will be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcTZfb0xBEAE",
            "text": "I’ve been twice & both times have been AMAZING ! Music is good & the food is even better!! Friendly staff & the owner is such a delight to meet !! 10/10 everyone should go here for a nice night out"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNXJQNmdRRRAB",
            "text": "The manager, owner and staff members were very pleasant and helpful. They treated me and my daughter very nicely. The food and drinks were excellent. I’m going to dine there again in the near future. I would recommend this restaurant to everyone."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbVBuZ3ZRRRAB",
            "text": "They allowed staff to accidentally harass my friend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NXIzb0tBEAE",
            "text": "Came here for a friend’s birthday brunch last week. It was terrible. Service was so bad. The waitress would take one person’s order at the table and leave and we would have to wait another 15 minutes in order for her to come back to do the same thing. Mind you we never got the basic for the table like water and utensils. When we got our food, it was wrong. She didn’t know whose food belongs to who. She was too worried about looking good rather than us getting our food . Food was mid . To top it off when we got our bill, she tried to overcharge us.  It was just a waste of time and money . I don’t recommend this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbVlXcW1nRRAB",
            "text": "Fire spot! Love the aesthetic, the food and drinks were A1 and arrived on time. We went for taco Tuesday and we’re not disappointed. The server was the only one and amazing, very hospitable. She checked on us, brought food and drinks in a more than timely manner and asked for feedback. They offer hookah and have happy our prices. The music was nice and a live DJ showed up around 8 making it even better. 10/10 highly recommend I love Supporting restaurants that are new so definitely give this place a try ❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna0pUQ29BRRAB",
            "text": "So I went to El Fogon two weeks ago and I had the Churrasco with some real fried Yuca it was delicious, my hubby had the Lobster Mofongo and it was amazing. the service was great and the drinks were expectacular. I highly recommend this place, if you just want to unwind from the stressful week, listen to music and relax this is the place to go to."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcXRmSHNBRRAB",
            "text": "Great spot definitely worth it, food was good! Hookah is great. Service was great! Stop by you won’t regret it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcXFlVEN3EAE",
            "text": "I love this restaurant! The ambient and vibe is just amazing. Also can’t forget about there amazing cuisines that are delicious, not only do the drinks look good but they taste great. Definitely 10/10 experience and very budget friendly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcXJ2RUJBEAE",
            "text": "Best experience I’ve had in a long time!! Amazing vibes and great ambiance! Definitely will be returning very soon!! Throwing my birthday party here this month!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3em9pa2V3EAE",
            "text": "The staff was very nice. Food was ok, but the music was entirely too loud. A customer should not have to yell at a waiter that is an inch away from their face in order to be heard. I understand trying to lure in business with music, but what good is it if it drives out customers that are already there? I wouldn't return solely for this reason"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bzlxTHVBRRAB",
            "text": "We had a great time here Laurdia  was awesome and a great host"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcjdfenJRRRAB",
            "text": "I went with my wife and the food was okay, but the music was way too loud. My wife enjoyed the place, but once they started doing the chicken dance, we were out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdFlTeVNREAE",
            "text": "I got my cellphone taking from my purse and they said it never left my purse the waitress's got mad cuz she wanted more tips than the 24 dollar of gratitude the get  . Bad service every one be careful and keep ya cell in ya hand .  ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM3ViaVhREAE",
            "text": "Nice little spot w/very good food. Order took a bit longer than expected but the taste was well worth it. Could use a bi-lingual server/hostess."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbzZhanFRRRAB",
            "text": "So I went for Sunday brunch at this place. The food was good the DJ was okay. However, I have One complaint   I thought I was In daycare, not an adult brunch with the number of children I saw at this place with their parents, while they had…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcW9YUnd3RRAB",
            "text": "Me encantó el lugar, me facino el baño, el servicio io excelente y la comida expetacular"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5LUliblVnEAE",
            "text": "Las mejores atenciones de la ciudad, te hacen sentir como en casa. La comida es exquisita y el ambiente unico ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaG9fX3pRRRAB",
            "text": "Great restaurant, if you want to taste good food check them out. Prices are okay"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbDZqQnZRRRAB",
            "text": "The ambiance was fantastic, the drinks and food were DELICIOUS 😍 & the music and service were amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMWZEWjZBRRAB",
            "text": "A very friendly service with a top quality meal guaranteed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxLWZfdEx3EAE",
            "text": "Great Restaurant! Delicious food, kind staff and warm environment! Definitely coming back soon!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdkxHNXlnRRAB",
            "text": "Servicio excelente, y la comida 10/10, súper recomendado"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbkozSWlBRRAB",
            "text": "Excelente servicio y ambiente, la comida es muy rica quedé encantada con este menú que tienen lo recomiendo 100%, los tragos de la casa son ricos me gustaron mucho, las meseras dan un excelente servicio y atentas a las mesas. Me encanta la decoración del restaurante y la higiene que tienen en los baños es de primera 👌🏻.😃😃😃"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXVPZ2J3EAE",
            "text": "New restaurant in the Bronx, the cocktails were very good and the food delicious, the atmosphere seems like you were in Miami, I will definitely return"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeHUyRExnEAE",
            "text": "Excelente servicio , la comida 10/10 , el ambiente increíble y una gran variedad de tragos que le aseguro no se arrepentirán …"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcUxiNUp3EAE",
            "text": "Muy buen servicio la comida muy rica los trago están súper bueno, encontré este nuevo lugar en el Bronx NY se lo recomiendo"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxeU9QbWdBRRAB",
            "text": "Súper encantada con el servicios de cada unas de las chicas que laboran en el lugar, la comida súper exquisita, los tragos delicioso, mi favorito el lychees martini’s, 100% recomendado, de los aperitivos el favorito de todos el montadito de pollo y yuca."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxeU9HTG13RRAB",
            "text": "Nice place, great drinks and the best food 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdnJtcDl3RRAB",
            "text": "I had a great experience at this new restaurant, the food was great, their staff is super friendly and try their best to make your experience memorable. The place is super comfy and cute. Definitely the piña colada was one of the best I have had in a long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbW8yTGxRRRAB",
            "text": "This is a new place in the Bronx , which I went yesterday first time and it was amazing, goor food, drinks and service. Will be there again. Thank you so much guys."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaHFtTDRRRRAB",
            "text": "Nuevo restaurante, la location perfecta. Fantástico ambiente, la comida espectacular\nDefinitivamente 10/10. Me encantó el servicio.\nVolvería definitivamente"
        }
    ],
    "reviews_count": 53
}