{
    "name": "East Tremont New York Grill Corp",
    "place_id": "ChIJjTMpGI30wokRK9FPpBIHtXk",
    "grid": "BX6",
    "address": "1057 E Tremont Ave, Bronx, NY 10460, USA",
    "rating": 3.8,
    "user_ratings_total": 8,
    "phone_number": "(845) 201-5790",
    "reviews": [
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzc3ZLOUVnEAE",
            "text": "A great place to get food if you’re nearby and at late hours when everything else is closed. However, the atmosphere isn’t the best when people are hanging out in and outside in front of the store"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MUlHUHFRRRAB",
            "text": "Buyers beware this place has a small rap sheet for skimming people's EBT card, what's when more criminal is that it's impossible for someone to insert a skimmer in their card slots because they're the ones holding on to it, plus the machine don't look like the one in 7/11 so with that being said they're the ones doing the skimming with their own device. It makes sense too because ever since I started using my card there it got hacked twice it's hard to track these transactions because people who do this sell off the information to the black market and once they sell the information the card can be hacked anywhere. Those with EBT cards do not use it at this place ONLY EVER USE IT IN SUPERMARKETS AND COMPANIES WHERE THEY ARE A HYBRID OF  A GROCERY PLACE LIKE TARGET AND BJ'S ETC. Your card is not protected at all and is susceptible to hacking with no chip involved on your card!!! Oh and a lot of times they don't give you a receipt  (not saying they do this but) they can easily put in any number of prices and charge you more than the price without you knowing it. Also the area is not safe after dark."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqczgtWGpnRRAB",
            "text": "This is by far the best spot out here the food is always fresh but the guy's behind the counter are great people always kind courteous out be even seen them give out food to those who could not afford just amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cXBmN2l3RRAB",
            "text": "My favorite store. =)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadUp2VG13RRAB",
            "text": "Amazing food and wide variety of sandwiches and juices and great staff"
        }
    ],
    "reviews_count": 5
}