{
    "name": "Emilia's",
    "place_id": "ChIJJ1pvX4f0wokRLOiByaI26OE",
    "grid": "BX6",
    "address": "2331 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.6,
    "user_ratings_total": 654,
    "phone_number": "(718) 367-5915",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVNIcE1hMTh5WTFKb1dGcHBORmhPVGt4a00zYxAB",
            "text": "Just a great meal at a more than fair price!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213dGFIcFNjR1JIVG5FMWJsTTNPUzB5WWtoRlZuYxAB",
            "text": "The food was rich in flavor and delicious. Very Italian atmosphere. Perfect for lunch! We had the mussels fra diavolo and rigatoni Norma. The rustic bread was perfect."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWE9VY3diRFpXZURKb1VubDNSVEEyTFRkSU1sRRAB",
            "text": "10 out of 10."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNFRYaHdURzFqYW10RWVYSTNYME5rVkU5cmVFRRAB",
            "text": "An all around very pleasant experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdFkyTjZhSEZvVkhOVFFrTTJUa2R5UnkxaWJWRRAB",
            "text": "Well another restaurant we sometimes go to was closed so we gave them a try.  Soooo glad we did.  Really great wait staff. They made great suggestions. And the food was fresh and delicious;).  Oh. Try the espresso martini. I ordered the veal parm and side order papardelle with bolognese omg yum. Definitely going back.  My new fav place on Arthur ave."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sak56bFhjMFpOVTJOQlVqSTFPV3BrUWtOSWVFRRAB",
            "text": "Disappointed ordered bottled water that was filled with smelly tap water if they’re too cheap to give you the real thing that probably only cost them a dollar and then they sell it for $8 imagine what else they’re cutting corners on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeFdUTlRSMHg2VTB0clJVTndURUp3TlU1cWRXYxAB",
            "text": "The last lunch my wife and i had together was at Emilias in little Italy in the bronx. Restaurant is quaint, traditional Italian decor. We started with an expresso martini and i had a pomegranate martini. Both cocktails were made with precision and were fabulous as per the waiter’s recommendation. My wife ordered the lunch special gnocchi bolognese. She found the gnocchi to be very chewy and ultimately did not eat much of the plate. I had the lunch special lasagne. I found the lasagna to be top flight. It was beautifully layered and seasoned  perfectly  and the bolognese here is  absolutely top flight. I wish the gnocchi was a bit better but i would come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbldFbDRXbXRWZW14aVRHa3paMVkwWm1saWEyYxAB",
            "text": "One of the best meals I’ve had.  You can taste the freshness in the marinara and vodka sauce.  On my next visit to NY I will 110% go back.  The rice balls were too die for."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTFZtWnlVSEpaTFdaUVpUVnlTa28xUzJseGVrRRAB",
            "text": "Nice spot for a bite to eat. The food and drinks were good, we especially enjoyed the arugula salad. The service was great, we even got more bread.\n\nI don't think it was the best Italian food, but it did the trick. There is indoor and outdoor seating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RVRuUlZlVU0wZVdGMGMwUlhlVE5oYmpOcmEzYxAB",
            "text": "I’ve been going to Emilia’s since 1987 and love it. The stuffed vegetarian artichoke is out of this world. Salad with arugula and fennel is fresh and delicious. The outdoor patio is lovely. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVVlVSXhUa2RRVjJSamNsbGZkbE5ST1VJMWRsRRAB",
            "text": "A truly traditional Italian restaurant with outstanding food and outstanding service and the style of the cooking is traditional one of the best Italian restaurants I've eaten in many years ... reasonably priced as well with a nice patio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdGVrcGlRM2x4TmpWdVdYSjVVVlpKYmw5SmVWRRAB",
            "text": "3rd time visiting, really nice and quiet, family friendly with a good selection of meals, alcoholic beverages available."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ0xVeHdiMEV6YjJGSmNUZFFWbGhPY0hKWU5VRRAB",
            "text": "One of authentic italian cuisine! And the price is fair. Def it can be one of choice italian restaurant in NY"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Nk5USTJaRkp5VldKRFZraDRiV3RITW5sU01IYxAB",
            "text": "Not only the pasta, which was really good, but the bread, the tomato sauce, the service. Everything outstanding! The small patio on the back is really nice, even on a super hot day like today we had a very pleasant lunch.\n\nIf like us you came to the zoo and are looking for a place near by, this is highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM01rMWlRbTVXTlUwMFpERTNUVkUyVUZGWGNXYxAB",
            "text": "Food was delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsclRtaHVTV3RJVWkxUFUzZHVZbUZEWmxkNVdXYxAB",
            "text": "Classic Italian red sauce style restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbGIzUnFhRkJaWld0SVNuSlhVa1JyUjJOVE4yYxAB",
            "text": "Simply outstanding. The best meal I’ve had in 2025. Delicious food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QlQxUnpXRkZsZUhkT2FGWTJOMTlOTm04eGRYYxAB",
            "text": "Such a great dinner - this is a humble and honest restaurant with Italian-American classics executed really well. Super friendly service, relaxed atmosphere. Dinner here was a highlight of our New York visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsamVVOUZNRUZaTTFSdWJVUXlZelZEYVdodFRtYxAB",
            "text": "Good food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMlV6ZFBaRTVVTWpRMFRqUkxRalZWUVRZM1YxRRAB",
            "text": "Delicious food 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKTFZoX3pIbko3M0dBEAE",
            "text": "Great italian food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN01zNDJYLTlHdGdBRRAB",
            "text": "Spectacular food. Big portions and great service. Was blown away by the rigatoni meatball. Spinach pasta was a really inventive spin. Good prices"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKV0htWTZVckt5d2x3RRAB",
            "text": "Food was absolutely amazing! Veal Cutlet Parmesan."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNT2syZDJxdnRxTzhnRRAB",
            "text": "This is an old-school solid Italian eatery. Service was a bit slow at first, we were a party of 5. Staff was pleasant, Drinks and apps were good - solid, not over-the-top. The zucchini flowers were good but oil-heavy. The pork braciole was a bit on the dry side but caught my attention since it's not often seen on menus. The Wild boar pappardelle was delicious. Cannoli & cheese cake were enjoyed. Portion sizes were plentiful. All in all, as our dear friend Dom would say:  \"Not thrilling but nice\"."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOMzl1UE9ubGR1NjNnRRAB",
            "text": "Very delicious Italian food and nice drink selection."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNR0x4c0dKaUtldUhnEAE",
            "text": "The best shrimp parmesan I've had in a long time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ2YzaUJnEAE",
            "text": "Wonderful bread. Very nice service. Excellent eggplant Parmesan. House wine was good and well priced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZM1BQVk5REAE",
            "text": "Emilia’s\n2331 Arthur Ave.\nBronx, NY 10458\n\nLasagna\n:\nDo not touch the plate because it is piping hot.\n\nThe Mozzarella cheese has a perfect char; watch out for the cheese pull.\n\nThe noodles are hand pulled one by one and layered with ground beef."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGNTRHFnRRAB",
            "text": "This is hands down one of my favorite restaurants! The food is consistently excellent—flavorful, fresh, and beautifully presented every time. The service is just as impressive: friendly, attentive, and always makes you feel welcome. Whether it’s a casual dinner or a special occasion, this place never disappoints. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb2NDY0lBEAE",
            "text": "Excelente servicio y buena comida"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNkpMVUlBEAE",
            "text": "A most enjoyable treat.  Osso Buco with Risotto done to perfection.   The service was excellent and friendly.  I highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LTZYal9RRRAB",
            "text": "Wonderful place to dine!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d1BxQ0VnEAE",
            "text": "We entertained future in-laws and family from Miami and ended up having dinner at Emilias.  Food and service were excellent. Reasonably priced.  The veal cutlet parmigiana and a side of pasta were excellent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRemEzalhBEAE",
            "text": "We finally tried Emilia's, and we loved it! Their meatballs pairs perfectly well with ricotta and parmigiano reggiano. Their truffle gnocchi is a must try!\n\nThe staff are friendly and the ambiance is great, feels very homey and intimate."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMDdMaDdnRRAB",
            "text": "La comida Deliciosa. Verdadera comida Italiana. El pulpo delicious. Excelente servicio y muy limpio"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbzlEMTFRRRAB",
            "text": "Place was very busy but got seated quickly.  I had the lasagna and tried the pasta with Bolognese, both were very good, eager to come back and try something else."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcGMyX05REAE",
            "text": "A really nice experience. Had dinner before visiting the NY Botanical Garden train exhibit. The food and service were very good. Prices were very reasonable. And the Arthur Ave. ambiance was welcoming. Other than waiting about a half hour in the municipal parking lot it was a well worth visit. We brought friends from California and they were impressed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMl9tNVVREAE",
            "text": "The food is always very good.  It was busy, it usually is. It was a late Saturday afternoon. We had baked clams and calamari for our appetizers.   We wanted mozzarella in carrozza, but it was just too busy.  It's not on the menu, but they'll make it if time allows.   All of our main dishes were excellent, and the portions were sufficient for everyone to take home some leftovers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ejk3ZFJnEAE",
            "text": "I had dinner here today it is an amazing restaurant friendly staff excellent food looking forward to going back to Emilia’s 👏👏"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQamY2TGtnRRAB",
            "text": "My wife and I decided to grab dinner on a Arthur Ave before we went to the Nightmare Before Christmas Light Trail. I foolishly didn't make a reservation (on a Saturday night) anywhere and after being turned down at 3 different restaurants we stumbled upon Emilia's. The hostess was so incrediblely nice and sat us right away. We ordered the chicken Arthur Avenue and chicken parm. Both dishes were absolutely delish. There arent too many old school Italian restaurants like this left anymore. We highly recommend it and can't wait to go back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMXNTdTh3RRAB",
            "text": "We have eaten at just about every restaurant on Arthur ave and this was the worse by far. We drove in from ct for a birthday of my son and were expecting a great meal but were disappointed. Just not what we expected, but we went there because of google reviews that were 4.5 stars. I would honestly give it a 2.5 rating and we are a very Italian family I guess you can’t go by google reviews"
        },
        {
            "date": "11달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOVAzTG53RRAB",
            "text": "Außerordentliche Italienische Küche auf der Arthur Street ist sicherlich keine Ausnahme, dennoch findet man hier ausgewogenes und verhältnismäßig günstiges Essen.\nDie Portionen sind ordentlich für den Preis, Getränke und Gratituity Fee wie gewöhnlich relativ hoch.\nHinter dem Gastraum bietet sich zusätzlich ein außenbereich der Recht gemütlich und damit auch relativ einzigartig ist.\nDer Service war teils unbeholfen, kann aber auch an dem jungen Kellner liegen."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNElPX0t3EAE",
            "text": "One of the best, authentic, Italian meals I have ever had! Will absolutely return!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYajQ2bDdRRRAB",
            "text": "We came to the Bronx to see Fordham university. Afterwards we walked a block or 2 to little Italy. We went to one place.. No one came out... Enzo's was packed, next was Emelia's. We were greeted by Bruna. She brought us to the Lovely patio with the mini waterfall. The service, food and ambiance was a 10!  Bruna was sweet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuXzlHVlBREAE",
            "text": "It was a very nice and calm restaurant for an early evening dinner. Food was great and served with complimentary bread. Staff was very attentive. I recommend the Gnocchi con Buratta!\n\n+ Very clean bathrooms too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueU96X1lnEAE",
            "text": "I was visiting New York for my birthday and I specifically wanted authentic Italian for my birthday dinner. This place was as authentic as you can get. The food was amazing, the drinks were amazing, the service was amazing. Everything was just amazing! I had the lasagna and my God was it heavenly. We were so thankful that we were able to get in because we did make it close to closing. But I will definitely return on my next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNW9fa1dREAE",
            "text": "really nice and attentive staff. lovely back patio. incredible food! gnocchi was just fabulous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbU1IUjFnRRAB",
            "text": "I had the Lobster Ravioli with shrimp paired with the house red wine, the creamy vodka sauce was incredible, I was not expecting it to be so flavorful while at the same time not overpowering. 10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidU1LV1FnEAE",
            "text": "What a great place to have the best gluten-free pasta with unbelievable I will definitely be returning to this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWZ5cER3EAE",
            "text": "Well since 2012 I’m  have been a costumer at Emilia’s  but  I have never experience such a  discrimination like today , they left me and my sister in the patio without asking if we want something , I assumed they forgot about us . We spoke to a nice Mexican waitress and after 10 minutes she disappeared. We had to go to pay the check at the cashier  because nobody show to bring the check. I’m so sad and dissatisfied that a place I delft like home became a place that I will not visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N0tIY1pnEAE",
            "text": "There are so many great restaurants in Little Italy The Bronx to choose from but Emilia’s is a definite must try.\n\nThe service: Amazing, can’t get better. The waitress was attentive and gave great recommendations. She was very friendly and warm. The owner came over and spoke to us. It was just a warm cozy atmosphere. I highly recommend just for the service.\n\nThe food: incredibly delicious. The red sauce was light and crisp. Very refreshing and delicious. The Chicken parm is the greatest of all time.\n\nThe bar: full bar with cocktails and beer. Made perfect and is not insanely expensive. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREajdfSFVBEAE",
            "text": "Saw that this place had some Sicilian dishes and wanted to try this restaurant first on my first visit to Arthur Ave. unfortunately they don’t sell the panelle anymore but still had some amazing fresh food! When we got our food it was amazing the fresh bread with butter and olive oil and cheese was amazing then we had the calamari arrabiatta and the fresh mozzarella and tomato it was wonderful! I had the pasta al foro a very traditional Sicilian dish and it was great the sauce was everything! Everything we ate here was great and the owners remind me of my aunts and uncles great people always making sure if we are fed like family great spot here on Arthur Ave will be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicUp2TWNBEAE",
            "text": "I wanted something from an outdated menu that I found online and they were happy to make it since they had all ingredients, the price was higher but I didn’t mind. Server checked on us a good amount of time and was very nice. Food was so good I can’t wait to come again. We sat outside, they had fans to keep us cool, and the water fall was such a nice view. Can’t wait to visit again :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM3BuZkhnEAE",
            "text": "Once again our original plan was closed on Monday and we end up at Emilia where my wife didn't want to go. We end up ordering meatballs,  Chicken Parmigiano and Lasagna. The meatballs were dry and have raisins inside which we didn't like. The service was okay but we decided to sit in the beautiful patio.  I had to go get our server and end up being cater to by 3 😅. My wife loved the lasagna so much that she try to convinced me I have an allergy reaction to it 🫠. We loved the grape tree behind us with the waterfall feature."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cGFPQmNnEAE",
            "text": "Amazing Food. Good portions. Decent price. 3 course meal for 2 with cocktails ended up costing approximately $150 excluding tip. Would highly recommend for a night out in the underrated “Little Italy” of the Bronx neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyN0tEX0VBEAE",
            "text": "What can you comment on a dish that’s name after its location? LOL. I picked this dish at first considered the balanced of its ingredients used in terms of nutrition. And I found myself curious in its representation of this neighborhood, Belmont in Bronx. A Neighbor that is well-known with a mix of Italian, Latino, and Albanian.\n\nThis is a well executed dish at some point quite difficult to “operate” (I meant to cut it like a steak without having the baby broccoli fell apart). The favor is rich. The chicken is thinly sliced and it successfully prevented it being too dry from the grill. The chicken is slightly marinated with salt and garlic which perfectly matched the favor of the baby broccoli. The mozzarella cheese meant to bind everything together and yet, it made it like a pizza in chicken crusts.\n\nThis dishes is savory. The broth carried its chicken favor with onion, celery, carrot (my wild guess of the making of the chicken broth) brought together a lot of immersion story between Italian, Latino, and Albania. It told me a lot of stories about this neighborhood in the hard time of mingling between immigrants and the anthropological transition of Belmont. It brought to be a lot of sentimental and emotional stories for immigrants here who worked hard for their family and lived up their culture. The Penne in marinara sauce as a side dishes bring it to a big reunion but also a balance of the nutrition pyramid. 😝\n\nLast but not least, remember to save a piece of bread to finish the broth on your plate. You won’t regret embarrassing yourself with its taste.\n\nThis is a dish deserves its name. The ambience is comfy.\n\nbuon appetito"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcXZldFpREAE",
            "text": "My friend and I had a wonderful time at Emilia's last night. Our server, George, was patient and very helpful. He is very knowledgeable about wines and food pairings. We enjoyed everything we ordered and the attentive service. We will definitely be returning for more meals in the future.  Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNHR2eDB3RRAB",
            "text": "Visiting NY for the 1st time, it was recommended that a visit to Arthur Ave was a must.  There are several restaurants to choose from.  We picked Emilias due to previous reviews and what looked to be authentic. It was a Wednesday night, so not busy at all.  Service was very good, offering wine samples to see what we liked.  Starting with large slices of fresh bread with oil and cheese.  Calamari was delicious, martini was strong, main entrees were very good & plentiful.  Tiramisu was good, but I was expecting more from an authentic Italian restaurant.  Overall, we'd recommend it and visit again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDajZuV193RRAB",
            "text": "My first time visiting Aurther Avenue with my wife we decided to go to Emilia's.\nWe had fresh mozzarella as an appetizer with roasted red peppers. My wife had penne a la vodka and I went with the chicken parmigina served with a side of pasta. The food was absolutely amazing! Best Chicken Parm I've ever had in my life.\nThe food also kept us full for a long time without overeating.\nI wholeheartedly recommend this place as your first spot to try if you've never been to little Italy in the Bronx before.\nMy wife and I shall return soon!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNi16Z3hnRRAB",
            "text": "Great food and service.  Husband and wife owned and they are there almost all the time. The owner makes the pasta himself. One of the best pasta in garlic and oil since my own mom. Ossobucca is amazing. Chicken parmigiana incredible.  Must visit if you are in the bronx."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldUtpMWtBRRAB",
            "text": "Such a beautiful hidden gem. A friend of mine grandmother used to live in the building and the patio area was his backyard.   So it was deff a charm being able to visit there. The ambiance was amazing, the waterfall was such a vibe.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOTVIZlBREAE",
            "text": "My fiancé and I were traveling from out of town and found this restaurant online. We couldn’t have been more happy with the taste, presentation and FRESHNESS!!! The owner was so sweet and welcomed us back anytime. We will not forget about this restaurant next time we are in town!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMnZTYmFnEAE",
            "text": "Stopped by with a bunch of my friends and had a very good lunch. I had the pork bracolio lunch special which was delicious. The pasta was a little sticky but tasted great. I finished with the lemon sherbet and was also great. Everyone in my group of about ten were satisfied. Arthur Av is great and Emilia’s stands out. I recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMTZIMmlRRRAB",
            "text": "Relaxed place with good food. I had the bolognese and enjoyed it. I also liked the arancini appetizer; calamari was a little on the tough side. Service was good and the prices are excellent. Wine list has good selection of very affordable bottles."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMkx5TzJnRRAB",
            "text": "Quintessential Italian eatery on Arthur Avenue!!! Highly recommend Nonna’s Meatballs to start, which were tender and flavorful, especially the sauce. The gnocchi in vodka sauce was fantastic!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd05hVGNBEAE",
            "text": "The food is phenomenal! We had pork Ossobuco and cavateli are just amazing. The owner, Joanna is lovely and very friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLS1IWnFRRRAB",
            "text": "Loved the place, the food, and the service. The restaurant is cozy and friendly. The lunch special menu is superb and the serving is plenty!! Finding parking is a little difficult but it was worth it.  Please try the affogato - ice cream with expresso, it’s delicious and refreshing!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cGJQZzBnRRAB",
            "text": "Very good food. Went with friends are a visit to the Bronx Zoo. Right in the heart of Arthur Ave. Very good service. Appetizers, entree and dessert all fresh and tasty. Espresso good too! Recommend it."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtOHJQOWJREAE",
            "text": "Everything was just as it should be in a quiet, unassuming way that says, \"Just relax. We know what we're doing.\"\nEverything was just. really. good. Uncomplicated.\nWhy can't every place just be excellent and easy like this?\n\nThe Osso Buco was rich, flavorful, not dry, just fatty enough, delicate, and tender.\n\nMy wife's broccoli rabe was outstanding. Simple. Rich. Succulent.\n\nThe house cabernet wine very solid.\n\nThe desserts beautiful.\n\nThe meatballs just like my Nonna used to make.\n\nThe service, quiet and attentive and warm. Unhurried.\n\nCome here with your family or good friends and enjoy outstanding food that makes you feel at home.\n\nThank you to Emilia's."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaWRuUHVBRRAB",
            "text": "Are you not sick of salmon? Tired of tilapia? Time to try Branzino. Here it’s prepared any number of ways including francese and to keep your blood sugar low they can even leave out the flour and just coat with egg batter. Delicately! But everything here looks delicious. Good Caesar salad too. I highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMC1PMm93RRAB",
            "text": "Yummy Yummy. Great food. Owner sat us. Waiters are right there very tentative. Filling drinks, breadbasket. I got Osso Bucco. Would def go back. Made res on OpenTable. Go for Lunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdHRhTUZ3EAE",
            "text": "Standard Italian food but expensive. The interiors could use some more lighting. I found it too dim for lunch"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReU0tM2l3RRAB",
            "text": "Wonderful fresh & delicious Italian food. Friendly Waite staff. Comfortable atmosphere & seating. Homemade pasta was light & amazing. I had the  Cavatelli  Bolognese with added peas and loved it. They were very accommodating. The house red…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla29xWWdnRRAB",
            "text": "So my wife and I were looking for an Italian restaurant for our 10 year anniversary.  Well we were spot on with Emilias.  The food and staff were amazing.  I cant wait to go back!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHajVfaFJnEAE",
            "text": "Truly delicious food but definitely Manhattan prices. I’d say it’s worth it though for an authentic and high quality cuisine experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMF96c2xnRRAB",
            "text": "The lobster ravioli Babyliss was splendid. Lobster was made to perfection. I also had a side of spinach which came home with me because I was so full. Great portions, great service, and decently priced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc09tdzlRRRAB",
            "text": "the real little italy, and i’m italian. The food was very good , the bread in particular !! I felt like home .\nThe manager is a gentleman. Highly recommended!!!"
        }
    ],
    "reviews_count": 77
}