{
    "name": "Travesias",
    "place_id": "ChIJB52uuD2LwokRNwneWmZBND8",
    "grid": "BX6",
    "address": "3834 E Tremont Ave, Bronx, NY 10465, USA",
    "rating": 4.3,
    "user_ratings_total": 1253,
    "phone_number": "(718) 828-3834",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ablNpMWhkMmhXZW0xME5VNVZTekJXUzJwTk9HYxAB",
            "text": "Travesias restaurant is a trip around Latin/Hispanic cuisines that dance together in the plate, on your taste buds, and in your tummy. Their fusion options make you want to order several dishes so you don’t miss out on anything but it may be better to return again and again.\n\nThe decor is beautiful! One wall has a mural of a woman with floral hair while the opposing wall shares the countries/cultures which inspire their fusion menu.\n\nIt’s so refreshing to have various waiters/servers visit the table and hear the Spanish language reveal their cultures/country of origin (and yes, they also speak English). They are friendly and will make accommodations should you have special needs (food allergies) to ensure you enjoy your meal.\n\nI was both surprised and impressed but not only the food presentation but also the large portions. Trust when I say either you prep two days before dining there or ready yourself to bring lots of left-overs home.\n\nThe food is simply delicious! Just when you think it reminds you of familiar foods from home- enters the seasoning and flavors of other Latin cultures fused into that familiar dish. So though it’s what you expect there are delectable surprises as you eat.\n\nThe Tamarindo juice is just what I expected…mmmm mmmm good!\n\nAs an appetizer I  shared the Guacamole & Yanikeke. I just loved the presentation of the fresh Yanikeke and the creamy guacamole.\nFor my main course I had the Travesías Chaufa Rice. I wasn’t sure what to expect and it did not disappoint. This Peruvian/Dominican dish had me going back for more even when I knew I had no more room in my tummy. I am happy though that the left-overs will last for a couple of days.\n\nI had hoped to have dessert but for the first time in a long time my taste buds and hunger were satisfied and there was no room for dessert.\n\nI will definitely return to Travesias and recommend that you come see for yourself. I will keep this as a place to bring my family and friends when they visit from out of town."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1VEbHlOVlJoZUhkaU1FSlJMVlJuWDNCSmRIYxAB",
            "text": "The atmosphere was great, and I came for brunch on October 26, 2025, around 3:00 PM. However, the bartender added way too much ice to our sangria—nearly 90% ice and only 10% drink. We politely asked for less ice in our second round, but unfortunately, it was served the same way. While the food itself was decent, it arrived a bit cold. Overall, the experience could have been much better if the bartender had listened to our request and been more attentive to customer preferences."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEM3ZpbnBRRRAB",
            "text": "On the low they have some good food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseVgwY3hXSGRETnpOalEwMXNVVjlPVVhORFZrRRAB",
            "text": "My go to stop, I been coming here for years. The presentation,  food and their customer service is excellent. Everyone here are sooo nice and welcoming. My favorite place for drinks, good coconut mojitos and of course leechi with a mix of coconut. 😛🥰😍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTWNrcFZkRU5uUTJsUWRsOHljWEF0Ym05d09WRRAB",
            "text": "Amazing food!! Fantastic service - “Thank you Xavier”  my forever place❤️❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWGFEQlFTbk5RV0VWUGJscEJZMU4zTFhWRVZtYxAB",
            "text": "Guys! This is the place — no debate. The food? Outrageous. The vibe? Unreal. The service? On another planet. And if you’re lucky enough to get Kevin, buckle up — you’re in for a treat. 1000% recommended by me and my fiancée — our new obsession!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WclprWkZZa3RGTW01bFZ6VkRXVzFMVFRBMGNXYxAB",
            "text": "Kevin was the best server really good vibes! He advised us on the best dishes! Amazing service and made us feel so happy as we came from London"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SlVIZGZTa1V4YUVaZmFsY3pUVUZvTUVoMUxWRRAB",
            "text": "Very good food and service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRlprWnNTMHBNWWtGMFdsVlZUVmcxUWxkTVRIYxAB",
            "text": "I’ve done a lot of traveling and a LOT of eating, and the Tamarind Airline Chicken is a top contender for best chicken I’ve ever had! I also loved the Pork Belly Ceviche. My husband loved his Churrasco Argentino steak. So happy we stumbled across this place! We’ll be back soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReFF6Sk5TR1ZCTlRZeU1rVlZkMFJIWmkxU2VHYxAB",
            "text": "This is hands down one of the best restaurants I have ever been too. The service is incredible, the server Ana is such a lovely woman so attentive and kind. The food is unbelievably good, I have no complaints whatsoever. The restaurant is beautiful, good music and they had the game playing! I will definitely be coming back! 10/10 experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M1pIbHZSM0ZTVFcxRFRqTk9kM0Z1WkRWWWNXYxAB",
            "text": "Very nice place. Good atmosphere and nice people.\nMusic was amazing"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3dnBqN1VnEAE",
            "text": "Omg this places has changes and not for the better. I would give it a zero, but unfortunately, we're not allowed. This places used to be A 5 stars, what happened the service was terrible and the food was worse! It was either too salty or just plain bland!!  Their sauces , which were the cornerstone was horrible.  No wonder there was no one here! The only thing this place is good for is to take Instagram pictures!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmJESjJjR1ZsZW5wMWQySnpURGg2VmxONlNuYxAB",
            "text": "Delicioso todo, recomendable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNmQxTlJiMjVJVEhkSGVqRk1WRGd3U1dWUFZsRRAB",
            "text": "Food is mid, and took too long to arrive. I thought I was going to fall asleep by the time the food arrived and they must be understaffed. Then when we got the food it was the wrong plate. Nice atmosphere but the tables are too small and tilt over when any amount of weight is placed on them. Also the music is so loud you have to scream to talk to another person. What’s the point of loud music if there’s no dance floor? Overpriced and overrated."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscU16TlNWbXByWjFWTVRFUkpSM1ZyUWxodmVGRRAB",
            "text": "Very good food great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQlZEUm9WSFJ3TnpSTGRuaDVUMDFVTTNSdFExRRAB",
            "text": "These guys in here are ignorant and rude you ask for a simple accommodation like changing the rice that comes with the dish like for example I wanted yellow rice with my steak instead of the black bean rice they straight up just told me no I ask why and they just walk away"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWWVVeGhNMkl4TUd4WVdHTjZiWFptUlZac2VuYxAB",
            "text": "La gente se sienta muy cerca, las portions son pequeñas y el sabor no es el mejor."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205blh6QjBVRmR4YVRKUlUzcFJaRVJ0V0hGMFFuYxAB",
            "text": "Comida deliciosa, platos cuidados y bien servidos (creativos), atención respetuosa y amable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNE9WUXlSa1Z2VVY5emVYaHNjMjlzVjJWZk9YYxAB",
            "text": "Kevin was our server tonight and his customer service was great  would def come back ! Food great service great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVFVDMHlRazl5UzJsaFNtbE5iRU16UjJFMWVrRRAB",
            "text": "The food is always a hit. Music and vibe ia great for brunch or friend gathering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MmFIZEtaSEpNYURoQk5HMHhkVFJhWlVSWVYyYxAB",
            "text": "The restaurant is clean and kept very organized. The customers away they were having a good and calm time. There was sports up on the big screen television which was hanging on the wall. There is wall art that is miraculous with beautiful flowers, making it a nice ambience a great calm area. There is an outdoor eating area. That is not small so you are spread out with options if you want to eat indoors or outdoors. The waiters and waitresses in this facility are phenomenal. My waiter was Xavier and he was just amazing from the moment I walked in on a plane with my drinks I’m talking about even pouring the canned the correct professional. He went to waiter school. But all in one ring service great food a little bit of a location to get to what is definitely worth the travel. And the food wait time was not that bad. Plus there’s a really good music playing in the background, I give this place a five star rating if I can give them another house. Sorry for just being so cute and serving alcohol then they would get that as well. I suggested anybody who likes the Latin Dominican Puerto Rican fusion cuisine. Plus it’s been a long time since I’ve not seen my mother for a while.. so this was our restaurant choice for the first time and it was great. My mother loved the food .. as well and she’s a big foodie and retired chef. So big Ups to the Chef up in here!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVWRWSTVWbU41VGxORk5ITnhRMmhpY2t0TGRWRRAB",
            "text": "I enjoyed this place they had nice Latin music and a nice vibe inside. The food however was a little pricey. I got the empanada trio and the piña colada shrimp and was disappointed in the size of trio for the price. I also had the espresso martini which was really good. I was a little confused that they gave us the happy hour menu, which my drink and both appetizers I ordered was on- however they couldn’t offer the appetizers at happy hour price which was a little strange. Overall, it was a nice spot but i would not recommend for those on a budget"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWlRrRnJhbXM1WTJWT1ZqRlZPWEZITVhJMVpVRRAB",
            "text": "Delicious dinner! Thank you to Ana & Julio!!! Food, drinks and service A++  We'll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUGNVZExWV0Z1VGtOTmR6RnpPVWRvYTJjNE1rRRAB",
            "text": "Took a little foodie trip to Travesías in the Bronx 🌎🍴 Started with their empanada trio (seafood one was the winner, but I wish they were a bit bigger). Tried their golden crab appetizer too—which turned out to be more like golden goat cheese 👀🧀 no crab in sight.\n\nNow the mains? That’s where they shine. My Travesías Chaufa (Peruvian-style fried rice with steak, shrimp, chicken, and sweet plantains) was 🔥 flavorful and filling. My friend’s skirt steak plate was just as solid.\n\nDrinks were a whole vibe, my Apple Martini was crisp, but the Caribbean Sunset stole the show 🌅🍹 (perfect happy hour pick, especially since theirs runs all day!).\n\nWould I go back? Definitely—for the ambiance, the mains, and those cocktails. ✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMExVNWtaR2hZY210TGJHOVZPRFp6TUVGNlEyYxAB",
            "text": "I was at this spot on Friday 9/5 and we had a wonderful time. The food was delicious and the drinks were on point. We receive an amazing service from the bartender Jhois and Ranfi. Definitely recommend this place for the great vibe, great food and service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFNUQlllVlptZGkxcFIzbHJSVXc0WVVSNmFYYxAB",
            "text": "The truth is that the experience is incredible, the service and treatment is super good, the food is very delicious and with good presentation, recommended with closed eyes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCek0zTkliazgyZHpoRVpVaEVVMmsyUlRWeWJtYxAB",
            "text": "This place is a complete joke, I wanted to place a pickup order that was worth close to $80 and I just ended placing an order at Patricia’s right across the street. Don’t waste your time or money here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adGNWRnFObWxPT1ZCWllWQkJRM1I2YUVKTE9VRRAB",
            "text": "Everything was fantastic! From the waiters.. to the food.. to the drinks .. Definitely wish I could’ve tipped more but definitely next time I will. HIGHLY RECOMMENDED!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oM1h6UnRXV010T0hOeU1YZ3RRbnB6ZVdabVFXYxAB",
            "text": "Food was trash no flavor, no one speaks English"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVFJHVm5NbFpZYjBkeFZYTlhiVk50UVc1Qk4wRRAB",
            "text": "I love ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWGVqQkhPVFZqTFVoV2VtNTZkalpDWWtWc1VtYxAB",
            "text": "great service and really good food!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRFl6Wk9Va04yT0dKSmJXc3Raa3BrV21GdVEzYxAB",
            "text": "I chose the steak and eggs. It was strange. The steak cut was unknown and looked weird. The taste regular and the potatoes lacked salt and taste. BE AWARE, THEY CHARGE AHEAD THE TIP AND TGEN ADD ANOTHER LINE FOR MORE TIP. DON'T FALL FOR THAT AND READ THE CHECK REALLY GOOD BEFORE YOU SIGN OR PAY!!! The music was too loud and we were seating outside. Won't return."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONmVXcGZOekJ4Y2pSbU9HeElWRkZNVVVvNE5XYxAB",
            "text": "Xavier tiene in son de servir, excellent Chico. Muy amable y servicial."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wblJFNW9UMlprWjJGdGVHeGxjV2x6Tm01VFRGRRAB",
            "text": "Rico ambiente, buena comida, y el servicio, fantastico,xavier un muy buen camarero."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRVIzVTJjbTFJYW5GRWJsVmpZVVJTVkc5M09FRRAB",
            "text": "Javier was amazing he was so attentive. Vibe was good and food. Never had any complaints with regard to service and food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdVV6QXllVzVyTURBM1ptdERXVWsyUmxaV2MxRRAB",
            "text": "The service was impeccable I enjoyed my birthday. Thank you Travesias. Xavier our server was very polite and attentive 10 out of 10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NWFIVnRNR0ZpZVVvM1MyZFNjVE5NYlVWa05GRRAB",
            "text": "Service was good, friendly. Food was mediocre at best, not flavorful. Not many options and the drink is chose was extremely sweet, a passion fruit mojito. I wouldn’t recommend this place, would not return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcllscExSbDlFYjFCM1NXbE5abGN5VlVWdFRsRRAB",
            "text": "Food was delicious. Julio/Xavier was an awesome waiter!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdU5qQjRaVTk1Ym1GSWJHTldUMEptVWsxWVlsRRAB",
            "text": "Food took some time but it was really worth it! The food drinks service and the atmosphere were wonderful and worth the wait. Xavier was a great waiter and very thoughtful saving us from ordering something I was allergic to to! Great restaurant will return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YVUyRlFkR05CUlZkRmVIaDBkVE5qYlRsUFgxRRAB",
            "text": "Xavier was a great waiter he was attentive and welcoming the food was great 10/10 recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSVZEVklSMU4wVFRGZlQyOTVkRk53TkZKbk9YYxAB",
            "text": "Travesias is a neighborhood staple at this point.  The food is consistently tasty and the vibe is always good.  Tonight, Xavier was our server and the service was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUGJsUkVaRUo2UVhaQ2NURmtRbWhGV21ZMVowRRAB",
            "text": "Love this spot been twice would go back again."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMU5XUk5OazUwYkRKQmQybFVSVkJrUjFKYWEzYxAB",
            "text": "Update: I had such an amazing time that I returned to this amazing restaurant in early August 2025.   This is the place to be.    The service was just as excellent as the first time I visited in July.   Trust me you'll love it.\n\nI visited this location mid-July 2025.  The first thing you notice is the décor of the restaurant    the atmosphere was very welcoming.  We were greeted upon entering the restaurant and there was no wait to be seated.  You can also make reservations for the restaurant.  The menu was on a QR code which I thought was really cool.  Our waiter was very attentive. They kept checking on us to make sure everything was okay.  We received our food rather quickly.  The presentation of the food was absolutely beautiful.  I ordered The Tamarind Airline Chicken.  To be honest I was worried of how it would taste I was afraid the sauce would overpower the chicken but it was absolutely delicious.  We also order Churrasco Argentino with shrimp.  I ordered a Shirley Temple and a Passionfruit Margarita.  For dessert we had the Chocolate Volcano Cake.  The cake itself was good but I didn’t like the berries with it.  I can’t wait to return for more of their delicious food.  The restaurant accepts cash and card.  This location is accessible via bus."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1lVUmxaV2MyVTJ0eWFFVlBiazFoTXpacFdVRRAB",
            "text": "The place was overcrowded, and it didn’t feel like there was any AC, which made it uncomfortably hot and sweaty. On the positive side, the DJ was excellent—he played great music that really set a lively vibe. The food was well-prepared, and the servers were attentive and friendly. Our experience almost started off poorly because the person who greeted us was very dismissive, and we nearly left. Thankfully, the owner stepped in and personally made things right for us, which turned the brunch around."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNlh6bGxZV1ZYYUdKcWEzZHVObTlGWmpCTVltYxAB",
            "text": "Beautiful atmosphere, delicious foods and friendly staff"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWGVWWXlOREJ0VFhwblVXOHRRVVpuTmxSck9FRRAB",
            "text": "Distorsionan la comida peruana, así sea \"fusion\" nada q ver, no lo promocionen como peruano xq dejan mal a mi país, mala horrible la comida 👎"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRk4xWmFNekkxUzJoUVptUlFia1ZPY1ZaV1dFRRAB",
            "text": "Xavier gave excellent service.. Five star 🌟  for his spectacular service.. Food was good but that Pina colada.. AMAZING!!!…"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlZXWjVNVFZYVW5ocFJFWXdWbWRaY0hwU09GRRAB",
            "text": "Vengan la comida espectacular. La atencion de todos es espectacular especial Xavier."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlpXTjJYMlpFWDJWb01tUnVVakpsY0VOSVYwRRAB",
            "text": "La comida exxelente y la atencion de xabier buenisima,gracias"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NWNGRm5aSEpDV1hGSGNqWmpRMjlNVkZCdVNXYxAB",
            "text": "Me gustó mucho la atención y servicio de Xavier, los tragos, el ambiente muy bien, los tacos de birria muy rico. Me sentí muy comoda con las atenciones y el deseo de hacernos sentir bien de Xavier. Un servicio muy memorable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dVgxWXlWMU5KVUhGSGEwTmlOMHhPZWtKUE4wRRAB",
            "text": "The absolute best Latin bistro I've had the pleasure in dinning at. The food, atmosphere and service was EXCELLENT. Will be coming back and highly recommend l"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMRHc2YWJlc18zYzVnRRAB",
            "text": "Where to begin!\nFrom the drinks to the appetizers to the main course, chefs kiss!\nKevin and the rest of the servers were top tier!\nOne of the best paellas I’ve ever had, drinks were AMAZING! King/queen, Mexicana and matrimonio. Definitely coming back and recommending to friends 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OFlpeEFnEAE",
            "text": "Dined indoor for Sunday dinner. Great atmosphere for families or any occasion. Once we sat down we were offered either bottled or tap water. Drinks were delicious and presented nice. Had the sample platter that came with all their signature items. Gentleman explained all the components that were delicious. We weren't rushed, but sometimes our server seemed absent as he was also assisting the outdoor diners. The only downside was the dessert. We ordered their bread pudding that was yummy but so thick and heavy."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMmVhOUtREAE",
            "text": "We stumbled into this place randomly on a Saturday afternoon, and honestly, it was a delicious surprise! The food? Chef’s kiss. The drinks? So good, they could solve problems.\n\nNow, the service… well, let’s just say it was on island time. Our waitress seemed to be in a staring contest with the wall while we waited to order. And the food took so long, I almost considered taking up a new hobby at the table.\n\nStill, the food and drinks made it all worth it. I’d 100% go back—just maybe bring a snack for the wait."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNE9GaFlORmg0Wm5sd1duaFRSak5DT0daQ01HYxAB",
            "text": "Mi experiencia en este restaurante fue divina eso tres plato es lo mejor de lo mejor ese plato que se llama Churrasco Argentino es un sabor explosivo cuando uno lo está disgustando es un sabor que te enamora y el termino de la carne lo pedí tres cuarto me gustó mucho como quedó la carne y el arroz de frijoles negro excelente muy graneado de mi gusto hace muy buena combinación con los plátano maduro.Y los monfonguitos que se llaman Ay Bendito Shrimp Mofonguito es otro plato que está a otro nivel tiene un favor divino y esa salsita blanca es una combinación excelente un sabor dulce muy agradable.Y ese último plato ese llama New York Steak viene con arroz blanco es otro plato que rompió mis límites de tan bueno que estaba un buen sabor que tenía la carne y el arroz muy bueno.Y de la atención a el cliente que ni se hable todo el mundo que  trabajas hay tiene una gran atención a el cliente muy excelente si de puntuación se tratará le diera un 100/100.Y el precio es algo que vale mucho la pena gastarlo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaW0xNE80bGFtSlRREAE",
            "text": "The service was some of the best I’ve experienced in NY and the food was phenomenal. Great for a date night or with family. Will visit again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdXg5NFRZc0tfSlZ3EAE",
            "text": "Kelvin the server was very helpful and polite ☺️ he answered all my questions about the dish and drinks 🍻 I'll recommend this place. My  fiance brought me here for the first time, I loved it🤩😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNDg3MldnEAE",
            "text": "I have dined here before and remember at least the food being good…that is no longer the case unfortunately. Had the appetizer sampler which looks appetizing but most of the food was a miss for me…the only thing I enjoyed was one of the baby empanadas and I can’t even tell you what flavor it was because I couldn’t identity it…not a good sign! The calamari was chewy and spicy and the chicken wings were spicy but not in a good way…the steak skewers were  chewy and tiny. Definitely not worth the $40 they charge. I had the oxtails which used to be my favorite…the oxtails this time around were either tiny or too fatty. The portions also definitely seemed to have decreased in size. The accompanying Moro rice was also not good, very heavy on paprika. One of my kids had the kids pasta with Alfredo sauce which to be honest I didn’t think was especially kid friendly, it tasted good to me and my adult palate but not to my 8 year old who found it “too cheesy”. We also had the churrasco steak which was good but again the accompanying sides fell short. Service was ok…disorganized and hectic..we ordered our appetizer and then waited to place an order and had to flag down the server…. Also worth mentioning that this is not a place you go if you actually want to have a conversation, it is entirely too loud…Spanish music blasting the whole time. I was dissapointed in our dining experience here and would not recommend or return. If you want Spanish food go next door to their takeout spot for Dominican specialties that are more affordably priced and less pretentious. Parking is hit or miss, you can find street parking."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbWRuTktXRFZ6Ym1GUVdIUnNkMmRwT0dGTWFrRRAB",
            "text": "Everything was amazing !! Service was great!! Food was delicious and fresh!! Definitely coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNXA3U1Z3EAE",
            "text": "Beautiful restaurant nice vibes at the beginning. Food not worth the price very small portions for too much $$$. My oxtail was salty, and the chicken tenders were very dry and thin. This place seemed like a family friendly place is why I decided to take my kids here for dinner after a long day of baseball and fun.  I guess not!!!! mid eating like 8 guys started arguing and making a scene. One came in with his shirt tucked in but once the other guy started talking and confronting him he put his shirt and sweater over a gun (don’t know if real gun or fake) but that scared the kids and dropped my hear I soon told the waiter that one of the guys had a gun and I felt scared for my kids. He quickly went to get the manager or owner which she defused the situation quickly and stood by us until they left. They sounded like frequent customers not sure though. I felt so helpless and upset that I had to pay for my full meal which I didn’t enjoy and my kids couldn’t eat there food due to the scare they experienced. Waiter was nice and virgin pina colada was good along with the decor. Will never go back though this place doesn’t feel like a safe place… 😟😟😳 don’t take your kids here!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJakp5cXN3RRAB",
            "text": "Kia our server was exceptional and pleasant.  Customer service was top notch💕 Lookong forward to another visiit."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna0l6U213RRAB",
            "text": "Slow jams vibes great winter spot for the rainy Friday nights! Very cozy service is amazing and the food was 10 out of 10. Kenny was the host and catered to our every need highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMmJubU1REAE",
            "text": "I personally liked this place, I really wish it was in a slightly nicer neighborhood but I think they did great. The food was amazing, the presentation was very nice and they even have a backdrop outside for those that would like memorable pictures. The drinks I tried I REALLY enjoyed to the point that I’ll be trying to replicate it. Would recommend it, just be aware that you’ll probably be spending more than you’d like for the menu items that can be found cheaper somewhere else."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbFpfLVhBEAE",
            "text": "Food was great, great vibe/atmosphere. Service is ⭐️⭐️⭐️⭐️⭐️ Kia & ADA and all the fore mentioned is reasons why we will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzhDdndRRRAB",
            "text": "Best backup ever.  Our first restaurant choice was closed for a private party, so on a whim my friend decided to try an IG recommendation. No notes.  Great food, even better drinks and a top class staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeUpXV29BRRAB",
            "text": "What an awesome experience. The food and the service was 100%. It had great atmosphere, the servers were attentive and friendly. Happy Hour drinks available, no hookah (didn't mind at all), great food menu and plenty of Parking spots (meters). Great place to go after work, you won't be disappointed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNna2RlOGdBRRAB",
            "text": "I love the vibes, ambient, SERVICE 😍 drinks are amazing and think the top plate of them is everything with salmon"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RVEwZHpNRzA0VldKelNXUmxSVkpWZG10SFJXYxAB",
            "text": "Came here for a birthday meal. Every dish that came out was presented beautifully and was delicious. We had the shared appetizer platter, shrimp mofonguitos, oxtail, lobster mad and cheese, ribs, salmon and spaghetti with shrimp and lobster. We also got drink which were all delicious and lovely. Also, the waitstaff bring out the birthday cake with a performance. I will definitely return for brunch. Give this place a try, you won't regret it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJakR6N0h4NS1PT1VBEAE",
            "text": "I recently celebrated my cousin’s graduation party at this restaurant, and it was an amazing experience from start to finish. The atmosphere was vibrant and welcoming—perfect for a special occasion. Everything went smoothly, from the service to the food. The staff was attentive and made sure we had everything we needed, and the space had a great vibe that added to the celebration. Highly recommend this place for any event or even just a great night out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeVJFNWhRemhFY0ZsR1JWaGtiMWhOY21WaFNsRRAB",
            "text": "Long term customer, had a few celebrations there because the food is top notch. However this week I was shocked by the horrible service. Firstly I did not recognize a single server nor did I see the general manager. The male who served did not listen at all to the order. There was an exceptional wait time between ever single service item including even being greeted and offered water. The items were brought out in the wrong order on top of all and I waited 40min from when the check was dropped off until someone picked it up. Yup this is now a take out place, the price is no longer justified given the disappointing change in service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCamFXOFlnEAE",
            "text": "Suggested by a friend due to a IG post. Went to celebrate family anniversary and try it out. So happy we did! The food was delicious and the drinks done right!😋 Love the fusion, latin and caribbean. I'll be back and our waiter had great energy, friendly and staff kept everything so clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN2RLRXN3RRAB",
            "text": "We love the experience, the place was cute and organized.\nThe food was really well, We loved it!\nThe staff was friendly and funny attitude, music was great a little to load (for my taste)"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNU2NrTVA3dU9yWjV3RRAB",
            "text": "I literally love this place , kevin es el mejor el servicio y bebida se lo recomiendo !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM0JxbzdpOHRYbzdnRRAB",
            "text": "Went last Sunday for the Brunch and I got to say it was great all around. I was with family, and we sat outside since it was a nice day. From the service to the drinks and the food, it was amazing. Definitely will return and try something different. My family were all satisfied."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sblEwNTJUWE50VXpWRlZWZERVamhIVEVvMk1tYxAB",
            "text": "Travesias! From the moment we stepped in, the atmosphere was inviting, and the food was nothing short of spectacular. Each dish was a delightful fusion of flavors, crafted with a personal twist that left us wanting more.\n\nWhat truly stood out were the drinks—each one seemed to be made from the freshest ingredients, with vibrant, natural juices that were clearly not store-bought. You can taste the difference in every sip, and it makes the experience even more refreshing!\n\nBut what really made our visit unforgettable was the incredible staff. Despite being busy, they treated us like family, taking the time to connect with us and even dancing with my baby daughter! It was such a heartwarming touch that truly made our evening special.\n\nAll in all, Travesias gets a solid 10/10 from us. We can’t wait to return for more delicious food, refreshing drinks, and that genuine family-like atmosphere!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMi1tb0pBEAE",
            "text": "The brunch here is amazing.  You can't go wrong with starting your weekend off with a carafe of red or white sangria and then amazing food from their brunch menu.  The staff is absolutely friendly, pleasant, and attentive. Their regular menu is delicious as well.  Taco night is delicious as well as the music that they have playing."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOEtXMFBREAE",
            "text": "I loved everything about this place. The food was amazing and so were the drinks. Must try ! The server and bartender were amazing too! ♥️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FME5qTmpMVzFvZUhNM2JVRnFVVlJ4U25kQmRrRRAB",
            "text": "Great drinks, appetizers were awesome, service was on point. The manager, Alberto was very personable and kind. We had a blast and will definitely be coming back. Highly recommended !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWRUNS1nRRAB",
            "text": "The place was clean and beautiful. The food was delicious! The staff was friendly and attentive. The music was great too but I wish I heard maybe some bachata or merengue. I will definitely be back to this spot!! Not too pricey either. 2 appetizers, 4 drinks, and 2 entres all for $199 gratuity included."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMHRxWDRBRRAB",
            "text": "It was my birthday and it was fantastic!  From the moment we walked in, the staff, the service, the food and the drinks were amazing.  I will be back next week.  This is truly my new spot!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbUxQTnN3RRAB",
            "text": "Been here twice already and the food was great service was awesome everyone was super attentive and it gets super busy they have indoor and outdoor seating and also will cater your events super clean and the atmosphere is great with the vibes on high with the music playing. Would definitely recommend for a cool date night or even for larger parties. Food was brought to the table fast plated gorgeously and packed with flavor."
        }
    ],
    "reviews_count": 81
}