{
    "name": "Gurra Cafe",
    "place_id": "ChIJc4bSin30wokRrZ4-Ad7oIoA",
    "grid": "BX6",
    "address": "2325 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.7,
    "user_ratings_total": 146,
    "phone_number": "(718) 220-4254",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UVJURkJUemhxU2w5NGRtOTBXRUYxWWxKaGNrRRAB",
            "text": "I have dreams about their chiles in creamy sauce. Get it with some bread and thank me later"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaVFWWmtXbXBuZDNsVVNFZ3lTeTFITUY5M01uYxAB",
            "text": "Best Burgers"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210clZuazROazgxZW1SdGFIZFpVblpJV21GaGEyYxAB",
            "text": "The customer service is on par and I loved the aesthetic of the restaurant. Beautiful people and great food. I recommend the Albanian burger. Must have."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeVdXeENOVVpmYTI5TGRFbFdiMnhqV1RSMmJuYxAB",
            "text": "Mixed grill only included bread. No tap water"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeVQweDNlV1owWm1oTVlYRjZNRUk1VEhWaVZFRRAB",
            "text": "Authentic Albanian food that hits the spot. The qofte were juicy and grilled perfectly, and the pasul was hearty, flavorful, and just like home. Everything tasted fresh and comforting. Chill vibe, solid service—definitely a Bronx gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLR2gtSS1HcWJqYnFnRRAB",
            "text": "Amazing service and delicious food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNWJhN0lBEAE",
            "text": "Amazing traditional Albanian food, authentic taste and warm atmosphere! Love it here definitely will come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaWFteldnEAE",
            "text": "Walked into this place spontaneously while exploring the neighborhood and I'm so glad I did! The staff were extremely friendly and welcoming and did a great job of explaining all of the menu items thoroughly. I ended up getting the Gurra Burger and it was so rich and flavor. Totally recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeThLN1hBEAE",
            "text": "The food in this place is amazing. Service was great and the place is very clean."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMGJXYVJ3EAE",
            "text": "Amazing food and service me and my wife come here frequently"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaam9hQ2tnRRAB",
            "text": "The New and Improved GURRA Cafe came nothing short of perfection. My wife and son were amazed! The spicy smashed burger stole the show for me however everything was delicious! Best food on Arthur ave."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeXE2cFBREAE",
            "text": "Fresh salad and good qebapa."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa0o3T3JRRRAB",
            "text": "I was really open-minded and eager to try a new cuisine, but objectively, the food I had was mediocre. It is only a fraction as delicious as the Turkish restaurants I've been to in NJ and NY. The service was gruff and not attentive - the waiter seemed surprised that we were there at all.  Based on the reviews, it seems like we got them on an off night, but I wouldn't go back or recommend it. PS the meat is not halal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cWYteXFBRRAB",
            "text": "Great little Albanian cafe in Arthur Avenue ! Mixed grill with beef sausage was so flavorful and served with red pepper sauce that hit the spot! Came with delicious fresh bread. The salads are great and the goulash was well seasoned and lovely. They serve wine and beer. Enjoyed the experience. They have coffee and espresso but no desserts."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ01fRmdBRRAB",
            "text": "Very mixed feelings because the burger’s sauce was very overwhelming to the point of ruining the burger… but the fries were some of the best I ever had. Server was very nice and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNzZhQjFnRRAB",
            "text": "Stopped by for a quick bite with my family and everything was delicious :). We had both burgers and the grilled meats 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaU1qcnp3RRAB",
            "text": "Delicious Albanian food in this nice little corner of little Italy with decent prices, good collection of dry meats and dry meat inspired dishes, a decent amount of seating and a nice ambience and good music.\n\nWe got the mixed grill, pasul and the Gurra burger and all three of them were pretty good. The burger with a nice sausage like patty was actually quite nice and a nice twist from the regular burger. The dried beef also made the pasul quite good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMnJMdnpnRRAB",
            "text": "awesome food and amazing service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOWE3Rjd3RRAB",
            "text": "Delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdThqWXNRRRAB",
            "text": "Best qebapa in Arthur Avenue."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOHBEZnd3RRAB",
            "text": "Great quality food, will come back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Nll2MHd3RRAB",
            "text": "Very delicious food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1enZpR2NnEAE",
            "text": "The best Albanian food ever!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNF9UTVFBEAE",
            "text": "My go to spot in the bronx. Best traditional albanian food on Arthur ave"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMV92RE53EAE",
            "text": "So amazing! It was our first time trying Albanian food and we didn’t even know what to order. Our server recommended the trout and the mixed grill, which were just fantastic. Tasted very fresh and the seasonings were perfect. Even the salad and the bread were delicious. We will be back soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMTV1WllREAE",
            "text": "Absolutely delicious. We wandered in after a day at the zoo and we were really happy about finding this place. I’m going to be dreaming about the grilled trout. Scraped every little piece off the plate it was so good. The salads and mixed grill were also great. Finished with some espressos and cappuccinos. Definitely recommend."
        },
        {
            "date": "3년 전",
            "language": "sq",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyc2JXUDh3RRAB",
            "text": "Knaqsi qe pata mundësinë të vi tek ju ne New York per darkë"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMFByS2ZnEAE",
            "text": "I was blown away by the food and service here. Everything was fresh and delicious. My family and I will definitely be going again 🥰.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMC02eTNRRRAB",
            "text": "My first time here.  Food was exceptionally good. Get their mixed grill for sure.  Their soup was really good too. Will definitely come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZzV2TkZBEAE",
            "text": "Great Albanian food"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NGZfVTZ3RRAB",
            "text": "The best foods"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLX1lIdTdBRRAB",
            "text": "Serves traditional Albanian dishes. Can't go wrong with this combo to go. Paired with stone castle wine and a salad  leaves you with a wonderful Balkan trio. Sometimes after a long hards day work take out is necessary.  This restaurant also has great dining. During COVID-19 I enjoyed outdoor dining with pasul to fulfill a desire for a hearty meal. It's a great stop on Arthur Avenue for a nice lunch after shopping, visiting family at Fordham University or even to grab a to go order on the way home for the family. Arthur Avenue offers Italian, Balkan and Latin foods on the strip, however Gurra Cafe should be on your list of places and do stop by at Prince Cafe on the corner of Arthur Avenue for a coffee afterwards."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdjRxQ0RnEAE",
            "text": "My good friend Jah was in the kitchen. Best Albanian food, 2nd to my mom's"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLeks2Z1F3EAE",
            "text": "Friendly staff, super fast service, nice outdoor seating, and the food tasted great! The tiramisu was surprisingly excellent, with all the flavors being very bright and distinct."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLejhHUXF3RRAB",
            "text": "best food and great service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5eUstOTBnRRAB",
            "text": "Great food and service was excellent.\nRecomended to all who love hime made food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5eUlmYURnEAE",
            "text": "x  cc."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNUpucWRnEAE",
            "text": "Good Albanian food"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDeS1XVFVnEAE",
            "text": "Thank you for the terrific meal I had today at you outdoor seating area. Johanna you were the best!!  My son enjoyed the chicken sandwiches I brought home to him."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDanRuZ2F3EAE",
            "text": "Excellent!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOUx2WGRBEAE",
            "text": "Very delicious Albanian food.  Very courteous and friendly staff.  Very clean and nice atmosphere.  Definitely going back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4aWRucUxnEAE",
            "text": "Stopped by here for lunch and a drink today and was extremely pleased. The beer was ice cold, and my Qevape was perfect. Full of flavor and cooked perfectly. My father had the Trofte and he enjoyed it. Would recommend this place any day, any time. Awesome staff as well! They have plenty of soap, and hand sanitizer to keep you safe!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4dHEyR2VREAE",
            "text": "Pastries are very good , attention is flawless"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjcXFmSU1REAE",
            "text": "Buen servicio"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcnNpY013EAE",
            "text": "An unpolished gem, delicious authentic Albanian food without the trappings or the price. You'll love it!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNMVBfZjJBRRAB",
            "text": "Delicious home made food. Service was excellent as well. Clean and cozy. We will be back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOWEyTUVnEAE",
            "text": "Outstanding, authentic Albanian food at a very reasonable price. I've been going to Gurra Cafe regularly for 4 years. Every dish is excellent, but their grilled meats and stews are particularly flavorful. The combination platter of meats is…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcmNDSjJnRRAB",
            "text": "The food here is always absolutely delicious and fresh! You cannot beat the prices for the high quality of food. I love coming here, and it reminds me of my mom’s home-cooking. Highly recommended!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa3JTeG1nRRAB",
            "text": "An absolute must go if you are hungry in the New York City area!\nThe food is very high quality, made perfectly! It is traditional Albanian food with somewhat of a American perfect twist! Will visit again !"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3OHNta2FREAE",
            "text": "Well priced Albanian food. This was my first time trying Albanian and I really enjoyed the meat and cream-sauce dishes at Gurra and their cucumber feta cheese salad was great. Salads were $4-8 and entrees $11-18."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJOGV1N1pnEAE",
            "text": "What do I say? Well, let's start with this: if you are hungry and you want to eat a quality food  then don't look any further,  this is the place for you.  An authentic Albanian Food.  Everything you want is fresh! The Chef ( OWNER ) is an amazing guy, Excellent Chef and very polite.\n\n■ Must have the Bean Soup with air dried beef.\n■ Grilled file of soul\n■ Mixed Grill Platter ( Beef ) and of course a nice Glass of Red wine.\n\nIt is by far the \"BEST ALBANIAN  RESTAURANT\" in NYC.\nFrom me to you ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐"
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa1lEOHpRRRAB",
            "text": "You might feel a little bit awkward at first as community (some customers) is very traditional but please do not mind it! This place has amazing food! Everything is always fresh and really delicious, especially villa la Gurra. I will always come back to this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROHFhZ1BREAE",
            "text": "The food at Gurra Café is fresh and delicious! Their bean stew is to die for.  I honestly have a hard time deciding what to get every time I go because I just want to order everything  on the menu.  Some of my favorites are the bean stew,…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBem9YWjdnRRAB",
            "text": "Amazing restaurant!! The albanian burger is my favorite. Staff is very welcoming and the new renovations came out beautiful!! Definitely will be back again and again!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeDdpaEhnEAE",
            "text": "They have a really good goulash! The broth was yummy, we asked for extra bread to soak it up! However, they do not take cards as a form of payment..and it is not listed in their establishment."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdU56QTJ3RRAB",
            "text": "Our first time to try Albanian. They made us a special platter of their favourites. Excellent. And really liked the Albanian coffee."
        },
        {
            "date": "8년 전",
            "language": "sq",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneElUaEt3EAE",
            "text": "Grosha me mish ishte fantastike! Nese permalloheni per ushqim e atmosfere shqiptare, kete vend duheni gjithsesi ta vizitoni!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVeU5IYWhRRRAB",
            "text": "I had the trout and grilled chicken so delicious and so affordable. The menu is very simple and very good. I love the stuff too always very attentive and friendly."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbU1mZExnEAE",
            "text": "Went there with a friend of mine and had a great and food was so delicious. Great  Albanian food, I  will definitely go again!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcXB2WUJ3EAE",
            "text": "An Albanian gem in the heart of little Italy in the bronx. Recently renovated, but same chef and a killer bean stew. Add in the sausages, and you can't go wrong. Been comming here for 10 years."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnXzY2T053EAE",
            "text": "Great Albanian food. Friendly staff.  Very reasonable prices.  If you're close by and want to try something new, stop in."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwc1pyQ3pnRRAB",
            "text": "Great food, great service. A must try for traditional Albanian cuisine if you’re in Arthur Ave!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndTRtZ2VREAE",
            "text": "If you'd like to try Albanian cuisine, this is the place to do it. Excellent food, excellent service."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnek9EVDJBRRAB",
            "text": "Very nice and cozy place. Food is perfectly portioned and very fresh. Definitely worth a try."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneklINFJBEAE",
            "text": "Amazing food! And absolutely wonderful staff! Been coming here for over a decade."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Z1kzMkRBEAE",
            "text": "The food and service is fantastic. The new renovations really give a comforting and modern ambiance."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaWM3UzZRRRAB",
            "text": "Great ambiance and excellent service.  Been to a few other local Albanian places in the Bronx and this one is better imho."
        }
    ],
    "reviews_count": 67
}