{
    "name": "Dominick's",
    "place_id": "ChIJn1_QWIf0wokROm8gWiL2oOU",
    "grid": "BX6",
    "address": "2335 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.5,
    "user_ratings_total": 952,
    "phone_number": "(718) 733-2807",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WGFHbDBaSGN6YVd3NFVVODFhVXRuTkRnMk1HYxAB",
            "text": "Been going my life and tastes incredible every time"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaloxWlViamhDZWt4S04wNDJVbFpSZEZsVFZXYxAB",
            "text": "amazing New York Italian food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocVZteHJiV1p4Y1hkWFdXZHJUMkZFYzNjdFVGRRAB",
            "text": "We were here for my sons birthday on Sunday, party of 5. My family and I have been coming here for over 40 years, food is consistently GREAT!!!, service the same and Charlie, the owner, makes you feel like family. If you are looking for the best southern Italian food, you owe it to yourself to try Dominics. You won't be disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1RIbFVNR1JLYkRWMVJYbEpUMnM1Y1ZaQlJsRRAB",
            "text": "Still amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oS2RHUkJlVGg1VmtoSmNFeDNSa0pQVXkxT2JIYxAB",
            "text": "Forget about it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVU4zbHNUbFZsWlZadk9GbFZNR3hzZHpkUVZIYxAB",
            "text": "This restaurant is a real gem!! The baked clams and the Italian salad are to die for. Great food, awesome staff and great atmosphere. It's like home."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MGIyRk9OMEU0WVhKelpsSlhWRUpoU3pGNVQxRRAB",
            "text": "visiting from seattle...we walked in after a yankees game and were immediately greeted and sat. all staff members were very nice and attentive; they treat you like family. food was delicious--we tried the eggplant rollatini, stuffed artichoke, and a chicken dish i can't remember...also my drink was perfectly mixed. i will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcFdtSkhPRGRDUm5CclNEQlJibFpqUkU5c1ZrRRAB",
            "text": "Went there with a group and we were shocked at the low quality of much of the food. The high reviews below are really strange."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMlEwVjJhSEZ5T1ZoNWFtWlpNSGxUWWxVMFpHYxAB",
            "text": "This was the worst Italian food the 11 of us ever had. The veal piccata didn’t taste so fresh and there were NO capers. The vodka sauce kind of resembled vodka sauce. The chicken parm was very average. The stuffed artichoke tasted ok, but it came with some saucy breadcrumb sauce, which I’ve never seen before. The pasta with meat sauce was ok. I’ve had Chicken Scarpariello many times. It’s usually beautifully browned crispy chicken pieces. This was like boiled chicken with some sauce thrown on it. The service was good. Even the Shirley Temple tasted strange."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RldDMVVlbWhxWTNvdFZISlJVVVJZVERCeVFWRRAB",
            "text": "Welcoming, friendly staff.  Charlie goes way out of his way to make sure you are comfortable.  Food is amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeWRISnlTRkJ6WWtaUmVtcDNTWE40WnkxbFduYxAB",
            "text": "I grew up decades ago in New Jersey in Italian American surroundings. The rhythms and sounds here were resonant with my memories as was everything we had to eat. Big portions...\nShare an entree. Excellent baked clams."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSWNuWlZZbWxwTUhwU1VXVTRSR1ZvUkhwZmNsRRAB",
            "text": "Great place, food is amazing. A place for the entire family."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1VsVXRVa0ZaUzBwTU16ZGpVbk5wVDFWSmNYYxAB",
            "text": "My father took me here 50 years ago. They wrote the menu on a paper bag and hung it on the wall. They have a menu now for those who need it. Great southern Italian food at reasonable prices. They use san marzano tomatoes and extra virgin olive oil which are the highest quality ingredients. I highly recommend a visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNVpVeG1SblZYZFVOTU5XMTRNMHhQVW1oMmExRRAB",
            "text": "Old school, family style Italian food...salad, chicken parm and shrimp marinara was excellent!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNREExcDI1bFl2ZklBEAE",
            "text": "Cozy family style restaurant serving authentic southern Italian cuisine. Started in 1962, this place is where people come from near and far, the owner Charlie greets all customers warmly with a pleasant smile! If you are looking for a family style comfort food experience this is your go to place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTk0zTmFlRFZPUnpobFJXeDVNbFZyVFROT1NsRRAB",
            "text": "Great place! Would love to go back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeTBtSUxDZ2ZQaHNnRRAB",
            "text": "Everyone was amazing, not pesky. Everything was delicious"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeURtX3Z2a1pEcGp3RRAB",
            "text": "“I have eaten as much as I can, not as much as I want to, but as much as I can.”\n\nPer a son on the verge of summer break at Dominick’s Italian on Arthur Street, Bronx.\n\nThe mussels starter with tomatoes sauce was outstanding.  Omg.  I usually only eat mussels with butter and garlic but I am converted!\n\nOssobuco, Roast Pork and Cabbage, and Lamb Chops were truly excellent.  The steak was declared very good (and fully consumed).  The potatoes with the steak were fine but not life changing.  This might be because the dishes were on the upper range of perfectly salty.  By contrast the potatoes were not salted.\n\nOne sits family style, sharing tables for 8 (or 12) with other patrons.  On a gentler day we might have made some new friends, but we came hungry and impatient today.  We love this style of eating, and have been here before.\n\nHighly recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMZW81YzZYaElmMVVREAE",
            "text": "Hidden gem in the Bronx. Great prices, great food, fast service, large portions.   Only negative is that it is cash only."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX1oyTVhXdjZPVUV3EAE",
            "text": "The Best of Arthur Avenue"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbnJLZTNnRRAB",
            "text": "A friend had recommended this place and so we tried it. It’s definitely a no-frills kind of environment so you definitely don’t go for the service. They are very fast and efficient but it feels more of an effort to flip the table. We sat downstairs, but there’s also a large area upstairs that had seating and was a lot quieter. The dishes are HUGE and 2-3 people could split a main dish with the portion sizes. The chicken Parmesan hit the spot and I’d come back for that alone. We also tried the stuffed artichoke, but it wasn’t great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODZqaGpBRRAB",
            "text": "Traditional Arthur Ave.  I love it, can't wait to go back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOWU3MEpnEAE",
            "text": "Dominic’s was my default go-to when visiting New York’s uptown Little Italy, a tradition I kept at least once a year.\n\nTheir restaurant offers the best food, made with the freshest ingredients, paired with superior service and fair pricing.\n\nI recommend skipping the menu and asking the waiter for their recommendations or specials. You will be pleasantly surprised."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOXU3ajlBRRAB",
            "text": "Family the minute you walk in.\nIt was amazing they looked and talked to me like a brother.  Felt right at home and I'm Dominican 🇩🇴.  Loved it ....did I mention the food....fohgetabboutit!!!!!!\nPicture you here!\n\nCASH ONLY $\nCASH ONLY $\nCASH ONLY $"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dEpqMDVnRRAB",
            "text": "Still my favorite place in the area been going there forever- try it you will love the food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveV8yODhnRRAB",
            "text": "Amazing food and service !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd01qQTRRRRAB",
            "text": "If you want real Italian food come to Dominick’s it’s delicious !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cTUyNjB3RRAB",
            "text": "Disappointing Experience at Dominick’s Restaurant\n\nOur party of eight (four adults, four children) had high hopes for an authentic Italian meal, but Dominick’s fell short in nearly every way.\n\nThe meal started with decent bread and low-quality olive oil. We ordered two servings of baked clams ($25 each), but one clam was rotten, nearly making me sick. The fried calamari ($21 each) was bland, lacking seasoning and crispiness, with a marinara sauce that tasted processed.\n\nThe ziti with broccoli rabe and sausage ($24) was flavorless, seemingly thrown together without care. The sausage resembled canned Vienna sausages—unappetizing and unworthy of an Italian restaurant. The veal parmigiana ($23) was the best dish of the night, but that’s not saying much. It was edible, though the linguine served with it was bland. The linguine with meatballs ($22) was so bad that even the kids wouldn’t eat it.\n\nI ordered lamb chops medium rare ($38). While cooked correctly, they tasted like frozen meat thrown straight onto the grill. The overcooked fingerling potatoes didn’t help. The chicken sorrentino ($23) was just chicken and mushrooms in the same processed-tasting marinara sauce—uninspired and overpriced.\n\nService was mediocre, the restaurant only accepted cash, and the atmosphere felt more like an SNL skit than a true Italian dining experience. To make matters worse, I ended up with food poisoning.\n\nFor the prices, the portions were small, and the quality was abysmal. If you’re looking for Italian food in the Bronx, Carmine’s is a much better option. I wouldn’t return."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bzRuSVdBEAE",
            "text": "Came to Bronx’s Little Italy with friends, looking for good food, and wound up here. The food was pretty mid, under seasoned, and their bread was stale. Area was very cramped and the people behind us kept accidentally moving their chairs into us. Tried to order the chicken and potatoes, and they didn’t get it. Apparently they didn’t have any potatoes, but forgot to tell us and had us waiting on it. Overall, it’s overrated."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cE1EWll3EAE",
            "text": "Amazing food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bnJEdkhREAE",
            "text": "Always a great place to go for great food, service\nand meeting great people."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdXZpUmR3EAE",
            "text": "The best in the Bronx good food good staff great vibes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b3ZuRll3EAE",
            "text": "Cash only! Sundays no white sauce?!\nAmbiance (4/5): We came in around 5pm on a Sunday and was surprised that the first floor was about a third full. The bathrooms are located up the stairs and the whole establishment is huge!\nService (4/5): There are plenty of wait staff to table ratio so service is very attentive and quick. The only time is when they have their backs to you while they are conversing with each other!\nFood (2/5): I found the food extremely underwhelming and overpriced for what we got.\nStuffed clams: All the other tables were ordering it so we followed the suit. The clams were not washed out enough and had sand in 2 of the 3 that I ate. Additionally, it was overcooked that it was a bit hard to chew. The actual meat sizes were large!\nChicken Marsala: Way too much wine in the sauce. However the chicken pieces were very tender. Mushrooms soaked the sauce.\nRivoli: The pieces were gigantic. However, I’m not a fan of their red sauce, which is very tomato forward and not very thick, and too sour for my taste.\nVeal scarpariello: wow the veal was so incredibly tender! Only a few thin slices and a slice of eggplant that almost looked like veal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLWV2bzVBRRAB",
            "text": "Absolutely in love with the place. These guys are fantastic."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNzZXV0JREAE",
            "text": "Stuffed artichoke is okay. The veal piccata was fairly bland. Baked clams were great. Pork chop and hot peppers were fantastic. Side of meatballs also came with a side of hair in them. They did apologize and of course removed them from the bill. I won’t return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGFxdlNBEAE",
            "text": "Very old school. Nice to see they still exist. Place was jammed to the gills. All locals. No tourists ( except us from CT). I was a bit reticent to go. The last time I went to Arthur Ave was about 4 years ago, when I went to Mario's. I found it Meh! However, we keep on steadily losing Italian places in CT, and I decided to give the Bronx another go--especially after watching several youtubes about the \"real Little Italy of New York.\" Fortunately, I was not disappointed. The food was great. The meat portions are enormous and the pasta dishes tend to be on the small side. I am definitely coming back to work through the rest of the menu before venturing out to explore therest of the little universe called Arthur Avenue."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOXJiM2JREAE",
            "text": "As always, it was fantastic. Big portions and delicious food. 😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc2ZDMlhREAE",
            "text": "Great spot that transports you to your grandma's/nonna's kitchen.  It's a legitimate authentic italian american meal for very reasonable prices.\n\nCash only."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX3BMa2lBRRAB",
            "text": "Not the Dominick’s I remember. We went on a Friday afternoon after Christmas. Tables are tight with family style seating and waiters were friendly.\n\nThe food came out very quickly and was just ok. They don’t serve pizza so we got the kids pasta and meatballs, which they didn’t love. My chicken scarpellio was a let down. There was no sausage, potatoes or peppers, Just chicken in a sause. Overall, I was not thrilled with our experience and will be trying a new place. I really wanted this to be better!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OEl5S253RRAB",
            "text": "Great food, great people.\nEverything's is perfect"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OTVTZ3dBRRAB",
            "text": "I absolutely love coming to Dominick’s. Me and my husband make it a point to come to Arthur Avenue\nTo eat here at least once a year. The food is amazing the atmosphere amazing and the service is to die for. Definitely recommend this stop in the Bronx."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ckxLNnlnRRAB",
            "text": "We’ve been going to Dominics for over thirty years and it’s still incredible. Like stepping back in time so go and enjoy the best there is!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNWJiYkxnEAE",
            "text": "Warm, friendly, and great people work here. The food is solid good food without any nonsense.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNlpmby13RRAB",
            "text": "Family style restaurant with a different Sunday menu. I only come on the days that have a non-Sunday menu. Love the shrimp, oregano, pork chops with vinegar, peppers, chicken, Scorpio, and more."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNXB1MnpRRRAB",
            "text": "Fun crowded cash only restaurant with great food and wine."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN2NXeklBEAE",
            "text": "Incredible Italian cuisine and tremendous service. Place is very busy ."
        },
        {
            "date": "11달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNHJMZVFREAE",
            "text": "Très bonne cuisine plat très bien fourni copieux même"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNS03cGVBEAE",
            "text": "Very mediocre and our experience on a Saturday evening did not mirror the 4+ star reviews.  Meat sauce was awful and pasta was undercooked.  Chicken Picatta was too bland and Chicken Scaloppini was too spicy.  My wife’s linguini with shrimp and calamari was very good so there was one bright choice.  Service was average to above average, but they jam you in as our table of 4 was butted together with another.  Also table next to us brought screaming kids which only added to the poor experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcDZlWWJnEAE",
            "text": "Crowded horrible food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeWY2dTV3RRAB",
            "text": "Food was yums. Portions were big.  Wait staff friendly."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdHVQbUVnEAE",
            "text": "포크챱 피짜이올, 스파게티 다쟌, 베이크드 클램\n존맛"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdzZQWDlnRRAB",
            "text": "Super down-to-earth Italian restaurant with lot of pastas and veggies on the menu. The pasta was great, you could see some imperfections on each noodle, so I assume it was fresh! My favorite dish though was definitely the broccoli. It was cooked to perfection and tasted incredible with the garlic sauce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbE55T3ZRRRAB",
            "text": "Can’t say enough about this charming old school Italian bistro perfect for family dining. I picked this place because the review I read said “it’s more like a neighborhood food hall. Long tables & the waiters verbally provide the menu.” This is my style. I wasn’t disappointed. Easy to get a table for one and I was pampered and showered with love & attention from the busboy, waiter, bartender and owner. The food was quick and AMAZING! Authentic and fresh. The bread was delicious and with the evoo , chef’s kisses. House wine was great & I got out of there for a mere $45. Cash only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX2NHNExnEAE",
            "text": "Miss visiting Arthur Ave and totally enjoyed my trip to Dominicks tonight. Amazing food. Had the stuffed artichoke and the baked clams for appetizers and the chicken parm with ling with garlic and oil while my wife had penne a la vodka. Service was amazing. Good seeing Charlie running to ship as good as always. Bartender and the waiters all were superb. We were given delicious expresso martini's for our 31st Anniversary. I highly reccomend Dominicks and we will be back very soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdTU2TnpRRRAB",
            "text": "I was here for lunch on a Sunday afternoon; it was my first visit to Arthur Avenue.  The calamari was perfectly fried, the pastas done nicely and the osso bucco special was delicious.  The ambience is nice and old school.  The waiters were knowledgeable, efficient and friendly.  I want to come here every Sunday!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2NPcHJRRRAB",
            "text": "July 2023:\nEnjoyed a delicious dinner. My friend has been going here for years and shared one of his favorite restaurants with us.\n\nWe started with a cold anti pasta plate. Really a tasty dish with meat, cheese, olives 🫒, lettuce. Paired very nicely with bread 🍞. By the way, the bread 🍞 was tasty 😋.\n\nThen we had broccoli rabe with sausage and linguine. This was a tasty pasta with lots of garlic.\n\nThen we had a seafood stew with a side of pasta and red sauce. Lots of seafood: tile fish, calamari, lobster, shrimp, mussels. Muy delicioso.\n\nThen we had the chicken scarpariello. This chicken was super delicious! I wish I could make this at home. Wonderful blend of spiciness and acidicness. Like the poppadew peppers!\n\nWe really had a great dinner. Looking forward to coming back again for more delicious food!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcnZqZTF3RRAB",
            "text": "Amazing food at an amazing establishment.  I recently celebrated a birthday here and we had about 20 people attend. The restaurant was great, they put us on the 2nd floor away from everyone else and closed us off to the rest of the patrons…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMU9maXZBRRAB",
            "text": "Went for lunch and sat out side. Service was fast to get us seated and get our orders in. Fried calamari (friday only) was really good. Thick cut and nicely battered and fried. linguine and clams was okay. Chicken parm was okay. Servings were plentiful for two people and well priced. Typical red sauce Italian spot, simple and rustic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa3VUbUlBEAE",
            "text": "Iconic location on Arthur avenue. Love this place. Amazing food; best Italian in the Bronx. The staff is friendly and attentive. Great eclectic atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdE55N0dnEAE",
            "text": "This is the family-style NYC dining experience that you dream about. Visiting Dominick’s is honestly like being with your family. They really get you. Their servers, like the dishes they serve, have been a constant over decades. I’ve truly never seen this level of longevity anywhere else in the restaurant industry.\n\nThe dishes and service impress every visit.\n\nThe vibe isn’t pretentious at all which is refreshing. Wear what you’re comfortable in and prepare yourself to feast. It’s worth it to hit the ATM hard in advance.\n\nHands down the best food around. They’ll never ever let you down.\n\nOh and for parking, there’s a nearby lot that’s $2.25 an hour. Super affordable and you can pay via ParkMobile (lot 223527). Finding a spot has never been a challenge."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMzllZWh3RRAB",
            "text": "This is a classic Italian eatery in the real sense of the words. The portions are generous and the prices reasonable and the good is very good. I first came here as a teenager decades ago and it had changed as it should, but it still had a family charm."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaUplcm1BRRAB",
            "text": "A gem in the famed Arthur Avenue (Bronx’s Little Italy), the Italian fare at Dominick’s is authentic. We always go with the antipasti for starters, a heaping serving of salad, assorted meats, cheese, olives, tomatoes. Then we go for our…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNFBmblV3EAE",
            "text": "Wonderful family style Italian restaurant.  I had the Veal Francese which was exquisite.  We also ordered good old fashioned linguine with meatballs, house salad, and stuffed clams.  All simply divine.  Service was friendly and attentive.  Only disappointment was that they ran out of chicken parm and linguine with clam sauce.  Otherwise, a delightful meal.  Cash only."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnel96cHBBRRAB",
            "text": "The vibe of this restaurant is really cute, old school and authentic Italian. Everyone is seated together in long picnic style tables. There are no physical menus or checks. The stuffed artichoke was very average, could definitely use a bit of flavor, but the baked ziti was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybVpLQzZBRRAB",
            "text": "Delicious Classic Italian Food! Loved every course! No Menu, the waiter tells you what food they have available! Go early, they are always busy and might run out of some dishes!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRc05xVnd3RRAB",
            "text": "Dominick's is an iconic Italian restaurant.  Located on Arthur Avenue in the Bronx.   Long tables which are good for groups.   You can order family style or individual plates.   No menu,  they just tell you what they have.  No fish on…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNThIdnJ3RRAB",
            "text": "For an authentic Italian experience, you must go here. Fully stocked bar, great waitstaff and a mouthwatering menu. Be sure to try the the stuffed artichoke and calamari. Crowd favs are the fettuccini alfredo and baked ziti. Front of house…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6amNYNXZRRRAB",
            "text": "Outstanding service and wonderful food. We were delighted with Dominick's and will be sure to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdTQzRC1RRRAB",
            "text": "Delicious food and huge portions. Waiters were extremely nice in a family-style sit-down atmosphere. The pasta combo for two is probably large enough to feed four people!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzLXRfM1ZREAE",
            "text": "In a traditional Italian-American neighborhood (called Arthur Avenue) near Fordham University and The Bronx Zoo in The Bronx, NY, is an old school Italian restaurant that serves from a menu that is only proudly recited by the waiters, often with delightfully wry Bronx humor.  There will be an array of chef's choices offered as specials -- but of course if you have a favorite meal, you can always ask.  The wine is served in unpretentious little wine glasses and you or your group may be seated on one of two floors at long tables.  On busy days, the din of multi-generational groups (it's kid noises friendly), tourists and neighbors lends it a sparky, lively, cafe atmosphere where everyone seems to have a smile for the groups at the next tables.  If you prefer a quieter or romantic outing, try to stop by on a weekday or when weather is colder.  (Over 30 years, I have occasionally seen lines running out the door and up the block on weekends, since many urban insiders know it's well  worth it. )  Three of us spent $150 for everything (wine) but dessert.  We ordered appetizers to chow on with the bread that's brought to the table and a simple leafy green salad.  Entrees included perfectly tender calimari in a marinara,  plump meatballs and fresh linguine and a somewhat complex bolognese sauce on pasta -- and all in generous portions.  (Be sure to bring cash).\nAfter dinner at Dominick's, you'll want to stop by Gino's Bakery to stock up on everything from sesame almond biscotti to layered pastries that are inscribed in frosting on the top -- 'Chaz'.  This is one of the pastries that has been a favorite of Gino's most famous (almost most famous?) customers, Chaz Palmieri, and several are often reserved for his visit later in the afternoon.  We ran into Mr. Palmieri, screenwriter (A Bronx Tale) and actor, at the dizzyingly abundant green market across the street.  We didn't want to bother him, but snapped a quick photo.\n\nEvery visit to Arthur Avenue is an adventure of a new kind (we often get fresh pasta or a crusty fresh-baked bread, mascarpone and fennel -- or we'll pick out gifts that might include imported Italian sausages, prosciutto and cheeses.)  This is a daytrip that still offers an authentic New York neighborhood experience that will make your heart sing.  Oh, street parking, as you might guess,  is in demand but we have always found a spot so far, some days closer than others.  Be sure to bring cash."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdTZ5R1B3EAE",
            "text": "Great low key experience, tasty pasta at a good price. Can’t ask much more than that! Just be aware it’s communal seating and cash only."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeU9XZ1JBEAE",
            "text": "If I was on death row I’d come here for my last meal. The eggplant rollatini was so good. We also had cavatelli with meat sauce. I would eat it everyday if I could. The service was incredible and I loved the family style seating, everybody was so fun and friendly. Eating here feels like stepping into a movie and playing an extra. You are not the main character here. It’s so much fun."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJNnVqLUxnEAE",
            "text": "This is a great family style Italian restaurant. Nothing fancy or flashy here. Just delicious home style meals bursting with flavour. We loved our meal. It didn't hurt that the servings were huge and the prices were reasonable. I highly recommend this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcy0tWTJ3RRAB",
            "text": "Food and service was great. I was expecting the moon after hearing all the stories about food on Arthur Ave, and this meal was very very good. The salad and bread to start were a nice touch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdVlIZkRnEAE",
            "text": "Top Notch baked clams and linguini Alla Gianni. Old school Italian atmosphere with great food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZcVpYUm5nRRAB",
            "text": "Been here many times.  The best in the Arthur Ave area!  If your looking for a quiet romantic table for two keep looking.  If you want the best tasting food with great service this is your place!\n\nYou sit at long tables and other will either be seated next to you or nearby.  However, the food is off the charts.  Stuffed peppers the size of softballs and delicious!!!!\n\nHighly recommend!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZbzZMZnBBRRAB",
            "text": "I love this place.  The menu is consistent and the atmosphere is casual.  Cash only.  Try the house red, eggplant parm, linguini with clams.  The salad is good but eat bread instead 😄"
        }
    ],
    "reviews_count": 77
}