{
    "name": "Ann & Tony’s Restaurant",
    "place_id": "ChIJf5gfuYD0wokRpIa9duwFG5k",
    "grid": "BX6",
    "address": "2407 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.3,
    "user_ratings_total": 412,
    "phone_number": "(718) 933-1469",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT1NraG1lWEJKV1dab1FYZHRkWEZQWlUxcFkwRRAB",
            "text": "We had a welcoming server, who cheerfully checked on us frequently. Large servings so hard to leave hungry. We had veal and chicken dishes and the antipasto appetizer. No complaints."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbGFVbHpVRzFaYjBKaFN6Y3hMVmxXVVhKS1NGRRAB",
            "text": "Sorry to say, and maybe it was because we walked in 1 hour before closing, but the food was mostly bland with little flavour and our bus boy acted like we were an inconvenience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTlNUbEZkWGQyTW1GbFkyY3dhWHBRUlRSb1RWRRAB",
            "text": "The best food on Arthur ave eggplant Parmesan side of meatballs plus pasta I'm eating my leftovers for lunch tomorrow the sause isn't oily and chunks of tomatoes second time here and definitely won't be my last husband had veal parmesan he said it was like butter didn't even need a knife side of pasta and broccoli just wonderful meal wait staff is attentive and polite"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaFRFNWhWR0oyYzJkaVRrWkJVMFp2TmpGcmNtYxAB",
            "text": "Delicious food!!!!\nRigatoni vodka - 10++++"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTlYwNUZZbFk0YWpSUVpqaEVlVkk0T0ROU2JWRRAB",
            "text": "Excellent, delicious!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVFrZE1iMlZCTkV3eFYxcGZVV0Y0V1RGeFQyYxAB",
            "text": "I like the old fashioned Italian cuisine but it may not be everyoneas bowl of minestrone (instead of cup of tea). The veal was just right, pasta, salad just hit the spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTk1GVnZRWGRGYW1odVVuZDNRM2wyTjJ0bE4xRRAB",
            "text": "It ok but the food could have been better and bigger way 2 small only good thing I liked was the bread"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVRHWndUbVV5VW5GaU9EaGhaalJrU1hKRmVIYxAB",
            "text": "When you come into this place, you will immediately be greeted by some of the nicest, genuine souls you’ll meet. Everyone working here serves you with a smile and has the best attitude towards life. Once you are introduced to the incredible staff, you soon come across the food. The family quickly made work of our meals and the bread given out, as food flew off your plate faster than you would ever imagine possible. The dessert here just adds more to the magic this place provides. If you want to find a place where you can enjoy incredible food and service, it would be best if you gave this incredible establishment a try! ps-make sure to get things for the road, you’re gonna regret not taking food home!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTU1TMXNiVEZNVHpGelFsQktSSHBVUmxWTU9IYxAB",
            "text": "THIS PLACE WAS AWESOME. I HAVE NEVER SEEN FOOD DISAPPEAR FROM A PLATE SO FAST. SERVICE WAS VERY FRIENDLY AND THE ATMOSPHERE WAS SO CUTE AND ITALIAN. THEY MADE YOU FEEL LIKE A PART OF THE FAMILY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdmFXbHhTakJUUTBoMU1XRmpabmhQU0ZsV05FRRAB",
            "text": "Chef Tony is AMAZING!!! We just had an incredible meal. The Chicken Limone, Chicken Scarpariello and Meatballs were excellent. Classics at its best!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb2FXZDJiRE51YVhWclVIcEhiVEZzV0hoSk9HYxAB",
            "text": "Editing my review to respond to the response below  We was not told it was not working at full capacity. In fact When i walked it it was empty that I asked were they open bc it was hot and they had a fan on in the bar area only.\n\nDrove all the way from queens to try this based on a few social media recommendations but disappointed\nEmpty when you walk in was a sign\nIt was hot and the ac was not on after i told them twice that we didnt finish our food\nThe staff was attentive. Good customer service\nthe chicken parm was good the ziti was so so\nI asked for ice it was extremely warm i cldnt finish the house salad that looked good but we wanted to leave too warm to enjoy our lunch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdGVqWmxibTVtYTBsS1Yza3hNRkJJYVZwdk4xRRAB",
            "text": "100% recommend Ann and Tony’s! We had chicken Ann and Tony’s -so tender and bursting with great flavor! The Chic parm was great and we also had the spaghetti carbonara with a great sauce."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbmJscGtTR2w0UjJSVmVqZHFjWEJ6VEZOa2FIYxAB",
            "text": "Very nice authentic Italian restaurant right in the heart of Little Italy. The Chicken Marsala was excellent. Highly recommend eating here when you visit the Neighborhood 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMVpVNWxNbXg1TkhNMFJFUk5hR3czZG10VVMwRRAB",
            "text": "Really good traditional Italian cuisine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWFYxaDFaRlJqVkdSVGEwc3hOV2hrV1hremFsRRAB",
            "text": "First time here and I had a great experience. I had the eggplant parmigiana and omg it was delicious. It was beautiful to see fifth generation."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOM0JydjJIal9HNFpnEAE",
            "text": "Very disappointed with the cleanliness of this restaurant. The tables were dusty, and the menus were visibly dirty and sticky — it looked like they hadn’t been cleaned in weeks. It really put me off my meal. Cleanliness should be a top priority in any dining establishment, and this place clearly missed the mark. Definitely won’t be returning unless serious improvements are made."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPS3kwZUN6ODhpbFNnEAE",
            "text": "Food was under seasoned and under cooked. There was a musty odor as soon as you entered the place. There are better places on Arthur Avenue, skip this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeUJqYWlMMGRmLVNBEAE",
            "text": "Best Arthur Avenue Restaurant"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VON0NwY0NnbnJhbUVBEAE",
            "text": "Best Arthur Ave restaurant hands down!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSFgzb0hHNVBxOXpBRRAB",
            "text": "I went here for my 8th grade graduation, and this place was amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM0ZvdFN4MzY3TFRnEAE",
            "text": "Great food awesome people feels like your part of the family in there .. get the chicken alfredo too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPX2hxNW5ZNTlhUkRREAE",
            "text": "Not a fan, never have been. Really bad. Also, An incredible miscarriage of justice occurred recently involving a reservation, devastating and disrespectful. I’m not even made about it anymore, just sad. Bring back real Arthur Ave establishements."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLX1JrY3VWa2RDeDNBRRAB",
            "text": "This place ruined our graduation dinner—without us even stepping foot inside. They scammed us out of $700 just to make a reservation, with no clear explanation and zero transparency. What should’ve been a special night turned into frustration and disappointment. The arrogance, the greed, the lack of basic decency is unbelievable. They clearly don’t care about customers at all—just scamming people out of as much money as they can. This place is run by crooks. AVOID AT ALL COST. WHATS SUPPOSED TO BE A PLACE THAT SUPPORTS THE COMMUNITY… is a place that takes advantage of it. A shame."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJWGp0ZG5RcWRXdkJBEAE",
            "text": "Go to literally anywhere else on Arthur. The management here is unlike anything I’ve ever experienced before. Food blows too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNbkMwY1czcnZpVkZREAE",
            "text": "Mid ass food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLS1poS210cVlqWllnEAE",
            "text": "Terrible food. Terrible service. Scammed us out of 700$ for a reservation. These people are the worst. Don’t give them your business. If you want great food on Arthur avenue go to zero Otto nove or emzos. Save yourself the trouble and don’t go to Ann and Tony’s. These people are the worst and will rob you of any money you have."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2FPaHdnRRAB",
            "text": "Ci è piaciuto moltissimo Ann & Tony's. L'atmosfera era calma e accogliente. Il cibo era molto gustoso e fresco. Il pollo Ann e Tonys era delizioso e il salmone al limone era molto gradevole. Grazie\n\nNos encantó Ann & Tony's. El ambiente era tranquilo y acogedor. La comida estaba muy sabrosa y fresca. El pollo de Ann y Tony estaba delicioso y el salmón al limón estaba muy bueno. Gracias"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbWR5Y1l3EAE",
            "text": "Ann & Tony’s\n2407 Arthur Ave.\nBronx, NY 10458\n\nVeal Parmigiana\n\nThis restaurant is family owned for five generations and it is still thriving.\n\nThese two full size cutlets came with a side of linguini.  Grandma’s marinara sauce is freshly homemade every morning.\n\nI’m really looking forward to exploring their other menu options."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbHBubFhBEAE",
            "text": "Great food,good portions,very reasonable prices. Only negative I can say is the water in the ladies room was literally scalding hot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cVpEcmtnRRAB",
            "text": "Highly recommend the carbonara so delicious and full of flavour. Their bread and oil are so textured and flavourful\n\nAuthentic food with grest service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMl9IQmlnRRAB",
            "text": "Relatively small portions sizes"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNHRDYjRnRRAB",
            "text": "Very disappointing.  The food was really lousy...so much oregano in the sauce. The service was good....it's sad because we brought friends visiting to our \"Old neighborhood to one of the oldest restaurants on Arthur Ave, and it was not good. You are now a tourist trap...sorry but we won't be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdjViVkhBEAE",
            "text": "Food was good and priced reasonable"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaXRfQVJ3EAE",
            "text": "They customize your food preferences wonderfully! Had a delicious grilled chicken with baked clams. The Santa's Day off cocktail was so good. The service was great and the waitresses were very attentive. Looking forward to going back.\nWe went again and there was a miscommunication on a side order but Anthony salvaged the experience ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfX1pqRE5REAE",
            "text": "Had the veal parm with spagetti.2 thick slices with a delicious suace.Be careful not to eat all the bread with that seasoned oil before the meal.Best bang for the buck on Arthur av"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmai1PT1hREAE",
            "text": "I recently went with my grandma and friends. Super attentive and sweet service with yummy food. I wish your family another 100 years of great service. Thank you!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdG92bkhREAE",
            "text": "The food was absolutely outstanding from start to finish. It began with some of the best bread I’ve ever had, setting the tone for an incredible meal. The hot antipasto was a delight, and the veal cordon bleu special was perfectly executed—truly memorable dishes.\n\nThe service was equally exceptional, making the experience even more enjoyable. I’m so glad we finally made it to Arthur Avenue, and Ann & Tony’s has certainly set a high standard for the other restaurants in the area."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dUl2dktREAE",
            "text": "I went here with my family. We ordered the h ot antipasto as the appetizer which was very good and various pasta and Parm dishes. I went for the veal Parm, chicken for everyone else and my wife was feeling adventurous and ordered the tripe (which is really good if you are into that sort of thing).  The veal Parmesan was excellent.  I am definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdU43blN3EAE",
            "text": "Food was great. The service was good. Atmosphere perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ2J6YUNnEAE",
            "text": "Went there for the first time yesterday have to say the food was incredible. Had the Ann and Tony's Chicken out of this world."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOFotQkxBEAE",
            "text": "Muy buena comida y excelente servicio, bien tranquilo para ir en familia o como deseen,\nlo recomiendo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyN3V1U0h3EAE",
            "text": "Makes me feel like Home..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMTY3ZjhRRRAB",
            "text": "When I went to Ann & Tony’s I had a delicious dinner indeed. I got the penne ala vodka which i enjoyed and my boyfriend got the bolognese which he says tasted like mush :( The bread is sooooooo good though we love the oil. Unfortunately the service is BAD. We were literally the only people in the restaurant and our waitress only came to check on us once. The ONE time our water was refilled was when we specifically asked for more. It is very important to me that my water cup is refilled as the meal goes on and seeing as there was no one else that is crazy to me. We are going back tonight and I am hoping, nay, praying that the water is plentiful\nedit: Wow! Things have drastically improved in terms of the service here. The waiters are very very attentive now and very on top of filling up waters. It’s wonderful to know that this restaurant listens to its customers! The food remained just as good as last time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cGY2QVh3EAE",
            "text": "My cousin and I liked the prices at this restaurant so we stayed and the service and the food was very good and plentiful! It is very cozy. 1 table by the window that we weren't able to get but none the less it I'd beautifully decorated. Will definitely be back to Arthur Ave. Do try their garlic bread and in house made meatballs!!."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMHBxU3NnRRAB",
            "text": "Most beautiful place for enjoying a good meal with friends and family. The owner is so kind and the service is amazing . The amazing employees are wonderful. The true hidden gem. They seem to surprise me every time I come here !!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcG8ySDFRRRAB",
            "text": "Disappointing Dining Experience at Ann & Tony's\n\nI recently dined at Ann & Tony's and unfortunately, my experience left much to be desired. From the moment I walked in, the atmosphere felt lackluster and the ambiance was uninspiring. However, the real disappointment came when I sampled the food and interacted with the service staff.\n\nLet's start with the food. I ordered the Veal Parmesan, a classic Italian dish that should be tender, thin and lightly breaded. What I received was a plate of tasteless sauce with two pieces of veal so tough, and with so many thick tough veins running through it, that I could not cut through it with the knife they provided.  The veal was literally drowning in a tasteless, unseasoned tomato sauce with the consistency of ketchup. I expected much better quality.\n\nTo make matters worse, the service was abysmal. The wait staff seemed disinterested and inattentive, making it difficult to get their attention when I needed something. To add insult to injury, I had to ask for my check 4 times, and it took an eternity for that to arrive, and when it did, it was evident that little care had been put into its preparation.\n\nOverall, my experience at Ann & Tony's was highly disappointing. The combination of subpar food and lackluster service left a sour taste in my mouth. I would not recommend this restaurant to anyone looking for an authentic Italian dining experience. There are plenty of other establishments in the area that offer far superior quality and service. Save your money and dine elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaE5DZWJREAE",
            "text": "By the time I realized that the shrimp were gone, I was sad. It was the end of the meal. Healthy amount of pasta and bread served. A pleasant experience all around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNVpYeXJRRRAB",
            "text": "Service was great! food was amazing! Great atmosphere! I will definitely be dining there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dU5xQ2Z3EAE",
            "text": "The owner and staff are amazing very attentive. Food is delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdXF1Uk13EAE",
            "text": "Can’t wait to be back ! Loved everything"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVb2E2eExnEAE",
            "text": "Nice restaurant on Arthur Ave  went on a Sunday night not crowded had table by window. Staff attentive and our server was very nice-  food was excellent.   Delicious desserts. Ordered glass of wine and they filled mostly to the top! Definitely worth driving to  from LI."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dXRxbml3RRAB",
            "text": "Tony is one in a million—his character, his restaurant, and the food was spectacular! I enjoyed every bit of my visit at this authentic Italian establishment. It felt like walking in to a family’s home and sitting down to eat. Wishing many years of success at this restaurant, well deserved!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncnVQdS1BRRAB",
            "text": "Unfortunately, we didn't have a good experience here. They mixed up their name list so other got their seats first. Bread was cold serve with simple olive oil. All food with red sauce were salty. Our salad came in aluminum bowl with (again…"
        },
        {
            "date": "4년 전",
            "language": "ja",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURLM2U1VhAB",
            "text": "シーフード好きの私が頼んだものはイマイチだったけれど、連れが頼んだ今日のおすすめ小牛のレモンなんとかは美味しかった。キッズメニューもあったのはプラス！\nサービスも良かった。\n値段はマンハッタンと同じ。"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBM3FQam5BRRAB",
            "text": "Wow - how disappointing!  Uninspiring menu.  Seems like they are living off their past. It was probably really good home cooking in its day, but that day has passed. Mushy unsalted linguine & fishy tasting calamari!  The fra diavolo sauce…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcVBQVWZnEAE",
            "text": "Food isnt to par. Theres no parking. The bx17, bx19 and bx9 are walking distance. I wouldnt recommend eating here, it's not the best. Lasagna was meat layered with no sauce or cheese, sauce and cheese was only on top layer. I ordered…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaWU3ZEJBEAE",
            "text": "I definitely love it, it is a beautiful place, they have excellent service, the bread is delicious as well as the rest of the food, the atmosphere reminds you of past decades, I really recommend it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHIyVWd3RRAB",
            "text": "Welcoming ambience, very attentive waitress, food was ok 👍🏽 their Calamari was something different, flavorful but different from the usual (I’m not sure if i like it since i love my crunchy calamari 🤣) had the spaghetti carbonara and it was good. We recommend the Limoncello! Very refreshing!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdjllLVl3EAE",
            "text": "Was referred to this place by a friend who grew up here and wouldn't stop talking about how much they loved this food. It was a beautiful restaurant and the food was amazing. I had the chicken limone while my boyfriend had the eggplant.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc1BuZnF3RRAB",
            "text": "My Family and I were visiting the Bronx for the day from Northern New York and happened to find this hidden gem. We were treated to an amazing meal. From the fresh bread and olive oil dipping sauce as we were seated to  treat of cannolis our entire meal was amazing. The friendly atmosphere and the speed in which we received our we could not have been more pleased!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaU5QQ0xREAE",
            "text": "Amazingly delicious food complimented with it's customer service.\n\nThe restaurant have an amazing vibe."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHanN6QVd3EAE",
            "text": "Great service and selection of great Italian dishes. The story of this place is fantastic as well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNanNMQW93RRAB",
            "text": "Food was amazing, extremely authentic italian food. Everything down to the ingredients were authentic. The Caprese salad made me feel like i was in italy.... Im positive that the olive oil they use is imported. Oh, lets not forget the fresh in house baked bread. And i cant finish this without the amazing story they have on the back of their menus paying homage to those who started it all. Will be coming back but next time am bringing more people !!! 😊"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbUxXVXVnRRAB",
            "text": "Truly excellent home cooking, just like you might eat in Italy. Mangia bene indeed! Everything authentically delicious."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbTR1X2pRRRAB",
            "text": "This is truly a traditional Italian family run restaurant. The food is excellent as is the service. For starters theyput their own special dipping sauce on the table with perfect, crusty bread.\nFor appetizers we ordered fried camaro and clams & mussels posillipo. The sauce, both in the posillipo and the marinara dipping sauce, are to die for. The clams and mussels were both tender and tasty.\nFor entrees we had the special of the day which was veal osso bucco. This is a chef Anthony signature dish. And for good reason. The veal is delicious as was the polenta it sat on. My son had clams, shrimp and calamari in their signature marinara sauce. Delicious! One of the other guests has a restricted diet and the maitre d' catered to her every wish."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNV9mcDVRRRAB",
            "text": "This is a very Family Friendly Establishment...\nThey are Family Owned for many Years!\nIf U don't see what U want on the Menu....\nJust ask and the Chef will prepare it for U!!\nI asked for Seafood Fra Diablo... WOW... Its was Delicious!!!\nWe told them that it was my Birthday,,, they surprised us with Cannolies !!!\nThank U Tony!!!\nWe will return soon!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaFp5MXBRRRAB",
            "text": "The same great  family atmosphere... Same incredible atmosphere with incredible food and incredible service!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhejhTU1RBEAE",
            "text": "My partner and I had dinner here and enjoyed an assortment of well prepared food. We started with cocktails and appetizers, had a salad in between courses, then wine and our main dishes and finished with coffee and dessert. We enjoyed every…"
        }
    ],
    "reviews_count": 68
}