{
    "name": "Piattini Café Bar Osteria",
    "place_id": "ChIJZ9ARhUP1wokR2hKIuOCz6wc",
    "grid": "BX6",
    "address": "2363 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.7,
    "user_ratings_total": 121,
    "phone_number": null,
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU01rUkNiekJsVkRkdVRWTllhMVJyUTJacVgxRRAB",
            "text": "Incredible food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVdtRnJZbEJmY0hSRFdrZHdVR290ZDJoVWIzYxAB",
            "text": "Food was fine but the service sucked. We were a table of 3 and they sat us at a small table for 2 that wobbled and spilled our coffee and water everywhere. Everyone else that came in after for a table of 3 got a 4 person table. We had to…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQmIzaEdORWRKTUhSR1ZXcE9ZakZhUjBOM2RrRRAB",
            "text": "The place is nice and seating outside is quite relaxing. The waiter was awesome. But all the food which we got definitely was frozen. I got linguine di mare and I could feel that shrimps wasn’t fresh. My partner got chicken parm and it was also definitely from a frozen meal. Frozen meals for 100$ dinner feels too much"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWS1YxSlZXbEZYZVZsdE9GRXhPVGt4V21sck5rRRAB",
            "text": "We had the chicken parm, lobster ravioli and penne vodka - not sure how this place has 4.8, the food is terrible, no flavour, barely any chicken in the dish and very processed. Service is great and the people are friendly but the food is not good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclZqUnFOa3ROZFRKMGNqTkhOREpzYjAxdFMzYxAB",
            "text": "the aperol spritz was so good (dare i say better than the one i had in italy?) our bartender was sooo nice!!! we had an amazing time here!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cU5VOVpSakpwV0ZwU2RtRndiMUJQTlVsa1JVRRAB",
            "text": "Great cocktails and lovely bartender"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbFkxazFjSEJvTW5WNWRWTTFRVWhmZVZaMFkxRRAB",
            "text": "A real Italian gem- beautiful food! Victor is a fantastic host, our server Eileen, I think is her name, made us delicious drinks to complement our meal. We felt very welcomed! The whole atmosphere,location and nourishing food makes it feel very authentic Italian. A very warming and memorable experience! Will be back!;))"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMWVTMWtRa2xDT1RCWU16WmtMVEV3WDFwYU9FRRAB",
            "text": "The food is like home cooking, they treat you like your home. I go there, I'm home... but better! If I could give this place six stars I would."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMclg2X2IycF95Z2tRRRAB",
            "text": "Certainly! Here's a heartfelt and detailed review that captures your exceptional dining experience:\n\n---\n\nReview: ⭐⭐⭐⭐⭐\n\nIf you're seeking an authentic Italian dining experience in the Bronx, look no further than this charming gem on Arthur Avenue. From the moment we stepped in, we were greeted with warmth and genuine hospitality, setting the tone for an unforgettable meal.\n\nThe service was impeccable—attentive without being overbearing, and the staff made us feel like cherished guests rather than just customers.\n\nNow, let's talk about the food.  The fritto misto was a revelation—light, crispy, and bursting with flavor.  It transported me straight back to the coastal towns of Italy, where seafood is revered.  The accompanying sauce was equally outstanding—rich, tangy, and the perfect complement to the dish.\n\nEvery other dish we tried was equally impressive.  The pasta was perfectly al dente, the sauces were rich and flavorful, and the ingredients tasted incredibly fresh.  It's clear that they prioritize quality and authenticity in every bite.\n\nThe restaurant itself is a cozy, intimate space that exudes charm.  Despite its size, the atmosphere is warm and inviting, making it perfect for both romantic dinners and family gatherings.\n\nWhat truly sets this place apart is its commitment to using locally sourced ingredients and offering daily specials that showcase the best of what the season has to offer.  It's a testament to their dedication to quality and community.\n\nIn my opinion, this is hands down the best Italian restaurant on Arthur Avenue—possibly even in the entire Bronx.  The only thing that rivals it is my mom's cooking!  If you're in the area, do yourself a favor and pay a visit—you won't be disappointed.\n\n---"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYVNrWnFtMnBYRUhBEAE",
            "text": "This place is a must try , the owner treated us like family , everything from appetizers and entrees and cocktails were absolutely perfect this restaurant is a gem on Authur Ave . 5 Star's if we could have given it more stars we would have especially Debbie Deb !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaXV3SnJUbE5YaGV3EAE",
            "text": "We came in on a relatively quiet Wednesday afternoon and were seated quickly. The food was good and satisfying but not mind-blowing, and the portion sizes were good. The service was excellent: they were friendly, responsive, and helpful. This past week in NYC we've had some really difficult interactions, so it was nice to be treated like a human being again.\n\nThank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKT3V6c1N5bXFpTHJRRRAB",
            "text": "I was very very Good, fantastic chef"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJWHh0WjJ2b3BDd3JRRRAB",
            "text": "I have never posted a negative review but after the worst dining out experience I've ever had I have to warn others. What went wrong? Fixed mother's day menu had no prices (should have been a red flag- our bad), all salads had many rotten slimy lettuce leaves, one meal was almost inedible (a crab-stuffed sole that tasted like a frozen dish, mealy texture, and smelled like rotten fish), the medium steak was clearly very well done, the bolognese sauce had an off taste (old?), our waters ran out and the waiter in this tiny place was nowhere to be found... only the lamb chops and lobster ravioli were reasonable quality. I would not wish food of this poor quality (and high price point) on anyone else. Run!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLZldzNldNMDVtVjhnRRAB",
            "text": "My family and I decided to dine in this restaurant for Mother’s Day. The service was fine but the food was awful. All the dishes we ordered except the baked clams appetizer were distasteful. To top it off, the pasta was cold and the dishes took about 50 minutes to arrive. Very disappointed"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJckwycmZ3EAE",
            "text": "Fantastic food and wait staff that made you feel like family. The locals hanging out at the bar introduced themselves and almost convinced me to move to the Bronx."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNk52dktBEAE",
            "text": "After a disappointing experience at the restaurant next door, we stumbled upon this amazing little bar, and I’m so glad we did! Despite being a small space, they quickly accommodated all 10 of us without hesitation.\n\nThe staff was incredibly friendly and welcoming, treating us like family from the moment we walked in. It’s rare to find a spot with such genuine hospitality. The drinks were fantastic, and the atmosphere was cozy yet lively. We had a great time, and it’s definitely a hidden gem. Highly recommend for anyone looking for great service and a relaxed vibe!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeU9iSENBEAE",
            "text": "Food was great! But service was super unorganized. 1 server for the whole place, outdoors and indoors. She was stressed out, running around, forgetting everything- her stress gave us an uneasy feeling the whole time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NnBlVzVRRRAB",
            "text": "Food, desert and drinks were capital."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNUx6amd3RRAB",
            "text": "It's pretty small place with seating at the bar and about 7-9 tables in the dining area. Went there after following the 4.9 rating. There was only one waiter and she was bartender same time. Make sure you look at their menu, It's pretty limited . We haven't had drinks so many comment. But food is definitely not 4.9 as it was reviewed.  We ordered calamari - they were super chewy and marinara sauce - it's not what you get most of the time. It's homemade - wasn't up to out taste.  Mussels in Diablo sauce - was homemade sauce as well - i would suggest kitchen to work on it. Overall, service was the best she could - but food.... I will spend my money somewhere i could really enjoy my food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd2JEdTFRRRAB",
            "text": "Delicious food. My go-to spot in Bronx Little Italy. Their vodka sauce is to die for."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeHZxVW9BRRAB",
            "text": "Everything was exceptional! We ordered the mussels with white wine sauce for appetizer as recommended by our server, as well as the lobster ravioli and shrimp francese. We finished off with the tiramisu. Everything was delicious and the service was particularly wonderful.  Highly recommend and will definitely be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eGZ1UXRRRRAB",
            "text": "Absolutely one of the greatest services I ever had in my life! Victorio and his staff were so accommodating! The pasta, and raviolis were cooked to perfection; and truly the best espresso martinis I have ever had in my life! Will definitely go back to this place and truly highly recommend it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MnNlYlpBEAE",
            "text": "Atmosphere is great cozy place to eat chef does a great job on the food.staff is great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LUttZDV3RRAB",
            "text": "Food was delicious and service was great. Would recommend for sure. Also, not overpriced."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQzdF9kVBAB",
            "text": "Exquisite service, genuine amazing server, angel! My party of 3 was extremely lucky to have him! Great service, it really made my dining experience worth it. Worth every penny, thankful to our server. He made great recommendations."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdmFpRnNRRRAB",
            "text": "Delicious food, great atmosphere, and service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzakl5Sl9RRRAB",
            "text": "Small place but the food was good. They had plenty of tables when we arrived and our group was able to sit right down. They have a full bar. The food was good, I enjoyed my pasta."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNEpqemtRRRAB",
            "text": "All around five stars. Small cozy place, small menu, big flavor. The staff were extremely polite and helpful, and the owner Bobby introduced himself and chatted with my wife and I for a short while. I wish nothing but the best for this lovely hole in the wall. A true gem on Arthur Ave."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdmZyZWt3RRAB",
            "text": "Perfection! Cozy warm atmosphere. Food delicious! All 3 of us raved about it. Owner checked in with us multiple times. A quick Lyft/Uber ride from NY Botanical Gardens (Bronx). Very clean bathroom."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcmNLXzJRRRAB",
            "text": "A Hidden Gem in the Heart of Arthur Avenue\n\nNestled in the vibrant Little Italy of the Bronx, Piattini Café Bar Osteria is a culinary haven that beautifully merges authentic Italian flavors with a warm, inviting atmosphere. Owned by the passionate and talented duo, Victor and Bobby, this gem on Arthur Avenue offers more than just a meal – it delivers an unforgettable dining experience.\n\nFrom the moment you step inside, the charm and ambiance of Piattini Café envelope you. Victor and Bobby have carefully curated every detail, from the cozy, rustic décor to the friendly, attentive staff that make you feel like part of the family. It’s this genuine hospitality, combined with culinary excellence, that truly sets Piattini apart.\n\nThe menu is a celebration of classic Italian dishes with a modern twist. Each plate is crafted with the freshest ingredients, sourced locally when possible, to ensure authentic flavors in every bite. Their small plates, or “piattini,” are perfect for sharing, making it an ideal spot for groups looking to try a variety of flavors. Standouts include the handmade pastas, bursting with rich sauces and perfectly balanced ingredients, and their seafood dishes, which bring a taste of the Mediterranean to Arthur Avenue.\n\nOne must-try is the signature “Bucatini all’Amatriciana,” a perfect blend of savory guanciale, tangy tomato sauce, and a touch of spice. And don’t miss the “Polpette,” tender meatballs in a rich marinara that are a tribute to Italian comfort food at its finest. Pair your meal with a selection from their curated wine list or a handcrafted cocktail, and you have a dining experience that feels like a mini-vacation to Italy.\n\nFor dessert, the Tiramisu is a masterpiece – light, fluffy, and expertly layered with rich flavors. Their espresso drinks also shine, perfect for a little pick-me-up to end your meal on a high note.\n\nVictor and Bobby’s passion for their craft is evident in every aspect of Piattini Café Bar Osteria, from the thoughtfully prepared dishes to the warm and welcoming vibe. Whether you’re a Bronx local or visiting from afar, this spot is an absolute must-visit on Arthur Avenue. Piattini is more than just a restaurant – it’s a place where food, family, and friends come together in true Italian fashion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYek5lQnB3RRAB",
            "text": "Love this place and the vib.. come for the clams oreganata and stay for dinner!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYczZhbXVnRRAB",
            "text": "One  of the best  meals I’ve had in a while,   Chill small spot . Atmosphere  and hospitality were perfect .  Have a little patience the espresso martinis are spot on but in high demand. Well worth the wait.  Looking forward to coming back . 👏🏽🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuenRfdW1BRRAB",
            "text": "The service is terrible I came in told the girl I wanted to order to go said okay pass by me multiple times I finally said hey I'm ready to order again said oh I forgot , then when she came back to take my order she said oh sorry I got nothing to take down your in she left came back finally she took my order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTZLbHlRRRAB",
            "text": "Very warm and lovely restaurant! Friendly staff and the food was amazing — the pesto and gorgonzola gnocchi was definitely a highlight 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmQtRkx3EAE",
            "text": "Went there with my wife & our family . We love the cozy layered back atmosphere, the service from bar to table & the food is amazing & the owners make you feel like family . This restaurant is a top 10 ! Must go !! Thank you for a great night !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa0lHU1F3EAE",
            "text": "We love this gem! Owners and staff make you feel like family! The food is absolutely amazing! Can’t wait to go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MU95WU1BEAE",
            "text": "Amazing food and great staff. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDlxTjhnRRAB",
            "text": "The food is amazing, completely authentic. Great drinks and cool, cozy vibe. Will definitely be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OVpXMmJnEAE",
            "text": "We came here for lunch on a Saturday and the food was incredible! The pappardelle and pesto gnocchi were so delicious and felt like the pasta was freshly made. Portions were large and the prices were super reasonable. Also the clams… out of this world! The staff was incredibly welcoming and attentive, made us feel right at home. I would 100% recommend this spot! Thanks Vincent and Bobby for a great experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Z3FtM3N3RRAB",
            "text": "Pasta was amazing! Friendly service + compliment appetizers = Great hospitality. Would definitely go back"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycDd1Zml3RRAB",
            "text": "Super restaurant familial!\nNous y sommes venus pour prendre des cocktails, la serveuse et le gérant ont été d’une gentillesse incroyable! Service impeccable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaDh1N2JREAE",
            "text": "Wonderful Arthur Ave restaurant with great food, warm service & atmosphere. Our server was super friendly and helpful. The food we ordered was delicious. Prices are very fair for high quality food.\n\nI would not hesitate to return on my next visit to Arthur Ave."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNDRYc2lnRRAB",
            "text": "INCREDIBLE! Sat at the bar for a meeting and had THE BEST BOLOGNESE and delightful drinks. The owner is attentive,  kind, and the chef needs a medal. Come here if your taste budds want to dance. A definite gem on Arthur Ave. I'm be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeVBlZ2Z3EAE",
            "text": "We had an excellent experience at this hidden gem of a find on Arthur Avenue in the Bronx. An excellent local feel with excellent food from start to finish. The bread and olive oil were maybe the best combo I have experienced in a long long time and the appetizer of the tomatoe and mozzarella was incredible. The clams were even better. For dinner I had the bolognese which I wanted more of when I was done. I enjoyed the food so much k wanted to hug the owners . I would recommend this place in a heartbeat to anybody looking to enjoy a great meal. What a lovely experience ."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6Z3VLZmJREAE",
            "text": "Victor is the best! He's so involved and on top of everything. Bobby is thoughtful and makes sures the resturant runs smoothly. Cesear is the best chef, the paperdelle is delicious. The best marinara sauce on Arthur Avenue, coming from a resident! This has become my neighborhood spot. 10/10 stars 🌟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNE95aW9RRRAB",
            "text": "Víctor is a dream come true and Caesar is the best chef in Little Italy! And we love Bobby for the ambiance. Vibes are up"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdWIyendBRRAB",
            "text": "It wa like my 1st tmd there with my husband, the place was wonderful , from the bar service food & cozy atmosphere. The owner makes you feel so welcome like family . Food was superb !! Looking forward to coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeF9mWFh3EAE",
            "text": "Amazing and delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMamRpM3FRRRAB",
            "text": "I loved the food & service & prices.  Small place but cozy & friendly.  Would recommend to family & friends as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeWRyWVlREAE",
            "text": "LOVE this place! Charming decor, welcoming staff and such great food. We had the Chicken Martini, the linguini with clams, the gnocchi with pesto Gorgonzola sauce and the chicken Parmesan; all were excelllent. Staff was attentive and friendly, and even gave us a courtesy aperitif! Definite recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd0s2VWlBRRAB",
            "text": "When you stop by just for one drink and end up staying for over 2 hours...\n\nWhat a welcoming and warm place this is. Fairly new on Arthur Avenue is this little gem with welcoming staff and an owner who makes you feel like family.\n\nThey have a great happy hour deal and very reasonable pricing. We had the cold antipasto platter for 2, which was the perfect snack we were looking for. We will definitely be coming back and thank you to Victor, Areaka, and his wonderful staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMlpIZ2xnRRAB",
            "text": "So glad I came across this gem! You walk in and feel as if you’re family! I’ve been thinking about the food since… I NEED to visit again and try more items off of the menu. Thank you Piattini for such an experience!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld1BPbk5REAE",
            "text": "What a cute place! So happy I stopped by to have a drink and bite to eat. Everything was great. I ordered the pappardelle pasta which was very flavorful and hearty. I also had the Aperol spritz which was made just right. Good portions sizes…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bVpiczRBRRAB",
            "text": "Stopped here for a quick bite.\nThe mussels fra Diavlo were excellent. The sauce hit all the right notes, I finished every bit of it. Just perfect!\nThe menu is rather small, but it was my understanding,  that you can ask for different dishes, and they might be able to cook them for you.\nGreat place, will come again if in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ2RMQldnEAE",
            "text": "New spot just opened up on Arthur ave and it's awesome! The wifey and I ordered penne a la vodka and pappardelle bolognese which were both amazing!!! They use only fresh, local ingredients so you can't go wrong with whatever you order. This is definitely a go to spot for us now!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb043ZzZRRRAB",
            "text": "Just had dinner tonight, food, service and wine were the best!\nNice to meet Victor and his staff!\nWe will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaHNUVmJ3EAE",
            "text": "When you walk into a restaurant and literally eveyrone greets you hello, you're off to a great start.  That is Piattini.  We walked in late with no reservation, but Vittorio, Roberto, and Michael treated us like family they'd known forever.  Now let's talk food.  This is a place where quality is elevated above quantity.  The menu is limited (see attached photo) because each dish is made with love.  They shop daily on Arthur Avenue - fresh pasta, meats, vegetables, Italian specialty products.  We had the mussels fra diavolo, slighty spicy and bursting with real San Marzano tomatoes.  More bread please.  I had their signature dish - Pappardelle Bolognese.  The pasta was cooked exactly to my request (they asked how I like it done).  The ragu was was Vittorio's recipe and chef Cesare does it to perfection.  It is one of the best I've had.  My wife, who didn't want pasta that night, stole a good portion.  She had the chicken parm.  Vittorio made fun of her for the \"classic\" Italian order because he really wanted her to try the Scarpariello (next time).  It was very good.  The sauce was among the best we've ever had, the chicken good (though I know a chef in Florida who somehow can make it more tender).  Vittorio confided that he is trying to source a better chicken for the dish.  We shared a bottle of wine and then, just when you thought it could not get better, Roberto made the best Cappucino (would you like a little powdered chocolate or cinnamon on that?) and we had a coronetto, warm, stuffed with pistachio crema.  Just wow.  And their prices are extremely reasonable to boot.  We're from Jersey, we stopped in after the holiday light show at the NYBG and we absolutely will be back, it is worth a drive and deserves every bit of the 4.9 rating."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsenBiVUhREAE",
            "text": "Caffè espresso stupendo, davvero davvero buono.\nMarco e Tracy hanno iniziato l'attività il mese scorso portando la \"colazione italiana nel Bronx\".\n\nIn bocca al lupo ragazzi 🤞"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LWN2WThnRRAB",
            "text": "Truly delightful - it’s like no other! We popped in to get out of the rain with the intention of having one quick drink and we didn’t want to leave. We ended up staying and enjoying exceptional service, amazing food, quality cocktails and…"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKemZYZjJBRRAB",
            "text": "Siamo entrati consigliati da un italiano del posto……… aveva pienamente ragione.\nA primo aspetto non lo diresti ma sono stato qui con la mia famiglia, ed il cameriere è una persona molto gentile ed educata ci ha fatto sentire a casa. Poi è arrivato il proprietario Vincenzo ( napoletano doc ) e siamo rimasti lì dentro tre ore in piacevole compagnia è un ottimo cibo.\nSpero di rivederlo a Roma.\nConsigliatissimo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOHMyMFB3EAE",
            "text": "Had lunch at Piattini for my birthday and could not have asked for a more perfect meal. The restaurant is intimate and the owner, Victor, is fantastic. Everything we ate was spectacular - burrata and prosciutto, risotto, lobster ravioli, linguini and clams. All ingredients are sourced fresh.. such a special place. Can’t wait to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc0xxNVVBEAE",
            "text": "Randomly walked into this little gem.\nThe cocktails were amazing and the staff makes you feel like home. Love the food. My favorite is “The Arthur Ave” sandwich.\n\nThis place is a huge must. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNXZ5bmdBRRAB",
            "text": "Great food, great atmosphere. I haven't had a bad dinner yet. I've been coming for 6 months on and off. Great service. They make you feel like family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOTRYYzV3RRAB",
            "text": "The customer service and the attention was great. Good area and the atmosphere but the food was terrible. My husband and I loved Italian food and we can tell about it, maybe they thought that we can not taste the difference of the food. My…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCX29Hak13EAE",
            "text": "I come here often and it’s my go to for all things drinks, coffees, game watches, great music and atmosphere, and even greater people!! The pasta is amazing and unmatched. I definitely recommend coming here, whether to study with a nice and…"
        }
    ],
    "reviews_count": 65
}