{
    "name": "Tra Di Noi",
    "place_id": "ChIJYYDOMof0wokRvCMy2r_-3S0",
    "grid": "BX6",
    "address": "622 E 187th St, Bronx, NY 10458, USA",
    "rating": 4.4,
    "user_ratings_total": 523,
    "phone_number": "(718) 295-1784",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlRtZExiRGhMUnkxS1VtcElSSGM0WWtSclZVRRAB",
            "text": "The food was acceptable but pricier than it should be.\nStaff were rude and had attitude. They neither listened nor communicated, and charged us extra. Also they weren’t happy to have children around. They didn’t serve water or silverware for children and constantly gave us looks."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GT1VrVldWVXAxZWt4dGFFNW9lazFEY0RkdVVrRRAB",
            "text": "Their food is good but their attitude is not. There didn’t listen properly when we ordered, so we got an extra dish we hadn’t ordered. They charged us extra to share a plate without telling us first. And they seemed upset that our toddler spilled food on the floor. Maybe they were not happy that we brought kids at all, as the kids were not provided with cutlery. Generally, they were quite rude and we did not feel welcome as a family with kids. It’s a shame, as I really wanted to like this place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb2EyOVRlbVJQTlZaRmFteDRTbk0wWmxGcUxVRRAB",
            "text": "The food was amazing, the owner was fabulous and real. I will be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUE9HbHJZbVJOWkMxVVRIQnVWVFJ1UVhSaVUwRRAB",
            "text": "Phenomenal, Exquisite, Delicous. The best Veal Limon I have experienced. Traditional home-cooking style meals. Quick service. Quaint but sophisticated. Very friendly staff. 10/10 reccomend this hidden gem."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc1JuazVSVkJSYjA1a2VWQlJZMnB1ZFcxNmNXYxAB",
            "text": "Chef was extremely rude\nservice rude - waiter rolled eyes when we asked a question\nfood mediocre and small portions\nNo tiramisu or vodka sauce"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeGNFcG5iRFppZWtOclVIbFVTVlJMUVRSMVQyYxAB",
            "text": "Everything is always perfect"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUkxVZG9TVFpaWjFBMU1FSjZWM1JzYUhOVk9XYxAB",
            "text": "Place is garbage,  small shoebox of a place and they really think their food is gods gift to earth the way service works.  Your food is nothing special.  Any other Italian restaurant is just as good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dU0zazFOR2QzWTNSZldIQlpaMlY1YzBSa2JWRRAB",
            "text": "Lovely little , family-owned restaurant off Arthur Avenue. Prosciutto and melon appetizer was lovely as was the light tomato sauce on the aranciani. Main course was delicious, light gnocchi with just the right bite with a fresh tomato aauce. Service was welcoming and helpful. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCamVGRnhkM1JxTUhsaVgxcGhjbFk1VkRBMVdXYxAB",
            "text": "Not recommended for a welcoming, leisurely meal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM2MydEhjVkpQVVdsMGNVUklZbEY1VFVsSlJtYxAB",
            "text": "A nice find just off Arthur Street."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeVQzVlBia3hTYXpoS1NVZ3lRekJMVUVGT1FtYxAB",
            "text": "Not sure where to start so many things were off. The wait staff is very busy and not attentive at all. My friend and I ordered 2 appetizers and a lasagna. We were sharing all the dishes. This $61 order apparently was a huge disappointment to the staff.\nAll 3 dishes were brought out at once as opposed to having appetizers first. We repeatedly asked for some bread and some lemons for the water. No lemons ever arrived and after 3 requests for bread we were told we did not order enough to warrant a piece of bread. We weren’t asked if we wanted desert and were just given the check. This is Arthur Avenue there are plenty of other better places to go to eat. Oh, the food, fried calamari was just average, salad also, the lasagna was good. It was very clear we were not wanted."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NFpGVjFVMU5OWkdGTWFUbE9hbEYyYmtkRVQyYxAB",
            "text": "Delicious and totally legit – I could eat here every day.  The waitstaff are extremely attentive and knowledgeable. The old-school tablecloths and classic tunes create the perfect nostalgic vibe. Easy to hold a conversation, and overall a great experience every time. Whether you’re popping in for a quick lunch or kicking back for a chill dinner, Tra Di Noi always hits the spot. Totally worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNWFrbEtObDloTkhBM1ZsVmtiSEV6UW10V2NYYxAB",
            "text": "Pretty great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WZlpFVm1jbEpWZDJSWlZucFhZVTh0U0djek5HYxAB",
            "text": "Food was fantastic.  Service was great.   The food is worth the money."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ09EUmZZVGxhV1VsclNIZGZiblZrZDJOME0xRRAB",
            "text": "Went here for the first time today to have a leisurely lunch with my parents. We sat by the window, so we got to take in Belmont’s street life while enjoying the best Italian-American food I’ve had since living in NYC. Everything was prepared simply and packed with flavor. The staff was very attentive, and the owners, who were both sitting in the dining room the whole time, were very welcoming."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacFVIRXpRVFZSU1RrMmFrRTFRMUI0WkVGQlRFRRAB",
            "text": "Great food, excellent service, great atmosphere. I would eat here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVE5XbEVTa2cwU0c1b1JFMW9kM2g2YjA1WGVYYxAB",
            "text": "Old school authentic Italian restaurant with delicious food, wine and fair prices"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOVGJoSmVpNTdQN1FREAE",
            "text": "My friend and I were looking for a place for lunch while shopping on Arthur Ave. We go often and had never eaten there. We will never eat there again. 3 strikes you're out we walked in and were told we had to sit in a certain table even though we asked if we could sit elsewhere it wasn't crowded. Then they gave us 2 pieces of bread and when we asked for more we're told only one basket or table, strike 2, they brought us a small plate of green beans and potatoes for both of us and thru it all the waitress was rude and not welcoming. 3rd strike was when we got the check we asked if we could split it on a credit card, not allowed there, we do it\nall the time!\nFood was just ok but with all the great restaurants you can choose from, don't go there! Wish I had reviews before !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbkI2WjNCbi1MWjdnRRAB",
            "text": "No better place to go to. Great food great atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdFJUZHRYMDVhZEZwRlVtaERYMmx1Vm5oRllYYxAB",
            "text": "We have been coming to Tra Di Noi for twenty years, usually for special family gatherings. I know of no other restaurant in NYC that has been so consistently excellent for so long. This is a mom and pop shop that with mom running the floor and pop running the kitchen. Old school charm.  We came with a party of 12. For appetizers we ordered calamari fritti, mussels marechiaro, and the melon prosciutto.  All delicious especially the calamari. For mains we had the soft shell crab, gnocchi, pork chop and sole meunierre specials as well as the veal scalloppine, polla scarpariello, rigatoni and linguine. House potatoes and string beans as sides.  Everyone raved about their dishes. Dessert was equally fantastic including perfect Italian cheesecake!  You need reservations during peak times. We love this cozy warm spot off Arthur Ave and will keep coming back as the food is to die for!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMYXRsb2pjdU82OGpBRRAB",
            "text": "I dined here today with some of my friends for lunch. We walked from the botanical gardens and we were famished. Three of us ordered stuffed artichokes. I have to say the artichokes had absolutely no taste. I don’t know if these people know what garlic is. They were horrible. We shared an order of soft shell crabs, which were very good. We were brought over a platter of potatoes and string beans, which were very good and the other person in our party had pasta with broccoli ran which she said was just OK. We told the waiter that the artichokes had absolutely no taste, and he told the chef who was sitting at the table right behind us. We thought the chef would at least come over and say I’m sorry that you didn’t like the artichokes but we got nothing. I’ll be sure never to dine in this restaurant again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUG5qdlAzbVplWDFRRRAB",
            "text": "A lovely lil restaurant with a lovely homey atmosphere. Food was delicious and fresh. The staff was helpful and knowledgeable. A great family owned establishment. Cannot recommend enough."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUzF0WkhNMzhlcy1BRRAB",
            "text": "The best of the best!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOQzN1TGpYc2JuX3dRRRAB",
            "text": "Party of 2 Dined here for lunch. We arrived for our lunch reservation at 11:50 We were told to wait outside until noon.Hostess could not seat us prior to noon. We waited outside for 10 minutes. We entered the restaurant and were seated promptly. The waitress/hostess immediately came over to take our drink order. She seemed annoyed that we only ordered Pellegrino. Waiter quickly returned with Pellegrino $8 and our menus. Hostess  gave us just a few minutes and then she returned to take our order. We explained to her that we had not even opened the menus. Again, she returned just a moment  later. And stood there while we looked at the menu. We felt rushed. There was no one else in the restaurant. She never explained the specials. We placed an order of one appetizer and one entree,\n\nWe were told they would be a sharing charge $3 . We said that would not be a problem because we did not want to eat such large meals at lunchtime. We were served an appetizer of a house salad, which consisted of iceberg lettuce, three pieces of tomato and red onion $14.  Our entrées of one pork chop with just a few  jarred peppers was then served. A small plate of vegetables, consisting of roasted potatoes, and string beans was served as a side. . The entrée of one pork chop with sharing  charge was  $36. No one came to check on us.Bread was not served.  Again the same waitress/hostess appeared and asked about dessert. We told her we would not be having dessert today. She just walked away. Did not say a word to us. A waiter came back placed our bill on  Table. He did not say thank you. We paid our bill and left. We were very disappointed as we had seen good reviews of this restaurant. The prices seemed high and the service was poor. However, what’s most egregious was We truly felt rushed and unwelcome . Please note there was one other table of patrons when we left. The restaurant was empty. That should say some thing to the owner on what should’ve been a busy Saturday afternoon. ."
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQNm12UDJNdzd1Q053EAE",
            "text": "Muito bom! Ambiente agradável e comida saborosa!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJX3Rxdzh3RRAB",
            "text": "If you find yourself around Arthur Ave seeking for a good Italian dinner, look no further than Tra Di Noi. From their daily specials to the staples on the menu- everything is delicious. I could come here 100x and never tire. Buon appetito!"
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ2s3T2JuMnNmN0VnEAE",
            "text": "MALEDUCATI! SCONSIGLIATISSIMO!\nEravamo in 4 , dopo aver ordinato 2 fritti di calamari 1 bufala e 1 piatto di pasta ci viene detto che dovevamo ordinare di piu PER FORZA! Perché loro devono lavare le tovaglie e i piatti, quindi o si mangia antipasti primo secondo e dolce oppure non si mangia lì! Vergognoso"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbXNMU1F3EAE",
            "text": "Best authentic family owned restaurant. It never  disappoints! Pork chops, rabbit and sole are a must. Order off the specials. Best simple marinara sauce, which says it all"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb1ptVUxREAE",
            "text": "by far the best food in little italy period. charming little restaurant\ngreat service a must for food lovers"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa3B5N1N3EAE",
            "text": "I went with my girlfriend and her son for lunch.  Wow! These people were beyond rude. They offered glass bottle of tap water or sparkling water. Because my GF  is the only one that drinks sparkling water I felt the need to ask if there was a charge for regular water and small amount of sparkling water. The rude bus boy stated rudely “ And what restaurant doesn’t charge for that”??  Not necessary to be rude or sarcastic, just give me the price. Then came the rudest waitress. I knew this was a mistake of a choice for lunch which ended up costing us $110 for the smallest portion of bake clams, no extra bread, two main course which were mediocre. I should have read all their poor reviews. I should have seen how empty the place was also. People don’t lie about this stuff. Food flavor can  be subjective, but service and rudeness can’t be a fake make up story."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa29pT1RREAE",
            "text": "This place was horrific in many ways. It was very expensive for the amount of food they serve you. To start they give you “ONE” piece of bread per person and if you dare to request more they charge. It was three of us and only gave us 3 slices of cold bread which is fine, but when finally our food came out and I asked for a little more bread the rude waitress said “there a charge, didn’t the bus boy tell you that?” I asked the bus boy twice and he kept saying yes !yes with nothing ever happening. Finally I had to call the waitress over twice with a hand signal. The food is very expensive and you don’t even get pasta with the chicken Parmesan or any of the dishes, their sauce to go on top of the chicken Parmesan was not good at all and was just slapped with a piece of deli mozzarella cheese, not even nicely melted. This dish was not worth $25 at all. Come on!! Pasta is cheap and so is bread.  Not worth the $130 bill for 3 people and no extra bread, no pasta. That was an expensive lunch bill and we didn’t even have any drinks. The waitress never came to see how was everything, she was totally dismissive and just sitting with the owner on a different table chatting away. Not a good Italian restaurant at all and I have been to so many good Italian restaurants in the city with in the same price budget, definitely not this one. Rude and cheap people. Will never have my business again."
        },
        {
            "date": "7달 전",
            "language": "it",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eWNyQmhnRRAB",
            "text": "Sono italiano e qui non mi sento per niente rappresentato.\nMaleducazione e scortesia qui sono all’ordine del giorno, cibo mediocre e prezzi esorbitanti.\nLa signora antipatica ha aggiunto la mancia da sola senza comunicarcelo.\nQuesti l’Italia non sanno neanche dove sia!!!!\nNON CONSIGLIATO"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OTktTkd3EAE",
            "text": "Delicious early dinner. I had the sole special with roasted potatoes and delicious string beans. My husband had the salmon special with spaghetti. The red wine was excellent. The service was on point and the atmosphere is comfortable and lovely! Highly recommend!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMmFEMG9nRRAB",
            "text": "The very best of Arthur Ave!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNGRxTE5BEAE",
            "text": "If you can get in?  Do it.  We got in late Afternoon on a Saturday, and had a gorgeous and leisurely meal.   Roman Artichokes, Osso Buco in risotto, linguine vongole, the best Pork Chop on the planet, and a Pappardelle with Truffle sauce that was OCF THE CHAIN delicious..... Absolutely incredible experience in the Arthur Avenue neighborhood."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMW9lb2RnEAE",
            "text": "Pork chop and the tiramisu were some of the best food I’ve had in the city. Worth a visit"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOXZQNGJBEAE",
            "text": "So glad i could come back up here. This spot is dope! ❤️⚡️❤️⚡️❤️🤌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcWUzcHdRRRAB",
            "text": "We are shocked by how rudely we were treated at Tra Di Noi today.  We had visited the restaurant several times before and had enjoyed it in the past. We ordered two dishes to share, the unfriendly waitress immediately informing us of the extra fee for sharing. Ok.  Bringing out both dishes at the same time, we asked if one could be kept warm. Completely indifferent to our request, we ate the cold second dish, inexpertly prepared, mediocre at best.  When we requested Parmesan for the pasta the equally rude bus-boy refused to leave the small container at the table, insisting on putting it on the pasta even though my partner requested no cheese.  The staff seemed to take an odd pleasure in being unaccommodating and unwelcoming.  When we attempted to pay the check with 2 credit cards, they insisted payment can only be accepted on one credit card; again, we’d eaten there before with this never having been an issue.  To top off the hostile vibes we were getting from the staff, the cook/maybe owner came over in his stained apron to request that we leave immediately to “prepare for the dinner service,” rudely insinuating that our presence was an inconvenience. I noticed the waitress enjoying the encounter wearing a smug smile.  Wow - what an unpleasant experience we’ll certainly never repeat!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LVBfOURREAE",
            "text": "I wouldn't recommend eating here – the food is nothing to write home about and the service made us feel like a nuisance.\n\nThat being said, the ambiance is lovely."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M0lUTmVBEAE",
            "text": "I never write reviews, but feel that I must. Although the food was good - not great - the RUDENESS of the woman in charge was beyond belief. There was a hub-bub at the table next to us and the woman in charge was chastising them because they didn’t leave a big enough tip. Then, my adult son was told to sit on the other side of the table (we were a party of 3) to make it easier for the waiter. WHY put a chair in a position where you don’t want anyone to sit in? The SECOND we were done with dessert, it was whisked away - there was the last spoonful of  gelato I had so satisfyingly wanted to have - but no! The check was paid during dessert and as the dessert was whisked away, the rude woman told us to leave because there was another reservation. We were there a little over an hour. On our way out, as I was getting my coat from the very cramped entrance way, a customer was standing there and I said that I hope she doesn’t get yelled at as we did. I could not believe that she said she already was yelled at for being early for her reservation. Unbelievable"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbjZHUUZREAE",
            "text": "True Italian dishes in Little Italy.  Second to none"
        },
        {
            "date": "11달 전",
            "language": "it",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc3NTTTJRRRAB",
            "text": "Due piatti di pasta 60€ tra l’altro scadenti e non di qualità. Servizio pessimo e sgradevole\nAssolutamente da evitare\nCe ne sono di più carini nel bronx"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdk52Q2ZnEAE",
            "text": "Have had a dozen good meals here previously, but this one was poorly prepared and almost unrecognizably sub-par for me and my husband. Osso buco meat seemed like it wasn't cooked in the sauce. Sauce was like a diner brown gravy, no aromatics, no tomato. Risotto was supposed to be saffron but no saffron or any other flavor present. Apps were disappointing too. Did they change chefs or run out of money?"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbk9fV1p3EAE",
            "text": "A lovely Italian restaurant in the heart of Little Italy. You are warmly greeted by very experienced personnel who are glad to help you understand their many dishes. Daily specials abound and you should order “Italian style”: appetizer, pasta and then an entree. Handicap friendly & street parking. Reservations recommended."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdnFUZEVBEAE",
            "text": "Nothing special about the food here. Server was good but house was abrasive and unwelcoming. Place is clean and lively"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd295c1FREAE",
            "text": "One word to describe this place\nAwesome!!!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMjdUdHJnRRAB",
            "text": "We arrived a bit early for evening service and saw a guy hand making tortellini on the way in - great sign. I ordered the Gorgonzola pasta tortellini because that’s what he was making and it was delicious. We ordered a few different dishes to shares and they were all fresh and well flavoured. Good wine and good service too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib2IyUmZBEAE",
            "text": "Food was excellent and the service impeccable. Will definitely go back again!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNS1YcVZREAE",
            "text": "I went here with my partner during a spontaneous trip into Little Italy. After looking at a few options, we settled on Tra Di Noi. We did not have a reservation but the staff were very kind and accommodating. The food was wonderful. The atmosphere was warm and welcoming. The staff were attentive, informative, friendly and helpful.\n\nHaving eaten there once, I would make a trip if I'm anywhere near NYC just to come again. I also recommend walking around the neighborhood afterwards as the little bakeries are very good as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbHJQYm1RRRAB",
            "text": "Wonderful experience in this family owned trattoria. Food was truly exceptional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaU1iWERnEAE",
            "text": "One of the all-around best places I've eaten in NYC.\n\nOrder the specials. They have a basic regular menu, but the only dish I've ever seen at this place that was less than stellar came off the regular menu, and the specials are always delicious. I'm still hoping to someday again come across the thing I had with fava beans my very first time there.\n\nUsed to live nearby and it took me a bit to get the hang of making reservations in advance, but they were always so kind and professional and found a way to seat us, even as they begged us to make a reservation next time (which we finally did). Staff still remembers us even though we moved boroughs and now only go every 8-12 months. Can't get there on public transit without transfers and walking, but yes, it's still worth leaving our borough."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaUpPMEN3EAE",
            "text": "I was blown away by this magnificent authentic Italian restaurant!!  It's everything you can imagine....all Italian from the table clothes to the decor, the friendly welcoming service!  A chalkboard of specials; handmade burratta, pasta I'm still dreaming about.  Wine selection is superb, get a bottle; you can take any left home with you.  I don't live in NY but it's worth a trip to Bronx, NY to enjoy a meal here.  An experience I can't wait to come back to.  Thank you for welcoming us without a reservation."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyZ3RHb1JBEAE",
            "text": "Love the small town feel you get from the moment you enter until you leave. This place is all about love. I'm not a big salt guy but in this case it needed it but besides that the food was delicious but for the show stopper was the cheesecake. One of the best I've ever had. It was airy but most importantly it wasn't sugary."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNTlYUWl3RRAB",
            "text": "Restaurant au décor des années 90. Service correct. Nourriture correct, les sauces étaient très bonnes. Je crois que mes attentes étaient trop haute avant d’arriver et que j’ai peut-être fait les mauvais choix pour moi."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aXVDaXpRRRAB",
            "text": "Had a terrific meal with friendly service. This place is still one of the best in Arthur Ave area. Quality meal at a fair price, not tourist overrun or glitzy, just great Italian food and the servers were very friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOGVDVmFREAE",
            "text": "Great Italian spot - lots of specials that seem to rotate (server mentioned meatball dish was only available on Sunday), nice ambiance, and all our food was good.\n\nThe burrata was fantastic, and we really enjoyed the Gorgonzola ravioli. The dishes are quite expensive compared to the rest of the area, but delicious nonetheless. Definitely recommend as part of exploring the great Italian food in the neighbourhood!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncnIzRU9BEAE",
            "text": "Best Italian food in Arthur Ave area. They serve home cook meat on red and white table cloth. Don't forget to check daily special board."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bXIzU0JBEAE",
            "text": "Just a short block and a half walk from the busting Arthur Avenue you'll stumble upon this gem of a restaurant. Chef Marco and his wife Laurie are the most welcoming of hosts. The food speaks for itself. Burratta, made in house, is delicate and flavorful. Pastas are cooked to perfection and seafood is of utmost freshness. The service team is phenomenal. Matilda and Todd are extremely welcoming and truly accommodate you! True Italian restaurant makes you feel like your in Italy! Always a pleasure when I'm here. FYI it's BYOW (bring your own wine- corking fee is $20)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeWZmQXJRRRAB",
            "text": "The Bronx Little Italy has no shortage of Italian American spots that serve a pretty consistent menu. Tra Di Noi is a bit different. Sure they have the classics, Parms and Pastas, the specials board is where the magic is and where you have the option to try something different.\n\nThe atmosphere is great, with the classic red and white tablecloths. There is ample outdoor seating. The wine is also very reasonably priced. Reservations over the phone are recommended."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcE1pNXBnRRAB",
            "text": "The food was Excellent. The owners and staff were friendly and made us feel very comfortable. Will def go again. Thank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHFuMVFnEAE",
            "text": "We have true love for Tra Di Noi. The specials board or the menu, you will be swept away to childhood memories or Italy 🇮🇹 this visit we indulged on seafood salad, mussels, the burrata (!!), veal Marsala, veal parmigiana, and rigatoni with…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2LWFIYWtnRRAB",
            "text": "One of the best Italian dishes I’ve ever had in NYC. Will certainly return for the meatballs on Sundays. Thanks for the hospitality Lauri!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsby0zcmRBEAE",
            "text": "I recently had the pleasure of dining at Tra di noi, an authentic Italian gem nestled in the heart of Little Italy. From the moment I stepped through the door, I was transported to the charming streets of Italy, and the culinary experience that followed was nothing short of extraordinary.\n\nThe Fettuccini Carbonara was a revelation, perfectly al dente pasta coated in a velvety sauce that harmoniously blended eggs, cheese, and pancetta. Each bite was a symphony of flavors that left me craving more.\n\nThe Fried Calamari was a crispy delight, expertly seasoned and paired with a zesty dipping sauce. It showcased the chef's skill in balancing textures and tastes, making it a delightful appetizer that set the stage for the feast to come.\n\nThe Octopus Salad was a refreshing surprise, featuring tender octopus combined with crisp vegetables and a citrus-infused dressing. The medley of flavors danced on my palate, creating a perfect harmony of the sea and garden.\n\nThe attentive staff at Tra di noi added to the overall experience, providing excellent service without intruding on the intimate atmosphere. The ambiance was cozy, with an authentic charm that complemented the exquisite cuisine.\n\nIn conclusion, Tra di noi is a culinary haven for those seeking a genuine taste of Italy in the heart of Little Italy. The Fettuccini Carbonara, Fried Calamari, and Octopus Salad are not just dishes; they are masterpieces that showcase the passion and expertise of the kitchen. If you're looking for an unforgettable dining experience, Tra di noi is the place to be. Buonissimo!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdk1fQ2hnRRAB",
            "text": "Each dish is a masterpiece, crafted with passion and authenticity. From classic pasta dishes bursting with flavor to the mouthwatering ossobuco every bite is a celebration of Italian cuisine. The attentive staff adds to the experience, providing impeccable service that makes you feel like family. The Cannonau was fantastic as well. This will always be my go to in Little Italy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoenUtZ3VnRRAB",
            "text": "Everything at Tra Di Noi was phenomenal. Service was excellent and unobtrusive and the owners are lovely people. Highly recommended."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdXUyUEtREAE",
            "text": "This place is beautiful!\nAmazing staff ! I’ve never went to a restaurant and felt so much love ! They care about how you feel and make sure you are happy and satisfied! I will keep coming !"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaHJicWdnRRAB",
            "text": "Fabulous service,  excellent food and a fantastic dining experience.  Will definitely be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdW92djJBRRAB",
            "text": "Excellent and authentic Italian food, mostly siciliana. Staff makes you feel like family"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ2REN3JBRRAB",
            "text": "Visited this establishment on my birthday and I can definitely say it did not pass the vibe check. Nobody was inside but since the reviews were good we wanted to try it for an appetizer and a glass of wine. Once we ordered all eyes were on us. We ordered the clams and they were average at best. Once we finished our 3 glasses of wine and one appetizer that was literally 5 clams we kindly asked for the bill. We were met with immense hostility and were told we needed to order a main course in order to be able to pay and leave… we said we were not told that when we initially sat down and that we just wanted to pay and leave. The server blamed it on the owner and we requested to speak to him. Once he came over all we got was weird excuses as to why we had to order the main. He told us he had so many reservations and we were taking up a table when there was LITERALLY one other table and we were literally asking to leave. The owner stormed away and we asked for the bill again and waited for another five minutes until we were literally forced to have to go up and ask for it. If you want us to leave because you’re so busy then give us the freaking bill. Food was mid service was despicable. For an 80 dollar meal go to Enzo’s."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3FxbXNRRRAB",
            "text": "This is an excellent and authentic family owned Italian restaurant. The food was top notch and the service was pleasant and personable. The bread on the table was so fresh and crusty, loved it. Our veal entrees were perfection. Highly recommended."
        },
        {
            "date": "수정일: 1년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbXBpQUZnEAE",
            "text": "ニューヨークに行くと、1度は立ち寄るイタリアのカフェ。\nショーケースに並ぶお菓子はどれも素晴らしい。"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoanJUZXVnRRAB",
            "text": "Really love this place.   Had Trippa alla Romana and it was just like in Rome.  Service is always A+.   Highly recommend this cozy gem."
        }
    ],
    "reviews_count": 72
}