{
    "name": "Ajo y Oregano",
    "place_id": "ChIJz_zvS770wokR2G-DXoskJP0",
    "grid": "BX6",
    "address": "1556 White Plains Rd, Bronx, NY 10462, USA",
    "rating": 4.2,
    "user_ratings_total": 2836,
    "phone_number": "(347) 657-1201",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVmVsWmxjbDlETkRGdGIzUkZaM1pSTm01RlkzYxAB",
            "text": "No soy de dar quejas, pero hoy lo hare porque pase un momento desagradable en este lugar, ya e visitado el otro local y siempre bien menos la espera Que siempre es larga. Hoy fui a white plains. Venia del aeropuerto y estaba cansada y tenía deseo de comer comida criolla, cuando llegué me dijeron que había espera, note que había una familia de 3, 2 adultos y un bebé, en mi caso éramos 4, pero nada esperé algo normal, sentaron a la familia que estaba antes, y seguí esperando luego veo que sientan a otro grupo que estaba esperando en la barra, ya yo tengo 45 minutos esperando, y cuando viene un joven muy educado y nos lleva a la mesa, viene otra persona que fue la que nos recibió y nos hizo parar, porque la personas de (2 y un bebe) ya sentado en una mesa por más de media hora antes estaban esperando. Creo que lo correcto no era pararnos porque ya ellos estaban sentados. Fue algo muy mal manejado por el personal y para colmo las personas a la que le dieron la mesa utilizaron las 2 sillas para poner sus chaquetas. Otra cosa las propinas incluidas se aplican después de 6 personas y cuando te traen la cuenta te dejan saber, en este caso pusieron la propina, no lo dijeron y me pusieron la opción para más propina, cómo no me di cuenta también le di más propina."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MmFTMVpjbWhwZEhsU2JuSjZRMU5wY0ROMlJrRRAB",
            "text": "Perfection"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSU9WZENWRzVXV0haRFZYUkRVRzEwYUV0c01VRRAB",
            "text": "My mom spoke about this place for months. I decided take her for her bday and what happened to us surprised me. Surprised me because I have been to the other location and they have good food but this place  they served us old food. I order churrasco rice and beans and my mom had chicken rice and beans. They gave me everything old food from yesterday and when I told them that the food was old they ask me if I wanted my food  heat up the food for me, mind you we waited over 30 min for are food. I will never go here if I was you"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFQxQjVUM1ZaZVVWNFIzbEZSVEo0YmxveU1tYxAB",
            "text": "The food at Ajo y Oregano actually tastes really good, but the way they handle the bill is very misleading. When the check came, I didn’t notice they had automatically included a tip, even though it was just two people in my party. I don’t even know if that’s legal for such a small group, and they never mentioned it. It is my understanding that automatic gratuities are usually only added for large parties (6 or more people).\n\nThen, when they brought over the card reader, it still gave me tip options of 18%, 20%, and 25%, and the staff stood right there waiting while I chose. Since I didn’t realize the bill already had a 20% tip included, I ended up tipping another tip of 20% meaning I unknowingly tipped twice, leaving around 40% total.\n\nMy total came out to $78 for two plates of rice, chicken, maduros, and a small mofongo appetizer, which is just way too high. When I went back to explain what happened, they told me there was nothing they could do because the payment was already processed.\n\nThe food is tasty, but the billing practices are very sneaky. Make sure to check your receipt carefully before adding any extra tip."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV1ducFNSWFpUUjBkdVUyTlpUVGRzZGw5Tk9FRRAB",
            "text": "Food is amazing , decor really though through and every detail shows up beautifully but the service isn’t great . Servers come to you once in a While and food took forever . We were the first ones there and the last ones to get served"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcmRDMTFSR1kzVVhSTVNsUm1kbTh4YUZKa04yYxAB",
            "text": "Excelente - mi única queja es que éramos 3 y todos comimos en tiempo diferentes porque la\nComida llegaba con 15 minutos de diferencia. Lo cual es fatal. Pero la comida es muy rica y los precios muy justos."
        },
        {
            "date": "수정일: 3주 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdDZiUkRBEAE",
            "text": "Eso mondongo estaba excelente"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQ2JERlVWRVpuTUZaTE4wMVhlVVowUTNOU1ZtYxAB",
            "text": "Is not nothing to brag about."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeWVtbDRjR2wzWDNSTldEbFJhamRmYXpBM2RHYxAB",
            "text": "Primera vez yendo a ese restaurante, viaje desde Boston a NY y fue el primer sitio donde fui por los videos que veía en las redes, buena comida el único problema que tuve fue que mi mofongo no estaba caliente del todo supongo por la salsa pero obre todo muy buen sabor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVFZWZ3dVbWM0VlVKSGJsQmxRMFozVWxoYVNsRRAB",
            "text": "I love this place!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd1dIQmxNSG80VFV4R2NGQndWMnQwVjNGZlZIYxAB",
            "text": "Food is Great. Been here many times"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd1MzcE5SRWt5YzBKRmNIaGlSWFpWUVRrNGJuYxAB",
            "text": "Me da pena dejar este review porque la comida de este restaurante es riquísima pero lamentablemente el servicio es pésimo!\n\nPor favor dueño/gerente de este restaurant ponle atención a su servicio al cliente. Específicamente el servicio dado por el personal que trabajo el sábado pasado en la noche."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaGNuWnpMVnBvU2pZME1YZHZZMjVXVVdoNldIYxAB",
            "text": "Although the food is good, their delivery service is beyond sub-par. This is the 2nd order that they were not able to fullfill even though the items are said to be orderable on doordash. No one refunds you the full amount & both the store & door dash customer service did not refund me the full amount of $40 instead they refunded me $12! It is very disappointing i do not recommend ordering through any delivery services! Update the menu on doordash!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMlVYb3dVMjl3UTNwcVJGcGhhRlJCYjFVek5FRRAB",
            "text": "Comida muy buena pero muy mal servicio,había que quejarse para que le traigan la comida e igual para pagar.se preocupaban más en conversar con sus amistades pero muy mal servicio,había que buscar quien se cobre y quien traiga algo para llevar la comida. No volvería y aparte se cobran propina y el servicio malo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1VIZEVNRlUxUms1cWRqVjZNbVpPTTBOZlZWRRAB",
            "text": "Great food."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaVRsTkNhMEZ3WjNKek56QkJMVUpuU0hsT2JWRRAB",
            "text": "Muy buena la comida, el servicio mas o menos, pero lo que mas me choco fue que si la atmósfera es dominicana, el cafe es parte importante de nuestra cultura dominicana, pero no tienen"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTmVFZ3RjM3B4U1RsNVFWRTNRV1pCZHpkWk0xRRAB",
            "text": "Que cobren un 20% de tip es un abuso .... por eso lo meseros no  se esfuerzan por dar un buen  servicio , y que sea elegido por el negocio   Es otro abuso"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VelgxVTFTazlMUWs5TVMwaHNWa2s0Ym1GbGVIYxAB",
            "text": "Creo que no es justo😡 pedir un jugo jugo de $8,00 dolares y te eche más hielo q jugo👎🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd2FrNXBTVnBGT1ZsdVdrZDFWRXhpWVcxdGRIYxAB",
            "text": "The worse and only bad thing was finding parking.\nFood was espectacular from the presentation to the taste.  Great atmosphere and service. Always attended, keep on checking on us at the table. Good latin music in the background. Family friendly. We simply loved this place. Highly recommend 👌🏼"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMWJuUktRbFU0VVU5eGFXMUljVVZNVG5aUGRsRRAB",
            "text": "I just discovered this neighborhood gem. It did not disappoint in terms of bright island decor, quick and attentive service, and fantastic food -- both in portions and aunthentic DR flavors. Will be back for their Monday- Thursday happy hour from 4-7pm."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM2RVbHdNMnAyYzAxSVFVVkJhM0JHYzJkb2QxRRAB",
            "text": "Si buscas una experiencia genuina de la República Dominicana, este restaurante es la elección perfecta. Ofrece comida típica, preparada con ingredientes de primera calidad y un toque sencillo, sin excesos de condimentos. El local es limpio,…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMk9HSlNhV05FTFdsWWRHZHFia3RGYUdkSVFtYxAB",
            "text": "The food is good but going to that restaurant with the family is too expensive."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa1FYb3pSMVY0WlVVNVRXUTBiRVkxVm1FemNVRRAB",
            "text": "Las personas que llevamos niños aya debemos ser un poco mas educar los niños a saber comportarse en lugares fuera de casa por que si lo dejan acaban con todos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUlMwUjJUWEF5ZVhsMFRVTkhWazlZWDB0WWJHYxAB",
            "text": "Please don't come here on Sunday! They have bad service, and the hosts and waitresses are lying as well... why do you need to lie to your customers and everything 🙄... the food is really good..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M1ZFVTRZMUp6TkdFemVHOVVSM1IzYWpaTGJHYxAB",
            "text": "Beautiful atmosphere and delicious food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMU1EbDJRbFZ4U1hOWFVqSlhaVkJsUVhFMlpXYxAB",
            "text": "Food is amazing but they messed up my order everytume. First time they did not give me my chinola juice...second time they did not give me the rice and beans. Wish I could give them more stars"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVNIZDNiMU5pWTBocFdGZEpiR05LT0ZFeGFuYxAB",
            "text": "Had some take out. Great authentic Dominican food. I had the rabo (oxtail) and it was flavorful and well made. They offer take out drinks which is great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNlUyVnJXRE0zTVdoMlJGOW1hVGxpTjNCc2QyYxAB",
            "text": "The environment is very welcoming, very Dominican and I like everything that has in the Dominican culture. It was my mother's birthday and we had a great time and she was very legitimate. A bit small but excellent."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOb1RXTmtOMFZXVnkxaFZqRmFSMWRMUW5CWlRHYxAB",
            "text": "Buenisimo todo"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeFVGTjJYM0IzVG5sblMyNDNVMGxaY0RWR1EzYxAB",
            "text": "Excelente lugar, buena comida, buen servicio, buen ambiente; la música un poco alta para comer. Acogedor y muy buen precio. Pintoresco y bello nos recuerda la lámpara de gas , las samurai, los jarritos de aluminio y todas aquellas hermosas cosas que recuerdan nuestro pasado en República Dominicana. Vale la pena"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVMzUk9ibXc0V1daS1gxSXRTbXRKVW5WaFQyYxAB",
            "text": "Not only is there food to die for!!! But the service is exceptional and they are very kind. 10/10 would recommend especially for the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGelQyUXRYekF3UWpOd1JEUXRSVU0wZGpKTlNWRRAB",
            "text": "Food was good! Service was kinda slow."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRk1tWkllSFJhTFhNMVkwWmFlbmhoYTJoWVJGRRAB",
            "text": "Truly, it doesn’t not get better than this. The food here is too good to be true. Every bite is a new experience. They do not play with their spices. Their passionfruit juice is so refreshing and tasty.\n\nIf you have kids, this is a wonderful spot to go to! Or even for a date. It’s really beautiful in here!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdTdYZzBBRRAB",
            "text": "Alittle disappointed with the lunch Serving after being very specific about \"little\" rice..and then to get  three pieces of meat is crazy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWZllsSmtOblo0T1VGR05sWnRlazlGWDJSR2VsRRAB",
            "text": "The food was HOT! Like fresh off the stove. Delicious and flavorful but didn’t weigh you down. Gracious with portions. Well seasoned. The servers were attentive but never rushed you. It was my first time but I will be back. The music can be loud at times but added to the essence. The decor was so cute."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kd1JYcGhTbVZ2VWxSUmMxZEpRelkwYnpVd09FRRAB",
            "text": "I been at this restaurant few many times and always satisfied with the food and the great service.\nI tried the sancocho, the fish filete, the oxtai and few other goodies and never disappointed."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQlRIVTRjR0k1TUhCWVdqUkRZamszVlVGSVlVRRAB",
            "text": "Horrible servicio. Mi esposo y yo fuimos a comer y luego de esperar por más de 40 minutos por la comida el mesero dijo que lo había olvidado nuestra orden. No mostró interés alguno en remediar su culpa."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UVZUWkZkWGt4YURCcFZFbGljekZYYUZJNFpVRRAB",
            "text": "The food was ok.  The drinks were good. You really come here for the ambiance."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ablpIcHJTVTVtWVU4MGVVVnJiMmxRZFhCNlNuYxAB",
            "text": "Un rincon de mi tierra Dominicana con buenisima comida, ambiente agradable, atenciones magníficas. Tengo que volver 😋😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb1J6TmlOVzVmUzFGdFZYRnNOV2QzZEZWQ1UzYxAB",
            "text": "I have to say one of the best foods I have ever tried in a long time. The food was tasty, fast service, affordable prices. Must try it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1dVbzJZemwzU1d0alpIQXpZV1ZtU2xjMVVHYxAB",
            "text": "I used to come here often and always enjoyed the food, but unfortunately, my recent visit was very disappointing. The quality has significantly declined. The food was not fresh, and most of it arrived cold. My boyfriend ordered the ribeye, which was overly greasy, smothered in onions, and mostly fat. I had the chicharrón de pollo sin hueso with rice and beans. The rice had a burnt taste, the beans were unpleasant, and the chicken was cold—as if it had been sitting out for hours.\n\nI couldn’t finish my meal, and there was no effort from the staff to acknowledge or address the issue. To make matters worse, the prices do not match the current quality of food or service. If you’re going to have high prices make sure you have good food !\n\nService was equally poor—staff were gathered at the bar socializing with friends, and we waited over 20 minutes for basic items like napkins and utensils. I had to ask multiple times just to get those.\n\nSadly, this experience does not reflect what this restaurant once was. If I could give it zero stars, I would."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OR1luQTRXVzFxUjB3MVJWZEpTSGhMTVVobldHYxAB",
            "text": "Food is average depending on your meal of choice. Service needs improvement. Parking is horrible. Very, very small place."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSVZUbE1jRVIzWlRoQ2JHTklhRkZZTFdscGNuYxAB",
            "text": "Definitivamente el mejor sancocho que me he comido, mi esposo encargó rabo encendió y estaba 10/10 sin duda alguna los mejores siempre ❤️"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaU9WRTNURlF4VTE5ck9YWklVM2hpYTBGbGJuYxAB",
            "text": "Cocinan bien y todo pero ellos te ponen lo que le de ls gana mi novia pidio un morrongo de queso con queso derretido por encima y lo que le pusieron fue salsa rosa ( mayoketchup) 🤮…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNWNIWmlYMm8wUmxsaFdHTTVWVmRtYkhSTE1uYxAB",
            "text": "Delicious home made Latin Food clean cozy you’ll want to come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT1h6WnNNR0p4WmxwWlozWlhPVFIzV0d4NFJWRRAB",
            "text": "I was i'm a bit disappointed. I was expecting the food to meet high expectations. total failure. food was not great, it was okay. The food didn't look that fresh, and the rice was too high on the salt . 😳 the atmosphere was great.The waitress was very nice and polite.\nI was just a little bit disappointed in the food and then the price of the food was too high. It was not worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU2JGQk9XbDlGTUVWVE1rMVRObWQwVVhjdGVVRRAB",
            "text": "I order Pollo al Calderon and it was spoiled smfh"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMk9WUXhZa1k0Umtac1kybHRjRTVxZFVaUlRsRRAB",
            "text": "Deben bajar un poco la música que sea más ambiental mucha distorsión entre música y conversación"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTGMzZGlkMU13T1dsbVpHcHVPRGh3ZUhwSGVFRRAB",
            "text": "Tanta hambre ke uno pasa en este pais con tanta comida mala !! Por fin algo ke sirve…Gracias por traernos ese sazon Dominicano para nosotras y nosotros ke no sabemos cocinar jjjjj o no tenemos kien nos cocine. Ke Dios Bendiga ese negocios y a las manos de los o las chefff…no se who’s grandma is in the kitchen pero se le agradece ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQmVUQjFVelIyUm5jd05ucDVTRTQwU1haS09VRRAB",
            "text": "Very nice atmosphere but the restaurant prides itself in selling some dishes as authentically Dominican. However, the Mofongo is NOT authentically Dominican. Just give credit where it's due my friends. Overall a nice place to check out!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMemlnLWZIX0tMZDBBRRAB",
            "text": "The place brings you back to all Dominican memories. From the old iron to the flip flops. The food presentation makes you just eat to take pictures and not touching it. And the service was also very friendly. Especially Marvin the bartender who ensure that we had a big time. I wish they can be a little more flexible with accommodations some food such as changing green plantain for sweet plantain."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvck1fYjRBRRAB",
            "text": "If you are looking for authentic Dominican cuisine, this is it!!! It's a gem. Honestly, the space is small but well worth it. The fish with coconut sauce was delicious.  A must try. My husband tried the chivo, and he loved it. It was tender and paired nicely with the white rice and guandules with coconut. The staff were friendly and professional, and the music tied it in. There is nothing better than merengue típico."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T1NqQm1Va3A0TlMwM2RWcGtWRUUxU25KdVRWRRAB",
            "text": "The food was amazing! The staff were really friendly and welcoming, and the décor truly captures the spirit of the Dominican Republic. It felt like a little piece of home."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbUtnNV9ZbGV5elpREAE",
            "text": "This is a restaurant takes you back to your childhood in DR, its beautiful decoration and excellent cuisine, its very attentive and pleasant staff, and its super affordable prices. I 100% recommend you enjoy this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaWNVaE1kRlV6VHpSMmNIUXRRVmhEUldoTmRuYxAB",
            "text": "Usually we will take out but feel like having a date night. Thr food was ok, dry. I wasn't sure why not add the sauce inside the food instead all ove the plate like it was starbucks."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMDlqS0Z3EAE",
            "text": "A mis acompañantes y a mí nos gustó la comida, buena música, el lugar es pequeño pero muy acogedor y con buena decoración dominicana, desde los vasos a servir el jugo, hasta las lámparas antiguas que utilizábamos antes. Lo único a mejorar que también es algo muy importante en la experiencia del consumidor es la atención al cliente, la atención que nos dio el mesero no fue la mejor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZUQ3Yml1dktQaW1RRRAB",
            "text": "My friend too me here for my birthday. I had an amazing time. The staff was friendly and provided good service. My friend even got them to sing happy birthday to me. I had the mofongito platter. It was so good with the small pieces of chicharrón on top of the flavorful platano. Besides their regular  menu they also have los platos del dia. Next time I want to go on a Sunday and try their oxtail and sancocho. The restaurant has that feeling that you’re in a campo. They bring your drink in a jarro and have beautiful art work throughout. Definitely worth the treck from the Heights to the Bronx"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NmZMMDdRRRAB",
            "text": "The food is amazingly delicious. My wife and I go to this place when ever we get a chance and every time I taste the food there all I can say is wow."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMTVlMXB3RRAB",
            "text": "Las atenciones estuvieron débil,  las chicas que trabajan, poco conocen el menú, no te dan opciones y por la ubicación del lugar, muy caro los precios se los platos.  Deben saber manejar el negocio, me atendió una chica que no sabía nada del menú, y luego terminaron atendiendome tres personas. Entiendo que deben revisar varios aspectos de su negocio.  Además,  al lado un negocio de una gomera. Deben saber manejar el marketing. Señores están en la uber New York,  BRONX"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcC12d3V3RRAB",
            "text": "My co-workers brought me here to celebrate my graduation. The staff was really nice and let me sit and wait for them even though they were an hour late. The food was AMAZING! 10/10 recommend, taste and presentation was awesome. I gave it four stars for atmosphere because it was insanely hot inside and we found out the air conditioning was out of service, other than that I would definitely return."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKS1d6S1RMMnNLaG9BRRAB",
            "text": "Esperaba más del lugar, considero que no fue mi mejor experiencia para la ubicación donde está bastante caro, la porción del mofogon era muy pequeña sus jugo nada que ver; en mi lugar no lo recomiendo y no volvería."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNnIzZ0xnEAE",
            "text": "The food was excellent, everything was juicy and tasty. The attention, even though we arrived without a reservation and about to close, was excellent, the drinks were delicious and I loved the presentation of the food, very Dominican and I'm not Dominican but I love mofongo and it's one of the best I've ever eaten."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOHVDNkpBEAE",
            "text": "Went there on Saturday, March 4, 2023. Love the decor very traditional and bright colors. Staff is very welcoming and attentive. Food was beyond exquisite, so flavorful. My order was huge, I took leftover.  The Gandules con Coco are to die for, amazingly good. The seating wait was 20 minutes. They offer valet parking. I will definitely return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPSEx4WUNSX2JhM2NBEAE",
            "text": "Good is great and seasoned well. Portions are kinda small. Decor is very unique and creative."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc3ZMMXZnRRAB",
            "text": "Great atmosphere, it is tight but I felt comfortable. Food was delicious! Everything was on point! Service was great, servers were friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLWZUSU5REAE",
            "text": "Although we had tried take out in the past, this was the first time our family of four (including a 1.5 year old and 2.5 year old) dined at Ajo & Oregano. To say that we were pleasantly surprised would be an UNDERSTATEMENT!\n\nSince we live in the neighborhood, we decided to pop in on a Sunday (day before Labor Day) afternoon. Although the place was absolutely buzzing, we were seated immediately and accommodated with a place to put our double stroller + offered a high chair.\n\n(Anyone with young children knows that this goes a long way for a restaurant to ensure that you feel welcomed and not like a burden for “having the audacity” dine with your little ones.)\n\nThe ambiance was colorful, vibrant, and definitely had a welcoming feel, as if you were transported to the island and eating at a local restaurant. Loved that and the beautiful mural on the wall!\n\nNow, on to the FOOD! We were super hungry so we ordered a number of menu items and were NOT disappointed by a single thing.\n\nOur meal included calamari ($15), mofonguitos de pollo ($14) for our appetizers, and Churrasco in chimi sauce ($33) and Fried Seabass Filet in Homemade Coconut Sauce ($17) for entrees. The portions were seriously MASSIVE! Needless to say we had leftovers that somehow tasted even better the next day! We ordered the chicken tenders for our 2yo which included a side of white rice and red beans and I was pleasantly surprised that it wasn't typical (frozen) chicken tenders that you'd expect. They had actually made them fresh, and it was toddler approved!\n\nAll in all, we had a wonderful experience and you should visit too to experience the same. We can't wait to return for more drinks, comida, and vibes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bXRtcVhBEAE",
            "text": "The Food was Ridiculously good. I will definitely be returning. Best Dominican food I have had hands down. I recommend every thing. The Lemonade was amazing. Eat here ... you won't regret it.  Lizbeth R. Was our server and she was Great. :))"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa2NEbXBRRRAB",
            "text": "I LOVE going to Ajo & Oregano so much! Especially when I miss my mom's cooking but don't want to deal with her nagging, lol. It's a true sense of home and the staff is not rude. I like the service. I know the last time I came they had valet parking, and depending on what time you go, you might get lucky and be able to park your car. I'm super picky with my mofongo, my churrasco, and my habichuelas and they never mess it up. I have no complaints. The cups they give you are the traditional silver jugs that almost ever Dominican has in their house, lol. Good music, good food, good atmosphere. I come here with my two kids all the time. :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKc2JiNF9nRRAB",
            "text": "It is not the best food but I really appreciate the creativity, variety and presentation of the dishes.  I would have liked more of the traditional flavor and less of the Dominican seasoning in the style of restaurants here in NY.  The waitress, I don't remember her name, wasn't friendly or helpful. I hope if she continues working here, she is doing better.  It's a small place but decoration is nice."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKRF91dTZ3MEpITkZREAE",
            "text": "Me encantó el lugar, la comida super deliciosa,  muy recomendado y buena atención! La decoración es bella, muy acogedor el sitio."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd3BiOEZREAE",
            "text": "English Review:\n\nAjo y Orégano brought the flavors and vibes of the Dominican Republic straight to the Bronx! The vibrant decor and warm ambiance truly made it feel like a piece of DR was right here in New York. Even though it was cold outside, the inside was cozy, inviting, and full of Dominican culture.\n\nThe valet service was a big plus, especially since they accommodated me by letting me pay for it with my debit card inside – super convenient! I went with my baby (who just had milk, of course), my wife, and her mother.\n\nWe started with the mini mofonguitos as an appetizer, and they were absolutely delicious! For our main courses, I enjoyed the pica pollo with crispy tostones, my wife had chicharrón, and her mother ordered the mofongo with camarones and chicken. Every dish was plated beautifully and packed with authentic flavor.\n\nThe only thing I found a bit off-putting was the automatic inclusion of a 20% tip. While I respect this practice, I prefer to decide my own tip amount (and I usually tip more!).\n\nOverall, Ajo y Orégano in the Bronx delivered an amazing experience – from the ambiance to the food. I’d definitely recommend it to anyone looking for a true Dominican experience! ⭐⭐⭐⭐⭐\n\nSpanish Review:\n\nAjo y Orégano trajo los sabores y la vibra de la República Dominicana directamente al Bronx. La decoración vibrante y el ambiente cálido realmente hicieron que se sintiera como un pedacito de RD aquí en Nueva York. Aunque hacía frío afuera, el interior era acogedor, invitante y lleno de cultura dominicana.\n\nEl servicio de valet fue un gran plus, especialmente porque me permitieron pagar con mi tarjeta de débito adentro – ¡súper conveniente! Fui con mi bebé (que solo tomó leche), mi esposa y su madre.\n\nComenzamos con los mini mofonguitos como aperitivo, ¡y estaban deliciosos! Para los platos principales, yo disfruté el pica pollo con tostones crujientes, mi esposa pidió chicharrón, y su madre ordenó el mofongo con camarones y pollo. Cada plato estaba bellamente presentado y lleno de auténtico sabor.\n\nLo único que no me encantó fue la inclusión automática de una propina del 20%. Aunque respeto esta práctica, personalmente prefiero decidir cuánto dejar (¡y normalmente dejo más!).\n\nEn general, Ajo y Orégano en el Bronx ofreció una experiencia increíble – desde el ambiente hasta la comida. ¡Definitivamente lo recomiendo para quienes buscan una verdadera experiencia dominicana! ⭐⭐⭐⭐⭐"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcmZXcWNnEAE",
            "text": "We always go there, the food is good, real Dominican flavor, the food presentation is great and the service is good too, the deco remembers a dominican county house and that's a nice atmosphere, my only complaint is they don't serve coffee !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMGZDUmR3EAE",
            "text": "The decor, music & food will have you feeling like you’re dining in the Dominican Republic! The food is outstanding, fast, delicious & fresh. The service is fast, the place is small, there’s usually a wait. This area of the Bronx is tough on parking, some days they offer valet parking."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaTRLLVV3EAE",
            "text": "Food was delicious.   Table for two a bit small had to ask to switch to larger space. Amount of food is generous.  My snapper was a bit dry but lime and garlic did the trick.  Will return back sooner than later."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNQ0lyYzJDeUlyNkNBEAE",
            "text": "If you’re looking for an authentic taste of the Dominican Republic, this restaurant is worth checking out—just be prepared for a bit of a wait. While the wait times can be long, the attentive service and warm, friendly staff help make up for it. The ambiance is charming and thoughtfully curated, with a décor that transports you to a traditional Dominican countryside home. From the Calderón-style sink basins to the rustic mini calderons and old stainless steel cups your food is served in, every detail contributes to the immersive experience.\n\nThe menu is impressively extensive, showcasing a wide array of dishes typical of Dominican cuisine. Standouts include the perfectly seasoned fried fish, rich and creamy coconut beans, and the refreshing soursop juice. The chimi sliders are a flavorful nod to street food favorites, while the shrimp basket is crispy and satisfying. Their drink menu is also solid, with well-crafted options to pair with your meal.\n\nFamilies will be happy to know it’s kid-friendly, complete with a children’s menu. Parking can be a challenge, especially during peak hours, but arriving early or opting for metered parking a block away can save you some stress.\n\nIn short, come with patience and an appetite—you’ll be rewarded with great food, warm vibes, and a genuine Dominican dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeUs2M0t3EAE",
            "text": "It is described with 10/10, the authentic taste of Dominican food, it took me to the delicious food of my grandmother and my mother. Super fast service, attentive and helpful staff.\n\nToday was the first time at this branch and the truth is that I thought the taste of the food was better than the other one. Although both have their charm. It certainly won't be the last."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMk5IdUJnEAE",
            "text": "Amazing authentic dominican food and flavors, great atmosphere and very friendly staff, Paola was very good and on point.\nThank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOVpxRkxBEAE",
            "text": "Staff is super friendly, food was delicious and came out very timely order. Very attentive and almost seem to know what you’re going to ask them ahead of time. Very busy street, but they have VALET PARKING. Definitely tasted as if I was in the Dominican Republic."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRk1TMWtWRGREVjFkcGRIWktRV3MxZWtWVVJHYxAB",
            "text": "Just amazing! The service! The atmosphere! And the food!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX0p2ZnFBRRAB",
            "text": "It’s a little pricy for dominican food but trust me is worth paying more with these guys any day !! I had white rice, beans and pollo alorno. They strawberry margarita was amazing. Top 10 on the margaritas in the world i had try. Definitely would come back here"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb2FyWVpnEAE",
            "text": "One of my favorite things here is the mofonguito. Every dish here is well executed, but I can’t skip the mofonguitos. The dinks are awesome as well, I like the coco en llamas and the popi lychee is another lighter choice. The casave from the appetizers is sooo good and because it’s made with cassava it’s a great gluten free option. Did I mention that mofonfo is made out of plantains? Which makes it gluten free as well. My server Juan Jose was extremely pleasant and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbHEyNjRBRRAB",
            "text": "Cute atmosphere and decor but the food and service were lacking. I'm Dominican myself and the food here was lacking in 'something' that just did not make it authentic. I must say I was a bit disappointed as I expected more...something that made it unique, but it was more ordinary. Even with not many customers, the service was inadequate since we barely saw our waitress and had to seek out 'any' waiter. The drink I had, Vierjebo, was good though. Might be a place to try...but once!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbHBXaUdnEAE",
            "text": "The best dominican food ever!!!\n\nMy first time there and boy the wait was worth. Prices are good, service is great and food is just awesome!!!\n\nThe space is very limited, the decoration is very traditional, it does feel that you’re in the country side. Every little detail counts and I just love ❤️ the fact that they keep it up with the Dominican traditions.\n\nHighly recommended!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKYXJ3NktxeTVDOG5RRRAB",
            "text": "Disappointed and Won’t Be Back\n\nI really wanted to like this place, but unfortunately, it was a complete letdown. The food was mediocre at best — definitely not worth the hype or the prices. What really bothered me, though, was the parking situation. There’s no appropriate parking and they put a piece of paper over your license plate, which is shady and puts you at risk of getting towed or ticketed. Totally unacceptable.\n\nThe staff were unprofessional and had a bad attitude, acting like they were doing you a favor just by taking your order. The whole vibe was off — loud, unorganized, and just not welcoming.\n\nIf you’re looking for good food and a better overall experience, do yourself a favor and head over to other great location in Little Italy in the Bronx. You’ll get better service, better food, and none of the nonsense."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbHUzR0ZBEAE",
            "text": "We had a wonderful restaurant experience. We went here to celebrate my mothers birthday. The food and service were outstanding! Juan Jose was an excellent server. We will definitely return to Ajo y Oregano soon!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJemVxdndBRRAB",
            "text": "Excellent place to eat if your love Farm and Local Dominican Food 🇩🇴"
        }
    ],
    "reviews_count": 86
}