{
    "name": "DeStefano's Olde Erie",
    "place_id": "ChIJ2z2dcGIyw4kRykyfkZXxPVQ",
    "grid": "BX5",
    "address": "7 W Main St, Middletown, NY 10940, USA",
    "rating": 4.5,
    "user_ratings_total": 791,
    "phone_number": "(845) 344-3743",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cllWVnRVMEprYjNsdlJ6RkxkME0wUzAxYWIzYxAB",
            "text": "This restaurant is a great place to get good food. I highly recommend this to anybody looking for a good steak or good dinner."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTFVGcDNRbTB3TkdRMlptbEJkbkpxWVRFME1uYxAB",
            "text": "Service was OK. I thought my eggplant sandwich was soggy. Atmosphere was beautiful."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTlMzVmZOVkpNUzJKblNqRTNlbHB0Y2pWUGJGRRAB",
            "text": "We had a large group and had dinner family style. Everything was delicious! We had penne ala vodka, chicken francaise, prime rib, salad, potatoes, and some vegetables.\nThe staff was super friendly and attentive. The room was decorated beautifully.\nHighly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUFZsRTVTRmRtY0RKNVVHUlFVRFV4UW5CZmJsRRAB",
            "text": "Old time flair! Very quaint! Great food!! Loved the family style touch!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlgxOW1VVmRDZEhwTFgyOUNhMUpsWmpjMWJFRRAB",
            "text": "My Rubin sandwich came on paninni bread, and not by design. Someone pressed my sandwich. My wife ordered chicken milanaise. I would not give this food to a starving dog. We both took one bite, said we wanted it boxed, took it outside and tossed it in the garbage. This place needs a surprise visit from the Health Department."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTVltY3lTRmh5Y214elNISnFXblkwV1hodmJtYxAB",
            "text": "Definitely one of the best restaurant experiences I have had. Everyone is extremely nice, the entire staff tries to help when they can. Food is excellent and at a very good price. Lots of food so make sure to come with an empty stomach. Everyone definitely should come in if they are by the area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMlRYazBaMkp2Y0RORGFXZFhNa3BpTVROTE9FRRAB",
            "text": "Just had dinner\nSat\nat the bar...dinner was great...service was great.\nOur \"go to\" place\nLOVE my girls....Maria, Linda and Donna...forever friends🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlduUk5kVzlmVEZCc00xbEJWM0Z6U1hGVGNGRRAB",
            "text": "Everything was delicious. Scallop with bacon and Bluepoint oysters to start. Beef Barley soup included with meal, Ravioli with meatballs were awesome. Carrot cake to go for dessert was perfect."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210S1ZGbHhNamxPU3pNMFJIRjBlVVJvZVdGb2VGRRAB",
            "text": "From the time we were seated, the service was great, the food was in big portions enough to share, and it was amazing. We went on a Saturday, even with them being busy, our food was ready in a reasonable time, which was a plus for us!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ak1IUmxhRFIwUWtweFpXZHZWaTFPVW5OMmQzYxAB",
            "text": "It was excellent. The bread oil is amazing. The food is really good. Me and my girlfriend enjoyed it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWlpsZE9SVmN3UzBsSFprdHZiVGMwVDBkeldXYxAB",
            "text": "Try out the Pepper confetti dessert!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS2NpMW5XSEpKVjB0WFNUUmxUR0pWVjJsemNFRRAB",
            "text": "Everyone in our group had a great meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOamJUVTBhakZvYmxrd1NqWklXVlpIZDNkMFltYxAB",
            "text": "It is always so nice to walk into a restaurant and hugged by one of the owners.  Love ya, Maria!!  We didn't have reservations for our group. But we were accommodated.  Thank you!  Our waitress was great!  Food was delicious as always!  Portions ... I ended up taking my salad home!  I have to mention this...the olive oil, garlic and hot pepper dipping sauce was to die for!  And the bread was perfect!  Thank you again!  It was wonderful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdWRHNHlUblZzY0hKUlQyZEdZM2hMV1hGaVZWRRAB",
            "text": "Our first time here. This is s full service Italian restaurant with the usual Italian fare and specially items. My wife and I ordered the prime rib (see pic), a 24 oz portion, no bone, for us to share. Note, it is only available Friday and Saturday.. It was more than enough for 2 of us. We ordered it rare au jus and it came out perfect. It also came with 2 sides, we ordered steamed vegetables and wild rice which were both lovely. Lastly, it came with soup or salad. We chose the stuffed pepper soup. That was also quite tasty.\n\nWe plan to go back to try there regular Italian specialties the next time we're in town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Rd05tRmthbWhSVnpOc1QyOVVkVlpaYjNVd1ZFRRAB",
            "text": "I had a party of 25 for dinner in a private room.  It was absolutely lovely.  The food and the service was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb2JuTnNhR2gzVjFGa1gyTTNXVWQyWjBkamVsRRAB",
            "text": "extremely rude staff. yelled at my husband for parking in their lot for 5 minutes because the dmv was packed and he had to just run in to drop something off, someone came outside and yelled at him in a very nasty manner and took a picture…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNFYyaHBhREZZVnpCZlRFWm9iMU5XTUhOclpFRRAB",
            "text": "Always a great time there when we meet up with family"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUFgwRk9NMHBETURsUE4zb3diREkxV1VsNE1WRRAB",
            "text": "The steak was very big, but not very tender."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlVXOVRZbTlzYW1GMVRWWkZUbnBUUzNwTFdXYxAB",
            "text": "Walked in … waited, and our presence was ignored. The what appeared to be “manager”, sat at the end of the bar in front of the hostess station, with her back to us scrolling social media. One staff member appeared out of the back after standing there for several minutes and asked if anyone had helped us? We said no not yet, she said she’d be right back. Another staff member, came out a few minutes later and asked if we were waiting? We said yes and she said ok ; I’ll go get a table ready for you. My partner and I; used the outdated, dirty bathroom and left. It isn’t a welcoming establishment at all. The place reeks of entitled family running their grandmother’s name into the ground."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacmFEaFRlbkZtYzNGclIwTXRRamN0Vm5kamRYYxAB",
            "text": "Place is amazing ing high class location where the food and atmosphere is unlike anything I’ve ever had highly recommend does not feel like your in ny great service great location great environment"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMelI5c25ra2R6eUp3EAE",
            "text": "Very nice all around"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMbmJuc3lCaXZuQmpBRRAB",
            "text": "We are actually sitting at the bar right now it’s 630 on 5/28/25 and was planning on having a great meal with oysters and seafood . The bartender has no personality at all so we asked, are you having a bad day ?\nShe then smirked and just repeated herself and asked what do we want to drink.\nShe was so abrasive that we decided not to get food here and go to Goshen . It’s sad bc we have eaten here before and had table service. The service was good and the waitress was friendly.\nWe watched the bartender not care about anyone at the bar and act bothered anytime someone asked for a drink. We had our one and left !!! Such a shame bc we travel everywhere and almost always give excellent reviews, sad this place was such a disappointment and the food is good but we will not pay and tip an spend money with an attitude like that . We have watched and she is like that with everyone. We asked the couple next to us if they felt the same way and they did ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMkU3Sy1RMWNIVXp3RRAB",
            "text": "I've always been a straight shooter with my reviews. I have in all honesty, not one negative thing to say, good food, large portions, clean bathrooms, mixed drinks , mixed correctly, cheerful staff and on a Holliday weekend. Street parking, real table linen!! Nothing plastic, what a pleasure. I will definitely go back on a less busy day and time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb2ZucWhBRRAB",
            "text": "Great food Great service at a fair price there food preparation is consistently excellent and the wait staff attentive without being intrusive"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdEkyeGN3EAE",
            "text": "Orange Runners Meeting 2nd Wednesday at Olde Erie"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdE56MXJnRRAB",
            "text": "I enjoyed this restaurant very much!! Prices were great considering the portions you get which are huge! Food tasted amazing. Can't wait to go back again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNkxIeXNnRRAB",
            "text": "No aura farming needed with a basic brick outside that leads to an exquisite dining hall, wonderful lighting beautiful staff and amazing food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNkpIcnRRRRAB",
            "text": "Absolutely phenomenal. One of my favorite restaurants in New York."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOFBTQl9BRRAB",
            "text": "Attended a party in the reserved party room and the food and staff attention was fantastic!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ek1HczJRRRAB",
            "text": "I was there for my aunts 80th birthday party. I had shrimp scampi over linguini and it was great. And seemed like others in party also enjoyed. There were like 20 of us and the girl who we had for our server was awesome. And very friendly. So food, great. Service, great. Atmosphere, great. So GO!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d0xQY2ZREAE",
            "text": "Heat. Place.   Food and aervicw"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTZmODBRRRAB",
            "text": "I’ve been going to Destefanos for many years, because the food was good, however it’s been a while since I’ve visited.  I thought I would go tonight with my daughter for my birthday.  We enter and no one greets us, we are just standing there felt invisible.  Then Destefanos wife who has always been the hostess, three words  stink, stank and stunk. So unwelcoming. Tells us the tablecloth side is booked and an hour wait but we can sit at the tables by the bar. The table was dirty, chairs are the same as a pizza shop. No reason why those tables don’t have tablecloth’s to continue the theme of the entire restaurant.  Instead of that section being so unsavory.  No one comes to wait on us. I finally said to my daughter let’s go somewhere else. As we are about to leave, a young lady came over her name was Joy and greeted us and I informed her we were leaving and shared my discontent.  She was so kind and insisted we stay.  We did and she was professional and provided good service.  She should be the Hostess.\nThe decor has not changed in decades, so old,  it needs “Bar Rescue” to come in and bring it to 2025.  Unfortunately, we will not return."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbVpyanR3RRAB",
            "text": "An authentic Italian restaurant with great taste and high portions. Not pricey either. Of course I've been eating from this family restaurant for over 40 years. Go and enjoy!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdUlhYXNRRRAB",
            "text": "Very nice and the portions were plentiful!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZzZtenVRRRAB",
            "text": "Beautiful decor, fast and friendly service and delicious food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc09yOUdnEAE",
            "text": "Awesome stop on a Friday afternoon after work!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOHRhZk9BEAE",
            "text": "First time going, we had to ask for help and wait but it was busy and food was good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ2FTdEFREAE",
            "text": "Fresh food! Amazing portions! Multiple options! Fantastic staff!\nVodka sauce is a love language so I HIGHLY recommend the chicken parm tower, drunken chicken parm piled on a bed of penne vodka with a sphere of burrata sprawled atop- get a cheesecake to go and you will not be disappointed!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbnQtMzlRRRAB",
            "text": "Amazing food large portions very slow though"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNnAzTnJRRRAB",
            "text": "The staff and food was wonderful, It made our family gathering to celebrate my father's passing a little less painful. Their kindness, compassion, and professional service went above and beyond. Thank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMHBIVTRRRRAB",
            "text": "Excellent food and service for a private event. Thank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaUl2bDRRRRAB",
            "text": "Pleasantly surprised,  service spot on, food was delicious!!!\nLike my mom's 🥹"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmZzhTTzJnRRAB",
            "text": "I've been there 3 times in the last month because it is so good. The food is absolutely delicious in very generous portions. Highly recommend this restaurant! Everyone there is so nice and friendly. The Christmas decorations are the most beautiful I've ever seen in a restaurant.  We absolutely love this place. Try the chicken parm tower! It's incredible!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMnAzZ3ZnRRAB",
            "text": "Tremendous strip steak. Highly recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2emZqcXB3RRAB",
            "text": "Thank you everyone for a wonderful- winter time when we attended Breakfast with Santa! For the 2nd year in a row, my grandchildren and family enjoyed delicious food,  excellent service,  and a fantastic atmosphere! Merry Christmas to you all!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dmZuTVVnEAE",
            "text": "Food is amazing, the portions are so much. This place ensures you are full before your main course. And the prices are very reasonable."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXR6a05REAE",
            "text": "Have our yearly company holiday party here, always a fantastic time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXBpaVlREAE",
            "text": "I attended a bridal shower. Buffet meal was fresh and well-presented. It's hard to get a buffet right, in my opinion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeE1IR2ZREAE",
            "text": "Oh my goodness!\nSo delicious,I had the Mushrooms in white sauce penne 😋 He had the chicken marsala. It did not disappoint. Portion was huge. waitress was fantastic 😊 she(Amy) was attentive and friendly. I had an excellent time.\nThose caramel apple martinis hot the spot.\nWe are super delighted we chose this place for his birthday dinner 😁.\nDessert was also fantastic! 😊\nApple crisp an Tartfuo with Mexican coffee ☕. Exquisite 😋👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZzh1MFRREAE",
            "text": "Today we had a baby shower for my Son and Daughter in law….it was a brunch setting and everything was perfect…..the food was wonderful and the staff were phenomenal…..it was a great atmosphere and everyone had a great time….Thank you Maria, Linda and staff 😊"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a1lINGR3EAE",
            "text": "Can’t say enough about this place. From separate rooms for private parties, too an amazing attentive bar and then a fabulous dining room set with tons of lights! The food…always enough for two (except the sandwiches of course) and so so delectable!  One of my top 5 in the area!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MDVPN09BEAE",
            "text": "We enjoyed our evening at DeStefano Olde Erie. My glass of Moscato was quite large. The bread was served with butter and olive oil. Unfortunately, the olive oil was too garlicy. The appetizer was Raviola Fresca, which was cheese ravioli with shrimp in a lemon cream sauce. This was exquisite! We had veal parmagiana and chicken parmagiana dinners. The portions were more than generous, but we were disappointed in the taste. They were just okay. Our waitress was friendly and attentive. Since the appetizer was excellent, we want to try some other entrees, so we will be back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1LUpTTGRnEAE",
            "text": "Huge and I do mean HUGE portions...like 2 portions in each meal.  Great italian food..very rich and delicious.  Huge meny and its all great.  A bit pricey but a good treat to yourself and others."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcnNybXhRRRAB",
            "text": "Delicious, as always. My family and I have been coming here for almost thirty years. The food rarely disappoints, the menu is great and the specials are always delicious and unique. and the owners are kind. The holiday decorations are always next level, too!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeTZqQmpBRRAB",
            "text": "Well our waiter Scot was awesome,the place is lovely and the food was delicious. Really  a fun and yummy experience. Went again  and it was awesome agIn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsM05mbFd3EAE",
            "text": "If you like delicious food, LARGE portions, great atmosphere and service, this is the place for you. An added bonus is the beautiful Christmas decorations."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bHVxNUdBEAE",
            "text": "Family sized portions.\nI had gnocchi and meatballs. The sauce was a little heavy and thick for my liking. The zucchini sticks were very good. Thick slices."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDb0xtc1R3EAE",
            "text": "this place is so good. our waiter Scott was very attentive, friendly, and patient! come here if you want to taste really amazing food in Middletown!! the atmosphere is wonderful, the drinks are plenty, and the food is delicious. they have the best french onion soup I've ever had.\n\nthe wait is longer than most people are used to, but that is not a bad thing! it means they are preparing your meal dilligently and with fresh ingredients! I love this place, it's a great part of downtown Middletown."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbW9uV0hBEAE",
            "text": "I was thrown a baby shower at Destefano's Olde Erie. Everything turned out absolutely beautiful-especially after the decorations were spruced up. Food was delicious as usual and overall event was fairly priced."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb1lDRkdnEAE",
            "text": "If I could give this more than five stars 🌟 I would in a heartbeat 💓!  Maria & Donna I can't thank you enough for your STELLAR care and quality service for my mother's celebration of life.  The dining room you recommended was perfect for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdUtDTHJBRRAB",
            "text": "Wow the steak sandwich is the biggest sandwich I have ever had. Check this place out ASAP"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDaUpQcGhRRRAB",
            "text": "Great drinks, excellent food. Giant size portions at more then reasonable  prices and top notch service. You can't go wrong!!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdjhYWnlnRRAB",
            "text": "We went to Olde Erie after hearing from multiple people how good it is.  I have to agree!  The food is great and the menu is varied.  The service is top notch as well.  The prices aren’t bad and we would 100% go back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcFB1MlBBEAE",
            "text": "I have held two parties here and they are the ABSOLUTE BEST! contact them ASAP for your upcoming events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMk9uY1VBEAE",
            "text": "We were visiting some family in the area and this restaurant was recommended to us and I'm very pleased with the recommendation. Excellent food with very generous portions. The waitstaff was both friendly and professional and made our dining experience excellent. We will definitely return there if we are ever in the vicinity again.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2M00zN05BEAE",
            "text": "The service and food at DeStefano is outstanding and they give you a nice portion!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdk8zNnZRRRAB",
            "text": "Great staff and a great atmosphere regardless of whether you eat in the bar area or dining room. The selection of food and size of the portions, sets DeStefani’s a bar above anything else you can find in Middletown."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMk1fakJBEAE",
            "text": "Cute place, decent food, but horrible service. We were here for a party and no one came around to clear the tables so we sat with piles of dirty dish on our table the whole time. Then the food was a buffet style and they ran out of plates for people. The service was just a disorganized mess."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ2I3b29RRRAB",
            "text": "I was there last Saturday after celebrating with friends . For an alumni event, I must say I was very surprised for the portions, especially the chicken Parm sandwich and the hamburger that my wife got .!! Definitely will come back and try other dishes 🙏🙏"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbF9xenZRRRAB",
            "text": "Great food!! Great atmosphere. No complaints!"
        }
    ],
    "reviews_count": 70
}