{
    "name": "Twin Tails",
    "place_id": "ChIJbxASGTNZwokR9eIMYL28EQE",
    "grid": "BX5",
    "address": "10 Columbus Cir 3rd Floor, New York, NY 10019, USA",
    "rating": 4.4,
    "user_ratings_total": 199,
    "phone_number": "(212) 970-8828",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adVZHbEZabVptV1ZKTE4weG1NSEJ2ZDBoaWVHYxAB",
            "text": "This was my first time coming here and I was so pleasantly surprised by this restaurant from the exceptional service provided by the whole staff, to the delicious food, and wonderful ambiance.\n\nWe started off with an old fashion cocktail and \"Falso Spritz\" (mocktail) and the drinks were made with equal amounts of all the ingredients so it was not too much of one thing.\n\nWe were a little overwhelmed by the menu, and our server recommended the \"Tasting for Two\" option which consisted of sampler appetizers, two entrees and two desserts from the main menu, and we also added the chicken spring rolls to try from the small plates. Our first course was the green papaya and kumquats salad that was tossed and mixed in front of us. I was skeptical by the sweet flavors being added but everything blended so perfectly to not only be a great way to open the pallet, but also a great refresher in between appetizer and entree. The yellowtail was also one of my favorites from the appetizers as it came sashimi style in a lemony vinaigrette, all together being very light and fresh.\n\nFor entree we had the grilled Branzino and shaking beef. The Branzino came butterfly style and was seasoned beautifully, however it came in a verde sauce that was a bit salty. The shaking beef was our favorite! The flavors were also very consistent, not overpowering, and the meat was cooked so tenderly, I can truly say this dish was perfect.\n\nWe ordered two cappuccinos with our desserts consisting of Thai iced coffee Affogato and Ube creme caramel. I preferred the creme caramel and my friend preferred the Thai iced coffee but the desserts were overall not overly sweet and a perfect way to end our meal."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseVZHbFFVblprWlZaRWFIaG9ZblY2YzA1MlEwRRAB",
            "text": "Great food and good vibe. The set menu was a great deal, I liked all the food and the portions were generous. My favorites were the appetizers, the fish, the coconut rice, and the flan. The flan was very dark and caramelized. The meat in the drunken noodles was a bit hard.\n\nThe servers were on one hand present, on the other regularly tried to get us to leave. It gets pretty loud as it fills up."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTWVYZzFOR0YwUzFwb1VrbDRORU42YzA5V2NtYxAB",
            "text": "So me and my friend came in Twin Tale yesterday and when I tell you please believe the hype. At first I was a little weary because of the amount of review bits it’s literally as I found out because they recently just opened. First off, the place is Gorg! As soon as me and my friend walked in the host Isamar was so welcoming and warm! She literally accommodated us as we were considered walk ins. We sat down and our waiter Javier was so nice as well! We decided to get the meal for two which was family sized and when I tell you it was so good that I left stuffed! Everyone on that menu was good. The papaya salad was so good! The appetizer was amazing. The Bronzino was wow! The beef was cooked well, the sides were amazing a tad bit salty but still good let’s not get started on the dessert. The ube flan was wooooowww and the mango and sticky rice!! Thank you will def be back. Hopefully they keep this up because I will literally tell everyone about this place!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdFRXbEliMWxUWlVwck1qRkpjM2xmUkMwd05WRRAB",
            "text": "This is my favorite restaurant! The chefs are incredible and the food is outstanding, but the servers just won’t let you relax — they come over 4 or 5 times during dinner asking if everything is okay. It’s strange that a place like this has such unprofessional and intrusive service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS1JWVTRlVlJXV0c5RGFYaHNXR3gyYVRBNGFuYxAB",
            "text": "Food was fantastic and our server Emily was amazing. 10/10 need to come back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cFgxQndSVE5XUW5BdFFWZ3RhMDVIVFZWdmJGRRAB",
            "text": "Great food and cocktails"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTFFYWjZhVzVITVdoNlVYQnVOSFpxVUhreVZsRRAB",
            "text": "I was excited to eat here for lunch with my parents since my mom enjoys the other Quality Brand restaurants and I usually take them to Quality Bistro. This was our first time and I was extremely disappointed. First, the service people need to be retrained in fine dining. Our waitress came up to us 5 minutes we sat down to take our orders. If I was eating at a NYC diner, I get that, but not at a restaurant of Quality’s standards. I specifically chose this place expecting peace and the ability to have a conversation and enjoy my parents’ company without being rushed. The good thing is that she was smart enough to pick up on my cue when I responded that we needed a few more minutes, visibly annoyed. Finally, we ordered when we were ready and the rest of the meal went smoothly. However, that ended when my mom asked for a takeaway container to pack up her leftovers since she still had a good portion of her Shaking Beef uneaten. The waitstaff who packed her leftovers in the paper bag was sloppy and there was food juice dripping down the side of the bag. C’mon, Twin Tails! Do better! I had to call the attention of the staff to the dripping sauce since I didn’t want it to stain my mom’s clothes. Then, the waitress came by with the check. I didn’t ask for it yet and assumed she was clocking out. But, she wasn’t. I choose restaurants when I want to relax and not feel rushed, and this experience was anything but that. I then put my phone on top of the check to cover it because I was not ready to pay. Well, apparently, without me prompting, the waitress came back with her payment machine. Flustered, I reached for my purse because I didn’t know she wanted to kick us out. Unfortunately, I am never coming back. But I guess, since we still love Quality Bistro, you still have my loyalty. But please retrain your staff. At your price point, I expected better service."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ob2JEVlVlRWt3UlV0VWNFWnBMV013V1ZweE5FRRAB",
            "text": "Went here for my birthday dinner and absolutely enjoyed the food, the ambience and the amazing service. My friend and I were treated really well which made our dinner experience very enjoyable! We got the sashimi which was so fresh and delicious. We also got the lobster tail satay, red curry sea bass, drunken noodle, crab fried rice and the pistachio soufflé. All were really really delicious, they also gave us the crudo and chicken spring roll on the house which were delicious too. All the dips that came with the starters really stood out to us! Hope to be back soon! :))"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRmQyWXlZMjlrVTFveloxSm9OMlZhWWxwb2VWRRAB",
            "text": "Delicious! Great atmosphere and fantastic sea bass. The glass noodles and chicken spring rolls were so good! Fun cocktails."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTGIzUnRaRE51WjFwclF6bEhRV2xwUjFKT2IyYxAB",
            "text": "Great tasting menu....\nExpensive but worth it..."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5clZrZEVOMVZOYTJ4d2VHdzJjazl0WWtOdlNVRRAB",
            "text": "My Fiancé and I came to have a much needed date out and Twin Tails did not disappoint! There was a great vibe and the music was the perfect volume for both conversation and enjoyment. Tyler, our server, was so knowledgeable- he was able to guide us through the menu and make thoughtful suggestions along the way! Throughout the meal he was very attentive; we felt as if he anticipated our needs and showed up at the perfect time. Paper Plane cocktail was the perfect blend, and ice cold which made it even better! Food wise, we had oysters, crab and uni buns, lobster satay, and yellowtail crudo for starters. We shared lemongrass ribs and shaking beef as entrees, with a side of crab fried rice.  It was immaculate! We finished off with the ube dessert and affogato, and they did not disappoint!! With my Fiancé being a Chef and I myself a Restaurant manager, we truly enjoyed the food and service, and are already planning our next date there. Thank you again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFRYaE9iR1ZmVFZFeWVYVktVREZyYVdGR2NGRRAB",
            "text": "gem tucked away in Columbus Circle from the Quality restaurant group. Shaking beef, long beans, and Vesper martini.  paid with blackbird dining app"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcU5XYzBMVWxuVEVweUxUQktkVzVOZHpGdmNuYxAB",
            "text": "FANTASTIC!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveGRXRlNUekp5ZVZReldEVmFOa1J2UmxSeGRXYxAB",
            "text": "While the food and atmosphere were good, the service was dishonest. After ordering two glasses of champagne - Perrier Jouet - the waitress serves a glass with no bubbles stating the bottle had been opened on the same day. She kindly said she could change them, and tried to serve us a different lower quality champagne for the same price point without informing us. Only when we pointed it out to her - with no apology on her part - did she agree to serve us the right champagne. Fast forward to the end of the meal, the waitress pretended that the card machine wasn’t working and took back the bill she had brought without us asking for it to add charges to it - as if we wouldn’t notice the $150 addition to the bill. A simple admission of mistake on her part would have sufficed for us to surely agree for her to rectify the bill. But the blatant lying about a card machine not working while we saw her go steps away to add the charges to the  bill and come back with the same machine is the problem. It is the pattern of dishonesty and the lying that are unforgivable. Unfortunately, we will not be returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVGJXRmxVbHA1YkdGcFQyMHlRWFZsYTJrNE4yYxAB",
            "text": "Atmosphere:\nSwanky, moody aesthetic\n\nFood:\nFood is next level. That type of food you relish as you know you yourself could never make. We enjoyed the shaking beef, cho lon duck, coconut rice, and gai lan.\n\nService:\nService was exceptional. Friendly, knowledgeable, checked in on you, didn’t make you rush (not always the case in NYC)"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RllqUTBSQzFzY25ReVMxQmlRVE4zZWtadVMwRRAB",
            "text": "I’ve been here six times in the last few months. The food is fantastic and the interior design is spot on.\n\nBut the service has steadily declined. The first visit was amazing, which kept me coming back, hoping for the same experience again. Unfortunately, it never happened. On my most recent visit, I actually had to get up from the table, grab my own bottle of wine from the ice bucket across the room, and pour for my guests. That was just the latest of several service issues that really take away from what should be a top-tier dining experience.\n\nAmazing food + atmosphere, but the service needs serious attention."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV2EyTjZUakpaT0daRlNteHhOVEJGVWpOMlJtYxAB",
            "text": "We visited Twin Tails on Friday for a celebratory dinner, and it was nothing short of perfect. Located across from Bad Roman in Columbus Circle, this elevated Thai restaurant exceeded expectations in every way - ambiance, service, and food.\n\nWe opted for the tasting menu for two, and it was an incredible experience. Every dish was bold, flavorful, and beautifully presented. Portions were generous - we were more than satisfied and even brought home leftovers. Not a single miss on the menu; each plate was a standout.\n\nFor drinks, we tried the Lipstick Palm, Manhattan Sling, and Bangkok Screwdriver. The Lipstick Palm quickly became my favorite (then again, I love mezcal). The Manhattan Sling packed quite a punch - stronger than I usually prefer, so I’d likely skip it next time. The Bangkok Screwdriver, on the other hand, was light and refreshing.\n\nOverall, Twin Tails delivered an outstanding dining experience. If you’re looking for a spot in Columbus Circle to celebrate a special occasion or simply enjoy inventive Thai cuisine in a chic setting, this is it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSmFXUXdNazFvYmxoRVZGZFpNMnBOZDJocVJXYxAB",
            "text": "We had such a great experience at twin tails, the food and the service were great. They told us to try the duck that was very juicy and tender. Love this restaurant, I’ll come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMGMwUTFiVkYzU1ZodlUwTmFiR2h2Wmsxa05FRRAB",
            "text": "I feel like I expected more? The sashimi was not bad but not that special. The Peking duck is far below par in comparison to a Chinese restaurant but I get that it’s more for the spectacle aspect and it’s not bad it’s decent I ate a lot of that duck. The standout for me was the crying beef: not bland at all and the perfect amount of tenderness. The lobster wrap was nice but again not a standout. Soufflé dessert was also more spectacle; a bit too sweet in my opinion. Ube flan dessert was pretty good— strong ube flavor and melts in your mouth. Overall atmosphere was good dark lighting and good view of the city. It also took very long between appetizer and main…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adVJGbGtWRmR0TjJaeFVrSXpZM05HUkZJNVdIYxAB",
            "text": "We had a good experience at Twin Tails. The flavors were unique and enjoyable on our dishes. We opted for a bunch of small plates and shared. The build out is beautiful. Everybody was inviting and friendly, but I'd tweak the attentiveness of our server up about 40%."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdVdteGhOekpRU0VZMGJqWkhUekpVUXpkVWVsRRAB",
            "text": "Fantastic food and service! The atmosphere is Just a little noisy for my tastes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWWRrVjNPV0ozWTFCMmVqVnJZMHhOVjNWWWRrRRAB",
            "text": "This is the best, most accommodating staff I have ever encountered in NYC. Our group got caught in a downpour in Central Park with my 3 year old and we were SOAKED. The dining room wasn’t even open, but they welcomed us with open arms. Isamar immediately made us feel so comfortable (we were so embarrassed about how sloppy we looked because this is a GORGEOUS) space. She reassured us, made my toddler feel comfortable, and gave us a prime table with a view. One of the staff members, Stephanie, brought my son a few toys and played with him, and he absolutely loved her. Our bartender John made us the most fabulous cocktails, and his recommendations were spot on. We are East Villagers and rarely venture to Columbus Circle mall for dining, and we will absolutely be returning to this spot. We could not get over how beautiful the decor is. The drink menu was interesting and the cocktails were executed perfectly. The bathrooms are spotless and stunning. The views are absurdly beautiful. They weren’t serving food while we were there (it was between lunch and dinner), so I can’t speak to that, but the menu looked amazing, and we can’t wait to try it. The space is huge, and I think it would be fabulous for a party. Cannot recommend enough."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbGEybG9UVlJOU1VKU2NYWTJNRGhEUTA1MVUyYxAB",
            "text": "Tictok lied to me!! Went here for the duck.\nThis place did not have the best duck in NYC. It wasn’t even cooked. Very disappointed after waiting for over an hour to be seated. Place was overcrowded. There was a manager there that was very nice and understanding but overall it wasn’t a great experience. Wouldn’t go back unfortunately."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ016VkRiVU10Vm5wc1NtSmhPVmxLU0hGNVVIYxAB",
            "text": "Couldn’t even enjoy our dinner because the service was absolutely terrible. We waited over 35 minutes for our table (with a reservation), the waitress forgot our appetizers, and sent a free dish to make up for it and ended up putting that on the bill! Very disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRlZscERla2RYZHpWc1QwZFFZbFowV1Mxd1FXYxAB",
            "text": "First off, the decor and overall ambiance was stunning - super unassuming since its in a mall  but def blew us away. Food was extremely fresh and tasty, my partner took me here for my birthday this year and let them know ahead of time - they treated us extremely well and even though our server changed halfway through the meal, the transition was smooth and the attention to detail and overall effort was clear as day. Looking forward to coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVlZIQmZZamw2WjJKelVWQlhUMHQ2VDA5UGNHYxAB",
            "text": "Seriously good and innovative food and cocktails."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT1lXNU1aVEp2WW5RMFdtNVpkM3BMWDJ0MWFuYxAB",
            "text": "We had an absolutely great experience at Twin Tails! We actually had had a reservation at a sister restaurant and something came up, they weren't able to seat us, but helped us replace our reservation with one at Twin Tails. We were thankful for the replacement reservation, and everyone at Twin Tails was SO kind, everyone from the hosts to our server, even the manager went out of their way to be accommodating and helpful, checking in on us throughout our meal and giving the best service I think I have ever had at a restaurant. On top of the excellent service, the food and drinks were incredible! We had the crispy pork roll & chicken spring roll appetizers, the Cho Lon Duck with scallion glass noodles for dinner, and the ube creme caramel for dessert, all were phenomenal. I can't recommend Twin Tails enough and we will definitely be back! Thank you, Twin Tails!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GblUyUnhSVWQwTVRsblNuazJOVVUyYmxCM1dHYxAB",
            "text": "Interesting modern restaurant serving Thai inspired dishes. We found the dining room elegant and festive. The service was friendly but a bit slow on a busy Saturday evening. We enjoyed the food. We ordered the papaya salad, the Maine lobster summer roll, the red curry sea bass and the Thai pork ribs. They were delicious. Overall, a very nice restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV1RHWlVSemhoWkY5NFJ5MVpjbXR4WVZwbFQyYxAB",
            "text": "This was overall a delightful experience, but being rushed to finish an almost $200 dinner is not right.  They upsell the soufflé at the start of your meal.  While eating my (expensive, delicious, though small portioned) dinner, someone comes up with dessert plates and says “excuse me, but your soufflé is ready and I don’t want it to fall.”  I was literally mid-bite and she said, “You can keep your food.”  I can keep the food I paid to eat so I can eat it? Thanks. I reluctantly let my $18 Brussels sprouts be carried away so I could rush to enjoy my $24 soufflé. Food and ambience are wonderful, and our server was nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NWJXWTJlRzlWVG5oV1FrNVhaQzFpVlc5a2FIYxAB",
            "text": "Hidden Gem in Columbus Circle , it's inside The Shops at Columbus Circle. It's a IYKYK type of spot. Has a great view to the Central Park , if you sit by the window.\n\nWalked in and got checked in the by the host , told us to wait by the bar , it was beautifully set up. I love the dim orange and black lights. It gave the Great Gatsby vibe.\n\nFood was delicious , my favorites were the Shaking Beef and Crab Fried Rice ! Good Portion Sizes and definitely worth the money.\n\nService - 10/10\nGreat for Large Parties"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUldXTklaV1J1UW5WUGJqRjJOVk5pV1haVlkwRRAB",
            "text": "Fantastic food, amazing service! Really great find."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd09UTkVjM2xqYTFGbk5YVXROR3RYTm0xRlNGRRAB",
            "text": "I have been multiple times and even rented out the mirror bar for my 30th birthday for 20 people, which they did a fabulous job. The food is delicious - get the whole fish sashimi and the duck and split with a group of friends it will be a very delicious and reasonably priced meal for nyc night out standards in the area. They also don’t price gouge on drinks, again for nyc standards ($20+ sometimes), which goes a long way in my book. I will never understand how people have to wait a little or expect Michelin star service and take off multiple stars. You get amazing food  and vibe here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM01XVnNiMWRoYVd0Q05VdHhaVkpRTWtaUVdGRRAB",
            "text": "My new favorite restaurant - the service was excellent (Thank You, Emily!), the food - simply sublime,  and the decor was posh (juxtaposed with views of Central Park). 10/10 for me."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaFpFeEpMV2hHV1ROdFptRXdTR0UyUTBrM2VuYxAB",
            "text": "Amazing amazing amazing. Incredibly authentic, piping hot, and full of flavor. If you know me, I can’t stand cold food when it’s supposed to be hot, and whatever they served their meals on kept my food hot the entire time. It’s a small thing, but a huge win in my book.\n\nPeanut-ginger satay was delectable—three extremely tender, thin slices of chicken, paired with either spicy peanut sauce or chili-lime vinaigrette. I was taking smaller bites just to make it last!\n\nChicken Pad Kra Pao was spicy, but paired with the coconut rice (pricey but worth it) it was manageable, and I have a lower tolerance in general for spice.\n\nThe Tiger Prawn Pad Thai was probably perfect. I’m not a fishy girl by any means but my husband loved it and the noodles were cooked very well. Just the right amount of sauce. Could maybe have used some stronger flavoring, but they supplied fresh herbs so you can add to your liking.\n\nWe had to send our check back because there was an additional item on it that wasn’t part of our order, so double check your check. The service was fine, sometimes curt and distant, but overall adequate.\n\nViews were great overlooking the park. You don’t need a window seat to have a good view, but there are very limited window tables, so if that’s important to you call ahead to request with your reservation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d1YwZzJjRTFqUkMxcWFqWTVTR1pLVTNKR2NVRRAB",
            "text": "Much needed and loved addition to Lincoln Square"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUlVVdGpkV1l3YVd0WFNFVjNkVFZhVGxGdFIzYxAB",
            "text": "Twin Tail strikes a rare balance between elegance and soul. The menu is thoughtfully composed, and each dish delivers depth, finesse, and a sense of place.\n\nOur evening began with the ginger peanut chicken—a clever, vibrant starter that married richness with bright aromatics. The mains were outstanding: the sea bass curry, fragrant and deeply layered; the filet mignon, expertly cooked and tender; and the duck, rendered with crisp skin and bold, balanced flavors.\n\nThe pistachio soufflé for dessert was exceptional—pillowy in texture and perfectly restrained in sweetness. Service was gracious, timing was spot-on, and the atmosphere elevated the entire experience.\n\nTwin Tail is a restaurant that clearly knows what it’s doing—and does it beautifully"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d1lsQmpNV3d3Y1V0U2NrRldZaTFJZEdoTVRIYxAB",
            "text": "We had such a memorable night at Twin Tail! The space is stunning and stylish, but still feels cozy and welcoming. The staff was incredibly kind and knew the menu inside and out.\n\nWe kicked things off with the ginger peanut chicken—super flavorful and unlike anything we’ve had before. For mains, we shared the sea bass curry, filet mignon, and duck, and honestly couldn’t pick a favorite. Each one was beautifully presented and packed with flavor—the kind of dishes you talk about for days after.\n\nWe ended on a high note with the pistachio soufflé, which was airy, warm, and absolutely delicious. Twin Tail nails it across the board and we’ll definitely be back. Already dreaming about that curry!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d1MwSXlOVlJ5UmxKME0wTktkRzVhVmpGaWVWRRAB",
            "text": "Great food. The Escargot and crab fried rice were my favorite! Love the atmosphere and the service was also a 12/10."
        },
        {
            "date": "3달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaWRFMUpjVTVsUm5WSmJub3RTbkpVVG5SblRYYxAB",
            "text": "Twin tails和Don angie、Bad roman同属于一家公司。\n\nFancy的装修一进门就能感觉到 - 和Hudson yards那几间宰corporate dining的餐厅简直一致的风格😂\n\n菜单走fusion路线，价格偏高，点菜时有点无从下手。整体是好吃的 - 每道菜都算是出品不错。\n\n招牌鸭就是北京烤鸭换了个名字，稍微有点鸭腥味，鸭子不够肥皮不够香。\n最好吃的是那个树叶裹着的牛肉satay，意料之外的juicy。\n甜品的pandan舒芙蕾加了某种柑橘类增加酸味，反而让我不太喜欢 - 酸味加热真的会更酸特别酸！\n\n总体来说，如果寻求一间环境好、出品不错、不讲究正宗的泰餐，可以一试~"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSVZIcFNWMUUxUWswNGNuWlNhakZSTjFOc1NsRRAB",
            "text": "I thought this place would be overhyped, but the food and drinks were absolutely delicious, and the service was on point. I wasn’t expecting to be wowed, but they really delivered.\n\nThere’s no lack of Thai options in Hell’s Kitchen, but, despite the relative high price point, Twin Tails felt like a special night out and made it worth it. Planning to come back many times over to try the entire menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUVZGZGpMVVY0Y21Kb1ZUQnRkbEpUWmpCblFVRRAB",
            "text": "Great restaurant! Seated on time with a table of 8! I had the waited pick all the top apps and food, and desserts and they all\nCame out perfect.  Great service and food and highly recommend to anyone! Business, family or date night"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGalVtZENYMHRPYWt0QmNEVmliM1JUZEUxbU1VRRAB",
            "text": "The food was excellent, and our female server was wonderful. The only downside was the attitude we received from a male server, which was completely unnecessary and disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTldGQktNWFUyWDFOb1JuWnpOME4zY0UxdlFVRRAB",
            "text": "Ambiance, service, and location/views are great. Cant go wrong with any of the food. Save room for souffle"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbmJGVm1aMDR3V2pOaVZ6SjZOVVpNZWs5Q00wRRAB",
            "text": "The place is amazing and the service is great. However, there are very limited options for vegetarians or vegans. The few vegetarian dishes available aren’t filling enough. I really wish they would consider adding tofu or mock duck to the menu, so vegan guests can enjoy rice-based dishes with some satisfying protein options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMVUzQmxZM0E0Y1VjdFJHeHpNWEpoWjJsNGFIYxAB",
            "text": "I’m a tough reviewer, but these guys have nailed hospitality like I haven’t seen before. We were there with a big group, and Tyler was absolutely incredible. He’s the absolute man. Service and food was 10/10. This was a very memorable night."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWmNGOXFTR3hEVEdwR1lVTkRWbFZwVlVwaVZHYxAB",
            "text": "We came here for a special occasion and had high hopes—the food was genuinely good, but unfortunately everything else missed the mark.\n\nService was inattentive and at times careless: our server bumped into our chairs multiple times, dropped utensils while serving, and forgot a birthday candle we’d specifically requested. We waited over 15 minutes for cutlery and were even charged for something we were told was “on the house.”\n\nThe space itself is well designed, but the table lighting was far too dim in the evening, and the dish pacing felt off—leaving our small table overwhelmed and uncomfortably crowded. Disappointing, especially for a place we were genuinely excited to try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbGRuQjRaakJpYkZCRFkyMXBTMTlEVFRWUFlrRRAB",
            "text": "Customer service was phenomenal and food was great. We loved the fact they wrote us a note for our anniversary. Small gestures that makes you feel the place cares for its customers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bVJtNVJkWFJxU1d4ZlUwOUxTSGhVYW1GamVVRRAB",
            "text": "A fabulous spot all around! The service is attentive, the space is beautiful, but you can still come business casual and the food… wow! The fresh and colorful dishes we had packed such great flavors. The satays, sashimi, duck and coconut…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVpFRlpPRmR6TFRkbE4wTkVhbUZZTXpOMWEwRRAB",
            "text": "One of the best dining experiences I've ever had, they really went above and beyond for my girlfriend and I's one year anniversary. Will absolutely be back again next time we're in the city!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeFZYRkNRbXBPYjFWV1ZtcHRTbGw2VjNkSk1HYxAB",
            "text": "Been here twice for special occasions. The food is incredible, in a beautiful restaurant! Recommend the lobster noodles, as well as the chocolate soufflé, but all meals and desserts we’ve had both times were outstanding."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQbjkyUExhaEp5SHRBRRAB",
            "text": "The restaurant seated us more than 35 minutes late and said they would comp some appetizers for us to make up for it but were eight people and they gave us one order of spring rolls with eight pieces so basically one tiny spring roll each which is comical for a place that's supposed to be nice. The service was incredibly slow and the waitress was amazing but forgot the drink of one of our tablemates so obviously all of our drinks were watered down because we waited until that arrived. (Which of course is not fun after waiting 35+ minutes standing for a table).The food itself was pretty good overall, slightly overpriced but considering we're in New York City with so many amazing restaurants not bad, the menu is absolutely great and the execution is above average, but nothing crazy. The desserts, however, are to die for. Get those. Again, the waitress was nice, but it was obvious that she was being overworked or kind of in a hurry just to take our orders or make suggestions. Of course, the front staff also kept on saying we'd be seated in a few minutes despite again, seating us more than 35 minutes late to the point we contemplated going somewhere else and it was not even a weekend... super disappointing experience because the food was actually quite good and I know the owners have other restaurants I like but would probably never eat here again and would not recommend to anyone. I understand it's New York and sometimes people get seated late, but to make up for it so cheaply (1 piece of spring roll each) then not even provide great service is embarrassing and disappointing. They did not even make clear which apps would be compensated so we had to go check because we couldn't believe that after waiting so long they would give something so lousy. 0% would return as my friends went again once, and the service was still really slow again too. For a Tuesday night, it feels like a mill to feed people and make money, not actually provide a nice dinner experience which has to do with more than nice decor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSHUtTEhzcVlUSUZnEAE",
            "text": "Excellent meal overlooking Columbus Circle. Shared everything with my group of friends on a Wednesday night. Service gave perfect recommendations to complement our order and dietary preferences (no seafood) and sent out complimentary plates for us to try. We had 4 apps, the duck, 3 sides and dessert. Skip the sticky rice and get the coconut rice. Pistachio soufflé is a must have!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNkozM1lREAE",
            "text": "I went with a group of 6 for my birthday on a Friday night and had the best time.\n\nWe had a beautiful booth overlooking Columbus circle. Everything was really tasty. It’s great for a group because most things are very shareable. If you like cocktails this restaurant delivers bc they all feel special. I’m a fan of the lychee martini. It feels unique to one you’ll find anywhere else.\n\nThe duck might seem like a splurge but it’s soooooo good!\n\nAnd lastly what a beautiful space and attentive, kind and fun service.\n\nI love twin tails and as a Brooklynite I’m happy to go out of my way to have a meal there. Will be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXNQSnRRRRAB",
            "text": "Twin Tails exceeded all expectations! We arrived early at 5 PM and didn’t leave until 10, yet at no point did we feel rushed—the service was impeccable. From start to finish, everything was top-notch—the food, the drinks, the ambiance, and the overall vibe. The wine selection was fantastic, and the raw fish dishes were simply outstanding. Every bite was a delight, and even the desserts were exceptional. We truly had a blast enjoying an unforgettable five-hour dining experience. Can’t wait to return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dnN5REZREAE",
            "text": "Came here on a Tuesday before a show at Radio City Music Hall. The decor inside is very romantic, yet modern. We ordered the lobster summer rolls, crab and uni buns, the duck, crab fried rice and beef satay skewers. The food was delicious, although I did not like the beef satay skewers. Definitely could’ve done without them. I enjoyed the green sauce with the duck and wrapping it in the pancake! I was impressed with the crab fried rice because there usually isn’t a lot of crab but this one comes with chunky bits of crab. The rice is also a little crispy which was an unexpected surprise. To drink, I ordered the salted lychee martini. It was just OK.\n\nOur waitress was nice and the food came out rapidly. It’s pricey but, I would return!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd19UMVd3EAE",
            "text": "Stopped by for a quick lunch and was immediately impressed by the swanky atmosphere and stunning views of Columbus Circle. The salted lychee martini was crafted to perfection—I had to double back for another. The melted chicken spring rolls were a delightful party in my mouth, and the black pepper sirloin satay paired with coconut rice was simply flawless.\n\nI’ll definitely be returning to experience dinner here.\n\nThis review was made in connection with a Toast promotion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNjl0dHViaTh2NEd3EAE",
            "text": "Twin Tails is absolutely worth the hype! This upscale dining spot offers a stunning view and an impressive fusion of Thai and Vietnamese flavors. The Whole Royal Dorade Sashimi is a must-try — incredibly fresh and beautifully presented. The Cho Lon Duck is a crowd favorite for a reason — rich, flavorful, and perfectly cooked. The Crab Fried Rice packs a delightful kick, adding just the right amount of heat.\n\nAnd whatever you do, don’t skip dessert. The soufflés are a showstopper — especially the Pistachio Pandan — light, airy, and bursting with rich, nutty, and fragrant flavors. An unforgettable dining experience from start to finish!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eVl6ZXR3RRAB",
            "text": "From the team behind Zou Zou and Bad Roman, this newly opened spot is all about Southeast Asian-inspired dishes. The cocktails are generous and stiff, and the Cho Lon Duck is a must order for all Peking Duck lovers, but make sure to save room for their soufflé selection! From pistachio pandan, to Vietnamese mocha or passion fruit, it’ll be hard to pick which one.\n**Pro tip: Look for the unmarked door on the right, on your way out, and grab a nightcap at their hidden speakeasy, Mirror Bar.  Decked out in rich velvets, warm lighting, and mirrored panels, it's the perfect spot to end the night, sipping on that very aged Single Malt Scotch.\n\n🫶🏼 Whole Royal Dorade Sashimi\n🫶🏼 Banh Khot Pancakes\n🫶🏼 Mushroom Banh Cuon Rice Rolls\n🫶🏼 Lychee Martini 🍸\n🫶🏼 Sambal Margarita 🥃\n🫶🏼 Red Curry Sea Bass\n🫶🏼 Cho Lon Duck\n🫶🏼 Scallion Glass Noodles\n🫶🏼 Grilled Gai Lan\n🫶🏼 Pistachio Pandan Souffle\n🫶🏼 Ube Creme Caramel\n🫶🏼 Ca Phe Martini🍸\n🫶🏼 Thai Teani 🍸\n\n📍@twintails_nyc | NYC\nBy the team behind Zou Zou's\n& Bad RomanChef Craig Koketsu"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX3o5T3FEODRPR0VBEAE",
            "text": "Went here for Mother’s Day - it was a big group, which can always be challenging. Service, views, atmosphere - and most important everything we tried on the menu were excellent. Would absolutely recommend going here and treating yourself!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMDQ2LWFBEAE",
            "text": "What an amazing place! His place the right combination of good food service and ambiance. Located on the third floor feels at first like you are going up tot he food court but it’s a different world once u walk through the doors.\nDid not have one bad dish there.  The shaking beef and tuna appetizers are standouts.  Excellent cocktails.  Well balanced/blended flavors."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeF96VFdREAE",
            "text": "Twin Tails is advertised as Thai and Vietnamese fusion, which I didnt get it from the food itself. but I dont mind because the food is amazing. I would say it's just an Asian fusion with a lot of different elements combined.\n\nThe space is dark and cozy but elegant. the service are excellent the host is super nice, coat check right away upon arrival. even you have reservation they require you to have at least half party to be seated. you can get a drink at the bar while waiting, they can bill straight to your table. we are a table of 6 the table is a bit too small for all the food we ordered but we managed. highly recommend to come at a group of 4 so you can try more different dishes and also at a more comfortable seating.\n\nlet's talk about the drinks.\n\n- Salty lychee martini is SO delicious. i was a bit hesitate to order, doubting a sweet lychee will taste weird if it's salty but i was completely blown away. it's a little bit like a dirty martini but has sweet and thai basil flavor. their martini glass is also very large. good portion for the drink.\n- Bangkok screwdriver : not my favorite. i think it's premixed , it came out really fast just poured into the ice. nothing spectacular but there's a lot of ice in the highball. not worthy\n- if you are whisky drinker, theres no price on the menu, will have to ask the bartender for the price, but the pour is generous.\n\nAll food are excellent , the highlights are\n\n- Whole Dorade Sashimi: very fresh fish and good presentation, if you are the person dont like to see the fish head, please skip this dish.\n- Green Curry escargot : best twist of the escargot we had , green curry is so tasty , it comes with toasted bread, in the end we just use bread to clean the plate because it is that good.\n- Crying Tiger Steak: we ordered medium rare , the steak was perfectly cooked, thick cut very juicy and pink on the inside. very good portion best to share.\n- twin lobster noodle: there are two salty fried lobster on top of glass noodle. noodle is very flavorful, and lobsters are fresh and juicy even it's deep fried.\n- Cho Lon Duck : it's very delicious crispy duck served like the Peking duck style. the skin is not as crispy as pecking duck style it's more like deep fried instead of roasted. the kumquat and pineapple is a good southeast Asian touch.\n- King Crab and Uni bun : very small portion but very delicious. flavor is a bit like lobster roll topped with Uni.\n- Crispy pork roll and netted chicken rolls are good, but the maine lobster roll is a bit let down.\n- lemongrass ribs are probably the weakest of the dishes, it's more like the shanghainese sweet and sour pork ribs."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNvN1pRVRAB",
            "text": "This place is beautiful- the restaurant is so gorgeous, the staff is so lovely, the food is delicious, and drinks are Gucci. We love Quality Bistro and this echos it perfectly. Chloe was fabulous and was able to recommend so many options- our favorite was the beef shank (a must have). Thanks to Matt, Callie, and Karmela."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJck0zZFhREAE",
            "text": "I came here with a group of 5 and we shared:\n\n- Whole royal dorade sashimi\n- Black pepper sirloin satay\n- Crispy pork cha gio rolls\n- Mushroom banh cuon rice rolls\n- Red curry sea bass\n- Cho lon duck\n- Black sticky rice\n- Scallion glass noodles\n- Pistachio-pandan souffle\n- Coconut-red curry souffle\n\nJust wow! Everything was delicious and had so much flavor. I really enjoyed the sashimi, duck, the 2 sides, and the pandan souffle. The sea bass was on the smaller side, but everything else was good to share\n\nService was great and the inside had a very classy feel. With a few drinks, the total came out to $540 after tip/tax, so definitely on the pricier side."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeE03NmhBRRAB",
            "text": "Opening in 2024.  The small plates are delicious and flavorsome.  The atmosphere is vibrant and energetic, but if you get one of the booths, it allows for some intimate gathering for your table.\n\nThe service-top notch.  Our server was attentive, informative and had a great personality allowing for fun with our two sons.\n\nA definite place to go and experience some new flavors which we haven’t tasted elsewhere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYW8tdTZNX3FfUFhnEAE",
            "text": "I’ve eaten here almost ten times now and just discovered I hadn’t written a review.\n\nTwin Tails is really a great restaurant. At the top of the list is the duck which is delicious, like Peking Duck but a million times better with the sides. Also they give you the legs separately which are insanely delicious.  The lobster roll is also excellent.  Tried the fish dishes for the first time and the Dover sole and branzino were both excellent with great sauces.  The black sticky rice and long beans are great sides. For dessert the Vietnamese chocolate soufflé, the mango rice, the crème caramel and the affogato are all excellent.\n\nService is invariably excellent, although they push the soufflés a bit much.  Items to avoid: the red curry soufflé is hard to eat, and the pad Thai while good is hard to distinguish from any other pad Thai.  Extremely good crowd and atmosphere."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MUpDVjlnRRAB",
            "text": "Tucked away on the 3rd floor, Twin Tails is a gem of a restaurant that feels like an escape from the everyday. Through its unassuming doors is an elegant dining room that's both grand yet intimate. When it comes to the food and drinks, great attention was put into the details to make these Southeast Asian dishes expertly crafted blends of already known items with a touch of innovated execution. Even simple sides are done well from plating and presentation to flavor. Altogether a meal where each bite finds you hungry for the next.\n\nAs a dessert-lover, the Ube Crème Caramel was custard flan-like and my favorite! Can't wait to be back to try the Coconut Red Curry Soufflé.\n\nA special shout out to Jeree and Anthony who had great understanding of the menu's nuances because each dish they recommended was wonderful. They're also undeniably skilled servers with a knack for attention and building a comfortable atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaHIzTWNREAE",
            "text": "This felt like such a hidden gem! On the third floor in Columbus Circle mall and exterior of restaurant had no windows and a blacked out door. Once you walk inside along a dim hallway to the host, you’re greeted with a nice ambiance with dim mood lighting and nice views of Columbus circle—perfect for a fun date night/special occasion. The service was amazing and my friend and I had a nice long and non-rushed dining experience. The dishes were so fun and tasty! We loved everything we got and our favorites were the shaking beef filet mignon, scallion glass noodles, and bahn khot pancakes! And don’t skip the soufflé—will be dreaming about it for the foreseeable future."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeGRYR0hREAE",
            "text": "I was surprised how much I loved this place. Not only is it a gorgeous space but everything from the service to the drinks to every bite of food was sublime. The staff were truly expert from check in to check. The food was unique in its flavors and bold in its presentation. There aren't many vegetarian items on the menu which is a negative for vegan and vegetarian diners. I was with a vegetarian so we cobbled together plates of sides starters and salads and it actually worked. The rice salad was delicious. I loved the mushroom rolls, the noodles side and the slightly sweet glazed Brussel sprouts. The showpiece was the soufle. We had a mocha and a passion fruit. Both beautifully executed and sauced tableside. Dinner here isn't complete without at least one of these gems."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aDQ2eHJBRRAB",
            "text": "TT is our neighborhood fave! Honestly maybe even our favorite restaurant in all of NYC (I know..powerful statement). Living a block away, we're thrilled to have such amazing Vietnamese food so close. Quality Group did it again – the place is BEAUTIFUL, with killer Columbus Circle views. We've had Julian as our server both times (including our anniversary!) and he's fantastic. Made our special day so memorable 🥹❤️. Food is incredible, flavors are unreal. Highly, highly, highly recommend! Couple food photos attached for ordering inspo :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXREa3V3RRAB",
            "text": "The food was fine, but the portions are SO small, considering what you're paying. We got the duck tower, crab fried rice, curry cod, and the pad thai. The curry cod was probably the most tasty dish; but it's literally just a small slab of fish wrapped in banana leaf - I'd expect more for a $40 dish. At minimum, include a side of rice. Desserts were a bit more reasonably priced. The ube dish was our favorite. The lighting is also really dark. If I'm paying this much for the food, I'd like to be able to see what I'm eating.\nGlad I tried it; but wouldn't come back again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLU1DZ1JBEAE",
            "text": "Our server and food was fabulous. Beautiful inside the restaurant. However the bathroom is gender neutral...so we could not find a single toilet that was not covered in urine. Not to call out men but l've never been in a women's restroom with urine on every toilet seat with urine on the floor. Luckily this restaurant is in a mall so we were able to use the mall restroom. Highly recommend making the bathrooms separate by gender."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmajVQak13EAE",
            "text": "We had our first experience at Twin Tails for New Year’s Eve dinner, and it was fantastic! We loved that they didn’t require a fixed course menu on holidays. Smooth service. Every dish we tried was exceptional, and we’re already looking forward to coming back!\n\nDorade Sashimi – A must-try if you’re a sashimi lover; so light and fresh.\nGreen Curry Escargot – The sauce was incredible, with perfect flavor and texture. Umami!\nCho Lon Duck – Juicy and tender duck with beautifully crispy skin and a trio of delicious sauces that complemented it perfectly.\nPistachio Soufflé – Felt like there’re some pandanus leaves. Lovely aroma. Delish!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODRHcURREAE",
            "text": "Absolutely mind blown by this experience! First of all Carmela was beyond amazing, anticipatory service at its absolute FINEST. Best way to have celebrated my anniversary with my partner. Food was beyond incredible!"
        }
    ],
    "reviews_count": 73
}