{
    "name": "Seoul Sizzle",
    "place_id": "ChIJTZWHu3Ezw4kR7QnD818-IT8",
    "grid": "BX5",
    "address": "101 Monhagen Ave, Middletown, NY 10940, USA",
    "rating": 4.7,
    "user_ratings_total": 267,
    "phone_number": "(845) 281-0104",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR1dIcFhOMlJOU25SMExXSlRVa05VVGs4MloxRRAB",
            "text": "My nephew had never had Korean food and doesn't like pickles so I thought he was not gonna like anything but now he wants banchan with everything he eats and is obsessed with bulgogi. He also started saying that Koreans know how to make things spicy the right way lol. Next weekend I'm taking him to get Korean fried chicken because he loves fried chicken but never had Korean fried chicken. I think his head might explode."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MGJHa3lhSGh6UnpCcE56UlBVVGczYW1obWIwRRAB",
            "text": "Value for money! Quite authentic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNVRUQnhVVFZaTVhsNVFqTllPVnBVVTBKbFYwRRAB",
            "text": "Food was extremely delicious, fresh hot. We will.\nDefinitely be coming back here for lunch?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTU4wMWtNMEp3VFVScmNsbEVOMnBIY2pkb00wRRAB",
            "text": "Had the pleasure of trying Korean food. This restaurant had you order at the counter and they brought the food to your table. Very well seasoned and beautifully displayed. I tried the pork dish(sorry I forgot the name) and an order of dumplings. The hot hibiscus tea was very good. The atmosphere was pleasant and there was music playing in the background. A place I will try again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRldtOXpORWRHYkdOSFZUZHVUSGR6TFhRemRFRRAB",
            "text": "Food was good, portion size was ok, the price was a bit expensive but I knew that it would be before walking into the restaurant, and I was fine with that. The wait however was unacceptable. We walked in and ordered 2 things at 4:07, she told us the wait would be around 10 minutes. We did not walk out until 4:50. Almost an hour wait for our food when she told us it’d be 10. There were only 2 people there when we first walked in so it was by no means busy. 6 people who ordered after us got their food before us as well!! After about 30 minutes of waiting I walked up to the register looking for a reason as to why it was taking this long but there was no one there. I waited at the register for over 10 minutes and still no one walked out to help me. At one point another customer walked in waiting to order food but ended up walking out because no one was there to help. We got no apology and the food did not look as advertised(was still good). For something that was so expensive I’d expect a better reasoning than “the staff got your food mixed up with someone else’s.”"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdmJraG1WWHA0ZEhSTk0zcFVkRVpMZGpOalUyYxAB",
            "text": "Отгонял мошки от стола, но по моему они на напиток налетели. Такое ощущение как будто у них на кухне как на свалке. Думаю проверка к ним давно не приезжала. Куда смотрят проверяющие станции. Лишнего слово не сказал, на чай 5$ сразу отдал когда заказывал. Надеюсь кто то обратит внимания на их кухню после этого отзыва"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dE5tNVdXR2N4VGtnM2VrazRSVjlGVmpkdlVtYxAB",
            "text": "Food was great, service was fine. Everything was great until it came to paying our food, my friends and i haven’t been here many times so we weren’t sure if we had to pay upfront or at our table. Once we got our checks n payed we were going to leave, where then the lady serving us said as we turned to walk away, “ ladies you didn’t tip here, am i going to see a tip at your table?” in a very rude tone, insinuating that it was obligatory to tip. It genuinely was an honestly mistake that we forgot to tip but tip is not mandatory, it is a curtesy. We were very respectful the entire time so I don’t understand why she was rude towards us when it came to pay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMk5qUnZNbWh4YlhONVgxaHBhMDkwV1dWUlFrRRAB",
            "text": "The food is good, but the service doesnt exist and the food may get to you by the time youre ready to pass on to meet the ancestors."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdGJ6VlNNRmxIVHpWeFZsTm1iMUpIUXpCTWIxRRAB",
            "text": "Absolutely loved Seoul Sizzle! The seafood pancake was perfectly crisp, the cheese dak galbi rich and comforting, the pork bibimbap fresh and flavorful, and the japchae light and delicious. Warm service and cozy atmosphere—already planning our next visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNFpuZEpSa3RhZEhWQmRIb3dUbmRMU2treFRsRRAB",
            "text": "This place is a total gem! Delicious food, great service, and nice relaxed atmosphere."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYVdYaENiMTl0Y2xkT2RXbHBTRVV6T0U1R1RsRRAB",
            "text": "We came here as a family after a fun day at the water park, just looking for a snack and some rest — and this place was perfect. The restaurant is clean, modern, and welcoming. The seafood pancake was especially delicious. The owner was friendly and chatty. Highly recommend for a relaxing bite with great Korean flavors!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTVdGRm1iR3hEZGtWbGQwWlBURlZsZUVwRGJuYxAB",
            "text": "The food here is sooo good! And the staff are so sweet and helpful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUlkwaG9kVkkwYWxSMWJ6QmhjR04wUlVsclpYYxAB",
            "text": "Food is always good.. flavorful and delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCblZrTk5kRVpyZUV4c1YzaEtNMmd3WW1oRllWRRAB",
            "text": "Lovely hostess, great food! Had bulgogi, bibimbap and, (for the most refreshing drink ever in 100 degree heat), Lime Applemint Ade. Highly recommended 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdmI5YjZsdThhdWRBEAE",
            "text": "Great Food Great Service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWGx4Y3pOMHVlZW13RRAB",
            "text": "If you go to Legoland, I recommend you to eat here. It only takes 15 minutes by car. This is the most cafe-like Korean restaurant I have ever seen. It plays cafe music and is very cozy. The food is really delicious. I ordered seafood cakes, seaweed soups, glass noodles, bulgogi, tofu soup, and their purple rice is also delicious. Everything I ordered was delicious. children's tableware for the children, which is very thoughtful. This is a rare restaurant that everyone in the family praised. In addition, the store does not charge extra tips, so the price is really a great deal. Highly recommended"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYjQxWW1HLXFUZDlRRRAB",
            "text": "Just recently discovered this spot since I’ve moved back to the Hudson Valley after living in the city the last 15 years. I’ve only ordered via uber eats but I must say they do not disappoint. It’s hard finding authentic cuisines up here especially Korean food. Very happy to see it. Well done!\n\n(Next, need to get some chi-bap on that menu 😏)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZnY1NkN2Z1A3b3ZRRRAB",
            "text": "Love Dak Galbi, ordered it twice and delicious every time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3YyMUlBEAE",
            "text": "Lovely restaurant whether you go for lunch or dinner. Food is authentic reminded me of my trip to South Korea. The server was very nice and curious 10/10!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcklhZmxnRRAB",
            "text": "I love to dine in here. It's clean and not that busy. Food is always good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOC1YR1FBEAE",
            "text": "Amazing!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNk1hV1lREAE",
            "text": "Delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNTVXb2ZREAE",
            "text": "Best Korean food around, highly recommend. I lived in Seoul and this has been the only place to offer authentic flavor and dining. Nice clean restaurant, always plenty of close street parking."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaVpDWVpBEAE",
            "text": "Clean n welcoming restaurant. Food was beautifully presented! Absolutely delicious!!! The ice cream was delicious too!!!! Highly recommend eating here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReFBtaHpRRRAB",
            "text": "The food is great but please know that I waited over an hour for an online order. Not even a “sorry for the wait” like she told a person before me."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM2NtQXh3RRAB",
            "text": "Such a cute place. Food is absolutely amazing. The owner is friendly and personable.\nWould recommend this place if you want great food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndThySW5BRRAB",
            "text": "I was excited to try a Korean place here in Middletown as I love Korean food! But to be honest I was pretty disappointed. soondubu Jjigae is one of my all time favorite dishes so I had to try it here, and it was just not good compared to the versions I've had elsewhere. The only vegetables in it were some zucchini and onions, not much meat and just a few baby shrimp. The banchan was all pretty flavorless as well, and no cabbage kimchi available? (I'm not a big fan of cucumber instead). I will say the fried pork dumplings were awesome and saved my order from too much disappointment and was the reason they got three stars from me."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNFl2dkRBEAE",
            "text": "I didn't want to write this review but it has to be known. Their hygiene standards seem to have gone down significantly. About a month ago, I ordered from through using Uber Eats and packaged my food up to eat at work in a meal plan way. I found a long black straight hair in my food. It wasn't mine or any member of my households because I have short kinky curly hair and no one else touched the food or opened the enclosed bag it was in. It's really sad that I have to write this because this was my go to place for korean food. I love Korean culture and I would order here for something healthier and tastier than Popeyes or whatever. But I had to let people know that they may want to inspect their food thoroughly before eating. It took me a while to get time to write this because I've been busy at work for weeks."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfX3JxN0V3EAE",
            "text": "Absolutely excellent food and super nice people.  Get the bimibap"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd2NtWmV3EAE",
            "text": "Food was really delicious and pretty good portions for sharing"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeFpENzV3RRAB",
            "text": "I often dine at Seoul Sizzle, and it’s always a fantastic experience. The restaurant is clean, beautifully decorated, and has a cozy vibe. The owner is so friendly and welcoming, which makes every visit even better.\n\nMy favorite dishes are the Tteuk-baegi Bulgogi and Soondubu Jjigae. I love mixing rice into the soup—it’s incredibly flavorful and comforting, especially on days when I don’t have much of an appetite. The soup and rice combo is so satisfying and always leaves me feeling better. The Cheese Dak Galbi is another must-try—the portion is generous, enough to keep you full, and the Korean-style spicy chicken paired with melted cheese is absolutely delicious.\n\nIf you’re craving authentic Korean food with generous portions and great flavors, Seoul Sizzle is the perfect spot!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZ1ozSENBEAE",
            "text": "Interesting place.  Dropped by for lunch.  You order ar the counter and they bring the food to your table.  There is no waitstaff, so when you're finished, you bring your plates to a drop-off station.\nThe food was very good and the presentation was very nice. It's definitely worth another visit"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdG9PRFl3EAE",
            "text": "Amazing restaurant & the sweetest staff! We visited with a large group to celebrate a birthday and were so impressed with the quality of service and food here.\n\nHighlights for food include the appetizers (moo ssam, mandu, haemul pajeon) and for mains, definitely get the spicy cheese dak galbi and tteokbokki!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeXNXUEdREAE",
            "text": "I ushally don’t rate restraints but it was AMAZING I tried all 3 dishes the beef pork and chicken and all 3 had amazing flavors!!!!\nAlso the staff was very friendly"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OWRDcWtBRRAB",
            "text": "Cozy, quiet, clean with very friendly counter/wait person.  It was my first time trying Korean cuisine since moving to NY and I was incredibly happy with the choices provided. Fell in love with the japchae, fresh side dishes and the ginger honey tea.  Highly recommend this lovely gem in Middletown!🫶🏻👍"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cTVLaldBEAE",
            "text": "La espera en comunidad en línea es terrible"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcU1Qb1BREAE",
            "text": "The food was very good. Reasonable prices.  Walking in, there was a musty smell. Clearly an old building. The management should consider doing something about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudWRia1F3EAE",
            "text": "Ordered online for take out, great vegetarian options! I loved the japchae and the ginger yuzu ade, I'll definitely be back to try more :D Surprisingly big portion for only $6."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyd2VINDl3RRAB",
            "text": "When I was a regular customer of owner Dave's shop on the opposite corner he asked me a few times if I thought a Korean restaurant would work here. There is an Asian fusion  place down on Dolson Ave. but it's not really authentic Korean and the prices are crazy and so I told him that  yes, I definitely thought a Korean restaurant would work around here.\nI recently returned to the Middletown area and was very excited when I drove by and saw Seoul Sizzle. I noted the location and thought 'What are the odds that Dave has finally been able to open his restaurant?'. I ordered online for a light lunch today and went to pick up my food. I was able to park easily on Monhagen alongside the building so no troubles there. I walked in and sure enough, there was Dave behind the counter. I was very happy to see him. The space is beautifully appointed with authentic Korean touches and is very clean. I chatted with him for a bit, picked up my order and headed out. I had ordered Moo Sam, Tteokbokki, and Eo-Mook Tang.\nI got into the car and started in on the Moo Sam, it was incredible! I had never seen or eaten it before when living in South Korea but it was so good, I ate them all right there! The pickled radish wrap is genius and the crab stick, peppers and radish sprouts make it delicate and sophisticated.\nWhen I got back to the office I started on the Eo-Mook Tang. The broth was perfectly seasoned and the fishcake was a great addition, although that's where the name comes from. I think the radish could have been a bit firmer but all-in-all it was a great dish.\nI was intending to take the Tteokbokki home with me but have already made several dips into it. The sauce is well-made, just spicy enough. The ricecake, mandu and fishcake were just right as well.  I don't think it's going to make it home!\nThe prices were reasonable, you're not paying City prices here. For the same money just the other day at another spot I got soup and salad with chicken breast added. What I got today will keep me full through dinner.\nMy wife and I will definitely be coming here and I'll be ordering to pick up lunch or dinner as often as I can.\n\n9/28/24 Add-on:\nI was missing a particular Guk dish but it's not on the menu. The chef kindly offered to make it for me and it was delicious! 맛있는!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIODZEYjFnRRAB",
            "text": "After a long day of selling real estate with McAteer & Will Estates at Keller Williams, we decided to unwind and recharge with dinner at Seoul Sizzle in Middletown. Arriving hungry, we explored a variety of dishes, and we were pleasantly surprised with what we experienced. Although this restaurant focuses on Korean cuisine, some dishes had a Vietnamese twist, adding an exciting fusion to the meal.\n\nWe started with Japchae, a classic Korean dish of stir-fried glass noodles, which was packed with flavor and perfectly complemented by sesame seeds. The noodles had a great chewy texture, and the vegetables were fresh and added a crisp balance to the savory dish.\n\nNext, the Beef Soup was a comforting and hearty choice, served with a side of purple rice and assorted sides, including pickled radish, steamed broccoli, and cucumber kimchi. The broth was flavorful with just the right amount of spice, and the beef was tender, falling apart in each spoonful.\n\nWe also tried spicy chicken served sizzling on a hot plate. It was rich, fiery, and satisfying. Each bite was bursting with flavor, leaving us coming back for more.\n\nOne of the highlights was the fried dumplings, golden, crispy, and served with a tangy dipping sauce. They made for a perfect appetizer and left a lasting impression.\n\nOverall, Seoul Sizzle offered a delicious and authentic Korean dining experience that helped us unwind after a busy day. We left feeling satisfied and already thinking about what we’ll order next time. Whether you're a fan of Korean cuisine or looking to try something new, this spot in Middletown is definitely worth a visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bXNqbk9REAE",
            "text": "The food was fine, generous portions but a little bland. However the service was really not good. Owners can’t seem to make up their mind about having table service or not. Having two people wait at the register asking us to come up to order, while also serving the food directly to the table is weird. Also, they don’t serve water unless you ask for it, while also having bottled water for sale. This makes it seem like you have to pay for water, which I’m sure is another profit driver for them. You also have to tip as soon as you order, which I really dislike."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidDlyOXBRRRAB",
            "text": "The food was delicious. Portions were generous and reasonably priced. The staff was gracious and accommodating. We had a birthday party with 16 people. They handled our chaos smoothly :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidFlTU2VBEAE",
            "text": "worst of all time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMU43M0tREAE",
            "text": "Nice and welcoming customer service, and the ambiance was lovely! The food was GREAT! Middletown needed a great Korean spot! I'm so excited to eat here again very soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNC1YanhRRRAB",
            "text": "This is a legit Korean place. The food is so good and the service is great. Usually it is very quiet and cozy in here. There is some roadwork happening around the restaurant that makes it a little weird to get into but it should be done soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURyb0k5dBAB",
            "text": "I ordered takeout (tteokbokki)(I've been in two other times for sit down).\nWhen I came to pick up my order it wasn't what I ordered. I felt bad for the miscommunication, and offered to pay for the mistake order and the one I meant to get.\nTurns out it wasn't what I wanted, but that mistake order (dak galbi) was what I needed, that ish slapped! Highly recommend! Even if they get the order wrong (probably just my bad cell reception) You'll be happy with what you get either way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMM3UycG9nRRAB",
            "text": "Great place\nGood food\nHappy vibes\nGood date place.. You can hear each other talk ...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMWR2OWJBEAE",
            "text": "Little hidden gem in this town. Love the decoration, atmosphere, presentation and quality of the food. The drinks are so pretty and not over sweet. This place is clean, and it’s just been an awesome dinning experience. I will come back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcmVhT2RBEAE",
            "text": "Absolutely love it. By far the best Korean food in Middletown. Everything tasted so fresh and flavorful. I absolutely loved how bright it was in the restaurant as well. I’ve also ordered take out and delivery from here and everything is always perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa0libHBnRRAB",
            "text": "They gave me only rice and left out the main thing. when I tried calling they didn’t pick up"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaWRiRU9REAE",
            "text": "This place was amazing. The chef/owner was so nice. She came out to explain the menu and asked if we had any questions. Everything was fresh and tasted so good especially the homemade kimchi! The soft drinks were unique and very tasty! The atmosphere and decor was very cool!  Overall we had a great experience and we will be back for sure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aGV2Yy1BRRAB",
            "text": "First time at Seoul Sizzle, and it wont be my last. We stopped by for lunch and was not disappointed. The food was excellent and the restaurant was chic and such a gem. You order and pay first and get to choose your seat. Your food then gets brought to you. It was a great experience!\n\nWe will be back for tea and dessert and set by the window."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMzdHS3hBRRAB",
            "text": "Food is excellent 👌. This was our second time having food from Seoul Sizzle. First time we did take out. This time we decided to eat there.  It's sort of cafeteria style. You order at the counter and they bring you the food. The young lady that took our order was extremely helpful and very knowledgeable about the menu. Food didn't take too long and everything was delicious. The staff is very friendly and checked on us several times to make sure that we didn't need anything and to see if we were enjoying the food. All the staff were very nice and accommodating. Atmosphere is is comfortable and neat. Entire restaurant including the restrooms were very clean. We will definitely be back and I would definitely recommend you to try them out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTVHVmVBEAE",
            "text": "5 stars doesn’t do this place justice! Everything was unbelievably fresh and  flavorful. I tried 5-6 dishes and I couldn’t tell you what I liked most - it was all perfect. The owner/chef Sunny is also so friendly and puts so much care into everything about this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNlBHbU93EAE",
            "text": "A very authentic Korean cuisine!\nWhen we went, they were still in the soft opening phase so not all menu options were available but still everything we had was delicious.. We appreciated the fact that food there tasted like real home food, and not like the ones that leave a strong aftertaste.\nI especially enjoyed the soft tofu (soondubu) soup and grilled spicy pork (jaeyuk bokkeum). The presentation was so nice and the restaurant was super clean too. Definitely willing to go back to try other menu once it fully opens!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMnJDaEZBEAE",
            "text": "Coming from Toronto Canada where we have a very big Korean community, this food is pretty good.  We order the tofu soup and bibimbap and they taste pretty authentic.  I just wish there is some Kimchi and we were a bit puzzled if there is service as we didn't get any water and there is a grab and go counter with drinks/bottle water."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMya3ZHTFN3EAE",
            "text": "Such a Jem! Recently found this place, went with my friends. We loved everything we had ordered. The atmosphere, the food, the drinks were all so good. We plan to be back more frequently knowing this place is right down the road! Definitely have to check out if you have a love for Korean food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyckp2OFhBEAE",
            "text": "What a great tasting authentic Korean restaurant for a lunch or dinner with family. Our family enjoyed every meal we ordered and their service was also excellent.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeGN2UWRBEAE",
            "text": "I love how the restaurant warm and welcoming the food was delicious it filled us up quickly  also the soda drinks are so that it was delicious. For the price they give is not to expensive and not to bad for price whole big plate we got. But tipping is a little pricey. I love the staffing and the young woman who help me and my boyfriend she was really nice to us the two time we went."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaFlYeDZRRRAB",
            "text": "Wow! Everything was amazing! My favorite was the seafood scallion pancake! So crispy and flavorful! The dumplings were fried to perfection! The Bulgogi was marinated soooo good.. it was tender and delicious. Served with rice, Korean potato salad, pickled radish, and kimchi cucumber! The rice was also great! I really enjoyed the toasted sesame flavors. My meal was the chicken and beef with the glass noodles and rice called dupbap... mmm mm m! It had a creamy sauce on top that was awesome! My ginger limeade tea had fresh ginger and lemons.. so good! The chef brought us complimentary  crab rolled up with peppers in a rice paper.. also yummy! Overall great fast service! The place is spotless! Highly recommend this wonderful restaurant to anyone that just wants great food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNk51YnNnRRAB",
            "text": "I'm rounding this review up from my desired 3.5 stars to four, because this restaurant is still in their soft opening. There is potential, but so far, the execution is a little lacking.\n\nSome of the positives: the presentation of the food was nice, and this restaurant is the cleanest thing for blocks around. That's actually the prelude to one of the downsides, being that this restaurant is on a corner near a dirty bodega, a greasy deli, a tattoo shop, of corner liquor store, two gas stations, and no parking at the restaurant. You have to park down the block and walk past some of these businesses to get here. As I sat near the window, I watched as the homeless and the beggars walked by.  One even came in trying to use the restroom.\n\nI ordered the beef bulgogi. It was the least flavorful version of this dish I have ever had at any Korean restaurant. I would have ordered something more exciting, except they were not serving their full menu yet. It was served with sides that were both very noticeably fresh, but also uninspired. Other Korean restaurants might serve with more interesting sides than a flavorless marinated cucumber, or plain marinated glass noodles. At the very least, kimchi would have been expected and would have been more flavorful than the sides offered. I did not see that on the menu at all.  I was impressed, however, with their choice of purple Rice instead of the more traditional white as the serving accompaniment.\n\nThe prices are reasonable for this type of cuisine, but rather pricey for the neighborhood they are in. I suspect that they will be doing the bulk of their business by delivery or take out.\n\nThe seating area was very poorly designed. I sat at the only two person table. The other tables seated six, eight, and three other tables at seated for. They either expect to only have large parties, or did not plan for dine-in customers.\n\nThey are a very modern restaurant, which I do appreciate. Their menus are digital, and while it's not working yet, they do have a self ordering kiosk. The style of the restaurant is, you go to the counter, place your order, and then sit and wait for it to be brought to you. You. You pay at the time of ordering, which makes tips and awkward situation. The cashier quickly skip past that screen when I went to pay with my card. As a result, I did not have the ability to add a tip to my purchase. To be honest, however, I feel awkward leaving a tip before I've seen the service.\n\nThe lady that helped me at the register was very friendly, however, she has serious problems understanding the English language. This will be an issue given the neighborhood that they are in. While I was there, I did not see any customers of Asian descent. All the customers were English speaking cultures.\n\nA small irritation for me, and one that I'm shocked didn't get caught by the health department, was that the front door does not automatically close. Since I was sitting at the table closest to the door, each time someone came in or left, and thought the door was going to close behind them, it didn't. I was treated to 30° wind blasts during my meal constantly.\n\nAgain, I have high hopes for this place. But so far, I wasn't impressed.  But, as it was a soft opening, I will still give them the benefit of the doubt, and will definitely go back again sometime in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOWZQQ3BBRRAB",
            "text": "This place was amazing. Everything from the food to the drinks were on point and fully delivered both in flavor and in plating. Highly recommend checking this place out for lunch or dinner, it really hits the spot. The Bibimbap is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMEptUG53RRAB",
            "text": "So glad to have a Korean restaurant in Middletown. The space itself looks great, the food was delicious, and the service was good. I definitely plan on coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb2ZyQmhnRRAB",
            "text": "The Korean owner is super nice as always:)) You can tell that they put a lot of effort into designing all these dishes and their presentation. And I feel like the food is more flavorful compared to the few times I came before. Will come again for the Dupbap!🤌🏼 Don’t forget to put your trays away after finishing the food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeDdQUjlRRRAB",
            "text": "We went the other night for the 1st time and it was pretty good. The menu wasn't 5 pages long, which was nice and simple. I had the Jeyook Bokkeum, which had a nice spice to it. My girlfriend ordered the Bulgogi and that had a good flavor. The only downside to eating there was that the 2 AC units were set at 60, which would be great for August....not so much for April."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMlktX01BEAE",
            "text": "Seoul Sizzle is a cute little corner spot. I had the  Yugi BiBimbap with Beef. Food was delicious, good variety of veggies in my bibimbap. My meal was filling but did not feel overstuffed.  I went back to the counter and ordered a plate to take home to my husband. The Place is clean and had a modern feel.  Probably a local favorite. Hostess was friendly. Thank you for a great lunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdjliRGdnRRAB",
            "text": "Really glad this restaurant opened in Middletown and I’m excited to try more from the menu/see how they add to it as they are around longer. We had fried Mandu to start which was great. The beef bulgogi and spicy pork were good but were both a little over cooked and could use more flavor. The banchan was really the only area I found disappointing. They had a potato salad, fish cake, a few pieces of cold fried chicken, and cucumber kimchi. I was surprised they didn’t have the usual cabbage kimchi and really missed it 😂 Maybe I’ll bring my own next time? The black sesame ice cream at the end, however, was phenomenal. Still thinking about it and would go back for that alone. The people were super friendly and I am glad they are BYOB!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1c01QOUxnEAE",
            "text": "Amazing food with the right amount of heat.  Super clean and everyone here is so nice and accommodating.  Highly recommend if your in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdEx6U2R3EAE",
            "text": "The food at Seoul Sizzle is delicious! Everything we ordered was phenomenal. The establishment is also beautifully decorated and the staff is very friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeXJ5a3F3RRAB",
            "text": "Quite authentic presentation of Korean food. Their rustic silverware was surprising as their truly classic style is not often seen anymore. Bit on pricey side, wait time can vary depending on dish, but mostly good. Their seaweed soup is much better than I expected."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNnZUV3VRRRAB",
            "text": "I had an incredible first time dining experience. The service was outstanding and the food was very delicious 💯 I definitely recommend eating hear as you get your food in a timely manner, the environment is clean and peaceful and welcoming…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLXBPcDN3RRAB",
            "text": "Excellent food and wonderful atmosphere! Great presentation and excellent service! This spot just opened but it is super refined that it feels like its been here for years.…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMWVYVm93RRAB",
            "text": "The place was great. It is my first time eating Korean food. The owner came and asked if we like kimchi. Then she brought out some & my wife loved it. Our plates were empty.  Only street parking but the food makes up for that."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaHJYZjdBRRAB",
            "text": "The taste of the creator is truly a revival of food that has the taste of each ingredient!  The taste of unbelievable grace.  Come and taste it!  best serving !  best server !  amazing place!  best cook\nHow gorgeous gorgeous that table!!!\n\nWhat a tasty bulgoki with simple soup! What a perfect combination and harmony!! A~~~~~~amazing\n\nPs: for those who don't know about this food concept.  This calls meal table of king!\nThis is very im~~~~ impressive!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc3JETGtBRRAB",
            "text": "BEST FOOD EVER!! The food was amazing, the drinks were really good and they look really pretty. Everyone should come here and try it out ❤️❤️🤩…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNWNTanNRRRAB",
            "text": "Nice quick eats. Food came out in 10mins and was delicious. Drinks were good as well. Only complaint is the girl at the front counter wasn’t too attentive. But overall good experience and will be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb1B6VFR3EAE",
            "text": "Nice quality Korean food with fresh ingredients. The waiters are friendly with great attitude with customers. Best Korean restaurant around Middletown."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXako3cjN3RRAB",
            "text": "The presentation, the food,the service also the price Simply amazing.Moo Ssam,\nJeyook Bulgogi with purple rice, comes with4 sides and a nice surprise of watermelon at the end."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a09Pa0tnEAE",
            "text": "This place should be one of the must visit restaurants when visiting Middletown or Legoland. I found this restaurant on Google with great review. I didn’t have high expectation at the beginning. But I changed my mind after walking in the place, tasting the food, enjoying the service.\n\nThe restaurant is clean and organized. I ordered the 19-Tteuk-Baegi Bulgogi. Delicious soup with fresh vegetables, sliced beef and glass noodle. It come with purple rice (My kids ate them all). The chief served Moo Ssam before the meal and tasted soooo good. The most surprised dish is Hell-Imja Ice Cream with Nokcha Crumble. I am not a big fan of ice cream, but I can finish this black sesame ice cream in 3 mins.\n\nThe staff were gentle and sweet. My little girl break a glass and the gentleman cleaned the dish and checked if my little girl’s hands were ok. Thanks for the delicious and great service!\n\nI would defiantly visit this restaurant again next year! Pay attention to the parking sign."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMExia1F3EAE",
            "text": "Wow!!!!\n\nThis place is a must! We came in after driving by one day and seeing the recently opened restaurant. We have been looking for great restaurants in the area and this is hands down top tier!\n\nA great selection of dishes and we were thrilled with the service, quality, ambiance and most importantly taste.\n\nIf you are looking for the best restaurants in Middletown…this has to be on your list!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaGVMX1ZnEAE",
            "text": "I'm vegan, although there were a few vegan options on the menu the chef was nice enough to come out and discuss options with me face to face. She also went above and beyond and made a special sauce for me to accommodate my edited vegan dish- it was delicious!!"
        }
    ],
    "reviews_count": 81
}