{
    "name": "San Gennaro",
    "place_id": "ChIJ00nj9H30wokR8izVYd3dAzY",
    "grid": "BX5",
    "address": "2329 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.4,
    "user_ratings_total": 434,
    "phone_number": "(718) 562-0129",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNk9ERmlMV2RtVW10cVNERlhTMmRsZGpNeWRsRRAB",
            "text": "Amazing food, service and ambiance.  Knowledgeable servers with great attitude."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTGFqQkJXamhvUzFaVE1qRkJVRUZmZFdzM1ZrRRAB",
            "text": "This is our favorite restaurant on Arthur Ave.  We love its small intimate dining room that's practically in the kitchen.  Just celebrated a 40th birthday there, and everything was fabulous.  Ever-present Gennaro and Luigi went out of their way to accommodate our family of 17.  They served 17 hot entrees at the same time - one from the extensive gluten-free menu.  The food is outstanding. Perfect salads, antipastos and pastas, fresh fish, authentic flavors, outstanding tiramisu and plenty of SCC Napoli talk."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMmFITk1SbkptZGtkTVF6aFFjblY0V1ZrMFQxRRAB",
            "text": "Very cozy seating. Friendly, attentive service. Clean single bathroom. Food mediocre. They didn’t have most of the beer options on the menu, but the draught Peroni was good. Worst eggplant parm I’ve ever eaten. Caesar salad tastes like the kind out of the bag from the grocery store. Cute Vespa out front, for a photo opp."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObmVHSXhjV0pxUmpSMk1qRnljMHhxVmxSVWMwRRAB",
            "text": "We were looking for a good restaurant  near the Bronx Zoo but also needed gluten free options. SAN GENNARO had an entire gluten free menu (in addition to regular menu) and the GF ravioli with truffle sauce was REALLY good. Also had fresh baked GF bread. Loved this place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNE9IcEVOR0ZWT0hac09EQlZibll4YkZscFJIYxAB",
            "text": "Ordered off the extensive gluten free menu including cavatelli, stracciatella, and. delicious cannoli"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weWMyTkRibHBDU1dreVEzVnZZV2xUVFdWdE5HYxAB",
            "text": "My mom used to live 30 minutes away from Arthur Ave and we wanted to visit in our trip to NYC. San Gennaro stood out immediately on the street because we had celebrated it ten years ago together.\n\nWe've been to Italy before, and this place immediate stood out as a true taste beyond the touristy cliches you see everywhere. The vibe was calm but festive. We enjoyed the wine and limoncello cocktails they had to offer, and the food was incredible. The pizza fritta wasn't what we expected, but it was single-handedly the best pizza we had across NYC. The veal and prosciutto were mouth-watering, and the calamari lemon pasta was perfect with it.\n\nThe staff were friendly too, always prompt, and made it a great experience. We will definitely come back one day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb1VYcGtlbTlqZVRFME1IcHhTbms1Y2s5VFQxRRAB",
            "text": "Really cute little place with a very nice atmosphere.Had buffalo mozzarella special appetizer- excellent- our main courses -my raviolis and my wife’s pasta with shrimp/calamari - were also very, very good. You can tell that it’s Homemade pasta from the first bite- our server Joy was fantastic -Sidenote, bathroom was extremely clean as well which isn’t always the case in even the nicest restaurants- i’ve never been to Little Italy in the Bronx, but I would certainly come back here just to visit this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZmJGUnhNM2RsUTFONlFYbDZVVEpKU2t3MFdFRRAB",
            "text": "Great service, good food."
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCck1XTnJYMmcxVUhkWllWcFlXbXR0U1U0elJIYxAB",
            "text": "Oggi ho incontrato il ristorante San Gennaro nella Little Italy del Bronx (Arthur avenue) il servizio è eccelente e si mangia come in Italia !!!!!🇮🇹"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT2RWSjRXWHBXYWxGdU56VnNhbFIyYTFkclRWRRAB",
            "text": "I don't understand how this place has such good reviews.\nYou will understand this review when you go there in a Saturday evening.\nFood terrible, service blah, place is just whatever. Just look as that octopus.  It looks it was made by blind person"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWemVFbFBPSFIzT0VNek5HNUZjazEwUVZSU05uYxAB",
            "text": "Posto fantastico come essere a casa cibo ottimo personale accogliente. Consigliatissimo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveVQxbHJWM1ZJV1dsSGNrUTFTbkZMY25OTWRYYxAB",
            "text": "I've eaten in many Italian restaurants during my years living in NY and this has been one of the best Italian culinary experiences I've had so far in the NY. Before visiting here, I hadn't had gnudi pasta and bufala Mozzarella. Food, service and price were awesome too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbWEwMVFhRE5RVldsTWJqSm1SMUJVVkd4cFpsRRAB",
            "text": "Amazing service, food was amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ob1FsaFVNRVZtYUMwNGVVdHphMXBXZW1wTmMwRRAB",
            "text": "Best meal I ever had. Salmon with red sauce 🐐"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaGVGQTBZa2hVU2sxc0xVMWtXR1Z2ZWs5aGVVRRAB",
            "text": "Outstanding place,, great service,great food,amazing staff… visited a few times on our trips to NYC, can’t wait to go again.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd2IzaHpUR3BtYzJONlNWWlpOVk4wV21GdmFFRRAB",
            "text": "Quaint and so warm! From the service to the food, a wonderful place for any occasion. Branzino is light and seasoned perfectly not to overpower the fresh fish flavor"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdUY5NnpNdDkzVllBEAE",
            "text": "There are no words. Joy, was our waitress - she’s spectacular. The food, 11/10. I’m nearly comatose."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQk4zSk5aMHh5VERaclIwdDZZbDlvV1hJM1FXYxAB",
            "text": "I grew up in the Bronx New York but like most natives rarely enjoyed GEMS in other neighborhoods. Sadly up until I was about 9 I lived in walking distance of this beautiful what is called little Italy in the Bronx . We never called it little Italy growing up . We just new the neighborhood had many Italians and the awesome smell from the bakery every morning . Now that I am all grown up and earn enough money to indulge food and culture in a different way . I want to give a warm thank you to this wonderful restaurant named San Gennaro in the Bronx little Italy not Manhattan. The waiter was a absolutely amazing as you will see in this video. The owner and people worked treated us like family . It doesn’t matter if you live in New York or just visiting. The soul of New York has its footprints all over this neighborhood. A true Bronx Gem."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbGFIaEZYMkZRWVdreFN6TjFWRGsxV0hZeFNVRRAB",
            "text": "We went to dinner at the San Gennaro on Arthur Ave in Little Italy in The Bronx after our bus trip to Yankee Stadium. First time here on Thu 5/22/25 4:30pm.\nWe were greeted & seated by the owner Gennaro Martinelli. We ordered wine ($14 & $11) while we looked over the menu. We had the very good Sole Oreganata w/ roasted veggies ($26) & very good & hot Cavatelli con Salsiccia e Broccoli di Rape ($23) Including warm bread w/ a zesty olive oil dip. a very good value & quite tasty.\nService & food were very good.\nNote: street parking is scarce but, there are paid public lots in close proximity.\nThank you Gennaro & your staff for a fine meal after the Yankee victory.\nNick & Liz, Albany, NY"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMFJscFdNQzExYVRGUk0wazBaSHAyVFZsRmVVRRAB",
            "text": "First, my daughter has Celiac and the team was VERY accommodating. Fantastic fresh food, including gluten free bread; Fantastic service and patience; great experience. Will be my go to for Italian food in the future. Thank you Gennaro!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUGM3czMxOXJEYmhBRRAB",
            "text": "The crust on the pizza was so crunchy and light. The truffle ravioli was delicious. Top notch place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT1Ffb3UwMy1IM1RnEAE",
            "text": "Food was excellent. Best fried seafood I've had in a while.  Place was a little small so make reservations.\n\nExcellent gluten free menu, see my photo."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZUNsS1Ntek5XclV3EAE",
            "text": "We ventured into Arthur Av for lunch after hitting the NY Botanical Gardens. Thankfully, San Gennaro had available tables since it was Mother's Day. The restaurant is cozy, sitting for less than 40 people, including the tables outside. The staff are super friendly, prompt, and helpful. We started with the fried meatballs and the burrata salad with Prosciutto presuito. The burrata is homemade, and it's creamy and delicious. The salad was amazing. The meatballs were excellent. They were served in a little skillet with onions, garlic, and red peppers. For our mains, we ordered the ravioli alla bolagnese and the cavatelli with Italian sweet sausage & sauteed broccoli rabe. The cavatelli was light in flavor, but good. However, the winner was the ravioli. The bolagnese sauce was probably the best bolagnese sauce I've ever had. It was rich, bold, and so full of amazing flavor it was awesome. This place is a gem. I highly recommend you stop here and get anything with their bolagnese sauce."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHVxakNREAE",
            "text": "I placed an order for pick up and I tried the food and I can’t believe that I paid almost 90 dollars for this garbage. The carbonara pasta said pancetta and they put a string of bacon on top. Do not recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbVBtS2FREAE",
            "text": "a real napolitan experience in the Bronx! Great food and ambiance. Staff is awesome. 100% returning the next time I find myself on Arthur Ave.   salud!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc195NTd3RRAB",
            "text": "Food, ambience and service are always good. Stopping by over the years, it never disappoints. Try the Branzino!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaXJ2aHJ3RRAB",
            "text": "Treats people with respect. Food is insane and creative and a hidden gem. Tell them Pauly sent ya."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bEtYdkRnEAE",
            "text": "Service was okay,  food horrible! \"Pasta Cacio e pepe\" wasn't not only far away from the authentic Roman  dish but tested awful . The \"Nudi\" they test okay but nothing to do with the really \"Nudi\" from Toscan. The only good dish was the grilled octopus."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OUtpNXFBRRAB",
            "text": "A Must-Visit Gem!\n\nI had an absolutely delightful experience at this restaurant! The Pancetta Carbonara I ordered was cooked to perfection—creamy, flavorful, and with just the right texture. The prosciutto salad was generously portioned and well-balanced, and my lemonade was refreshingly cold and delicious. To top it all off, the tiramisu tasted truly authentic—rich, smooth, and just the right amount of sweetness.\n\nBut beyond the incredible food, I have to give a special shoutout to the service! Gabby and Luigi took care of me, and they were both beyond wonderful. Gabby’s energy is contagious, and her smile lights up the entire place. They even made me a lovely video, which was such a thoughtful touch!\n\nThe restaurant itself has a beautiful, cozy ambiance that makes you feel right at home. If you visit (which you definitely should!), please remember to tip well when you receive great service—these amazing people truly deserve it! Can’t wait to come back soon!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTZfbDRRRRAB",
            "text": "I made a last-minute decision to order, which can be risky since you don’t always know where to go. But this pasta was perfect—everything was balanced beautifully! Highly recommend this place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncDV5cnB3RRAB",
            "text": "You cannot go wrong with chef Gennaro.👍😃"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHFMWHJ3RRAB",
            "text": "Best place to catch a Napoli game too."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXFPeHRRRRAB",
            "text": "I can't wait till our next visit. Everything was impeccable, from the service to the food and drinks. Luigi, our server, never skipped a beat. We started with the Arancine and Buratta for antipasti, for primi we had Cavatelli Al Frutti Di Mare and the Gnocchi Gorgonzola, for secondi we shared the Scaloppini Al Vino Bianco with a side ofBroccoli Rabe. We finished the night with espressos and BABA' Al Limoncello, which set the bar kinda high for Baba's in general. As a lifelong Bronx resident, this is my first time attending a restaurant on Arthur Ave. I can not recommend them enough!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOWNieTVRRRAB",
            "text": "Food was delicious and service was outstanding"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNWRpWDRRRRAB",
            "text": "Made a reservation on OpenTable.   Got there on time and was seated.   The guy who sat us then played on his phone and ignored us though the restaurant was empty.  Soon he was joined by a second gentleman,  both ignoring us.   We gave up and left, they didn't even notice.  We walked down the block to Enzo's, had a great meal and was ready to forget about it. Then I received this insulting email.  So let me post their words...\n\"You having reservation at restaurant....you come you seat we give you a water and after 5 min you get up and LEAVE and you don't leave said bye.... I hope you don't have any kids or grandkids is not the way to EDUCATE kids enjoy your day i hope they treat you like you treat bye\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucGJlNm1BRRAB",
            "text": "So, we've been to this restaurant before and liked it. We decided to try again. Got seated, given water then the gentlemen there played on their phones, which we could see and hear, for more than 5 min.\nWe decided they weren't coming back anytime soon so we left. They didn't even look up and ask why.... too busy on phones.\nLater we received this email from the restaurant. You decide if you want to patronize establishments that would send this\n\"You having reservation at restaurant....you come you seat we give you a water and after 5 min you get up and LEAVE and you don't leave said bye.... I hope you don't have any kids or grandkids is not the way to EDUCATE kids enjoy your day i hope they treat you like you treat bye\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc0pINFlREAE",
            "text": "Went there cause it is quieter than most however warm and friendly. The meal was top notch start to finish. We had the grilled octopus and some pasta dishes and it was delicious. Service as well was spot on"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTZyLXJ3RRAB",
            "text": "This place is the best restaurant on the Ave.  Pasta is fresh and the service is amazing.  Pics below are after we started eating.  Forgot to take prior."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3enNXcmpBRRAB",
            "text": "The food is delicious and very authentic, the staff is very warm and welcoming and the service they offer is immaculate"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMzVTdld3EAE",
            "text": "The service was attentive, the owner was kind and the food was delicious. The gem was the \"pizza\" which was more like a calzone with a sugary dough and the most amazing cheese filling. But the most delightful dish was the delicious triple chocolate mouse that the owner was kind enough to comp us because we were celebrating a birthday. It was to die for! 10 out of 10! I can't stop thinking about this wonderful meal was. Can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybF95RTVBRRAB",
            "text": "Great service\nGreat pasta\nI have the nudi without the meat\nThe sauce and the pasta light and delicious\nI recommend without hesitation ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN2R2UE13EAE",
            "text": "Food is tasty and fresh! Have visited twice, no disappointment at all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbDlqRTh3RRAB",
            "text": "DECIDED TO MEET UP WITH MY GODMOTHER FOR LUNCH ON ARTHUR AVENUE & DECIDED TO TRY THIS SPOT & THE CHOICE WAS NOT DISAPPOINTING... THEY HAVE AUTHENTIC ITALIAN CUISINE,  YET THEY CAN COOK TO ORDER ANYTHING YOU WANT. SO I HAVE A LOVE FOR CHICKEN FRANCESE & IT WAS TOO DAMN GOOD. THE CHICKEN WAS SLICED VERY THINLY LIKE U WOULD FOR A CKN PICCATA DISH. THE POTATO & GREEN BEANS SEASONED AMAZINGLY, BUT THE FRIED BROCCOLI WAS SOOOOOO GOOD. AS LONG AS ITS NOT DRIPPING WITH OIT ( WHICH IS WASN'T) IT WAS A FAVORITE.  AUNTIE GOT SHORT RIBS OVER RIGATONI.  IN A BROWN GRAVY  IT LOOKED DELICIOUS SERVED WITH LEEKS ON TOP. I WILL DEFINITELY DEFINITELY BE GOING BACK. AND IDK WHAT BRAND , BUT THE MOSCATO WAS PERFECTLY PAIRED TO THE DISH."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbU1Xb21BRRAB",
            "text": "Ottimo cibo italiano"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaThyLXhBRRAB",
            "text": "The best Italian food you will find outside of Italy, and perhaps inside also.  Fantastically well and authentic! Give it a try, you will never regret it!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN2QzY1dBEAE",
            "text": "Nel Bronx nella zona di Belmont c’è Bronx Little Italy un pezzo d’Italia vera. Ci sono negozi e ristoranti tra cui San Gennaro. Eravamo al fantastico tour “il mio viaggio a New York” . Abbiamo bevuto un buonissimo caffè, l’ambiente è molto accogliente e pulito. Cortesia e allegria invadono il locale. Spero di tornarci per assaggiare qualche loro piatto."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMVlLbHNBRRAB",
            "text": "Great food, friendly people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcklmcUFREAE",
            "text": "The best Italian in New York"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeGZ6XzhBRRAB",
            "text": "The BEST restaurant on Arthur Ave. Very classy atmosphere and a very warm welcoming feeling. From the pasta dishes to the seafood and steak nothing ever disappoints . The Nudie naked pasta is a MUST. Homemade Limoncello in many flavors is absolutely mouth watering . I have been a customer for many years and have celebrated occasions here many times with family and friends and every time has been an amazing experience. Excellent service and always outstanding food. Highly recommend you Dine here. You will not be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd09tcVN3EAE",
            "text": "Small place with a big impression.\n\nA coworker of mine has been raving about this restaurant and we decided to coordinate a work family dinner. We crossed over the bridge for this place, and it was well worth it. It's a very small restaurant but the food and service is fantastic.  At the end of our meal they offered us little shots of homemade limoncello. I really enjoyed the food here - the freshness and simplicity of the dishes with a punch of flavor. It's a little bit of a distance for me to go all the way into the Bronx but for a nice gathering with friends or family it is certainly worth the commute."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSODlhRFpBEAE",
            "text": "Phenomenal Italian eatery on Arthur Avenue!!  You can slip into many places on Arthur Avenue for a bite but my suggestion is....don't pass this one up!  The bread was warm, served with a sweet pepper oil I'm still dreaming about!  I wish they bottled it.  Their homemade meatballs were the best I've ever had....ever! 😋 Service was impeccable, authentic atmosphere, indoor and outdoor seating.  I wish I lived nearby because I'd become a regular weekly customer at San Gennaro.  Thank you for a memorable meal"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwd2VlamZREAE",
            "text": "The waiters were really friendly and explained to us the menu and gave us a recommendation on what we should eat. Our entrance, second plate, dessert, and wine were super delicious. We had a great and quality time in the restaurant, my friend told Let's go back to the restaurant with the flowers, I like flowers, we were looking and checking menus of other restaurants nothing to compare with San Genaro. We are going back with more family. Thank you for the delicious food and services."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteUtUU2VREAE",
            "text": "Excellent authentic Italian restaurant. We had the meatballs to start, followed by two pasta dishes and a homemade mandarin lemoncello to finish. Fantastic service and a real taste of Italy in the bronx and well worth the journey from Manhattan!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXa1puM2pRRRAB",
            "text": "Arthur Avenue is chocked full of Italian/Italian American restaurants, we picked San Gennaro for lunch because of the enclosed sunny seating area and very hospitable front of the house team. The restaurant turned out to be a lovely choice - the staff were friendly and attentive, the atmosphere was what we were hoping for and the food was tasty. The chef was accommodating of vegetarians and we ended up with the gnudi, paparadelle with mushrooms and a ravioli marinara. The gnudi was recommended by the waiter and was definitely the strongest dish - absolutely delicious. The limoncello marscapone cake was another winner. San Gennaro is a solid choice among the many winners of Arthur Ave."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbWRTQlRBEAE",
            "text": "Excellent Italian restaurant in the heart of Arthur Ave's Little Italy.  The food is consistently good and the service  is very good.  They  always have great  specials.   The restaurant  is cozy but adds to the charm of Arthur Ave.  The pasta nudie is excellent."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQweHZDQXBRRRAB",
            "text": "Living in the five boroughs all my life and I must say the moment I walked into this place I was transported to Italy. The ambiance was so welcoming. There was an accessible ramp on for anyone in need. The service was prompt and attentive…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDaVBEQnhBRRAB",
            "text": "Delicious seafood pasta and veal! I loved the seafood pasta and thought it had a generous serve of mussels and calamari. Also enjoyed a frozen sangria. Friends were pretty unhappy with their meals - they had the eggplant Parma (apparently…"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcUsyQVpREAE",
            "text": "Da buoni Italiani ci siamo recati a \"little Italy\" e naturalmente da buoni Italiani siamo andati a mangiare Italiano. Pur trovandosi nel cuore del Bronx e piu precisamente ad Arthur avenue, entrando da San Gennaro vieni proiettato in Italia, accolti da due gentilissimi ragazzi che ti si rivolgono nella nostra lingua(comodo per chi come me non ha dimestichezza con la lingua inglese), il locale avrà circa 20 tavoli è molto accogliente e ben tenuto. Abbiamo ordinato dei fritti come antipasto, due piatti di cavatelli con salsiccia e broccoli di rape anche qui un paio di birre(Nastro Azzurro), e per chiudere del profiterole e caffè. Consumato tutto con vero piacere, anche qui secondo me prezzi nella norma."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4dWFqR0NREAE",
            "text": "They have multiple exterior seating options with front patio and street side table service with cabana. Friendly and considerate staff coupled with good food and Prosecco.\n\nWe had another opportunity to review the facility for a festive time during the dinner service; and it was impeccable. Fresh bread, pasta and salads accompanied by fried meatballs were simply shiny. It was also nice to dine indoors during these challenging times (not to mention cold weather)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnFMUkFREAE",
            "text": "Order take out penne la vodka with chicken. I’ve had way better penne la vodka from pizza places. The penne was hard think it could’ve boil more an also need some more flavor in the sauce taste bland. Also online menu price is different. To me it’s over price spent $28 on plate of food that was no worth it"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxei03MTR3RRAB",
            "text": "The food here is only outdone by the care for the service. The only down side to this place is the lack of alcohol on the menu. But they will happily provide free service for any bottle you bring. I've been coming here for a year. The attention to flavor for every dish is awesome!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ0lMejF3RRAB",
            "text": "The food was fabulous!!! Unfortunately they are having issues with getting a liquor license. But we got around that. Don’t forget your COVID vaccination card like my fiancé did. For November it wasn’t bad out, so we sat outside and ate dinner. Felicia our waitress was friendly and accommodating. We definitely will be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhdnByZkh3EAE",
            "text": "A pleasing eating atmosphere. Both indoor and outdoor seating. We chose to eat indoors. The staff was very attentive and friendly with quick service. The food was very delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcmE2bmJBEAE",
            "text": "The real taste of Italy! We enjoyed the taste of our dishes. The missing star is due to lack of table cloths and table presentations. The neighbor restaurants have better visual presentations."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cnV1dlFBEAE",
            "text": "Horrible experience with delivery from this restaurant. They completely botched our order and tried to blame the delivery service. Missed half of our order then sent the wrong dish all together. Ordered the Pollo San Gennaro and it was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcXZHWGNBEAE",
            "text": "I was at San Gennaro’s yesterday for a private event and I cannot begin to tell you how amazing the experience was. Gennaro, the owner, was warm, welcoming and his staff did a FANTASTIC JOB with all the amazing food and service. Everyone was friendly, professional and very accommodating. I ate absolutely everything they served! The antipasto appetizers were so yummy, (I had never had fried rice balls before) the salad was perfectly prepared and the chicken parm was absolutely delicious! Food restrictions were taken into consideration during meal prep for all guests. I had such a wonderful experience here and I look forward to visiting San Gennaro’s again with my husband this time for dinner!\n\nI recommend this gem on Arthur Ave without reservation! Thank you so much for making my friend’s wedding and reception such a beautiful and memorable one!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc3QyTWFBEAE",
            "text": "Beautiful Restaurant. Hostess is awesome. He makes you feel so welcome and waitress was also great. Would recommend this Restaurant to anyone who what’s Authentic Italian Food and beautiful Atmosphere!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeXVUY2JnEAE",
            "text": "We came from Oregon and just wandered. Found this gem and OMG it’s authentic and so damn good. Thanks for creating a lifetime memory. This meal this place will resonate with me forever m!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNcmFubE1REAE",
            "text": "We love this place, so lovely!\nThis restaurant was our first time to visit New York and we took a walk in this area and chose this one, their food tasted so good. And we moved to New York in…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc3Yyd0xREAE",
            "text": "What a beautiful place. The Hostess was amazing at recommending dishes. The waitress was lovely. It’s a real authentic Italian restaurant. I had an amazing birthday dinner. I had the Paccheri Genovese and my husband had Cavatelli Con Salsiccia. All I can say is Wow. Bless the chef. If you want real Italian food , then this is the place to go. Thank you for an amazing time"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4a3VmbUVBEAE",
            "text": "This veal chop w bone was fabulous.\nGood texture and flavor, the portion is very generous.\nDue to covid, outdoor seating only.\nDefinitely going back there for more veal chop."
        }
    ],
    "reviews_count": 71
}