{
    "name": "Clinton Hall",
    "place_id": "ChIJBbjPq4H0wokRYUVlZKLFPHI",
    "grid": "BX5",
    "address": "601 E 189th St, Bronx, NY 10458, USA",
    "rating": 4.4,
    "user_ratings_total": 493,
    "phone_number": "(718) 220-6400",
    "reviews": [
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3N3RtbDJ3RRAB",
            "text": "Update 10/2025\nI was a big fan after a long day at the hospital (see my prior review below).\nSince my last visit (I come every few months) all of the regular ABV beers have undergone a ridiculous amount of shrinkflation.\nAs a craft beer connoisseur, I'm used to higher ABV beers being smaller volume, but 10 oz 6% beers at the same price as what was a pint or at least 12oz is a bit crazy.\nknow that our dear president\nlevied a 100% tariff on China, but I don't think that beer from Port Crane, NY is affected by that. And draft beer doesn't require aluminum cans.\nI guess I'll have trek over the\nBronx Alehouse for 16 oz of\nhigh-end beers like Other Half Bronx house for 16oz at the same price.\nI feel sorry for the Fordham\nstudents!\n\n2018\nGreat addition to Belview, Bronx!\nKevin, the head bartender/psuedo- manager is a great guy. He delights 8n customers' satisfaction and knows their beer selection inside/out. Just ask him what to drink and he won't steer you wrong!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcldFeFNkVFpzZGpGQ2EzaHRXQzB5UWpsemVIYxAB",
            "text": "I didn't take any pictures but I had these amazing wings, I forgot the sauce name. I paid about 40 bucks for two big orders of wings and Waffle loaded fries"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWFRERnNaMnd0U2trNVNUbFdia3AzVWtOT1dFRRAB",
            "text": "This is a hidden jewel in the Bronx. Glad my friend held his event here. I'd definitely return to this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNFNXWjBkQzFpVlRoaFExRTFVMFJxVUZjMGNWRRAB",
            "text": "Place super clean. Bartender was super nice,  professional,  personable. Good finger foods.  Could use air conditioning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLN2t3NFAtX0o2SHhRRRAB",
            "text": "Disappointing on the service of the food I got wings and fries spent about $30 on takeout but before I ordered, I asked special request can you please mix buffalo and lemon pepper garlic together? They told me it was fine when I received the wings on side cups, and the fries were soggy with no salt wings were undercooked. I went back to inform if they could mix it up together and The chef stated that he cannot cause he will get in trouble for a customer to spend about $30 for something he didn’t wanted and he’s not receiving it is very unacceptable and I will not be going back that is not right"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdTBocl9OdU5TRDhRRRAB",
            "text": "Great food and atmosphere"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb1phUzJnRRAB",
            "text": "Great place. Allot of couches and seats to sit in. Not the best food however I only had the chicken tenders. Not a fan."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c0pmSVdnEAE",
            "text": "Fire food, fire sports, fire vibes! Home of the TRBX watch parties"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d0tmTnR3RRAB",
            "text": "Go during non-busy hours and lounge around comfortably while having a bite and trying out the selection of drinks at this location. Appetizer portions are big. Consider sharing or be ready to bring some Buffalo Califlower home for dinner, my fave. Also fantastic for a large group celebration."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcC1QY1Z3EAE",
            "text": "Just went to Clinton hall again after moving away for 3 years. The service was extremely rude and inconsiderate. Had to ask for water multiple times and when asked for sharing plates and utensils the girl immediately got an attitude. The food was terrible they didn’t even heat up the nachos or cheese in the oven. It’s disgusting and we will never go back."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzcGJXMkZnEAE",
            "text": "Fantastic choice of craft beers and a nice selection of cocktails. Their wings are delicious and their bartenders seem to always be in a good mood. There's always a mix of locals and college students, so the atmosphere stays quite lively even when it's quiet"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncnBMRHF3RRAB",
            "text": "Great service and beer selection. Smashburger is excellent"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNnEtSDlRRRAB",
            "text": "I used to love this place, however, I have noticed that the prices have gone up and the food quality has gone down."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcjlmSERnEAE",
            "text": "I have enjoyed multiple visits during football season, and each time has been a satisfying experience. On football Sundays, I look forward to indulging in their delicious wings, refreshing beer, and the excitement of the games on big screens. The lively atmosphere keeps me coming back for more, and I’m eager to explore their other locations to see what else they offer."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaDZpQWNnEAE",
            "text": "Clinton Hall is the place where, after a hard day of work, people from all walks of life gather around and be themselves, away from the constrictions of employment etiquette. I personally loved the guava fruit drink, with 5 percent strength. My friends and I were able to catch up on events. Also, we met this IT dude who opened our eyes to be ambitious and successful. We exchanged social media and gathered ideas on our next job ambition. The place is immaculate, with the vibe of a local pub. It is well-maintained, and the good noise is just what I needed, reminding me of my last party with friends last year. All the festivities drowned out the silence I usually get when alone. I love the drinks, the vibe, and most of all, the water they provide to hydrate the mood. Thank you Clinton Hall. It was a pleasure to be here."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc1ptX2hBRRAB",
            "text": "Good vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYc2Jfblh3EAE",
            "text": "Dint like the crowd much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd2ZQRG1BRRAB",
            "text": "Great place to eat and have a Manhattan bar vibe... and I own businesses in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbU1mQXhRRRAB",
            "text": "The best bartender works here. I asked him to surprise me with something he might think I'd like and every choice he gave me was spot on."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNEp1ZUpBEAE",
            "text": "Absolutely delicious food, omg the garlic parm wings 😍😍😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucXBuelNnEAE",
            "text": "Fun draft selection with a nice ambience and plenty of comfy seating - love the annex with the couches and floor-to-ceiling opening windows."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyM1BYbnhnRRAB",
            "text": "Went here with a group of friends to watch a soccer match; no reservation but we were able to find a table. Menu is limited but I kinda expected that, nothing super special, American-type food. Great variety of beer (as expected) and they were cheap and tasty. One of the biggest hypes of course are the games; you won’t get bored ever because they have a great selection of games to keep you entertained. In general vibes were good (music a tad loud maybe), but would come back for sure 👍🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNlBfdGNREAE",
            "text": "We love the bartender Emilio, he’s such a vibe! Everyone is so so nice and friendly! The nachos are amazing. Since we moved here we are obsessed with coming here for drinks and it’s always a great experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycDRHd1dnEAE",
            "text": "Alive at night but desolate during the day. And drafts were $8 is that normal especially when I'm the only customer there. I found that unnecessarily expensive. Maybe that's why the place was empty at 5p."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cHFmT3RnRRAB",
            "text": "Food and drinks are great. The music caters to their core patrons - Fordham U students so as a Latina woman who loves to dance, this isn't the spot for that but still a chill place to hang and chat with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaEtQaUJBEAE",
            "text": "I’m not sure if it was a location thing but how we was treated was unacceptable! We really felt discriminated against, we go to the bar and had to wait a few minutes to order drinks which was ok with us and I asked the bartender for the drink menu.. she says that they are mostly known for our beers but we do make margaritas and old fashions ..about 8 minutes passed and we are still waiting for the bartender who served 5-7 people behind us before acknowledging us we said that we wanted margaritas.. she made the drinks which looked skimpy to the point she added more ice and it still looked skimpy.. ok so I asked how much but at the same time she said that we had to move because the guy that was sitting down at that bar was back and standing behind I said ok but let us pay you first.. We paid her and walked out to the curb to the outside sitting area and we discussed what happened and said we will not come back because of how we was treated.. the energy was definitely off and I wish I could say it probably was just a bad day but I can’t because the people behind us wasn’t treated like that so be careful when coming to this location.. yes it’s 2024 and still discrimination is still happening and that’s sad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeE5QM293RRAB",
            "text": "Awesome place the food is awesome the staff very accommodating and the entertainment code of conduct band is outrageous"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcUxYcW5RRRAB",
            "text": "Good beer food is decent at best"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeTRmeHd3RRAB",
            "text": "Great place love the food, cool games"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkci0yRmdBRRAB",
            "text": "I had a party of 20 people with me. The place is small but great. One side has the games and tables and the other side is a cool lounge area with sofas and Tvs. We each ordered separately as well. In most restaurants this is usually a challenge. I will say that Fabian was absolutely amazing as well as super professional, patient and on top of his game. He was running the whole show. From doing it literally all alone he was bartending, taking orders, cleaning, cashier, talking to customers and he did it all so naturally.\nHe always had a smile and did everything so seamlessly. He is definitely an employee that deserves a rasie. Everyone in my party prasied him. We are a family that does party's and events in a lot of restaurants in the city so we know great service. That man provided us with the best top notch service even after it became packed. I get that it is a bar but even at bars you will never receive the service we reciebed from Fabian.\n\nIf you do go there you must absolutely try his mango margarita. I'm a big fan of them and they can be a hit or miss. Well his was a hot 🔥  Hit!\n\nThank you Fabian as you definitely made this place. Without you there they would lose.\n\nNever change! Stay happy, humble positive and keep on smiling!\n\nHe was so great that even though this place isn't  as close as we thought it was we will definitely venture back with other people and that is thanks to the service Fabian provided us.\n\nThank you again and please let Fabian know that he is an incredible person."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bXRmNnlnRRAB",
            "text": "Fun delish food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cjlXUFRnEAE",
            "text": "Great beer bar right near Fordham.  Service was excellent, really friendly, helpful, and knowledgeable.  Food came out quickly and was good.  Wings were very tasty and the nachos were good though we should have added chicken to make them tastier.  The nachos are enormous though!  They have a few games too, which we didn't play but appreciated the option."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaThPQlJ3EAE",
            "text": "So good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnMtM3FBRRAB",
            "text": "A nice chill location, food was great, beer selection was also very good. There was just no server that night. Over all great local spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb0ptR3JBRRAB",
            "text": "Nice bar! Cool college bar but also a community place. Cool games, friendly staff, good food. I have a great time all the time! 👏🏽👏🏽👏🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaFlUUk5BEAE",
            "text": "A little expensive but had fun"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdGJEakVnEAE",
            "text": "Amazing food and vibes , Shelby is great ! She didn’t steal anyone’s homework 📚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMWQyVzFBRRAB",
            "text": "Fav spot in the neighborhood. Waitress Shelby is the absolute best! Recommend the burger and cider."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMWEzZXZBRRAB",
            "text": "Favorite spot in the Bronx!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMVkzaGt3RRAB",
            "text": "Shelby is an amazing hostess! Enjoyed the entire night out thanks to her and due to her great service. Great recommendations and made sure we were taken care of all night!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNGNXZVN3EAE",
            "text": "Shelby was the best!! Enjoyed every bit of our night thanks to her great insight/recommendations on the beers and ciders available. She also told us about trivia night which we will definitely be attending."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsMWI2aURBEAE",
            "text": "Clinton hall is the best. Great service, great people. The best you can get in the Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMVo3XzBBRRAB",
            "text": "Amazing! Loved the vibe here, food came hot and fresh, and our server Shelby was the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGLTg3MlhREAE",
            "text": "Good Bear and whiskey ... Burger is fresh made not frozen."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cC1ENG5RRRAB",
            "text": "I came here on a weekend night as they were in their Oktoberfest celebration. I ordered some of their buffalo wings and grabbed a seat at one of their long tables with a stout. The wings were quite good and hot, which worked well with the side of ranch. There are a few arcade games in the back. The music is good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacjQ2X1dBEAE",
            "text": "Went there on a Saturday night for the October fest food and even though it was not crowded it was overly loud and had people drunk and fighting, they had 1 server who completely ignored us so we left the table and ordered at the bar and found half of the people there had to do the same thing so it was a long wait but they were out of half of the octoberfest food and draft beer so I ordered a stout beer and it was sour completely flat and not drinkable, the German wursts were soaked in oil and left us leaving feeling nauseated."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaElyVjJ3RRAB",
            "text": "Overall service very good. Nice games.  The bacon bacon bacon burger was good from my boyfriends plate. But honestly the fondue burger was tasteless. I asked for well done was still pink inside. The burger had no flavor at all. Not even the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNTZPN3BRRRAB",
            "text": "Great service and expansive draft beer selection. I love the various games they have for customers to use. They have an outdoor area as well. The burger and nachos were decent. Would def come back for happy hour 3p-6p."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMnRQRTl3RRAB",
            "text": "The room with big windows that look straight into Arthur Avenue is our favorite spot to hang out in Little Italy of The Bronx.  Service is friendly and efficient. Beyond the beer menu, you will find a wine option that is much appreciated. Don't be discouraged by the can, it's a really good Malbec. Food is consistently good: chicken strips are good (and spicy), fried cauliflower is tasty as well.\n\nSeveral game options. Young college crowd. Good playlist with occasional 80's and 90's hits."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMXVpYk1BEAE",
            "text": "We had the Clinton Hall classic and a chicken sandwich. If you’re inclined to get her classic, you might want to ask for them to put the sauce on the side. Mine was covered in a white sauce, which made the burger unappetizing to me. The…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNXE3NDZ3RRAB",
            "text": "We absolutely fell in love with this youthful place. With outside design elements which rival international street murals in most major cities, this is a spot to hang your coat. Beautifully decorated establishment coupled with strong food…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMl9tWEpnEAE",
            "text": "This was our first time at a Clinton Hall establishment and we're definitely coming back! We had a wonderful Happy Hour, enjoyed some great dishes, and had a blast with the games.  There is a giant Scrabble board on a wall if you are interested or other old school games, i.e. Uno, Jenga, or even the fishing game!\n\nThe bartender, Kevin, was absolutely friendly / down to earth, knowledgeable about the beers on tap, helpful with menu recommendations, and attentive to all the folks in the restaurant.\n\nWe ordered the Erdinger Hefeweizen and the Clinton Hall IPA off the Happy Hour drink list and were pleased with our choices.  We ordered the Fondue Cheeseburger; the Bacon, Bacon, Bacon Burger; and the Crystal Methadonuts.  Our food came out promptly, was absolutely delicious, and sent us into food baby city!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NTl1Ykt3EAE",
            "text": "First I would like to start off and say I was looking forward to eating here as I have in the past and it was amazing. But not sure if they changed but the food was not good. I’m pregnant and my sense of smell is heightened and the patty of the burger did not smell good. It tasted as if it came straight out of the freezer. And probably did because our food came out super fast within 7 min. And I ordered a well done burger. There was no kind of char or taste as if it was cooked on the grill enough to be well done.  The “double smash burger” says it comes with two pattys smashed with onions and other toppings. All we got were lettuce and tomato and cheese. Even the pickle tasted like it was washed down with water. How can you mess up a pickle???? This is the Bronx. I would’ve got a better burger at kennedys for 5$ instead of paying 19$ for a horrible burger. The wings also were mediocre. They definitely needed to be cooked longer. Even the fountain soda was flat. Nothing was enjoyable. The actual space is cool but the food needs work. Surely will not be coming back, very disappointed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMmZmVVJBEAE",
            "text": "Food is excellent low key spot. Loved the fondue burger and the injection filling donuts. Mimosa was good too. Good place to catch sporting events and Brunch is from 12-4 on weekends"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvX2NtQzhBRRAB",
            "text": "First time at Clinton Hall (Bronx)... I was pleased with the service - food was good & came out fast. We ordered Guac and chips to start, Bacon, Bacon, Bacon Cheese Burger w/Onion Rings & Cheese Fries Fondue Burger w/Fries.. Music would…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBd05QUUlREAE",
            "text": "I haven’t tried the food yet but it looks fantastic. Knowledgeable and friendly bar staff and a great line up of beers. I’m kind of shocked it’s taken me so long to discover this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnLS1DX0R3EAE",
            "text": "I’m giving it a 2 because when I came in they took long to give me service , and since I’m Spanish and my husband is Hispanic but dark skin they want to give us attitude and not be polite and I didn’t like the service ..they need discipline…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeGI3aGVREAE",
            "text": "Nice spot. A bunch of games. Front area, game area, outdoor seating and a nice back room with games. It's a good spot if you have a group of people. They have a really nice beer selection and also some key bar food. Their french fries were very good. Really friendly staff."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dWRxR29BRRAB",
            "text": "Bartender was super dope! The fries were amazing and my best friend destroyed her fondue burger lol so I guess it was amazing also. Goose w/ cranberry was $5 for happy hour which is almost unheard of so keep em coming lol"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLXFteDRRRRAB",
            "text": "Clinton Hall es un gran lugar para ir con amigos a tomar unas buenas cervezas artesanales y poder conversar super tranquilo. Hay 20 diferentes tipos de cervezas artesanales, en las pantallas de tv que hay en el local indican cuales son y cuanto porcentaje de alcohol tiene cada una. También hay pantallas en donde puedes ver algunos partidos. La música es muy buena y las luces son bastante cálidas que te da un ambiente muy bohemio.\n\nHay piqueos básicos como alitas y papas fritas . Me parecieron muy ricos. No he probado cócteles ya que su especialidad son sus cervezas artesanales pero hay bartenders por lo que entiendo que también pueden vender.\n\nHan expandido sus ambientes así que ahora hay mucho más espacio. Puedes ir con grupos grandes ya que las mesas son bastante largas para recibirlos.\nMe gusta mucho, cada vez que he ido a nueva york he ido. Ya los he visitado 4 veces."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aExtSlZREAE",
            "text": "Fantastic buffalo cauliflower and lots of fun table games available (giant Uno, Jenga). There’s also a cute little photo booth! Had a great time here ◡̈"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRLV9ubXhnRRAB",
            "text": "Saw the outdoor mural and decided to check it out. Fun spot! Great for the college crowd. Lots of beer on tap and comfort food on the menu.  Had the Walter White doughnuts. 👅…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM29IN193RRAB",
            "text": "We had the double smash burgers.  The fries were ok but had some weird metal shaving in them (see attached pic).  The burgers were greasy as hell.  They send out a little container of ketchup that is, apparently, supposed to stretch to the bag of fries and maybe the burger.  No condiments or salt on the tables.  The service was great but we won't be returning due to the quality/price of the food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3amNpSzV3RRAB",
            "text": "Such a cool place, went on date night with the hubby.  I just moved from the neighborhood and cant believe I had never been  before when I lived so close by and now found it when I'm further away.  Great giant board games, ad plenty of food options and beers I still have to try! Will definitely be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbmZUb1RnEAE",
            "text": "If you burgers and beers 🍻 this is the place, small but cozy and happy hour specials until 7pm. Service is ok food is out quick!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaVA3UEZREAE",
            "text": "Very nice setting. Food was good and I enjoyed the drinks. Bartender could be more engaging."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNWVXd213RRAB",
            "text": "Clinton Hall is a very unique place in the area. There is a unique mural highlighting the entrance and inside it’s very cozy. They have games for when you’re with a group like Giant Jenga, Connect Four and more.\n\nTry Walter White’s Crystal Methadonuts. You won’t regret it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPZ183SGR3EAE",
            "text": "So many quality beer choices, listed with details on large screen TV on the wall, gotta try them all, famous cheesy donut and tomato soup is great companion of the any beer of the night"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMHFYdkVnEAE",
            "text": "Cool spot with a simple menu and a nice beer selection. My burger and fries were pretty good. Beer was nice and cold."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM3NQenF3RRAB",
            "text": "The Hefeweisen wasn't on tap, the slider was so small, and there's no WiFi. The German pretzel was big though."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMHZETldREAE",
            "text": "This place is a staple for Fordham students! Ivan is the best and the food is unbeatable. This place is fantastic and the atmosphere is awesome. Will miss this place once I graduate!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncjRlNlZBEAE",
            "text": "Soooo yummy. I looked at the reviews and decided to try out the fondue burger and I was not disappointed. Looking forward to trying more items next time but I fell in love with the fondue burger 😍…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdlpxaUFREAE",
            "text": "Great beer. The fries were delicious and the service was quick.\n\nI asked for my burger medium rare and it came out raw in the middle, so take that as it is. It was tasty still. So maybe just make sure you get it at least Medium?\n\nMy wife got the chicken and it cut up the roof of her mouth. She wasn't a fan of the taste.\n\nThe menu is not nearly what it says online."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya29uMmtBRRAB",
            "text": "Everything was good.  My family loved everything my brother had the Grilled cheese donut With tomato soup and he loved it my father and I had the Korean chicken sandwiches they were so crunchy and so TastyAnd the beer selection is awesome. The staff was helpful informative and fun. My uncle felt like a king."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcl9Pd1R3EAE",
            "text": "My second time here and the service was quite mediocre. first time was much better. Not sure I'd  go back. However  I enjoyed the food both times."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRb1oyRnhRRRAB",
            "text": "Excellent burgers and beers! The only \"negative\" point would be the very limited selection of desserts."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNGNyX293RRAB",
            "text": "Typical bar with long benches and tables, TVs playing different sports games, and food available. The seasonal Peach Cider and the Irish Stout were great, as were the mozzarella sticks, garlic parmesan wings, waffle fries and potato wedges! Very friendly, light-hearted, efficient staff! Highly recommend for some chill time with friends."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc29tREdREAE",
            "text": "Burgers are pretty good and filling. Fries could be reduced portion wise, i've eaten there several times and everytime I leave a lot of fries. Perhaps they'd save a few bucks this way.…"
        }
    ],
    "reviews_count": 78
}