{
    "name": "Texas Roadhouse",
    "place_id": "ChIJtdm0p-Yyw4kRGexgFAoTRWQ",
    "grid": "BX5",
    "address": "390 NY-211, Middletown, NY 10940, USA",
    "rating": 4.5,
    "user_ratings_total": 3407,
    "phone_number": "(845) 343-7427",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gdk1VUXlMVGRTWWpCNU5FeFJTamx1UXpoNWVIYxAB",
            "text": "Brianna was our server and she was amazing. She was very attentive, quick, and friendly."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeldtUndhVU4yU1VwQlpYZHliblJ4WTI0M1JGRRAB",
            "text": "Excellent food as always"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4U2VIaDBNSEJPUW10YWJEUmpVa2hDT1ROeWQzYxAB",
            "text": "My boyfriend and I visited Texas Roadhouse this evening. We both enjoyed our meals.  He ordered the 6 oz steak with ribs and I ordered steak tips. The food was good and the service was very good as well. We were able to use a gift card that we earned from Fetch."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQk9VTTRkRXBNVFdGdExUUkJNMUp4WDBoMmIxRRAB",
            "text": "Meat was just about raw, only saw our waiter maybe once. Waitress cleaning table behind me splashed a drink all over my hair."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST1lVSklZWHBhV1V0NWIzQkNUM1EyZUhSSk1IYxAB",
            "text": "My husband and I got ourselves excited to go out for dinner with the kids and chose Texas Roadhouse. Well this was our last time coming here. Steaks were tasteless and drier the more we cut into them. Blooming cactus was slightly under cooked. Terrible tasting gravy on the mashed potatoes. The only good food we ate was the bread. Very nice waitress though."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jelVVSmpWVkZqWVZaa1VteFVNbmhDZDE4NGEzYxAB",
            "text": "Nice Waitress , food was cold steak was all fat."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNVdFUTJPWGcxTnpGb1FVbGlVbEZpZDFSdlQxRRAB",
            "text": "Our server Terran was phenomenal super friendly and attentive. The restaurant was absolutely freezing. And your food/drinks have really gone downhill."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNmJHVlNkRXBZY0hNM1ZWTlFla2RyTmxwTmFXYxAB",
            "text": "Best Prime Rib around"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvd3JTZTB3RRAB",
            "text": "Always over the top. Fantastic."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dWNVbHhaa1U0TUhsSlprRm5SMUJaYmkxMGIwRRAB",
            "text": "So affordable with great quality food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGJrRkRVbXhSY0hsalh6bHFTbkV3UVhoVVpFRRAB",
            "text": "Is there a -5 rating? Staff was nice but the food… chicken wings were cold, overcooked and disgusting. The burger was cold and salty and the cactus onion was terribly seasoned. Plus the food was heavy as hell. Better get McDonalds!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMmVqSmFiRzVQWm1ka1ZrUkhjbWQzTjJOVVNXYxAB",
            "text": "Best ribs ever."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210algyaHdlbWxFVkZOSlgxaGhZMEo2U1dkdE9VRRAB",
            "text": "I placed my order online at 430 and scheduled my pickup for 530. We showed up at 525 but never received our order until 550."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVFpIRTRWbGR3WkcxcVoxbFVaVUoxTVZOYWVrRRAB",
            "text": "Always very rushed when we are here. Servers very over stimulated for 4 table sections. Appetizer came out hot, all other food came out with something missing and incomplete. With 4 servers and food runners thst came to the table. We were also in an awkward table for a party of 5. Two huge booths with no high chair availability.\n\nI understand being busy. But discombobulated was more like it"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbUkzU1RBEAE",
            "text": "Love coming since we first moved here, the food and service has always been awesome 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeWJUbEhiMk5IZFV0UVFWaHJkRGxSVG5sTk0yYxAB",
            "text": "For the prices they charge they could maybe season the food during cooking.  And it would be nice to get your meal HOT, not luke warm. Servers are very nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSVQycFdNbFJTV2pSdWNGRm9iVFp3ZW5RNWNVRRAB",
            "text": "Tyler was amazing. He made me feel like I was his family. He took very good care of my brother and I a week ago. You should put him as your trainer"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdFZWRjVSblYxZFdGemNteHNhMkppWmtWeVNVRRAB",
            "text": "Love the food! The servers are all excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU2RuZHhNSFZaTXpoVlIwRXRMVE01T1RsNGNrRRAB",
            "text": "At 4:30 pm a little miss managed, open tables, 7 minute wait time with 3 servers just standing around. Maybe it was a shift change?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMFpXUmlVM0JVU1hGV2RUUTFkRGt6VDBwS01WRRAB",
            "text": "Matt J was a fantastic server. 10/10 experience will come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jek5XeDZaMEpaYmt4UVNWRk5VMGRGYW05Q1RtYxAB",
            "text": "Matt J was the best server ever! He was so much fun and mad our experience amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNVVXODNlVmhZZGpOUlRHaFJWRGxMVVRoUFMyYxAB",
            "text": "Matt J was the best server we’ve ever had and he made sure we were tended to very well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd2FYUkxUalF3TTJSQ1FWVnBka1ZZWkRGc09IYxAB",
            "text": "The food is delicious, the atmosphere is great and everything is always very delicious and detailed, but the bathrooms oh God is a disaster, the smell is tremendous, there was urine on the floor, dirty papers and a mess which damages the experience a little."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214QmNFTkpkRTkyTFRWU01URmtkRTlWWVRSbFgxRRAB",
            "text": "One of the best dining experiences I’ve had in years. Our server was Devon he was amazing!, didn’t miss a beat. We got a burger, steak and 2 kids meals. And ours kids actually ate them! Everything was amazin- the food the atmosphere. Even the bus boy…meticulous! It was our first time at Texas Roadhouse but it won’t be our last!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNFExb3hibEE1U0hSamRrUTJPWGxDT1ZWeVZsRRAB",
            "text": "Been here many times. Overall great experience. Food is great, service is friendly, great experiences overall"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWFRVMVRRMGhhTFVzeGFXbG1aVXBXYlVaV1NXYxAB",
            "text": "So, the utensils are wrapped in the napkin and ready to unroll when you are ready to use them.\nThat is great, accept when you unroll it and there is rice from the previous users mouth stuck between the tines of the fork.\n\nI'm feeling like they don't care to much about being clean.\nShared the issue with the wonderful server. No response.\n\nThey were my favorite place to go. It was on the gross side of the scale.\nI probably won't eat there any more. I can get a clean meal at the grocery store.\nShame on the Texas roadhouse!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdFJsOUJiMHBvYlc5NU1XUkpYekpDUWpSMmMwRRAB",
            "text": "I don't know how the food is went to get something to eat and the wait time was a hour so I didn't stay but it looks like a good place to go when it's not packed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaGJtbFJTMkpoWld0SVpTMXNTa0pVWkZOWWIxRRAB",
            "text": "Great American food, Margaritas were delicious, highly recommend chili"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1VuSjFXbGhTWjA1RFZrRm9ZVE5HTkd3d2EwRRAB",
            "text": "Loved the food! Seating is very close & noise is deafening but great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcFlWaDNlaTB3TUZoeGFUWkNSMHRIVkV0TGMzYxAB",
            "text": "Staff were amazing and most of the food was good. But the steak was so dry and flavorless.  Very disappointed 😞"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNmQ0b21KazRYZmtnRRAB",
            "text": "Our waiter Peter was absolutely amazing went above and beyond,  one of the BEST waiters I've ever had. Thank you PETER. TEXAS ROAD HOUSE PLEASE BE GOOD TO THIS KID HE DOES AN AMAZING JOB,\nAdd on: had an amazing dinner once again Bella was our waitress. She was Amazing until she told us we had to pay a Bill 🤣🤣🤣 just kidding."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRWJEVnlaVlZNU1hkdWVWWmhYemxZTFhKVmJFRRAB",
            "text": "Very good food and easy take out to go from your phone"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVNua3lVa0YwTTIwNU1FSlFNV1U1ZDJSWlFXYxAB",
            "text": "Jenny was amazing she was very hospitable extremely attentive to our table and assured perfect service while making it feel comfortable my twin had the best day to date pls show her love genuinely amazing replicate what she’s doing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObGIxRlpjV2R5VFZveldpMVNSRmgxWVRKRVJYYxAB",
            "text": "Always a great time @ Texas Roadhouse!  We will repeat!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkM2NGQm5aSFYwYWtaS2NqQnZURjlOUlhSaE0zYxAB",
            "text": "The food was amazing! The servers were very kind and accommodating to my allergies."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1ZXMWxWRVJ5YmpOQmJWcFFOa2RyTlRsM1IxRRAB",
            "text": "Good food. Poor management."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Sk5HY3pUMmhSZUdSU05rZHdaMVJFUW5ORVYyYxAB",
            "text": "Gedeon was an exceptional server! His energy was welcoming and cheerful and it made for such a wonderful lunch at the Texas road house!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVX3BIdzRBRRAB",
            "text": "We had an exceptional dining experience at Texas Roadhouse in Middletown, NY, thanks to our wonderful waitress, Sara! Her warm personality and impressive patience really highlighted the restaurant's commitment to service. It's dedicated team members like her that truly deserve the restaurant's prestigious 5-star rating! Thank you so much, Sara!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2czdHcU5nEAE",
            "text": "I tried to order both online and through your app.\nThe app constantly freezes up then crashes and erased my order, and the website freezes up and totally stops.\nI love your food, but the aggravation of trying to order to go made me place my order with Outback Steakhouse for $115+."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeFJqVjZVR2RGY1VJNFkxTnFhR2hzUWxWSGQxRRAB",
            "text": "Great place to enjoy dinner with the family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTE0xOUhXbkl3TkRCZlFtbGpZa2hKY1VKRFoyYxAB",
            "text": "Sat at the bar for was good no complaints and the bartender(DERNA) was so nice and her service as well"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUlNrVjZWMkZpWVV3NFRXMWlNbTFzZURNeVExRRAB",
            "text": "The food was salty, but the service was great."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLamNEMzB3RRAB",
            "text": "Getting very busy.. bar is open to chat at and eat at. Enough TVs for everyone's liking. Good food,  ok service. Try them out, you won't be sorry!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKejZ1ZmVuX3BIdkdnEAE",
            "text": "Recently started coming here and it didn’t disappoint. Steaks are consistently cooked at the right temp with a nice char—whether I go medium or medium rare, they’ve nailed it every time. Sides are great, and it’s surprisingly easy to dine with a toddler—booster seats and a family-friendly setup make a big difference. Even though it’s a chain, the food quality feels more like a standalone steakhouse—fresh and well-prepared."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VGNYWlZXVmhCTlZKb1p6ZDRUMDVIVlROalgyYxAB",
            "text": "My daughter and I have been here countless times and they never disappoint. The employees work extremely hard. The manager should be proud of all of them."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paalpuVlZabmc1TUVNNFlreE9SVVUzTXpGd2FYYxAB",
            "text": "The food was amazing! This was my first visit, so according to my friends and family, I needed to become obsessed as they were with the warm and fresh buns, which were an honest godsend to start with. I got the 16 oz prime rib because I know how to order when I go out, and it was unbelievable. The horseradish sauce was perfect, the au jus was amazing, and the mashed potatoes with gravy were spot on. The steak came with a Caesar salad too, which obviously is the least nutritious and most delicious salad to get, if you’re smart and care about your spiritual health.\n\nMelissa absolutely crushed the service by providing everything in a timely manner, replacing waters and sodas promptly without having to ask, and always at the perfect time. She also brought out condiments and accommodated any request super professionally. She was an utter saint.\n\nThe place was really clean, and all the servers appeared to be happy, too—a rare find.\n\nGod bless America and Texas Roadhouse. My first visit was superb."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxck1uT09REAE",
            "text": "This is a beautiful restaurant with delicious-tasting food 🍲 that really satisfies the palate 👅😋. However, I didn’t enjoy the wings because they were too salty. Everything else I tried was just fine and well-prepared. The staff were very friendly and helpful, making the overall experience pleasant. Highly recommended for anyone looking for great food and a welcoming atmosphere.\n\nEste es un restaurante hermoso con comida deliciosa 🍲 que realmente satisface el paladar 👅😋. Sin embargo, no me gustaron las alitas porque estaban demasiado saladas. Todo lo demás que probé estuvo bien y bien preparado. El personal fue muy amable y servicial, lo que hizo que la experiencia general fuera agradable. Muy recomendado para quienes buscan buena comida y un ambiente acogedor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wV1kwRlVUMXBSYUVWa01WZDZWMHc0ZWtST2EyYxAB",
            "text": "I've never had a bad experience at TRH in Middletown!  They brought back bags of peanuts (which I love), give you as much bread as you need, servers are always welcoming and the Beef Tips meal never disappoints!  (Just make sure you get that baked potato loaded, ok?)  We had a party of 8 and they accommodated last minute (just make sure your party is all there, or they may not seat you)!  Spent around $30 with tip included!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWEdtUHJoLU55ak9BEAE",
            "text": "Amazing experience & great food! Will surely be back in the future! Logan was an amazing waiter, kind, patient you name it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdGJ6aWx3RRAB",
            "text": "First off, will start this review in being that we've been here before, just not in a while. I used to not like it because there would be all peanut shells all over the floor. Good thing not anymore.\nWent here on Sunday October 27th 2024 with my parents for some much needed dinner. Got there, found a spot. Fair warning, it can get really crowded and may need to wait. If you have less than 10 people, you may be able to get on the waitlist online, which is what my mom did. And with our luck, our table was ready maybe 2 minutes after we got there. We were sat at a booth, near the outhouse. Our server was very pleasant and took care of us. I forget her name unfortunately. First, we ordered 3 waters, Then i ordered the Island Cooler Drink, and my dad got a Cowboy drink. They also have a bag of peanuts and buckets on the table to eat peanuts. Was also given delicious bread! The island cooler was very good and i enjoyed it. We also started with the Cactus blossom, which hit the spot and was very good. even tasted less greasy and more flavorful than the competition out there. For entrees, My mom ordered the 8oz Sirloin M with mash potatoes and String beans, I ordered 8 Sirloin M, with loaded sweet potato and string beans, and my dad got some kind of chicken with steak fries and house salad. kudos to the restaurant in which they brought out the salad first. Food came out in a timely manner. i liked my steak, although seemed more on the Medium Well side and dry, but i enjoyed it, and added steak sauce. i enjoyed my sweet potato, although was expecting for it to be loaded with cheese, and bacon. Good idea for any server to inform the customer- it is loaded with marshmallows, or add onto the menu that loaded sweet potato is loaded with marshmallows. Enjoyed the potato too and took it home. The String beans i did not like at all, tasted very smoky and had bacon on it, and again the menu doesn't say anything about bacon. My mom didn't like her string beans either. We didn't ask for any substitutions because we were okay and somewhat full from the appetizer, plus we liked our steaks and other sides. We paid with the server because we had a gift card, then paid the balance on the machine with a credit card. Left a cash tip, and gave it to our waitress, who checked on us, and made sure we were okay. Will definetely come back again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M0t2cE13EAE",
            "text": "A bit of South Texas hospitality in the great North.  Pick your steak and have it cooked the way you like. Plus a bunch of other vittles and spirits too. Fun place to eat."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfak9qOFRBEAE",
            "text": "Service was great. Staff was nice and offered many discounts and coupons for us to come back. Food was okay. Prices are great for families."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaGNHaGFNa2g0YldGd1RqQnFMVEYyZGpSVVIwRRAB",
            "text": "First time there with my family. We all loved it! From the rolls and butter to the steaks.\n\nSteaks were cooked to perfection and even my non meat eating daughter found something to eat.\n\nThe atmosphere was great. Our server was amazing and friendly!\n\nMy husband joked that we may not be able to go again because when you start at the top the only way to go is down but we are all already planning on going again."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDLUxyd0lnEAE",
            "text": "I've been to this Texas Roadhouse location multiple times, and the food is usually good. However, my recent visit was a letdown. My food arrived cold, and my family's meals were lukewarm. While the manager did apologize and offer replacement food, it arrived after my family had already finished their meals.\n\nThe service from Marybelle was attentive, and the atmosphere was lively, but the food quality was subpar. Hopefully, this was an off day, and they'll get back to their usual standards.\n\nI'll give them another chance, but for now, it's back to average."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMUw3cEZBEAE",
            "text": "First time visiting Texas roadhouse, and was not disappointed\n\nIf you are a fan of BBQ or looking for some delicious, mouth-watering meat, then Texas Roundhouse is a must-visit. The meat is tender, juicy, and cooked to perfection with just the right amount of smokiness. You can practically taste the flavor of Texas in every bite.\n\nThe waitress recommended me to try the ribs. Delicious!! Their ribs are famous for a good reason.\n\nBut it's not just the ribs that make this place special. Their sides are equally impressive, including the bread was the best ,\n\nPlus, the atmosphere is friendly and welcoming, making it a great spot to take the whole family.\n\nIn short, I highly recommend Texas Roundhouse for any BBQ lover or anyone looking for a delicious, authentic Texas-style meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM29mMlR3EAE",
            "text": "I had John as my server the last time I went. He is THE BEST server EVER! all of the food came in a fast and timely manner, and he brought bread and butter out nonstop. I left feeling like I went to an all you can eat buffet off of the rolls alone. I highly recommend that you request John as your server. I went on Saturday as soon as they opened so it wasn't very busy but boy we felt special."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdFNYRkJOVGQ1VGtONldVbEVlVUp2Tmt4R1pIYxAB",
            "text": "Not for people with peanut allergies\nService was great, she didn't miss when we asked for things.\nThose FREE buns and sugar butter were A1 👍 and that buttery corn... loved it. Had 2 servings alone.\nPrices were definitely reasonable for a steakhouse.\nThe steak and chicken entrees were cooked to perfection. Loved how you picked your cut before being seated\nCelebrated my kids' 5th bday, my server got everyone to sing, including the customers, and she sat on a saddle!\nMy only complaint was it was definitely not a  clean atmosphere (peanut shells everywhere)\nI was not impressed by that, but I vocalized it, and they cleaned up my area quickly.\nFirst timers, definitely will go back."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhNzlyYUd3EAE",
            "text": "Excellent service, and friendly staff. The bread is so soft, and warm. Not a fan or hard bread wherever I go. Here, their bread one of the best. I like the Fried Pickles, & Grilled Shrimp. The Steak, & Ribs combination is a good selection. The drinks have a nice kick to them. Overall, no problems, nice night there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Z3M3eGxnRRAB",
            "text": "They go for the rolls. I go for the ranch! Always good service. My kids like when they staff dances. The biggest pain point is that the tables are not big enough for a large party. Need to update sides, been years with no new options."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreVRXSlZUWFl3UlhGM2J6VnRVelZZVlVONVpVRRAB",
            "text": "Service was impeccable even though it was packed. You could tell that they were going as fast as humanly possible and trying to get people in and out but at no point that I feel pressured by our waiter and the food came out not only fast but to out exact specifications. I have a picky brother so that can be difficult. Only slight complaint was that it was hot when we first arrived but weather's been weird and it was a packed house so temp rises quickly and ac was catching up. Best children's menu if your kids likes steak as much as my nephew."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNWJtRHF3RRAB",
            "text": "Dinner last night was great.\nA.J. was very professional and caring.\nEven though we had to wait about 40 minutes, It's definitely worth the wait, it is a great experience!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROS1EbVRREAE",
            "text": "Love that experience... Amazing service (Thank you Shelby for an amazing service and great smile)... awesome food and great prices and the variety of STEAK IS AWESOME and very well made to perfection and cut to order!!!\n\nAnd if you don't feel like having a steak... well just wait to taste the award winning BBQ RIBS!!!!\n\nLet's not forget the appetizers... especially that blooming fried Onion and HEAVENLY unlimited BREAD and the all you can eat Peanuts!!!\n\nin short... you won't regret it!!\n\nEnjoy"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycjRxSklnEAE",
            "text": "Grilled shrimp was good. Green beans were disgusting. Mozzerella sticks were ok. My granddaughter enjoyed her salmon. My son loved his chicken and ribs. Not my favorite place .I'm more into seafood but my son likes this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NWQxUlFkelJHZWpOcE5sQjNXWFo1Wm5KbmJHYxAB",
            "text": "Lately, I've eaten in a few TRs around the country, and surprisingly, I've been  impressed. Quality/ portion of food depends on location, but the staff are always helpful and accommodating. Waiting for a table during peak lunch and dinner hours can be a challenge."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaExEM2lBRRAB",
            "text": "We were conflicted about the reviews on this restaurant.    Yelp gave it a 3 but google review gave it a 4.2 so trusted my google reviewers  but came out disappointed.\n\nThe food pics posted look ok but the food itself was left sitting way too long in the back.   The food was warm and not as tasty as we hoped considering how pricey it was.   My husband ordered a 6oz sirloin meal and ended up with a piece of fatty bottom.  Waitress was nice enough to take off 5 dollars but meal was not worth price to begin with.\n\nOn the other hand, the decor is really nice and it has potential.   May have been an off night but not going back to find out."
        },
        {
            "date": "4달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQeXQ5N1BPOWViRDFRRRAB",
            "text": "在今天取回家的色拉里发现一只虫子尸体。"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTVpV1BnEAE",
            "text": "Our Server was fantastic, attentive and knowledgeable. Food was delicious. My only complaint would be the temperature it was very chilly in there. There is still snow on the ground, no need for the chilly atmosphere.\nMy mother and I both had the 6 oz steak - medium - baked potatoes and veggies. Our steak was perfectly medium and tasted scrumdidllyumcious as were the potatoes and veggies."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MXF5UFNnEAE",
            "text": "Dang it! I forgot to take a pic in the restaurant.  But I took it home because I went too far with the hot, sweet buttery rolls, bagged peanuts and delicious onion blossom! I'll have to enjoy my bone-in ribeye and loaded baked potato at home. Oh...and the green beans with bacon & onion, are fire."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMFRrZzBaV0pOT1RSR05tY3hRVlUzYXpGblMwRRAB",
            "text": "This place is really falling off..let's start with when you sit down and the dust on the blinds and the walls is gross..then I go to put my arm on the back of the booth and my arm sticks to the wood.....how dishusting. Then I order the triple sampler for 15 bucks and I get 4 very smalls pieces of chicken and 7 tiny balls of cheese for that price is insanity. I ask for a 32 oz sirloin and they bring back a 22oz and charge me for the 32oz.. sweet potatoe was hard and not cooked all the way and the onion blossom had so much uncooked batter at the base it was gross..very over salted and some of the skin wasn't removed because you couldn't break down the onion with your teeth. Place was slow and the guy cutting steaks seems to have an attitude because he said he couldn't because he was behind but all of a sudden he could because I complained and then he sends a small dry steak..I used my gift cards I got for my birthday and I won't be back. I never had a bad experience or meal like this from here in a long time andni can see this location is going downhill in food quality, and portion size."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREanZyUW5RRRAB",
            "text": "I would've given it 5 stars but the wait time here is crazy! The food is great and the waiters tend to you and check in to make sure everything is fine... all in all it's a good place to eat with great tasting food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSHo3NGJGdHEtSTdBRRAB",
            "text": "Jeanette was our server and an excellent one at that!  Made our experience there great, she was on top of everything we didn't need to ask for refills or anything, that's the type of service I like!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBd3AySFBBEAE",
            "text": "Texas Roadhouse in Middletown never disappoints! The ribeye was juicy and full of flavor, the ribs fell right off the bone, and the grilled shrimp had the perfect seasoning. Friendly service and lively atmosphere made it even better. A must-visit for meat lovers!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhM3BhQl9RRRAB",
            "text": "I have been to Texas Roadhouse a few times in different places, different states, their foods were ok, not impressive though, just another chain restaurant. However, this one here at Middletown NY has surprisingly good foods, all foods are…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU2NYbEpWRWR6YUROek5HRjBXak5DWjJWblRGRRAB",
            "text": "Place was clean. Loud and busy but service was pretty quick. Restroom Sink had standing water. Manager was made aware. Ribs were a bit dry and fatty. Sticking with steaks next time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OU9lOXhBRRAB",
            "text": "Normally when we go to Texas Roadhouse we have no issues.  I've had birthday dinners here with large groups of friends and family but today we seemed to not be a priority.\nWe called hours in advance to give them notice that we would be having a party of 18-20 people.  We were looking to arrive around 7:30PM We were told that we would need to be there a hour early to be able to be seated by 7:30!  No idea why thats a thing but members of our party did comply with this request and were there an hour early.  The rest of our party arrived at 7:30 but were weren't seated until 8PM. When we were seated we were give three booths but one of the booths were separated by another booth away from the other two booths.  I am not sure why this was done.  If we called ahead with a party of 18-20 people why would we want to be sitting away from each other?  Once we were seated I asked the waiter if he could ask the couple across from us to switch seats.  Instead of asking them he walked away to ask a manager.  Out of confusion we simply asked the couple ourselves if they would mind switching seats.  They were kind enough to swap seats with the members of our party.  But here's where it starts to get weird.  Our waiter comes back and is like no we can't do that and thats when we advised him we simply asked the couple at the table and they said they didn't mind.  For the remainder of our time there we watched management come out and apologize and ask that couple if everything was okay.  Almost as if we didn't matter or the dining experience we were to have was less important to them.  Management didn't speak with any of us and event when the couple left staff apologized as if something wrong had occurred.  If this restaurant can't accommodate parties of 18-20 people then they should say so instead of ushering us in and expecting us to sit wherever they see fit.  I'm not sure this will be a place we bring our friends and family to in the future."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReU0yTFlnEAE",
            "text": "Texas Roadhouse is a beautiful fusion of good steaks and country culture. The whole place oozes country even right down to the way the staff will help you celebrate your birthday. You walk in and the first thing you'll notice, in this location, is the peanut shells on the floor. That may sound unsanitary or as if the place is dirty, but this is part of the culture at this restaurant. Immediately to the left of the entrance is a peanut dispenser that when you crack the shells open, you throw them on the floor right there while you're waiting for your table. After the staff let's you know your table is ready, they ask if anyone in your party would like to hand pick a steak. This location (not sure about others) has a butcher on staff who cuts the steaks daily and you can pick any of the juicy steaks by hand if you so desire. Once you're at your table, the menu is already waiting for you and the choice of food is immense. Not too much to where it's overwhelming, but just enough that you can enjoy something different each time you go. I highly recommend the ribs with loaded mashed potatoes as one of your side choices. The staff is friendly, the place is clean, and the food is great. This location can get rather busy, so plan ahead for that."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcU82cE1REAE",
            "text": "One of my favorite spots..love the salad and the ribs,shrimp,prime rib…I could go on and on! A must good you already aren’t addicted!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaXJEWldnEAE",
            "text": "Good food at good price. Got the steak and glad I did. It was delicious and good value for money. And the biscuits with that butter is a reason to keep coming back. The staff were very friendly and made me feel welcomed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd1BXU0x3EAE",
            "text": "I think I waited twice to be seated when I come here. Staff are always friendly ..food is always good, and love the bread & butter. The Texas Peach Fuzz is my favorite drink, just stinks it is in such a small glass."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5d3VXSC13RRAB",
            "text": "Great steaks!! Cooked CORRECT to order! Loaded broccoli is becoming a fav!!\nYummy drinks! Good meal.. great service!! Nice job Josh!!"
        }
    ],
    "reviews_count": 80
}