{
    "name": "IKARO STEAKHOUSE",
    "place_id": "ChIJp52n0okyw4kREddwuE5Nuj0",
    "grid": "BX5",
    "address": "9 King St, Middletown, NY 10940, USA",
    "rating": 4.3,
    "user_ratings_total": 230,
    "phone_number": "(845) 775-3045",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMGNHaGZlbnBEYTBseE9XcGFXRFUzUzFwR2JtYxAB",
            "text": "Went here with family for a girls lunch. The food and drinks were so delicious. We loved everything."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMFVtOUtYelpsUVZsMGRYSlVUbEppWTJwM1YzYxAB",
            "text": "Place is closed 🤷🏻‍♂️…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVE1DMXZhMGhOTldoQldWOWxXa2xZT0MxdGRuYxAB",
            "text": "Very disorganized/ disappointing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod2JqaDVSRFI2VGxFdFpFVTRURkV4Ym10NVZWRRAB",
            "text": "The steak is mouth watering,the mac n cheese was good.The drinks were well made.This was the former Sugar Shack"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRGJIa3hSVXBIT1VkV2JWZHFMV2d4ZWxOUGExRRAB",
            "text": "This wasnt goed experience, i waited just for drink 20min, i ordered burger and after 10 min they sah me thet kitchen don have burgers anymore..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNalhxSS02dVlDREJnEAE",
            "text": "Excellent food and service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOejl1dHFsNy1EN0l3EAE",
            "text": "Food was ok, definitely not worth the price"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKTzF5dDNYbHJMR2pnRRAB",
            "text": "Had an awesome time with friends\nFood, drinks and service was amazing\nAtmosphere was also great felt like we were in Manhattan without being in Manhattan"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcWdvSnVUOU5QN2F3EAE",
            "text": "All was good, best 20.oz Ribeye I've had so far. All around very good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMRHV2dFdnck9TVnhnRRAB",
            "text": "Marcos was Awesome!! Our first Time going to Ikaro. Special occasion was for my Wife’s Birthday we all enjoyed everything! Will be going back!  Food was Awesome! Service Awesome! The restaurant is just Beautiful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcTZpaDlRRRAB",
            "text": "Certainly a hidden gem in Middletown! It’s tucked away on a side street, so it can be a bit tricky to find at first (tip: park in the DMV lot). If you’re into posh, moody décor, this is definitely your spot — the vibe is on point.\n\nThey offer a bottomless brunch, which is always a win. I ordered the pancakes and the passion fruit lemonade, and both were really good. The pitcher of mimosas was a surprisingly generous size, which I appreciated.\n\nThe chicken and waffles, however, were a bit on the smaller side — I’d love to see a larger portion or maybe a full Belgian waffle instead of pieces.\n\nI also wasn’t a fan of the automatic 20% gratuity being added to the bill. If you're not paying close attention, it’s easy to accidentally double tip. It would be better if they gave patrons a heads-up before the bill arrived.\n\nOverall, everything was good, and I’m looking forward to going back to try their signature cocktails and dinner menu!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmUyZlJBEAE",
            "text": "This place is a hidden gem. It popped up as a suggested place to eat on google so I went. Nicholas was amazing. He was knowledgeable and took amazing care of me.\n\nThe food overall was pretty good. I initially just ordered apps, but then realized it was a steakhouse and wanted to have a steak.\n\nI’ll be back with friends…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOUpTUGJ3EAE",
            "text": "Great brunch, had the chicken and waffles, delicious,  had the mango mojito, slamming. My wife had the steak and eggs, delicious,  Marco and his wife are amazing host. The atmosphere was beautiful, very nice music playing, very clean, would highland recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjZ1cHFRRRAB",
            "text": "Everything was high quality, amazing food , great atmosphere"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJZ3Jua1N3EAE",
            "text": "We love supporting businesses and wanted to choose a local but nice restaurant for our wedding anniversary dinner. The atmosphere was very intimate and perfect. Ambiance was on point! We went early to avoid crowds and yet it still gave the romantic vibe. The food taste, quality & presentation gave us our NYC souls that fix that we longed for ABSOLUTELY PHENOMENAL. Loved the fact that there was no rush in service but the perfect amount of check ins and attentiveness. Also loved the no rush feeling to leave. Perfect date spot. We stayed about 1.45 and a couple that that been there prior to  us was still very comfortable and remained. It is a total intimate romantic vibe spot that I’m sure can get crowded fast but I would just choose early evening if you want that intimate quiet vibe. It was also nice to see a family, parents with two young well behaved  children very welcomed and comfortably come in to dine. Our server I think is name was Jefferson (we went 3/30) was very attentive and served us perfectly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OE1mWjhRRRAB",
            "text": "So far one of the best foods I have tried in Middletown"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbExDUElBEAE",
            "text": "I had a mixed experience at IKARO RESTAURANT AND LOUNGE. The first time I visited, everything was excellent—great food, a pleasant atmosphere, and impeccable service. However, my second visit was not as enjoyable.\n\nI made a reservation for 10 people, but only 7 of us attended. The staff was very friendly upon arrival, and our table was nicely set. Our waitress, Mía, was kind and attentive, and the restaurant had a great vibe, perfect for a date or a celebration.\n\nHowever, several issues affected the experience:\n•\tWhen we arrived, no one offered us a drink menu or even water, which is a basic expectation at any restaurant.\n•\tThe drinks were a highlight! The house margarita, piña colada, espresso martini, and white sangria were delicious and didn’t taste like cheap liquor.\n•\tThe appetizers were disappointing. The calamari was soggy instead of crispy, and the portion was too small. The guacamole didn’t look fresh and had a dark color, though the taste was decent (7/10). The tortilla chips, however, were very good.\n•\tThe food took a long time to arrive, but our waitress explained that they had another large reservation. When it finally came, the presentation was great, but none of the steaks were cooked to the requested temperatures. This was especially frustrating for the birthday guest, who ordered the most expensive steak on the menu, only to receive it incorrectly cooked.\n\nDespite these issues, our waitress tried her best to make up for the mistakes—she was attentive and even gifted us a bottle of champagne and a lava cake for the birthday guest, which we truly appreciated.\n\nOverall, IKARO RESTAURANT AND LOUNGE has a beautiful atmosphere, great for dates and celebrations, but they need to improve their service coordination, wait times, and food preparation. If they address these issues, the experience could be much better.\n\nWould I recommend it? Yes, but with some reservations. I hope they improve because they have great potential."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXEyWFp3EAE",
            "text": "The service was good, our food came out very quick (this was a plus), and the atmosphere was nice. It was just a bit cold due to the door being open at times."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN1BuU2xRRRAB",
            "text": "Food was excellent! And staff is amazing. Nia and Marco made it to experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM29lMV9BRRAB",
            "text": "Unfortunately we went on V day but that's our fault. It seemed they are short staffed and I felt awful for our waitress, she was all over the place and came back to have us ordered even though we ordered awhile back. Definitely not trained in customer service as people around me complained to her and were ignored completely or not addressed. The food we had was disappointing, flavorless. We had a simple burger and fries for $20 a piece and def not worth the price. Bland and bland."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXZ1TGhRRRAB",
            "text": "tonight was my first time eating here and all i have to say is it did not disappoint! the flavors of everything was amazing. i will definitely be returning soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0t2cERnEAE",
            "text": "weirdest place ive ever not been served food… wait staff stared us when we walked in, after a couple minutes told us to seat ourselves, and then never spoke to us or made eye contact with us ever again. there was a random qr code that took you to a page to order online but only had half the menu and no drinks. after 30 minutes no one brought us water greeted us or took or order/ explained if we were supposed to use qr code and we walked out. Kinda felt like the whole place was a front 3/5 stars for the escape room experience tho"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ1pxdU9REAE",
            "text": "I was there on a Wednesday about 3 O'clock.  Staff  barely spoke English  Tried to order at Root Beer and they looked at me like I was crazy.  Same thing when I tried to order a Manhattan.  My\nfriends chicken dish was undercooked.  He sent it back.  Only needed a couple of more minutes in the pan, but we never saw it again. Finally he said forget it.  Also a 20% tip was included in the tab and there was no mention of it on the menu or by the server.  If I wanted to eat in a foreign country,  I would go there.  Never again. Food was decent atmosphere was nice except for the staff."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfemFLRWNBEAE",
            "text": "Laura is amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfallQMHZnRRAB",
            "text": "Just took my wife here for her birthday,  and we absolutely loved everything.  Great service, amazing food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamEyUUJREAE",
            "text": "This was our first time here and we are so happy to have discovered Ikaro! The food was phenomenal! The steamed buns, mussels, clams, lamb chops, short ribs.. my goodness!! And don’t get me started on the flan. Highly recommend the blueberry martini as well! I would come here again and again!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNE0tMDBRRRAB",
            "text": "I love everything about Ikaro from the staff to the delicious food.  Very cozy place to hangout. I really recommend this restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbVlXazBBRRAB",
            "text": "I had an amazing experience at Ikaro. The food was absolutely delicious, especially their sangria , and the service was top-notch. Our waiter, was very attentive and made excellent recommendations. The ambiance was perfect for a relaxing evening out."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa2MzdmJnEAE",
            "text": "We had an awesome time, it has that NYC vibe and the waitress we had I forgot her name but she was awesome, we were joking with her and she was joking back so she has thick skin and rolled with our shenanigans ! Anyways the place was clean, warm, had an artsy NYC vibe, the atmosphere was great, the staff was above and beyond. The food was great, there wasn't anything that came out that we didn't like,, the burgers were great, just everything was good and I look forward to coming back with friends. It was clean, service was great, atmosphere was great and I highly recommend checking this establishment out, you won't regret it."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNFo3VnVBRRAB",
            "text": "Buena atmosfera y servicio!\nRecomendado"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMXVYcDBBRRAB",
            "text": "Although I don’t always have good experiences when going out, I can’t remember the last time I had an experience bad enough to write a review about it.\nFirst, we had reservations for 3pm but were given lunch menus that end by 3pm. After questioning the waitress about it, she assured us it was still okay to order from the lunch menu since dinner doesn’t start until 5pm. However, after we placed our orders for parmesan chicken salads, it took the waitress an additional 10 minutes to tell us that it wouldn’t be available as an option because it was past 3pm! Precisely what we tried to avoid in the beginning!! At that point, after bringing the dinner menu, we selected the organic roasted chicken and requested baby broccoli in place of the puréed carrots. When the meals arrived, there were baby carrots instead of the baby broccoli we requested from the menu. Then I realized my chicken was not thoroughly cooked because blood dripped out as soon as I started cutting into it! The waitress apologized and took it away but before she had a chance to replace it along with the missing baby broccoli to go with it, my spouse was done eating her chicken WITHOUT the broccoli and our 2 other guests were done with their meals also.  At that point, I told her not to bother bringing out my meal or the broccoli. As a small local business owner myself, I understand that sometimes mistakes can and will occur and not to judge a person or an establishment for imperfections and errors but instead, how they handle it. We remained cordial and respectful throughout. However, what made this experience inexcusable was the fact that the restaurant was not busy and management was aware of the series of issues as they were arising but COMPLETELY IGNORED the situation. Management NEVER stepped in to assist the waitress or apologize for any of the problems we were experiencing. Any decent and professional restaurant manager that understands the importance of their position in protecting and preserving the reputation of the restaurant and values their customers, would have at least come over and acknowledged the situation and make a sincere effort to make it better. We didn’t expect free drinks or dessert but instead a compassionate apology as a sincere and respectful gesture of accepting responsibility for the mistakes. Instead, they added insult to injury by bringing the check which had their mandatory 20% gratuity added to the bill for the terrible service we received. Absolutely unacceptable experience and I will never return even if offered a complimentary meal. To clarify, I don’t hold anything against the waitress for the honest mistakes and matters outside her control. It was apparent she felt bad about the situation and I accepted her sincere apology. As far as management, it was apparent they didn’t care at all. Despite appearances, this place clearly lacks substance."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMXVDc2tRRRAB",
            "text": "I hate leaving bad reviews but this experience warrants it unfortunately.\n\nA series of mistakes that ended in an overall terrible experience. I am a huge supporter of local but I will not be recommending this restaurant anymore.\n\nThe server didn’t understand English very well so there were moments of having to translate and point to the menu. We had a 3pm reservation. She hands us lunch menus that clearly states ends at 3pm. So I ask her for the dinner menu and she replied that dinner does not begin until 5pm. So what exactly is 3pm-5pm called? She said we could order from either menu. Confusing but ok.\n\nWe ordered Parmesan Chicken Salad (found in the lunch menu not the dinner menu) she brings out our appetizers and perhaps after an additional 10 minutes she informs us the salad was no longer available. The time is 3:30pm. Our dining guests at this point have been served their dinner so we scrambled to make another selection from the dinner menu. We decided on the $29 Rotisserie Chicken but we asked to sub the carrot puree for baby broccoli. We thought she understood. 15 minutes later we are served Chicken with baby carrots. We explained the error but she insisted we ordered baby carrots. She offered to get us baby broccoli as a side. One of chicken dishes was undercooked so we return it. She then brings out over steamed broccolini. At this point everyone else had finished their dinner so we send the broccolini back and tell her to forget the chicken.\n\nSo we are hungry and just annoyed. Now comes insult to injury. The bill included a mandatory 20% gratuity. 20%?! For incompetence. What happened to the customer deciding the percentage? The service and the lack of food definitely did not deserve 20%\n\nEven good places can have off days because nobody’s perfect. The biggest issue is how they handled the problem. Not once did the manager come over to our table. The least could have done is brought us free drinks and/or desserts as a courtesy from management. Nothing was offered to make up for the series of mishaps. The pathetic sorry offered by the server lacked substance.\n\nManagement was aware but chose to ignore the issue because they obviously didn’t care. Then they add insult to injury by having the audacity to require a 20% tip.\n\nTotally inconsiderate and unconscionable. The details of the experience warrant them to be exposed in a review for how terrible they handled the situation. We left hungry, annoyed and frustrated.\n\nSave your money. Go somewhere else."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX29lZHVnRRAB",
            "text": "Love the atmosphere the vibe is grown and sexy food and drinks at its finest"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dzQtX3R3RRAB",
            "text": "I had an awful experience at Ikaro Restaurant and Lounge, and I won’t be returning. I went for their soft opening, and right when I walked in, they told me they only took reservations, but still let me in. The music was unbelievably loud — it was so bad that I couldn’t even have a conversation with the person I was with. We went upstairs to get seated, and the noise level was unbearable, with a party of eight near us, one of the ladies literally yelling that she found hair in her dish which completely turned me off from the food. The customer service was terrible — nobody came to take our drink or food order for at least 30 minutes, and it felt like they had completely forgotten about the people upstairs. The DJ was blasting music to the point where I couldn’t hear myself think.\n\nThe space was cramped, and it was uncomfortable just trying to walk around, let alone head to the bathroom. I ordered calamari and a Cosmo in which the cosmo had sugar on the rims like a margarita so I was confused, but after everything that happened, I lost my appetite. I didn’t even finish my meal. Overall, it was a terrible experience, and I wouldn’t recommend this place to anyone. I definitely won’t be going back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OWF2NTNnRRAB",
            "text": "The new restaurant has nice decor, friendly servers. The food was overpriced and the portions on the small side. For $30 the pork chop special was disappointing at best, small, overcooked, flavored ok. The brioche buns for the burger was dry and fell apart while eating it. Needs some vast improvements."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MmFEUG5BRRAB",
            "text": "Came to eat here yesterday and the food was delicious. Service was excellent and fast ! Would definitely come here again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ekphMm9BRRAB",
            "text": "This was the worst service ever.   I came in with 4 children and 2 adults the food came out one at a time and was cold my family was done eating by the time my food came out."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cEszSWx3RRAB",
            "text": "Just a great atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNXFxMEVnEAE",
            "text": "Flatbread and apps were excellent and the food was very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeXAtSHBnRRAB",
            "text": "Julie the server is warm and friendly and a great bartender❤️\nI hope to see this place soar with more options  of an eggs Benedict such as crab or lobster instead of beef but overall amazing decor & service . The  tasty watermelon lemonade is an alternative option for non drinkers.\nThe Overall plus of this restaurant is the bottomless brunch all week !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzck92ek1REAE",
            "text": "Solid offering, French toast was excellent.  Perfect service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNUxQOGhnRRAB",
            "text": "Food is ALWAYS great! Drinks are on the spot!!! The atmosphere is pretty cool and the vibe is perfect! Only bad was  tonight we stopped for couple drinks and there was a funky smell as soon as we entered the rest. Almost felt like a sewage smell. I didn't enjoy my visit this time due to this smell that no one seems to address 😞"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcFpINjlRRRAB",
            "text": "Went for a weekday brunch and it did not disappoint. The bottomless mimosas were the perfect combo of juice and champagne. All four of us ordered something different and we each thoroughly enjoyed our food! Will be back to try the dinner menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdWEtclZ3EAE",
            "text": "Pleasant staff and service. Menu options and entrees are much better than the previous business. Give it a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc2VPQTB3RRAB",
            "text": "Friendly but a little inexperienced staff  The food was very good but maybe a little pricey. We would definitely try it again"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dmF6YXVRRRAB",
            "text": "Well done. Food, service and attention to detail. Great for events"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXUycVBnEAE",
            "text": "Ikaro Restaurant and Lounge offers an inviting ambiance, but the overall experience fell short. Service was slow, with over 10 minutes before anyone took our drink order, and when the cocktails arrived, they were bland and had to be returned. Worse, the server lacked basic knowledge of the menu, uncertain about the sauce accompanying my underwhelming salmon dish. My friend’s lamb rack was equally flavorless, and no one inquired about potential allergies, which is a serious oversight.\n\nAdding to the disappointment, despite being a party of just two, gratuity was automatically applied to our bill, eliminating any opportunity to tip based on the lackluster service we received. While Ikaro has the atmosphere of a high-end dining establishment, its service and culinary execution fall far below what one would expect.\n\nOverall, Significant improvements are needed in both staff training and overall attention to detail before it can truly deliver on its promise. The experience was underwhelming, from the poor service to the flavorless food, making it hard to recommend this place. (No food pictures were taken as it is nothing to brag about)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnV6MzBRRRAB",
            "text": "I was visiting  Legoland , it was a 18 minute drive from the resort . The food was amazing . The only complaint is they ran out of sweet potato fries 🥺 My steak was overcooked but the server was really nice and recommended some really great dishes . The Mac n cheese, sweet potato fries ?lobster bisque & rib eye were some of our favorites. Hope you visit soon . Ask for Janine🩷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudTUzTWR3EAE",
            "text": "Nice place. Pleasant servers.  Good wine selections."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTVxVzlBRRAB",
            "text": "Is this worth 23 dollars? I don’t think so. This place is overpriced and I have ordered from this place before when it was the sugar factory.  It was also overpriced back then. I thought I would give it another chance and see any difference since they changed the name. There isn’t any improvement and the food just tastes “alright “, for 23 dollars I could have gotten more for my money elsewhere for chicken and waffles.  This isn’t a Michelin Star place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMDdXdk9nEAE",
            "text": "My wife surprised me with dinner and this was our first time here! The experience was great, the location was good as well. We parked behind the building in the parking lot as compared to street parking in front. The service was fast! We had muscles as an appetizer and lobster bisque along with it. Both were very good. Their mango lemonade was amazing!! My wife has never had a Tomahawk Steak before and I ordered that. The last Tomahawks I had were from steak houses and were dry-aged so there was a difference. I still recommend trying it however the temperature of the meat (medium rare) was undercooked initially. They took it back and cooked it more for a very good meal. Their sweet fries (sweet potato) were also excellent. We are looking forward to going back to try some other dishes. The staff was helpful, friendly, and positive. They have outside dining as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNTZqNk1BEAE",
            "text": "This place was really nice! The atmosphere and vibe were very cozy and fun! Their menu is nice and they have some great options. We tried the steak and eggs and the French toast. The steak and eggs were decent but the French toast was so delicious. I also tried the strawberry lemonade and it was tasty. Definitely a spot to try out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOHFfRWRREAE",
            "text": "Beautiful place. amazing food. nice manager. Woman is gorgeous and kind. Definitely makes you want to come back! Saturday and Sundays bottomless mimosa. The manager provided us extra fries on the house. Definitely recommend checking this place out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NlBELVVREAE",
            "text": "The food was very, very, very good! The French toast is a big dish but probably the 2nd best French toast I’ve had. The steak and eggs were perfect! The cappuccino was excellent. The calamari was tender and crispy. Steam buns were awesome too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6azV2RzBnRRAB",
            "text": "Solid choice for brunch in the area. Went there on a Sunday and didn’t have to wait too long for the food. Both dishes were great and the plating were very lovely. Will come back to try some other items."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLTlyS1ZBEAE",
            "text": "What a great find! Absolutely amazing first experience and I’m looking forward to trying more on the menu. The bread at the beginning was exceptional. We started with the tuna and it was good as well. We got two excellent burgers (perhaps the only restaurant I’ve been to in Middletown where when you order a medium burger, it’s actually medium!) that were flavorful and well made. The service was incredibly attentive, friendly and efficient. Thanks sugar shack!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMDV6aEpnEAE",
            "text": "The concept of this place is really interesting. We went there with some friends to have a brunch and it was good.\nThe place needs to improve little things but in general we have a great time there and food lie you can see looks very nice and flavor was good.\n\nThe shakes needs to have a better taste but is good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMk1XRzJ3RRAB",
            "text": "Stopped here for brunch today. The food and service were both great. Loved the stout battered French toast. The margarita with was delicious too. We will be back for dinner at some point. Worth a visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeE5fZ3h3RRAB",
            "text": "We randomly stumbled upon this gem today and i cannot tell you how amazing this food is. Eggs Benedict and the french toast were the best we've had EVER. The flavors were insane and everything perfectly seasoned. The presentation was great as well. The customer service was excellent. Always attentive and kind to whatever we needed. The place itself is adorable inside!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabTZya0Z3EAE",
            "text": "This is a sweet find! It is a little unknown because it is on centre St, in an alleyway, and the DMV may throw people off; but walk through centre St and you will be amazed!\n\nHad the eggs in purgatory and spouse had the stout French toast! O my! Flavorful, savory, and filling without overfilling. And the cappuccino was perfect!\n\nUpdate: fabulous food! Clam chowder, lamb panini left me speechless!\n\nDo not pass by this gem! Look for it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaTZEQnZBRRAB",
            "text": "Absolutely delicious! So nice to have a place in Middletown with fresh and tasty breakfast/brunch options. Can’t wait to go back! Avocado toast and vegetable Benedict were both wonderful! I would come back just for the fruit & honey!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibVBLd053EAE",
            "text": "I love the food , wish the portion size was a little more 😀 , but  I loved the food ..had the chicken and waffles and the steak and eggs.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a3VTbVJBEAE",
            "text": "Owners run an amazing coffee/restaurant shop. Love the atmosphere. It’s cozy with great vibes.\nThe menu is a little bit pricey but food it’s delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcS1DR0l3EAE",
            "text": "The place is very nice inside the food was great and the service was also great. Definitely recommend bringing friends, family or your a couple. Their  lemonade and milkshakes are really good and choices to choose from. Definitely would come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bk9fN2x3RRAB",
            "text": "Very cool place in Middletown. The food was some of the tastiest I have ever had—everything from our drinks to our entrees. Our server was so nice. Don't leave without trying the ice cream!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSc2ZUdWxRRRAB",
            "text": "Went there during restaurant week. The food, service and atmosphere all amazing. Was a little hard to find but enjoyed everything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteG9majN3RRAB",
            "text": "Simply wonderful! A great experience! We had dinner here on Thanksgiving. The menu options were vast and they were all delicious. The foie gras french toast appetizer was stellar,  so buttery and melt in your mouth soft. The prime rib was juicy and tender and the corn pudding was perfect! My party tried the Salmon,  cherry compote sauce,  sweet potatoes and duck confit rice amongst other things,  everything was delicious. Compliments to the Chef! Let's not forget the service! It was the best! So gracious and friendly. It really was a wonderful holiday at sugar shack factory ! Don't hesitate to visit, on King Street,  right around corner from DMV in Middletown! You'll be glad you went!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNWRIYjN3RRAB",
            "text": "Today was my first visit to this location since they changed ownersip and you can tell from picture how my experience was. ABSOLUTELY AMAZING! The food was great, the server was amazing and the manager was very helpful and knowledgeable. I love the atmosphere and variety of foods available.  The customer experience provided by all employees was outstanding! Im bringing the family back very soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMDhqb1h3EAE",
            "text": "Stopped by for coffee,\ntiramisu was silky and coffee was good.\nThe atmosphere is what does it here, dim lit vibes and sweet music.\nMenu is a little on the pricier side though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocE1ib0d3EAE",
            "text": "Ayana was wonderful! This little gem was such a pleasant surprise.  Came here for a brunch, the avocado toast was delicious and my Son LOVED his Chicken BLT. First time but won’t be the last! Thank you :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaV9QaTl3RRAB",
            "text": "Great atmosphere! The food and drinks were amazing, the waitress was super friendly. Definitely recommend this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaloyYkNBEAE",
            "text": "Stopped to check out the bakery and ice cream. Nice selection of ice cream. I ordered a watermelon lemonade - it was good and fresh, but I didn’t taste the watermelon at all. Nicely decorated restaurant. Menu looked good, maybe a tad pricy. But I will be back to try it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeUxldDFBRRAB",
            "text": "Wonderful place! Incredibly kind and attentive staff. And DELICIOUS food! Highly recommend!"
        }
    ],
    "reviews_count": 73
}