{
    "name": "Parrilla Latina",
    "place_id": "ChIJu-kkhoDzwokRNQqGYF1EN6o",
    "grid": "BX5",
    "address": "2501 Webster Ave, Bronx, NY 10458, USA",
    "rating": 4,
    "user_ratings_total": 686,
    "phone_number": "(718) 329-3000",
    "reviews": [
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWmR6bG1Za3hJYXpaTVpIbFFibTh4Um5RdFEwRRAB",
            "text": "Fui aya y compre un servicio para llevarlo, un combo 1. los empleados no estaban atento a los clientes, diraban mucho a atender. una mujer me dio una ensalads de papa (expirado, o de otro dia) cusndo llege a casa tenia un olor feo, y sabia malo.  no buelbo comer en ese lugar!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paR2FEaFBjMGRxV2kwemRqWmxaSFJLYkd0WVJHYxAB",
            "text": "The food and service was excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb2NFVnZNR0ZHTWxGUmJHaHdlRU5wWjE4eVNrRRAB",
            "text": "The service and attention was very nice the food was really good and fresh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFVtWlZObFl5YlRkUVN6UnhURkJIUTE5bFdtYxAB",
            "text": "Amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCS2NVMVZNRlpwYW1oa1FtWXpObXBsTVc1QlNuYxAB",
            "text": "Horrible customer service.  very disorganized. Waitress were all over the place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcS0yT0t6MU1MZWVnEAE",
            "text": "The grilled chicken is amazing! I get it everytime I come. I brought my girlfriend and she got the seafood salad which I would say was worth the price."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKT256WmZOb2VueXR3RRAB",
            "text": "Everything turned out perfectly."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNS3VwZW1Td2FhQU9REAE",
            "text": "Bueno todo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZTF3YXFEdXBhTERnEAE",
            "text": "I love the food so much! Drinks are delish and waitresses are on always on it!! Love the food. Will come back again with family! Excellent service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJdnIzcW5VZy1pWElBEAE",
            "text": "I order a mofongo and it came empty"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd0xyRWpBRRAB",
            "text": "The food here is delicious 😋"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dzhyVTVRRRAB",
            "text": "Comida muy buena atencion top muy amables las chicas RD mi próximo viaje seguro regresare restaurante top en el bronx"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bGJXS0lREAE",
            "text": "I always buy food from this restaurant. The food is delicious. I love their grilled chicken."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncllUeTZ3RRAB",
            "text": "Food is good. But I didn’t give it a 5 because prices are not as advertised. Online is has combos  for a set price and when I got there and asked they gave me a complete different price. Also online the combo said it came give beans and salad when I got there they said either or not both.  False advertisement"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMjc3cGdnRRAB",
            "text": "Muy mal servicio solo quieren dirigir al cliente a gastar más dinero servicio pésimo (cabe resaltar que de todos los restaurantes que eh visitado este gana en todos los renglones de faltas )\n\nAsistí con 10 miembros de mi familia y fue la peor experiencia vivida de nuestras vidas.\n\n0-0"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzM0lmZVJBEAE",
            "text": "As per photo uploaded given rating"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuXzRyM2lRRRAB",
            "text": "Just had chicken and okra and rice bean was nothing special it was 11 dollars part of chicken was hard the rest of meal needed more seasoning needed a kick to it the meal was plain"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcF9LRnJnRRAB",
            "text": "Cada vez que ordeno de este lugar me solprenden. La comida es deliciosa ! Nunca hay fallos y tienen  El mejor sazon de Webster!  Y aparte de  comida rica todas las chicas que trabajan son super amables!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLUtfN0J3EAE",
            "text": "Muy buena comida, el personal es un desastre, no respetan los turnos, atienden a quien les da la gana, con una cara fea para todo mundo, como que no les importa nada y no les gusta su trabajo. El ambiente cargado y horrible!!! E intentado ir varias veces por la comida y la mayor parte del tiempo debo irme por la mala atención"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyXzhPSkhnEAE",
            "text": "Pedí un delivery y nunca llegó. Mejor me hubieran dicho que no podían y así comía otra cosa."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaE92Z1RBEAE",
            "text": "Buen ambiente, buena música, excelente servicio y la comida buenísima éramos 4 personas y pedimos 8 cervezas 4 coronas 4 modelos y diferentes platos, paella marinera, filete de salmón,mofongo tóxico y churrasco, también pedimos un combo para llevar y no gastamos más de 250, definitivamente el lugar que voy a comer cuando regrese al Bronx,❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ3NLWmZREAE",
            "text": "Food was amazingly delicious, servers were super kind and attentive, must get the piña coladas! Definitely will come back"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MHZHbHdnRRAB",
            "text": "Muy rica comida a buen precio."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODUycV93RRAB",
            "text": "Food is amazing! Best in the Bronx. I recommend the steak it is cooked to perfection! Service was lovely"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUODYzclVREAE",
            "text": "Llegue del aeropuerto directamente en busqueda de comida Dominicana atras de una bandera arroz habichuela y carne y me tuve que aflojar la correa de la hartura. Volvi 2 veces mas durante mi estadia espectacular."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUODlYdEpBEAE",
            "text": "Amazing food! Best sangria, everything is seasoned perfectly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOC1XeTRnRRAB",
            "text": "This place is so amazing. The food is so good and I have got multiple times and I get the same service and the same quality. Hats off for this business owner that gives 100% with every order. I don’t know where else y’all are going to get food from"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODhYOTZBRRAB",
            "text": "Food was amazing! Service was great and fast. Food was so great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMVpxRy13RRAB",
            "text": "Good Spanish food. However, if you live a distance away from the restaurant and are in a rush, the delivery is by bicycle. So add some time for the delivery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NzczcXd3RRAB",
            "text": "Good food"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bDVHZnJ3RRAB",
            "text": "Muy buen servicio y la comida muy buena la mesera muy atenta  la china   pregunta por ella te atiende rapido miy servicial  todo muy bueno las margaritas muy buenas"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2akt2Wk9nEAE",
            "text": "The Food Is Delicious. The Service Is Great. People Are Very Friendly And Great."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MU43T3NnRRAB",
            "text": "Pedí un mofongo es la segunda vez que esto me pasa lleno de agua no tiene cuidado para empacarlo y esa ensalada podrida que asquerosidad tan grande falta de de respeto a sus clientes eso está lleno de bacterias no le vendan basura a la gente sanidad es que hay que mostrarle esto para que inspeccionen la asquerosidad que tienen ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkczZ2MU5REAE",
            "text": "Delicious Latin Flavored Food.  Pork Penir was off the hook as was the rice and beans and other cooked rice dish.  Tostones and maduros so tasty"
        },
        {
            "date": "1년 전",
            "language": "fi",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aXEtRWNREAE",
            "text": "Yummmmmyyy"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0eFBMQjhRRRAB",
            "text": "Me gusta el lugar por todo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcmVlUWdBRRAB",
            "text": "Great place with great food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdnBYVm1nRRAB",
            "text": "The food is good but sometimes the service is alittle  wacky"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsODZIZV93RRAB",
            "text": "I waisted my money.\nI got pork that was so dry it should not have been served.\nI ordered expresso & got American coffee.\nTHE RESTAURANT IS IN THE UNITED STATES AND NOONE SPOKE ENGLISH!!!!!👎🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bXNDLUR3EAE",
            "text": "I quite enjoyed the food for a place we randomly walked into. But why $6.24 for a few pieces of lettuces and tomatoes? It was the size of a small side dish (wish I took a pic of it) that came with the chicken stew. At least bother to put a few avocados slices?\n\nOh and note that 18% gratuity is automated included.\n\nAll in all, solid homemade food but unhappy with how they charged. Not sure I’d return because of it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc01QWlB3EAE",
            "text": "Steak, chicken,  pork, shrimp, soups, cheap eats @ it's best . Food is excellent, friendly staff"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdkpYamNBEAE",
            "text": "Small place. I do admit thier baked Salmon was awesome!! Good drinks👍will definitely go back.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdU1pS1NREAE",
            "text": "Food was so yummy! Pricing for the quantity of food served was a delicious bargain. We sat outdoors which I am usually not a fan of but the ambiance was pretty and inviting. Our waitress was so sweet. A star was lost as we had a long wait…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGeVlLWG5RRRAB",
            "text": "Hands down the best restaurant in this zip code. The only thing better than the food is the service. If you love Spanish food or a nice cooked churrasco, this is your spot. Drinks are pretty good as well!!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReGFxMVBnEAE",
            "text": "The food is great but the attention and greeting from the staff unfortunately it's poor for a so mentioned place in the Bronx.\nThis review is base on carry out experience  multiple times. It goes to the point that it makes me think every time I walk in it seems to be a bother asking for prices menu inquiries etc. I hope the service and greeting improve and keep in mind that there are many choices of similar food at just walking distance that provides with better customer treatment.\n\nFyi; this is only from my own experience nothing personal. I only visit this place when I'm around the area."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMFk2VUJnEAE",
            "text": "Ordered stewed beef, fried chicken chunks, stewed chicken and all were delicious. Disappointed they rarely have yellow rice with gandules. For some reason the food seems to taste better when you eat at establishment rather than when…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNzUyLXNRRRAB",
            "text": "Love this place!! The food was very delicious. The manager Danalkis  was very welcoming and she made me feel really good and also interacted with me. It was a nice experience with all the ladies at the cashier and not making me wait long for my food. Overall a 10/10 experience!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaUlLdXdBRRAB",
            "text": "Disgusting, not only was the food bad but the dessert they delivered had mold ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwXzRpVDd3RRAB",
            "text": "The good reviews have to be fake. Customer service was horrible. They are super slow and move like time is no factor to anyone. They serve you attitude way better than they serve you food. They messed up my order because they struggle with…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMjltejh3RRAB",
            "text": "The order through GrubHub and it was delivered over 1 and 30min late. Called the restaurant, really bad customer service and they marked as delivered in the app when the driver left the store. Took over 35 min after that I got my food when…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTLVlQWGh3RRAB",
            "text": "Just ordered food from this restaurant at 4:36pm and the delivery got here at 5:59pm that’s almost an hour and 30 minutes. When I opened the bag the lid from the plate was opened and some of the food spilled onto the bag and the food was cold . I barely touched the food, there goes $17.40 down the drain. Basically paid for cold food. I am not satisfied at all. I am still hungry because I couldn’t eat cold food . I wanted to call the restaurant but they would have taken another hour to bring the food because the plate they gave me was cold. And on top of that they barely gave me rice, they mostly put the fish in the food. These people are horrible and have extremely bad customer service. PLEASE DO NOT ORDER FOOD FROM THIS RESTAURANT, I repeat, PLEASE DO NOT ORDER FOOD FROM THIS RESTAURANT!!!!!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyei1TVUd3EAE",
            "text": "My grandma loves to have their lobster tail and I went recently to see how the food was. I ordered the grilled chicken breast and all my god, it was amazing. They gave me Soo much that I was able to share it with someone."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaWJPZWtnRRAB",
            "text": "I swear this used to be my dad and I spot. The food used to be soooo goood and cheap. Apparently they changed administration, and the food quality went soo low, and expensive. I ordered a t-bone well done, and it was not even well cooked in the middle. I even asked for it to be re-cook but when i came out again was the same. When i tell u blood was coming off, the meat was rare to it’s finest"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNEpEaFdREAE",
            "text": "I just bought my food an I found a damaged curly little black hair, you suppose to get a lemon, they didn't soak the grease off the chicken.. 3 way do not do this.. this is horrible the beans have no taste. I spent 16 bucks an a tip for…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbDZ5NHhBRRAB",
            "text": "Stopped there on a Sunday afternoon and ordered goat stew and some bbq ribs. Food was just barely ok, - nothing to write home about. The service was  absolutely horrendous and super slow. Finally, they brought the bill with 15% tips already…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNnEyc25BRRAB",
            "text": "The restaurant was empty when my mom, brother and I got there. We waited about ten to fifteen minutes before we wre served. We weren't greeted upon arrival. While placing our order, the waitress was a bit dismissive and not very friendly.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLZ01MTUdBEAE",
            "text": "Nice food, but I've had better. Terrible customer service. As a Bronx native, I find that  a lot of these establishments, (especially in the BX), can care less about how they service you when you don't share the same heritage. Smh. Waste of money."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZallhWEZ3EAE",
            "text": "Delicious! Whenever I'm in the Fordham section of the Bronx, I make it my business to eat lunch.  My go to is the pernil, but it's all good! The food is always fresh, the restaurant is always clean and the service is prompt and friendly. Thanks!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwOWV6aDBnRRAB",
            "text": "Stopped here on a sunny Saturday afternoon to treat myself to a lovely oxtail lunch with rice, beans and a small salad. Steamed veggies with rice and beans for my little one. My order came out to $27.71. I was truly disappointed when the…"
        },
        {
            "date": "8년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMGJqdGNBEAE",
            "text": "La comida tiene muy buen sabor pero la atencion es una basura. Nosotros eramos 7 personas y cuando llegamos, por mas de 5 minutos nadie vino a ver si necesitabamos algo, ni a darnos las bienvenida. Atendieron a otras personas que llegaron…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdk5fMC13RRAB",
            "text": "Everything is a Lie,about food prices.overcharge,not good set up aut side benches broken lamp on top of eating table,ask for face mask at entrance when everyone doesn't have one on.they will kick you out of the restaurant if you don't have…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNnVHVnJ3RRAB",
            "text": "They serve you old, stale and uncooked food for too much money. Spent $100 and I kid you not, we got ONE round countainer of uncooked chicken, one container of wet mushy fries and one container of unfried tostones. The worst one yet, was…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaFo3VTNBRRAB",
            "text": "My Co-Worker  I.C.has patronized this establishment  many times,\ntoday we ordered lunch for our administrative staff and the order was missing items, we requested to have the missing orders replaced and they treated him like…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjMnVhXzhBRRAB",
            "text": "Placed an order via GrubHub and and the delivery was set for 645 PM. called the restaurant at 7PM and was told that the orders had ALL been sent out a few minutes ago and to give them some time because there is traffic then i was abruptly…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M3Z1MTRnRRAB",
            "text": "Waited over 20mins to get a simple soft drink and over 45mins to get my food. Good food, horrible service. I tried asking my server the sta tus of my food and before i could even sag a word pass excuse me, she just pretty much told me to…"
        }
    ],
    "reviews_count": 65
}