{
    "name": "The Windham Local Public House",
    "place_id": "ChIJgf2Qz4RM3IkRS0oJIbq2vaw",
    "grid": "BX5",
    "address": "5410 NY-23, Windham, NY 12496, USA",
    "rating": 4.4,
    "user_ratings_total": 356,
    "phone_number": "(518) 750-8300",
    "reviews": [
        {
            "date": "6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFRIcENlVjl3UlhKT1RrbEtURmN4T0dKVGNGRRAB",
            "text": "The soup dumplings were absolutely divine. Id drive back to NY for those alone."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM2FtTTRMVkJ5WVRCNGNrOUtiME56U2xwWmVuYxAB",
            "text": "This is the kind of place I wish I had in my neighborhood. They rolled with our group of 16 people like it was nothing. My bacon was crisp and tasty, and the breakfast burrito was delicious."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNE5EWnNiMFIwYjBzeVEySnNXVTlIUlVWS1RFRRAB",
            "text": "Had the best time with my family there. Great lunch options even during breakfast hours."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVU1UWnVhRkZ4YkRGaGJFcGlaVVU0V0Zsb1dYYxAB",
            "text": "Very cool building and atmosphere.  Food was good although a bit expensive for what it is - for an example; $20 for a breakfast burrito."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adFkydExWRkJRUlRCM2JsUkpkMVJFVUhaT1VWRRAB",
            "text": "My hubby n I Coffee n bagel 🥯 😋 sandwichn breakfast burrito yummy.  Great way to start our 32 year anniversary, fueled up  before our  hike."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdFEzZE5SRk4zTjFaTmMzSlBNVVpPV25KTmExRRAB",
            "text": "Excelente lugar, súper buena la atención del personal; y la comida es exquisita."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNGJIbDFjMk5UTVdnM1YyeHdSbkJVTmpCeVUzYxAB",
            "text": "Thai holds up against anything you’ll find in a big city and the ingredients are local and fresh.  Pad Thai, Dumplings, Red Curry are all outstanding"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaU9VNUxNVmsxWm5sRVVVTjBhRTFrYVROSFZsRRAB",
            "text": "Their hommade soup dumplings, AMAZING. Breakfast bagel sandwich, AMAZING. I don’t think you can go wrong here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbFNsSktSMmRPVEcxTWNrWmFVMUEyZG5aUk5YYxAB",
            "text": "Pad Thai chicken for 27 bucks. The chicken is bought pre cooked frozen and most likely then microwaved. No flavor on the pad Thai\n\nA steak quesadilla is 29 dollars . No rice or beans.\n\nI’m extremely confused  what’s going on or what justifies the prices ?\n\nEvery major city in America charges around 17-20 for Thai dishes.\n\nBeer was barely cold.\n\nThis place is absolutely outrageous.\n\nNice server would be the only redeemable quality ?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSU9EaDVUeTAwZDFkSFRHMWpZMDF6UnprM1NXYxAB",
            "text": "Good place for breakfast"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa1ExTTFRWEpXWjNOamNVVmFXVzFNWlZGVE1FRRAB",
            "text": "Tourist trap, not local and overpriced. If you’re looking for breakfast this ain’t it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veVVVMXpkamxUUzIweFkwZzNNVU42VVUxTVFXYxAB",
            "text": "Windham Social felt anti-social for me as I was refused service because I had a service dog with me. Not only is it against the law to discriminate, but the owner did it rudely. As a local I will never spend a cent there or recommend anyone ever go.,Michael"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trdFkxOVpOR05IVkhOSFUxZEZXalYyT1RZMlFtYxAB",
            "text": "The food is delicious and it has a great vibe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdVNuWlNVOUlEWFl3EAE",
            "text": "Id vote for Emily as mayor of Windham. The food is great too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdWF0SnpzemRqYnVBRRAB",
            "text": "They are so kind and have a great selection for everyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN0txNlRhZ2RIcVR3EAE",
            "text": "Very good everything , happy time with my friend"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNemJYM2hnRRAB",
            "text": "Cozy little place. Good spot for breakfast and lunch. Coffee selection is extensive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMWIyam13RRAB",
            "text": "If you’re in the Windham area and want to have an amazing breakfast or a spectacular lunch/dinner, you definitely need to check the Local out. The breakfast sandwiches are incredible and the curry I can’t get enough of and constantly go back for more! The staff is friendly and helpful, and the atmosphere is really cool and welcoming."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdUt5eUp3EAE",
            "text": "The Pad Thai exploded with flavor. The setting in a former bank building was a super cool atmosphere. The family running the joint was very sweet."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNkozcFRREAE",
            "text": "This is cosy cafe with amazing soup dumplings and Thai food.  A real jem of a find in a mountain town"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMHVmU1R3EAE",
            "text": "Great coffee and lunch! We got the pork soup dumplings, pulled pork sandwich, pulled pork tacos, and a side mac & cheese - mac & cheese was the BEST!\n\nOrder at the counter - servers are friendly and give great recommendations!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNFo3aTFnRRAB",
            "text": "Good"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMkkza3RnRRAB",
            "text": "Food was delicious. Atmosphere is great. One of employees was rude."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dzRDNXdBRRAB",
            "text": "Excellent spot for both breakfast and lunch. We came multiple times throughout one weekend because we liked it so much. Food is great - Breakfast sandwich and avocado toast were awesome. Great drinks with lots of alcohol selection. Food was superb -- soup dumplings and pad thai and Kimchi soup were all great. Lots of food selection including Italian, Mexican, Asian food. Good vibes overall with a cabin/lodge feel. Would totally come back again. Good service. They have live music on Friday and/or Saturday night, we didn't get a chance to stop by then, sounds nice though. Thanks!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aHA3VmxRRRAB",
            "text": "I can always tell that they use the freshest ingredients & the food is always delicious.  Very cozy atmosphere too."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOC1EdUxREAE",
            "text": "I love it .  Thank God this place is here . They are very talented chefs .  Delicious food !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLU5ELW9RRRAB",
            "text": "Friendly folks in a local place with a variety of fare.   I got the catskill Cuban that came with potato chips.    Tasty, though not a Cuban for purists as it had chicken instead of roasted pork.  Still liked the flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOHRiMlVBEAE",
            "text": "Very surprised that they have great matcha!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHVXbVJREAE",
            "text": "Peak vibes here. Excellent music - s/o Eugene Tyler Band. very friendly and hospitable staff. The food was delicious! Lots of options. Hiiighlly recommend the pork soup dumplings and the steak sandwich. Generous portions. Affordable. Super cozy but lively atmosphere 🫶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbkxTYTR3RRAB",
            "text": "Horrible pad thai I've ever eaten.\nThe noodles were not cooked fully and were extremely salty, burning my tongue.\n\nI asked the lady if there was anything she could do to make it less salty. I asked nicely, and she replied that it was their chef's style and there was nothing they could do. She didn't even bother to go to the kitchen and ask.\n\nI was speechless. The owner or manager didn't want to give us any sort of discount and kept saying there was nothing they could do.\nShe gave us $6 back for not raising my voice.\n\nStir fry veggies with steak: $36\n(extremely overpriced)\nShrimp Pad Thai: $26\n(the worst pad thai I've had)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN1BfSkd3EAE",
            "text": "How this place received a 4.4 is beyond me. If I could give this place a negative 1 star I would.\n\nI seldom write a negative review but with my recent experience at this facility I will make an exception. Upon entering the establishment I wasn't sure if they were open since I was the only patron at the restaurant and I clearly see why. The waitress who served me looked like she was having a bad day and clearly showed it through the grimace on her face. She reluctantly took our order of pork soup dumplings, my wife had a shrimp pad thai and I had a stir fry veggies with steak.\n\nThe soup dumplings clearly tasted as if it was bought from trader joes and heated up in a microwave, my steak stir fry was tasteless and my wife shrimp pad thai was extremely salty, it felt like they dump a bottle of table salt on the meal. The meal was vile and odious, when my wife complained about her meal being salty the waitress simply said, \"deal with it, thats the way our chef makes it.\" Along with a slew of nasty comments she made. When I went to complain to the manager, she simply didn't care and was just as dismissive.\n\nFor a meal that cost just as high as a 5star restaurant in nyc, you would at least expect good service. I can't see this business lasting through the winter. I advice you to please stay away at all cost. Eating a discarded McDonald's meal from a dumpster is more appetizing than the crap they serve here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbUx5WDRnRRAB",
            "text": "We stumbled in here when our first plan had a crazy wait, we were so happy to be greeted by friendly staff and a smattering of locals. The food was delicious, especially the pad Thai. Even the spaghetti for my kid was fantastic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIekx5MW93RRAB",
            "text": "Definitely worth a visit for excellent food and service at fair prices. Live music was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3amVxcDNnRRAB",
            "text": "Delicious food, tasty coffee, cool hang out spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieW9iTE53EAE",
            "text": "Great Show tonight! The Drumming, Singing and Atmosphere was Superb! Great Bar service. Delish Snacks. Edamame bowl was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdC1XbGVBEAE",
            "text": "Foods overpriced and not good quality. Look elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdU1UT3l3RRAB",
            "text": "Very salty pad Thai and service was not great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6b3JMem1nRRAB",
            "text": "The women at the counter with the tattoo around her left arm , she had a very hard time understanding what we CLEARLY ordered. Threw nasty comments under her breath. She couldn’t understand my name (R.J.), had a nasty attitude and said it’s whatever I don’t care.  When we paid her she aggressively slapped it onto the counter when I had my hands out to grab it. She was nice to others before and after us . Wonder if it’s because I’m of color ?!  They wouldn’t allow my SERVICE dog in either and kept saying he’s emotional support but he’s my physical assistant dog a.k.a SERVICE DOG! 🐕‍🦺"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6enA3ZFFBEAE",
            "text": "It was a beautiful place to come in and grab coffee and something to eat and do some work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqenBQWEJBEAE",
            "text": "Food was awesome!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpa28tS1RREAE",
            "text": "Cool coffee house with mountain views.\nBest cappacino."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcktfeEFnEAE",
            "text": "My husband and I love this place for breakfast and lunch.  The staff is so wonderful and the food is amazing!  We couldn’t get over the steak sandwich!  It was so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aExuSkFREAE",
            "text": "Good food and vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkX28zVV9RRRAB",
            "text": "Lady behind the counter had some attitude and a weird vibe and we just didn’t feel welcomed here. No one came to take our orders so we left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeDZLWEVREAE",
            "text": "Great food\nEmployees are very rude service sucks\nNot nice people who work as servers and behind the counter. Once and done"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROXzZ5WTh3RRAB",
            "text": "Best coffee and breakfast"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOWYzdlFREAE",
            "text": "The Local is run by friendly people that look after you. It is like the warmest meeting place in town. Really it is the smiles that keep you coming back! Thanks for being here, James Bergeron"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxODRQdDh3RRAB",
            "text": "Great food, lovely staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbF9qOVRREAE",
            "text": "Always very delicious food, I love getting their tomato soup and a creme soda"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdzlPNklREAE",
            "text": "Please don’t order the avocado toast. Not only couldn’t look at it - could eat it . They should redo the item. It is not worth the amount they charge too. Left it uneaten!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleDRuSnJBRRAB",
            "text": "We had a great lunch here.  Love the orange soda and the cappuccino was really good.  The BBQ pulled pork sandwich was excellent.  The bread was toasted.  The steak tacos were great as well.  Very good steak.  The fatty pieces gave it a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbGFQODRBRRAB",
            "text": "Come to the Windham Local for excellent food and great vibes (there was jazz playing all morning, and it seems they often have jam sessions in the evenings). We tried all of their specials (a wonderful array of Thai food) and greatly enjoyed the Pad Thai, Basil Stir Fry, Thai Red Curry, the Veggie Dumplings, and Shrimp Shumai. The Everything Bagel with cheese was also very good.\n\nYou have to order at the counter, and given they are a bit understaffed, there was a queue to order. The food preparations were efficiently prepared though. They're doing the best they can and we had a very positive experience. Highly recommend!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnLU5hVDlnRRAB",
            "text": "This place used to be called Daly's Coffee, which had closed. It has been reopened about 2 weeks ago as The Windham Local Public House, with a fully renovated kitchen and interior under new ownership. The interior has been much improved and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeEpfc1NREAE",
            "text": "Stopped for a quick bite without knowing what to expect but feeling the positive vibe when you stepped in was a good welcoming. There was an interesting interior design at far corner of the cafe. Friendly staff, fast and good service. Will be back for a Saturday nite out and live music..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5enZXRTVRRRAB",
            "text": "Wonderful eatery in the heart of Windham with a full bar and an expansive menu. Great food and drinks options available all day and  across multiple cuisines. Fun mixed drink options and beers on tap. I’d highly recommend if you’re in the area!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LWNxT2FREAE",
            "text": "The restaurant was accommodating for our group of 8. The live music was great, and it is a really cute local spot. The dinner menu is mostly Thai food, and we got some delicious pad thai."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxc3EtWERBEAE",
            "text": "Their food and coffee are too good. Must try bean chilli and latte. Their quesadilla is also amazing."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NF9PSHNBRRAB",
            "text": "Great food, amazing coffee, beer on tap from a local brewery and the Best tomato soup I've ever had. Good spot for lunch and breakfast."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURza05Qa0R3EAE",
            "text": "Proper food and coffee, nice jazz music and good service. Vegan options. Highly recommend in village with lots of junk food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhckppOVVREAE",
            "text": "Very good ambiance and good food, moreover pet friendly. They have live music on weekends which was really good.\nVery friendly staff and good service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMXFfdW5RRRAB",
            "text": "The best cold brew in town. The food is delicious and the whole staff is very friendly! The lox is a great breakfast option"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNna1lwNRAB",
            "text": "Cute, clean, spacious, and very delicious. I got the grilled cheese with pickled shallots, and tomato soup with pesto."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3amNQSk5nEAE",
            "text": "I discovered this little gem last weekend and am so glad that I did, it is now my go to lunch spot after skiing. The donuts are delicious, coffee is strong, and food is yummy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXZ3BiSzJ3RRAB",
            "text": "My daughter loves tomato soup there and I love their coffee and Catskill Cuban sandwich. My husband is a fan of truffle grilled cheese"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMzg2RGdRRRAB",
            "text": "Nice place to drink a beer and quietly kill some time with a book. I hear live music is really good. Will definitely come back. Comfy sofas too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSenJ6emRBEAE",
            "text": "Super cute little spot right on the main drag in downtown. Service was polite and quick. We got coffee's and pastries and hot breakfast too. The sticky buns were delightful and my breakfast burrito was so good. My husband got a bagel all dressed with salmon and capers and onions and cream cheese. We definitely recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbl9yVXV3RRAB",
            "text": "Delicious food with a nice selection of beers, large portions, and attentive service. The live music was a nice surprise as my husband and I are avid music fans - the guitarist was excellent.  Next time we are in the area we will return with hefty appetites."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeFA2cHJnRRAB",
            "text": "Th Burrito was excellent! The oatmeal was big and delicious... but Chai latte was the best!!! You have to try it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGamF6eTVRRRAB",
            "text": "More than just amazing coffee! My husband and I had been here for breakfast (yum!) But here we were, on a very busy Columbus Day Weekend, visiting local friends. Options were scarce -- everything \"fancy\" was booked -- so we dropped in to the Local. Not only did we enjoy the food -- the dumplings! the pad thai! -- but we were treated to super-fun live music. Total home run!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMXJ5cmFnEAE",
            "text": "We went to the Windham local today. What a beautiful place. Feels like a Parisian resturant! Beautiful calm ambiance, decor and amazing service. The Thai food is a great addition. We also met the owner David who seemed very nice and welcoming. We will definitely be going there again and enjoying live music too!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhc0pDOHN3RRAB",
            "text": "Delicious food!! I ate one of the best quiches: tomato, asparagus, feta, BUT the real winner was the eggs —- light & fluffy! A real joy to eat. The side salad was tasty & came with a homemade lemon dressing that made it even better. I’m…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleHE2dVJBEAE",
            "text": "I came with my wife on our anniversary and were appreciative of the atmosphere. Sadly, that was really the only thing we liked.\n\nWait staff was…terrible. Our simple order had 2 mistakes (wrong drink, no rice), and the waitress completely forgot about my wife’s meal. After waiting nearly half an hour AFTER I got my food, we had to flag her down to ask about my wife’s dish. The waitress couldn’t even recall what our order was and blamed it on the kitchen being too busy. We suspect she just forgot to order it. Honestly, we’ve never had a situation where the wait staff completely forgot about our order before and were understandably very upset.\n\nFood was okay. Roasted chicken and the veggie quesadilla were good! The steamed vegetables though were undercooked - I could do better with a microwave and a bag of frozen veggies. Normally I’d be okay with it if the price was reasonable, but at $31, my expectations of my food were way higher.\n\nWe waited for them to make it up to us, but nada from the waitress. To their credit, another member of the wait staff checked in later and offered a soda as a apology after we told her what happened, but by that point we were done with the place.\n\nOverall, very poor experience. Typically I don’t write negative reviews as I get it’s difficult to run a restaurant, but made an exception this time given how bad the experience was. If you wish to go, I hope your experience is better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcW9MUmxRRRAB",
            "text": "Food was great. Fresh ingredients. We had a Cuban, Mac n cheese, tacos, and a quesadilla and everything was very good. Prices are very high ($15-18 for a sandwich). Staff wasn't very friendly, specifically the young woman taking orders."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMmVyRnlBRRAB",
            "text": "Windham Local is not only a fun hang-out spot, but it's also a laptop-friendly cafe that I find myself visiting to get some much needed work done. I often frequent the Windham Local whenever I am upstate during my summer breaks and always enjoy the array of delicious coffees and pastries, as well as the fresh, flavorful meals (especially Chef Salad and Pad Thai). This place is a hipstery, homey local staple in Windham and I recommend it to anyone who is in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcTdqRDdBRRAB",
            "text": "Tasty food, and great vegan options. Good flavor of meat in pulled pork sandwich on a warm bread that soaked up flavor from the pork nicely. Thai red curry with tofu was warming and just spicy enough. Nice coffee and a nice ambience to boot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcS1HVzlRRRAB",
            "text": "Had been wanting to try the place as it looked lovely from the outside & it always seemed to have a crowd.\nBut soooo very disappointed! Wait staff was dismissive and kept disappearing.\nWe ordered an appetizer and two entrees, the Basil shrimp & the steak sandwich.  Mind you, only one other table in the whole place had customer, you could say they were basically empty.  My dish was salty (but hunger is the best chef & I was starving) and as I’m taking my last bite they finally bought my husband’s steak sandwich…which he refused.\nNO ONE was apologetic and even then we had to ask for the check TWICE."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldTdHTXdnRRAB",
            "text": "Same dry over-cooked re-heated leftover cubed over-seasoned dark meat chicken, used on the two different chicken dishes we ordered. If it was chicken at all. At first the place seemed nice but when it comes to their food, it's not fresh. Would have tried a coffee or latte but the menu for that was easily missed. Not impressed with the beer or taste of the beer. Service was meh, just ok. Sorry, nothing great here except the decor and try-hard ambiance."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0Z0lxd3d3RRAB",
            "text": "If you’re in a rush, then this isn’t the place for you. It’s definitely worth the wait with great food selection and great coffee. I had the bacon, egg and cheese on a perfect bagel from Bread Alone in Kingston. My wife had the chicken sandwich, which was cooked to perfection. They also have a great beer selection. Go!"
        }
    ],
    "reviews_count": 78
}