{
    "name": "La Cocina de Rosa",
    "place_id": "ChIJQRi2bHYzw4kRE6M4qfyRv5A",
    "grid": "BX5",
    "address": "228 Dolson Ave, Middletown, NY 10940, USA",
    "rating": 4.8,
    "user_ratings_total": 51,
    "phone_number": "(845) 784-0514",
    "reviews": [
        {
            "date": "수정일: 3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQy0xSm52dFBlbjJRRRAB",
            "text": "El mejor de todo Middletown ny"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelNVUlZUR3RTZVZKNFNFcHNZMEpCUkVSU1QyYxAB",
            "text": "Tiene una buena atención al cliente, siempre con el cariño de lo tradicional de nosotros pueblos latinos 🫶🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTWRFTm5RbGRHVUhKUWVtTTBiSHBvVkUxTmJHYxAB",
            "text": "Found fly maggots in my food very disgusting.\nAnd the lady that cooks was very rude telling me I was wrong. Look at the picture and tell me if I was wrong. 😑…"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeGFrcHZaV1pNYjBGeWVVVkNiR2RHTFVwamRWRRAB",
            "text": "Muy agradable buen servicio buenas comidas los jugos son % por % jugos naturales vien rico y y el servicio de primera me encanta 💖"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1l6WjBPRU5UWlV0UFVVeFpWVzVMUW5oS2NIYxAB",
            "text": "Excelente buena comida ,muy simpática ☺️"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUWMwSm5VbU5wV0U1U2FHTkxkRkZKU1VGT1ZrRRAB",
            "text": "Excelente comida! Doña Rosa y su sobrina! Lo máximo! Costumer service excelente! Comida excelente! Que ma hoy a pedir? No soy Dominican pero que ricooooo!!!! 👍🏻😁\n\nEnrique B."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdE1EQk1WREZ2TjJsR2JrSm5NRWxCVEc1TFMwRRAB",
            "text": "Muy buen sabor y la atención es excelente.\n\nGreat taste and excellent customer service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM0p0dlBzcHVmSUZ3EAE",
            "text": "Great fresh food Everytime I go!\nPrices are moderately priced.\nI just love there oxtails and they have the best fresh juices."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnamZ6WERnEAE",
            "text": "What a gem of a restaurant. I wasn’t expecting this place to be so tasty. The chicharron and backed chicken were well seasoned and tasty. The customer service is great along with reasonable prices. We will be back."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNfdVo1ZBAB",
            "text": "Comida autentica, excelente servicio. Yo volver para acá!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ci16eHBnRRAB",
            "text": "Absolutely delicious. Will definitely return. Muchas gracias!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGUycGt3RRAB",
            "text": "Ok, it's crazy that this place is inside a Mobil mini mart, but it is.  It'd some of the best Dominican food around! The oxtail was amazing, the tumeric tea was so different and delicious,  and I so appreciated the coffee! We live in Milford PA, but are looking for excuses to go back!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbDRUdnN3RRAB",
            "text": "Muy amables , súper recomendado no hay comparación…. Necesitábamos un lugar como este ! 🤍🙏🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHB6Q2lBRRAB",
            "text": "Delicious mangu and friendly and fun service. We can't wait to go back and try more menu items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIelpUMGpBRRAB",
            "text": "I stopped to get some gas and instead of grabbing a snack I had their chicken empanada and it was delicious 🤌🏾. Im sure all of the food is great so you definitely have to stop by for a quick bite or to take something to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd2QyWFBnEAE",
            "text": "This place is awesome. Great food. Pricing is great. Serving is amazing. With great people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6LU02dTdRRRAB",
            "text": "Absolutely GREAT FOOD! If you don't want to cook that night you can always get your families' meal here! They also serve breakfast too!! I recommend the Chicken Empanadas for a quick bite!!! 10 out of 10 They won't disappoint!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOF9XdzRnRRAB",
            "text": "Excellent Dominican food.  This place is tucked away inside the Mobile Mart.  The rice and meats were excellent.  The beans delicious.  Tostones were great.   House fresh flavored waters were delicious.    The only draw back is that the dining area is shared with the mini Mart for traffic.  You can always get it to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaHZMQ3NRRRAB",
            "text": "Very affordable great tasting authentic food. Everything is made fresh daily. Love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULXVUNW9BRRAB",
            "text": "Eating in Rosa's kitchen is like eating at home. The food is delicious and the seasoning is very well balanced. I can't wait to return.\nWithout a doubt 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ2UyMmJnEAE",
            "text": "Enjoyed our food crispy chicharrones and some stewed chicken. Definitely recommend trying this place. Very Good"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5M1lEYnZRRRAB",
            "text": "Muy amables y serviciales"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ0tlN1dnEAE",
            "text": "I really really absolutely LOVE this place! You want REAL flavor!?!…Come here because I’m telling you it’s100% perfect all around …literally everything they make (their custom sauces 👌)!!! And also everyone in the kitchen and who makes up this business are such sweet and generous souls."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNXJXQlhnEAE",
            "text": "I loved this place so much I turned around  to get another order! The food is amazing! The people working are so nice! Best baked chicken ever!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcFp2ajd3RRAB",
            "text": "The service was horrible, and to make matters worst I found cockroach in my take out.  The soup I ordered was so greasy.   If I could give them zero stars I would."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOU1hamR3EAE",
            "text": "A Hidden Gem of Authentic Dominican Delights!\n\nRating: ⭐⭐⭐⭐⭐ (5/5)\n\nI stumbled upon this hidden gem, a hole-in-the-wall Dominican spot, and let me tell you, it's an absolute culinary delight! Located in Middletown, this restaurant offers some of the best Caribbean food I've had in the area.\n\nThe highlight of my experience was the warm and welcoming atmosphere created by the two lovely ladies who run the place. They were incredibly sweet and attentive, making my visit all the more enjoyable.\n\nUpon my request, they graciously prepared the empanadas fresh, and they were nothing short of perfection. The burst of flavors in each bite transported me to the streets of Santo Domingo. And if you're in the mood for some classic Dominican dishes, the arroz con gandules and pork chops are a must-try!\n\nThe authenticity of the flavors here took me back to the heart of the Dominican Republic, reminding me of my grandma's cooking. It's rare to find such a genuine taste so far from home, and I'm grateful for stumbling upon this little treasure.\n\nFor anyone seeking an unforgettable experience of good Dominican food, I can't recommend this spot enough. Trust me, you won't be disappointed. Don't miss out on this culinary adventure!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdTlYdTdRRRAB",
            "text": "I love, love the food there real fresh home made food very recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LTkyem5RRRAB",
            "text": "Best Sandwich had after a long time. Didn't expect to be that good becuase it is located inside a Gas Station (Mobil). Service is excellent and they made everything fresh. Fresh Lemonade was really good. Definetly go back if I'm visiting Middiletown."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OC16eTlnRRAB",
            "text": "Delicious authentic food and great service. The staff were very courteous, polite and friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cWNic2N3EAE",
            "text": "Great Dominican food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aXBpLWt3RRAB",
            "text": "Great food, friendly service. A must have."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4N0wtclVBEAE",
            "text": "The chef and his staff were so warm and friendly.  Food was outstanding!"
        }
    ],
    "reviews_count": 32
}