{
    "name": "Milo's Restaurant",
    "place_id": "ChIJvxG38Zozw4kR800mkrXNYOg",
    "grid": "BX5",
    "address": "90 North St, Middletown, NY 10940, USA",
    "rating": 4.3,
    "user_ratings_total": 88,
    "phone_number": "(845) 342-0025",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneHJySWpRRRAB",
            "text": "Gracias Monica por tu servicio y amabilidad."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSFptUjFjbUUzTTNkWVdtTkdaVm8zTnkxT1RHYxAB",
            "text": "Terrible atención, la señora que nos atendió no nos pasó cubiertos, ni servilletas hasta muchísimo después de habernos pasado los platos. Todo el tiempo hay que estar pidiéndole que nos ayude con las cosas que se suponen que son necesarias…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWlIwWlJNbUZ3VUVscmF6aFVlV1p1Y0ROUk5FRRAB",
            "text": "Horrible service. We waited a full hour without receiving our food, and no server checked in on us. We had to get our own menus and chase after the server multiple times, but she kept ignoring us since we were not Ecuadorian. The staff was extremely rude and discriminatory.\n\nWe tried to be patient, thinking they might just be busy, but even after finally placing an order of food, I also inquired about the drink selection and the server rudely said that they had what was upfront. I said I don't know what you have can you please tell me all with a gentle demeanor but she was just plain nasty. We waited but no food or drinks ever came. Meanwhile, other tables who arrived much later than us received their meals right away. At that point, we decided to leave. The experience was just bad. I felt so disappointed for inviting my sweet parents here. They never apologized or offered any explanation. Everyone was just simply rude and condescending. Don't get fooled if they treat you well. If they do its most likely because you are their only customer at the time but if they have predominantly equatorian customers and you are not equatorian, they won't care for you.\nAfter the horrible ordeal, because we are simply not disgusting people like them.\nI still paid $10 for our drinks—which tasted like watered-down Kool-Aid—even though we would have been justified in walking out. Absolutely unacceptable service. Do not recommend this place at all. The.photo had the nasty person we dealt with she had a poker face the whole time. Rude and nasty. For a family-friendly restaurant, it claims to be this is definitely not the spot for family at all."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFVURjFUbmxUUVdjM1ltUXpiM0pHV0U5b1NIYxAB",
            "text": "Wey la comida que rica y al atención de la señora muy buena, es más te dan jugo y palomitas gratis hasta que te preparen la comida 🤗🤗🤗"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeU9FWmFUVmxpUlVkdVJGSjJOQzAxY25wcFQwRRAB",
            "text": "Donde puedes encontrar comida para llevar desde 4 de lamañiana ya esta en servicio"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eVQwMTZNblV5UjFOaFQwUldhRll3YW1RNVFYYxAB",
            "text": "Such a great service and food amazing :) thank you"
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNmN1ejV3RRAB",
            "text": "Falta poner más atención en los clientes, ya que la última vez estuve esperando más de 15 minutos a que alguien tomara mi pedido"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLXzM4bzJKbHZYa3JBRRAB",
            "text": "Deben mejorar mas su atención al cliente por parte de sus meseras gracias"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb2Y2b2V3EAE",
            "text": "👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvd3RLb2ZREAE",
            "text": "Don’t waste your money.\nI got the Orange Chicken (“Pollo a la Naranja”). It’s NOTHING like the picture in the menu. Look at what they gave me, then look in the menu (found under “photos” already in google maps, posted just a few days ago. Look next the “Pechuga de Pollo a la Naranja”). It looks nothing like what i got.\n\nThe prices are expensive for smaller portions. What i was served was not enough to cost $18 (NOT including tip or delivery!). White rice, plain bland fries, and a watery substance that’s supposed to be a “sauce.”\n\nAs you can see in the pic i posted, i poured the “sauce” over the chicken and rice but you don’t even see it. It sank straight to the bottom because it’s pure water.\n\nThe chicken is nothing like the picture in their menu. I was expecting so much more out of the chicken, especially after spending $18+ for plain white rice & plain season-less fries.\n\nTo top it off they packaged it to go when i called and ordered it to stay… and i spoke in the girl’s native language, spanish😐. The girls didn’t seem engaged in their job at all. They were just there to show off their makeup, looking at you like you’re bothering them, and moving in slow motion like they’re not at work.\n\nTake your money somewhere else. I gave 2 stars only because i only went once, and maybe their other workers create a better experience. But i won’t be going back to find out. I can get more full, and better flavor for half the price right up the street at olivias."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTlpYWZnEAE",
            "text": "Muy amables las meseras, 100% recomendado."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdDVMY0RnEAE",
            "text": "La comida muy buena con muchas opciones, excelente servicio un lugar agradable para comer muy recomendable 😁😁😁"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMTVlaXZBRRAB",
            "text": "Muy buena atención de la mesera Evelyn"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLXF5N0pBEAE",
            "text": "I recently had the pleasure of dining at an amazing Ecuadorian restaurant called Milo’s and I couldn't be more impressed! The star of the meal was the fried fish — perfectly crispy on the outside and tender on the inside. I was able to share this delicious dish with a friend, which made the experience even better. The portion was generous, and the flavor was absolutely spot-on, showcasing the rich culinary traditions of Ecuador.\n\nAlthough the waitress didn’t speak English, it wasn’t a problem at all. We managed to communicate just fine, and the service was friendly and welcoming. It's always refreshing to experience authentic food in such a warm, local setting.\n\nOverall, this was a 5-star experience. If you're looking to try something different and indulge in amazing Ecuadorian flavors, this restaurant is definitely worth a visit! Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdXZDMHhRRRAB",
            "text": "I had an amazing dining experience at Milo's Restaurant! The food was incredibly fresh and perfectly seasoned—each bite was a delight. We ordered the fried fish with rice and beans, salad, and plantains, and it was more than enough to feed both my friend and I. The only small thing I would have changed is that I wish the plantains were a bit crunchier, but they were still tasty. The only challenge was the language barrier with the waitress, but we managed to figure it out and still had excellent service. Overall, I highly recommend Milo’s for anyone looking for a flavorful and satisfying meal!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN3VQV0JREAE",
            "text": "El juego de tomate de arbol es delicioso."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXNDZDFnRRAB",
            "text": "Great food . Friendly stuff"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cmNiUWdBRRAB",
            "text": "Lo mejor de lo mejor"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtck9LV2JnEAE",
            "text": "Nice and cozy Ecuadorian restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYc19pUmd3RRAB",
            "text": "If could give this place a zero stars i would. They are scammers. In The menu the 1/4 of chicken combo  has a $12  yet this server girl told us is $20. This place needs to be shut down! Their menus are not updated. They know and they dont care they are professional scammers. The food is not fresh they have served leftover food and they warmed up i. The ovens you see in front of the restaurant. The server specially one girl has a nasty attitude they dont apologize  for their scam and  mediocre service. My family and I a very disturbing experience at this place. We now have PTDS. Do not waste your money.  Stay away and report this place so they stop scamming people."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucGFHeFZREAE",
            "text": "Muy rica la comida, buen ambiente y atencion."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqN3F2aFJ3EAE",
            "text": "Rica comida aunque no tan casera como pensaba"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMHVMZUdnEAE",
            "text": "Un lugar amplio para compartir en Family y desgustar de la Comida Ecuadorian... I needed this 💓"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ekpxOFdREAE",
            "text": "Que delicia de comida ecuatoriana !!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbThEc01REAE",
            "text": "Good"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWN3UtX2lnRRAB",
            "text": "👎…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMnNlX1J3EAE",
            "text": "Many years ago when I looked so babyfaced, I had to grow a beard to be taken seriously, I spent 6 months in Quito, Ecuador working at the Voz Andes Hospital. When I wasn't in the city, I traveled to the Amazon basin to assist with pop-up medical clinics.\n\nI have many memories of Ecuador that come back to me vividly--the toucan with its massive beak and bright colors that made a loud ugly sound that I never imagined such a lovely bird could make. There were the many different types of butterflies and hummingbirds, the mountains, the banana trees, the smell of wood fire on the clothing of people I sat next to in church, the hot springs and baths.\n\nBut most of all I remember the food--especially the soups. So rich in flavor yet quite simple with just a few ingredients. Especially when I was in la Sierra, in the higher elevations, soup was the ultimate comfort food.\n\nMany years later I am in Milo's Restaurant in Middletown. Perhaps it was because it was right before Thanksgiving they decided to forgo their typical menu. Whatever the reason they only served two dishes that day, a soup and some roasted chicken. And even though they served the soup in a large enough bowl that it easily provide a full meal for an adult, most of the patrons started with the soup and finished with the chicken.\n\nIt was tasty, well seasoned, presented beautifully, and served quickly. One taste and I was transported to Quito. That one taste unlocked hundreds of memories."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMy1IMVVnEAE",
            "text": "Sitio muy bonito y limpio"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNTdlQ2RBEAE",
            "text": "Es un lugar que vende comida rica, su atención al cliente es excelente, me encanto el lugar que uno regresa una y otra ves🫶🏼"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweE16S2RREAE",
            "text": "El servicio me parece mal .. pedi una comida espere lo que regularmente se espera cuando fui a recogerla me dijeron que si podia seguir esperando y escuche al cocinero diciendole a otra que fuera a buscar los ingredientes para mi comida por que no los tenian todos … cuando regrese me dijeron esta es su comida la agarre y me fui a mi casa cuando llegue era otra comida diferente fui a desvolverla ( vivo como a 12 minutos de ahi) si apenas se disculparon ……."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwa0tfVElREAE",
            "text": "The atmosphere could have been nicer however the food was delicious and I got three meals from it. Highly recommend getting the fried rice dish."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobk1XUmRREAE",
            "text": "Well I can say is okay clean they I could be sitting at the table four people have came in but sitting different they left me for last even though I was there first they have their own I guess because they are regular that was my first time still it isn't right even though they are you should make customers feel welcome I felt a little angry in not welcome they serve the two table and they I should have walked out but angry to be the last time I ever go to it's not right how to treat customers treat them welcome"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtelBiSkxnEAE",
            "text": "A little hole in a wall but really good food"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdllmcXFnRRAB",
            "text": "Excelente 👌 felicitaciones 👏"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtaGJDMmlBRRAB",
            "text": "It was very nice and the food was good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla2JQdDJnRRAB",
            "text": "Great food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMlB6dWZnEAE",
            "text": "Racist asked if I spoke Spanish and when i said I didn’t asked me to leave and go next door … very upset"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OTh6cS1RRRAB",
            "text": "Súper buen servicio, atención y comida deliciosa 🥰…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OTR6UnNRRRAB",
            "text": "Muy acogedor la comida súper rica muy buen precio y muy buen servicio los almuerzo súper frescos"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OWFUbG1nRRAB",
            "text": "The food was amazing! Service was very good and friendly.  Definitely recommend!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtN0xDM09BEAE",
            "text": "Muy buena la comida ecuatoriana nunca avía proba ese tipo de comida recomiendo este lugar muy bueno"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXa2VhaXpBRRAB",
            "text": "Buen servicio buen precio"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeU1UQVdBEAE",
            "text": "Clean and friendly very professional"
        }
    ],
    "reviews_count": 43
}