{
    "name": "The Hotel Chelsea",
    "place_id": "ChIJZ2_TLytZwokR03K2GtOG9h8",
    "grid": "BX5",
    "address": "222 W 23 St, New York, NY 10011, USA",
    "rating": 4.7,
    "user_ratings_total": 550,
    "phone_number": "(212) 483-1010",
    "reviews": [
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbWFWTkZZVmRMV1RCaFRYbHBkbFprVlZveFRYYxAB",
            "text": "We called a few days prior our stay to let the hotel know we’d be arriving early and they noted they’d try to accommodate us. Upon arriving they said a room should be ready by 11-12, and guaranteed check-in was 3:00 pm. We were fine with that however our room was not ready until nearly 5:00 pm and they offered us a free drink lol. Could’ve offered breakfast and a drink for our stay was the least they could do. Anyways we get into our room and I will say it was spacious and has some charm but we got an accessible bathroom to top it off. No storage or anything. Definitely not worth $850+ per night. I want to note everyone at restaurant and bell desk service was great but the reception was not super friendly. Besides when we first arrived there were two nice guys but not after that."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMVEwNXhSa0YxVEdKQ2RHVmZWalJ6UTJKemFXYxAB",
            "text": "The room was not clean, the laminate was dirty. When I arrived in the shared bathroom there was hair everywhere and a trash can full of trash that was not thrown out until I left. Since the bathrooms are shared, at least they should be cleaned often. The location is great, but unfortunately that's all. The rooms are extremely cramped and it's very noisy all the time."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYVkzY3pWVXhaU25RNE4zTlpXR2xVVWtoSlRYYxAB",
            "text": "Historic building with Cafe Chelsea offering drinks with noise at the bar."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc05VNU9iM1UzZDNwS1pGZzNiVlpWTFY5clRtYxAB",
            "text": "Liked 👍"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMldFOTJNWEZYYlhwMVZHVjFhVjkyTlZNNFRrRRAB",
            "text": "Lovely Lovely expérience. Loved the different restaurants, the 3 of them are outstanding. Special mention for the sushi restaurant, amazing quality of food. The breakfast is soooo good with Pain au Chocolat and Croissant that will transport you right to France."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swelFtSmhZeko2VUhoUFNETm1SR05sTkhkRU5sRRAB",
            "text": "Let me start off with the staff was a 6 out of 5. They were great and tried to go above and beyond. The concierge was very helpful with helping find places to eat.\n\nThe hotel itself was very interesting and quaint. It has a lot of history. Keeping that in mind, you need to remember it's an old hotel.\n\nWe did have some issues with the room and had to change rooms. Then the TV in that room was broke so it was another issue and they wanted to move us again for the second time on the first night. They were very accommodating, it was just a bit annoying. Overall for the price of the rooms, I expected less problems but they discounted our bill for the problems. We also got free drink tickets and breakfast so they were great about making things right.\n\nOne thing you should know about the place is the lighting is on the dim side. So for women it's not optimal for putting on makeup.\n\nIf you get a bathtub shower make sure it drains properly."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abFdYQjZkbmd4TjBkTVRGaG1Ua2d3WDJkWGFHYxAB",
            "text": "The room was great, as was all the service!\nOur only issue was with the spa. The woman at the desk was not very welcoming and gave a very lack luster tour, where we had to go back and ask questions about basic things. The dry sauna was not hot at all and when we poured water on the rocks, they hardly sizzled. Defeated, we went to use the steam shower and that also was not very hot. While running the hot water, it actually went cold. As we left, we informed her at the front desk, and she really could only muster a “well, that’s a bummer.” attitude.\n1star for the spa—a waste of time."
        },
        {
            "date": null,
            "language": "de",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1NYSllRMlU0UVhwelYyNW1RMnhNVjBGaVIxRRAB",
            "text": "Das Chelsea Hotel lebt vom Geist der Vergangenheit – und genau darin liegt auch sein Problem. Der alte Glanz ist längst verflogen, und was bleibt, ist ein Hauch von Patina, der zwar Charme versprühen soll, aber letztlich nur an schlecht erhaltene Zeiten erinnert.\n\nHeute versucht man, das Ganze mit einer Fassade von „gehobenem Stil“ zu übertünchen. Das Personal gibt sich schick, die Atmosphäre wirkt gewollt exklusiv – aber das Preis-Leistungs-Verhältnis ist schlicht unverschämt. Im hauseigenen Café zahlt man für ein Frühstück für zwei Personen locker 100 Dollar. Für zwei Eier, eine Scheibe Brot und ein paar gebratene Kartoffeln 23 Dollar zu verlangen, ist absurd. Und eine Tasse Kaffee für 9 Dollar spricht für sich.\n\nIm Grunde lebt das Hotel nur noch von seiner Geschichte – nicht von Qualität oder Gastfreundschaft. Wer nostalgische Atmosphäre sucht, mag kurz fasziniert sein. Wer aber für sein Geld auch echten Komfort erwartet, wird enttäuscht."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214alNHdFlTWHBmTlV0amJXZHNYekpNZUdwcGIxRRAB",
            "text": "Fantastic hotel! Interior/exterior is beautiful, comfy beds, great food, and friendly, helpful staff. I would absolutely stay here again."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSFpEVjZWemh3Um1sV2RXRTNhWGg0Y0RFeE5XYxAB",
            "text": "If you find yourself in New York City, as I did, with the wife, Go to the Chelsea ..! Yeah!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UlpXdFRPVVJyVVY5R2FtMWxNM1kzV0dsT2EyYxAB",
            "text": "Excellent cocktails in a relaxing historic room. Great vibe."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZlVtUkpkMnBWUkdORVQwbEtiMmxtU1VWMmMyYxAB",
            "text": "Iconic hotel did not disappoint!"
        },
        {
            "date": null,
            "language": "nl",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xka1JtaEpNMHRxVEVscE1sUlVkakpKY1Y5eVpuYxAB",
            "text": "Gave historische plek"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1dHbHNaWFJ3VXpGc2EzWmxVbGxmUkVaRGRGRRAB",
            "text": "Not what it used to be"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFEzUnVTMXBQYUVoM2JrNXZlV1U0ZDAxMlYxRRAB",
            "text": "My new favorite ny hotel (both the rooms and main area were beautifully decorated) is a great location. My one criticism is there should be water in the rooms/main area when its 90 degrees outside. Otherwise, it's really an outstanding place."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZelZsUnZhRE0yZUZrNVNFUXROVWt0VlhsT1VIYxAB",
            "text": "Lovely"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeGRpMVZVbHB2UlhOVE1HNWthMUpVWlVSS1NIYxAB",
            "text": "Yes its that Hotel!! The Legendary Chelsea Hotel where Sid Vicious of the Sex Pistols killed himself and his girlfriend and where Leonard Cohen wrote some of his famous music, but here's whats new , the whole place has been renovated by a company that bought it and they did an amazing job and retaining all the originality with very tasteful updates like a beautiful bar/restaurant on the premises thats worthy of Being compared to Pastis.. so Go book a room in one of the most famous places innthe City. You never know what resident artist you may see in the lobby."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMmVHNDNPRWhSY1c5alVUY3dWMlE1TkZJMk5rRRAB",
            "text": "An interesting place to visit considering it's history"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQk1sOVJaVmhQTlRCME0xUXpiV1paU2xWSWVVRRAB",
            "text": "Food and bar were excellent!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Mk0zQnlRVEZrYkVKSGQxSXhjM0JLTm5salFrRRAB",
            "text": "When I look for a place to stay in New York City, this is one of the only hotels I will stay at; Amazing remodel, seriously, other developers need to look at the refurbished Chelsea as an example of how to remodel a legendary property without ruining anything. Everything from the sitting room in the lobby, to the rooms, to the rooftop, 5/5"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWFUzVTFVVlZ3ZDJKck1TMVliazlvZUdFNFJWRRAB",
            "text": "Top"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd1dUaFVSREJOYzJwc2JWWlpVa3M1UzA0NE0wRRAB",
            "text": "The website is totally misleading. The hotel is filthy. The entrance is a dump. The elevators have been beat up & dented. The front desk is run down. The itty bitty sitting area is like a college dorm. The face soap provided is the size of my thumb. The ceiling in my room had dust & scapes all over it. The furniture is chipped & damaged. The people who work there are not professional. Peoples luggage is just stuffed behind the front desk, completely unsecured. They put stickers over the previous hotel name Four Points. Some emergency happened so medics were there when I came in one evening. I had to get out of there. Do not stay at this hotel. I tried to upload photos. They finally loaded but then I got a email message that says my photos violate Google rules. Well that's BS. They were photos of the dirty ceiling in the room, the banged up elevators, the gross entrance, the previous hotels name on room documents with stickers over them & an ambulance that handled some kind of \"issue\" with a guest. Not sure how any of that violates rules. There's literally no people, just things in the photos."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKS04wVm5jRUZWYVhrM2RXaFVibFV6YVMxNWMyYxAB",
            "text": "Love this hotel. Clean interiors and friendly staff. Restaurant and bars are great. Super convenient location for subway or walking. Close to a Whole Foods too."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeVZ6TlpZaTB4V1hsMWJXdzBRblJsT1RkbFZWRRAB",
            "text": "I didn’t stay here, I went in to look around the lobby areas and bar to see how much it had changed since being an apartment block which I’d been to previously. The beige-ification of this historic landmark was so disappointing. The inclusion of various beautiful artworks felt forced and the whole vibe was off. The service and food was ok in the bar, nothing exceptional. The hallways were super crowded with people checking in and out, which I’ve not seen in a luxury hotel before. It’s like they didn’t have anywhere to wait despite the bar rooms being fairly empty. The decor could and should have been so much better to honour the building’s history but instead it feels corporate and soulless designed to include some instagrammable nods to its past. The poor apartment residents who still live there must be so disappointed."
        },
        {
            "date": null,
            "language": "it",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS2JVMVFVak42YkRGVVdqRkJNVUZIVXpWeVpXYxAB",
            "text": "Esperienza unica, luna di miele proprio come desideravamo!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd1VGSmlRbFZ3VkhKeloyNUphbWwzUTB0QlVIYxAB",
            "text": "This is the very first time where housekeeping was the strong point of the stay. Sounds odd but they did everything right. I often ask ahead for alcohol to be removed from the mini bar, and in all my 5-star hotel stays this is the first time where it was done. I'd say the downside was that the rooms are really dark. It's probably the old wiring but the lamps were so dim I couldn't read. Beds were super comfortable, I loved having a bathtub and a balcony. Glad those are options."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WWVqaDVSSGRQV0hBNFowTlZiVmR6YUhKRlVsRRAB",
            "text": "We was just for dinner and cocktails.\nInterior design is very pretty  old fashion."
        },
        {
            "date": null,
            "language": "es",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV2JrMUpNbmRQV2tGSlJXVlRVM2Q2UzFkR1ZXYxAB",
            "text": "Gran hotel mítico"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eE1tZHdkRk5yYkdFNFlraHJPV053UkRoWGFXYxAB",
            "text": "Spectacular in every way."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNWFUQkpkVmN5U1VORFNucENaMWRNTlhsWlIwRRAB",
            "text": "We didn't stay here, just wanted a cocktail and a chance to see the art work. The feel of \"old New York\" hits you as soon as you enter. The Lobby Bar was pretty quiet (we were there kind of early on a Monday), but we were welcomed by Dustin, bartender extraordinaire! He shared a lot of details about the hotel (my husband peppered him with questions about its history) and the beautiful drinks he made. The drinks are unforgettable; so uniquely delicious. My husband had the 1884 martini and I had the Chelsea's version of a French 75. We were charmed by the atmosphere and the company (which also included a lovely server named Melanie, forgive me if misspelled) and stayed for a second drink! We will be back!!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFdtUlpjWEkxWDJKSUxVOXpWM2RCUkdOUVUwRRAB",
            "text": "Loved the hotel, so much history and a strong cool vibe.   Staff was too nicety, top to bottom.   They were attentive, and happy to help."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWU9IRk5hbE5OWVRNd2FXVXdaMkpxU1VWQ2FtYxAB",
            "text": "Ordered a couple of martinis but had to make it myself. Waiter was distracted by the other party. Mind you it was just 6-10 of us in the whole restaurant."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVVpGUmhVVGd4T0RWTVEwOUpObU53UW10dk9YYxAB",
            "text": "Such a nice hotel 💐"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbU0wVkdkVkJQWjJWRlNVUjJPR2x1Y0VkQ00yYxAB",
            "text": "The dukes martini in the hotel bar is almost worth every penny. But heads up - it's a lot of pennies. 😊…"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUldHc3lZbTFrTUVsM1FuaElObE5FY0dkUk1GRRAB",
            "text": "I stayed here years ago and the closet door would open on it's own and you could hear someone laughing. Sounded like Christina superstar who died in the hotel. Also when I would go to take a shower I would hear foot steps creaking in the hall but noone was there! It was one of the coolest experiences of my life!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNllVTlFabTEzYjBSTE1tY3pZMnh1YzJWUE0zYxAB",
            "text": "I remember you well"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWE4yOWlhVlpVVUdOU1FrNU1NV0pNV1VWd2JuYxAB",
            "text": "This is my new favorite in NYC. Fantastic rooms, staff, 2 great restaurants, crazy cool bar and a staff that can’t be beat! Spent 4 nights here and was sad to leave!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNWNYaFRXVGhLWlZOM1pscHFXbXc0VlZobFFVRRAB",
            "text": "Always a pleasure. Lovely accomodations and first rate service."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ab2ExVnlPVUpCTTNaYVN6UmhkVTFuUzA5d1lVRRAB",
            "text": "We had a great stay at Hotel Chelsea!\n\nBeautiful accommodations, warm welcoming staff, great location in the city.\n\nOur flight was delayed and we had to reschedule our spa appointment at the hotel and they were very understanding and helped us book a different time. Also, when we checked in they offered us a complimentary upgrade to an awesome room. We felt very well taken care of the whole stay."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSk9EUkVOREpJTUU5TU4yWTBOSEpTYlY4M1YzYxAB",
            "text": "Great Drink's at the bar"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWS1IwRkJRekpyYmpSa1J5MXdlR2RJV2prNWIwRRAB",
            "text": "Just stayed at the Hotel Chelsea and can safely say I’ve found a new favorite hotel. It was pretty much perfect from start to finish. The rooms are large, super comfy and beautifully decorated with so many fun, unique details. The shower is the stuff dreams are made of and the bathroom was gorgeous with so much charm. The hotel is also kept in immaculate condition - even the common spaces were so clean (and I’m a TOUGH critic). The service was excellent and everyone went out of their way to be helpful and kind. Ate several meals at the hotel and they were all delicious. I will most definitely try to stay here whenever I’m in town!"
        },
        {
            "date": null,
            "language": "fr",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFZ6QnlkRGxIUVZZdFJXSlFlSE00WVdGTVVrRRAB",
            "text": "J’ai uniquement bu un verre au lounge et profité de l’ambiance du lieu après avoir lu Just Kids de patti smith. Très bel endroit avec quelques peintures, une petite terrasse à l’arrière, différentes salles. Les boissons ne sont pas données."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abFVsaGtUbDlVZDB3MVpqSjJUVGwzV1daUk4zYxAB",
            "text": "Typically stay at The Dominick in SoHo but wanted a change of scenery. The hotel is super funky and cute and the exterior foliage surrounding the restaurant is beautiful too. I like Chelsea and you’re very close to the train. However, reception left a lot to be desired. I cannot think of one time I came back and was greeted from anyone at the desk or even acknowledged. Some of the other people working, like the doormen & bellhops were great, but the actual receptionists were terrible. The rooms are really cute, albeit ours was dark because there was only one window. They were super clean and loved the decor. However, I had some of my things on the stand the tv was on including $50 in the form of two twenties and singles and it was taken by the cleaning service I am assuming as they thought it was a tip, even though it was crumpled and located with all of my stuff. That was a bummer. I think we will likely go back to staying at the Dominick."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacmMyZzNTa2RJYm10NWVFeEVTSFpIUWs5M1dVRRAB",
            "text": "An absolutely fabulous gem of a hotel.   The staff is truly exceptional:  the bellman greet you and welcome you back, the front desk is incredibly helpful with warm smiles and the the lounge staff just rocked.   The room was lovely and roomy, especially for NYC.   AND the ambience!!!!!   Great place to grab drinks or curl up with a good book in one of the Lounge nooks.      Easy walk to West Village and Greenwich (unless it's 90 degrees!) and the Highline is just a few blocks away.    Just wonderful!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paR1FWTmpjWFJhV1VkRFdtRTRRemhUYVZKemRuYxAB",
            "text": "Good"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnelNVSkVkbWhqVVhweFMycEdhSGRLWHkwM2RIYxAB",
            "text": "My stay was simply fantastic! Their crew is on it, they make you feel like you’re home. I suppose this is due to the professionalism of their team balanced out with the DNA and history of the building. All I can say is that the room was awesome, the service on it and the experience overall amazing. I am not the one to leave review often but when I come across a place this good I say it loud and clear!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSGIzQkRTSEJOZEV4cGRGRndURmxSWHpWMmFuYxAB",
            "text": "I first stepped foot inside the Chelsea Hotel not as a guest, but as someone who never believed she’d ever be one. I was a girl who had spent her life reading about this iconic place—since I was twelve, it had lived in my imagination like a cathedral of art and myth. I walked into the lobby just hoping to feel it with my own feet, prepared to be gently ushered back out once they realized I wasn’t a paying customer.\n\nInstead, I was met with kindness beyond expectation.\n\nA woman behind the desk didn’t turn me away. She handed me a personal pen with the hotel’s logo—just so I’d have something to remember the moment. She pulled out business cards and told me about the space. She even let me step behind the desk to take in the view of the historic spiral staircase—the one I’d only ever seen in photographs. She didn’t treat me like I was wasting time. She made me feel like I was home, even if only for a moment.\n\nA year later, for my 30th birthday—a milestone I wasn’t always sure I’d make—I saved up and returned as a guest. From the moment I arrived, the staff were welcoming, thoughtful, and warm. They went above and beyond to accommodate me—but what stood out most was their recognition of reverence. When they saw me standing in the lobby with tears in my eyes, just overwhelmed by being there, they handed me a business card and offered guidance on how to reach out to the owner for a possible tour.\n\nAt every turn, this hotel respected not just my reservation, but my story. They understood that for some of us, staying here is more than a trip. It’s a pilgrimage. And they honored that with grace and generosity I’ll never forget.\n\nThe Chelsea isn’t just a place to sleep. It’s a living, breathing memory.\nAnd they made me feel like I was part of it."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbXVXZGRREAE",
            "text": "We stayed at The Hotel Chelsea as a family of three for seven nights in March, and it was unforgettable. The place is full of character—in the best way. Drinks at the Lobby Bar were excellent, the front desk was friendly and welcoming, and the doormen were always happy and ready to help. Our room was gorgeous—stylish without trying too hard, and actually comfortable. The beds, sheets and pillows are perfection. The location? Ideal. Two subway stops close by, and walking back after a night at the theatre felt effortless. This hotel isn’t just cool—it’s iconic. It made our trip. We’ll be talking about this one for a long time."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbUtpZkhREAE",
            "text": "Really just not a great hotel for the price. I paid $1100 a night for a Premier room including a balcony upgrade. Checked in, room wasn't ready after 3pm (check-in time). After some back and forth with reception they managed to find another room which was ready but it needed me to really push on it being past check in time to get this(!).\n\nI had paid for an upgrade to a high floor. When I asked about the upgrade that they confirmed it was a high floor room. It wasn't (4th floor). After raising this, with some more back and forth, they agreed to refund it.\n\nRoom was nicely decorated and big, although I think they use the \"shabby chic\" to avoid it being too clean/ready. There was dust in a few places. The shower glass and bathroom fixtures weren't clean.\n\nThe drinking glasses in the room were dirty with fingerprints and water marks on them. The minibar had a half drank bottle of mineral water inside it which someone had refilled half full and put back in - the cap was unscrewed. I think it was a major miss for this to have not been picked up.\n\nNice balcony which was a paid upgrade but it had no furniture on it, unlike the pictures on the website. So it wasn't really useful in any way and the doors let in street noise - while this isn't surprising in New York, it was disappointing to have all the downside (noise) and none of the upside (somewhere to sit) of a balcony upgrade.\n\nThe service was in the hotel was non existent. Drinks took too long in the cafe and bar - it took about 10 minutes to get an espresso to go. The bar vibe wasn't great - it was loud, the bar tenders weren't helpful and the lighting was very bright and without music. The door staff spend the whole time talking to each other and ignoring guests. They didn't offer any help loading luggage into the car or ordering taxis. I checked out early due to a work commitment and the immediate answer was \"but you will need to pay for your last night\" - which I was expecting - but \"do you need any help with your luggage?\" would have been nicer.\n\nWater pressure in the shower was poor. A lightbulb was missing in the ceiling lights.\n\nThere are two elevators but they're two sides of the lobby so you're walking between them to see which one will arrive first. They take 2-3 minutes to arrive.\n\nLots of better options in NYC and the hotel is hugely overrated for the price at $1100 per night including the Ritz, FS, Casa Cipriani and many others."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc2ZHTXpRRRAB",
            "text": "I will say our stay was pleasant. The location was great. The rooms were nice. The only issue with the room was that both mine and my friend's a/c was not adjustable the last night. We were both miserably hot. Maybe a breaker flipped. I did not call it in as it was too late. I am sure that it might have been fixed if i had. However, I was extremely disappointed when I reached out to them about a pair of relatively new and expensive jeans that I accidentally left on a shelf in the room, and they said they did not have them. I do know that leaving them was ultimately my fault, but I would just have expected that a hotel of this caliber would have been able to retrieve them for me. Together, my friend and I spent 4K there for three nights. For that price, I would have expected excellent service."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYWRWOTZhV3BaTldVelp6QjRTMUpZWmpGcmMyYxAB",
            "text": "Historically interesting hotel; we snacked and drank in the beautiful bar area. Excellent, top-notch service, and a talented mixologist. We walked around the common areas to marvel at the hotel's beauty. The restrooms are a particularly nice touch."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VQRGNuTDJMMWQtT3d3RRAB",
            "text": "Sid and Nancy are nowhere to be found in this shnoozy hotel, a hologram of what was  once bohemian hotbed. Ah well, I guess times change, and that version of Chelsea no longer has cause to exist. This one is a quite nice fancy hotel in an interesting part of Manhattan, so I guess if you can afford it, why not? If you want coolness, though, then over the bridge to Williamsburg, you must go!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VMLWlpczZEcHFxdENBEAE",
            "text": "Great hotel bar with different rooms, from bar-like to loungy to grab a drink and people watch.  It's a landmark building in Chelsea with LOTS of history.  Definitely worth a visit if in the area."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcWV2Z2Z3EAE",
            "text": "Stayed here on a business trip in Feb 25.\n\nThe hotel was renovated while keeping it's original style. Comfy bed, nice shower, and above all wonderful service.\n\nI arrived at 7:30AM directly from the airport, and with a smile, the receptionist sent me to my room. No early entry fee, no please wait, nothing. This is going above and beyond for your customers.\n\nI was always greeted with a smile. That says a lot.\n\nLocation is superb, close to everything."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbmV2TmJREAE",
            "text": "Celebrated my friend’s birthday here and it was luxury. Starting off, the rooms are so beautiful and can only really be described as what I’ll call “Glam Rock”. A mix of rock and roll and delicate beauty. Really enjoyed myself here and especially walking through all the floors and hallways at night. Sometimes you can feel a chill in the air. Talking to some of the residents here was cool too. Definitely will be back and I love the service here. The staff is friendly and helpful but also let you explore and do your own thing which is cool. Not uptight and annoying. Excited to come back."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVJrbHRUMUpJVldOVlFYbGtXVzVQZEhOd1VXYxAB",
            "text": "This place is amazing and feels special as soon as you walk through the door.  The historical building is amazing and the rooms are beautiful. The staff is friendly and very helpful."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcHJxZlZnEAE",
            "text": "As semi-frequent recreational travelers to NYC, my husband and have stayed in quite a few hotels through the city. We always struggled to find a place that met all our needs until we came to the Chelsea. The Chelsea is a building steeped in a rich history that will keep you interested for years to come. The location makes it accessible to multiple subway lines. The neighborhood feels safe and has lots to offer including great hot dogs at Chelsea Papaya, across the street. The rooms, even the basic ones are generously portioned and WELL appointed. The bathrooms are comparatively large for NYC and have gorgeous brass and marble details . The rooms are also pretty  quiet, which is essential. This was our third but longest visit, we stayed for 6 nights. We were in two room types, a Chelsea “Grand” (1H) and then the Chelsea “Loft Suite” (10C) both rooms were lovely and spacious. We’ve also stayed in and like the “premier” category rooms, (especially with a balcony). My husband and I visited the Spa for massages which were PERFECT and great for New Year Day recovery. The Spa facilities are stunning, thoughtful and relaxing. We’ll go back for additional services, without hesitation. I’d like to see it in the spring and summer when the tranquil rooftop outdoor space is open too. We dined in the Cafe Chelsea and had a good experience, the food is always yummy. Make sure you get a croissant. We also visited the Lobby Bar several times, it’s such a fun vibe. We even spotted a celeb while we were there. The drinks are spectacularly crafted with care and grace by real bartenders, (Corey and Louis, amongst others). I miss my dirty martini already!  We ordered room service (available 24 hours) on NYE and I’ll never stop thing about the dijionaise and the yummy crispy fries. Above all, the greatest asset to the hotel is the service. The staff is second to none. From the lovely bell staff (William, Dominic, Brighton, Michael, Anderson) ready to help you come and go, to the down to earth management (Michael, Meredith, Rita). Every member of staff that we interacted with could not have been more amazing, we could really go on to list so many names. Everyone there genuinely goes above and beyond to ensure that you’re not just “staying” but really feel “welcome”. We had a couple of very minor feedback points for the hotel, which we shared. The management staff was immediately responsive and went well above and beyond any expectation to make us feel valued and heard. Lastly, I’ll never not be amazed at the cost of the room vs. the value and experience. TURN DOWN SERVICE, with treats and mineral water!?!? THE. BEST! Truly it feels better than a 5 star experience and we can’t wait to return over and over and over again. Until next time, thank you Hotel Chelsea for a beautiful start to 2025."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dDc2WkpREAE",
            "text": "It's cute, and I love the vintage movie theme. However, if you like Hyatt Express and 24/7 coffee, cable TV, and elevators this place might be a little too old school for your liking. But the people who work at the front desk are just awesome, and its not crowded at all."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRE0wNTZWR1J1ZUZnM1FWcFRTV1Y1VFdWSGIzYxAB",
            "text": "Historic and unique hotel. Even if you aren’t staying there have a drink in the bar which is unique. Check out the lobby and back rooms in general as the old charm really shows."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdllLREpnEAE",
            "text": "The hotel is in a great location, walking distance to 28th and 7th subway, Penn Station and around 20 mins to Times Square.\n\nThe rooms are a decent size for New York but the bathroom was pretty small.\n\nKing bed was super comfortable and I really appreciated the block out blind.\n\nStaff were very friendly and helpful but Chelsea in particular was awesome. Such a friendly greeting when we arrived and even though we were early, she was still able to get us into our room.\n\nChelsea also checked us out when we left and she was still a gem. She is definitely an asset to the hotel, always smiling and welcoming 😊\n\nDefinitely recommend the hotel if you want to stay away from the \"craziness\" of Times Square but still be in a great location.\n\nOh....make sure you go to the rooftop. Great view and lots of space to sit and chill."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNWZpQXl3RRAB",
            "text": "I have stayed at this hotel a number of times and during my last visit, I was poisoned 3 mornings in a row on a work trip. I was staying in a large suite and have spent a lot of money with this hotel and recommended it to colleagues of mine who work in the same industry. The room service contained food I am HIGHLY allergic to and I am very careful about letting everyone know beforehand about my allergies - before I check in, at my check in, and each time I order food whether at a restaurant or through room service. I was physically vomiting and having allergic reactions each day of my stay and the hotel did nothing to help me. Again, this was a work trip for me and was a complete disaster. I've been following up with their \"insurance\" since SEPT 2024 and they have done nothing to help me or compensate me for the terrible service and poisoning incidents I experienced. This happened 3 mornings in a row after ordering & consuming room service breakfast before my meetings.\nTERRIBLE TO SAY THE LEAST.\nDO NOT TRUST THEIR SAFETY OR CARE OF GUESTS.\nWOULD NOT RECOMMEND if you struggle with any allergies."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VOLVN6TG43eFpiMFdBEAE",
            "text": "Celebrated Mother's Day with my daughter. We had a nice Dinner and Drinks! Great food and great Service. The Staff was very attentive!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX1pxeEpnEAE",
            "text": "We recently stayed at The Hotel Chelsea and were quite disappointed with our stay! As it’s such an iconic, well known hotel with a great reputation we were really looking forward to our stay and couldn’t wait to see it in person! We arrived to the hotel and had no help with our luggage (travelling from London so we had big cases and were extremely tired), we weren’t greeted by any hotel staff and our check in consisted of them taking payment, handing us our key and sending us up to our room with not much else! Nothing welcoming us, no information and it felt like they couldn’t get us checked in and out of reception quicker!\n\nThat evening when showering, we found multiple bugs/flies on the wall/ceiling in our shower, which we reported to reception! They fixed this issue, but never after this asked if everything was okay or if the issue had been resolved! During our whole stay, not once did anyone ask how we were getting on or if we needed anything! Something you’d expect from a hotel at this price point! The room is big and spacious, but the whole feel of the hotel overall is a bit strange! I would go as far to say that I wouldn’t describe it as a hotel, more as an apartment block!\n\nWe walked into the champagne bar for a drink, only to be greeted to a room with absolutely no atmosphere, no music and we were expected to pay $30 a cocktail for it! Absolutely not! There isn’t really any level of service from the staff, they give you your key at the front desk and then you don’t hear back from them until you give your key back at the end of your stay! Considering the hotel is charging over $500 per night I would say this is extremely steep and overall it feels like you’ve rented a self catering apartment in a block! The hotel interior is lovely, has a very old school NY look, but if you’re looking for a luxury hotel where you get your moneys worth and receive a high end level of service to match the price, this isn’t the place for you!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfX2NyNGF3EAE",
            "text": "This might actually be the best hotel in Manhattan, as they say. It is definitely my new favorite. I’ve spent two night here and am absolutely in love. It’s eclectic, interesting, warm, and beautiful. Every detail from the service to the decor has been carefully thought out. I stayed in the Chelsea Suite and didn’t want to leave. It’s stunning."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHIzamtBRRAB",
            "text": "Amazing stay!  Location couldn’t be better with lots of restaurants and coffee shops within walking distance. Hotel is very close to multiple subway lines to get around the city. The staff was very friendly and helpful. The rooms were clean and comfortable. In house restaurant, Chelsea Cafe, was wonderful. The whole hotel gave the vibe of an old charm and boutique hotel that you would expect to find in NYC."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OWZ2R2xnRRAB",
            "text": "THIS is how you do it. I’ve been obsessed with the history of The Chelsea since I was in my 20s- Name a book associated with the hotel and  I’ve read it.  The decades worth of renovations ended after we moved to the West Coast and I’d been desperate to stay here when visiting home.\n\nMy husband and I stayed here after getting married-  It was a short stay (one night) - as we planned being in the city during the last leg of our trip. The Chelsea over exceeded all expectations.  We were gifted a beautiful room upgrade with a balcony. There was wine and a card for us in the room. There were macarons on our bed stands after a night out at Minetta Tavern.  The doormen and front desk workers remembered us (after just a 24 hour stay!). They allowed late checkout so that we could visit Central Park one last time before rushing to the airport. They even stored our luggage for us.\n\nHistory oozes from its pores. The drinks are delicious but pricey-  It’s ambiance tax to me and that’s fine. Although I know the renovations were/are controversial, I really feel that the updates honor the space.  I can’t wait to stay here again.  Thank you Hotel Chelsea-  We cant wait to come back home!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbGVHSDdBRRAB",
            "text": "I loved this place; and I am a pick traveler. The renovation was on point, not a false note in terms of appearance. Perfect front desk attendance, as well as housekeeping. There was some light maintenance work on my floor but it was surprisingly unobtrusive. The only gripe: by Friday, the lobby was overrun with people trying to get into the bar. A bar which I was not able to enjoy because I was sternly  told that guest of the hotel or not, it was “strictly” first come first serve. I look forward to going back and to see this policy changed"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VLTDUtYnF1djRiSmdBRRAB",
            "text": "Tall white man at the check in desk completely ignored us for a full minute while not doing anything and proceeded to be extremely rude and answer with one word when asking a question about the cafe. Acted like it was the biggest inconvenience to do his job."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VMLXJsNktpaXNfTFZnEAE",
            "text": "Great iconic hotel in a fab location. Rooms and very comfortable and stylish. Service was great and staff very attentive. Highly recommend!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMlBfcFl3EAE",
            "text": "I can’t say enough good things about Hotel Chelsea. For me, the perfect place for my time in NYC. The staff are exceptional - friendly, warm, and approachable - and a wonderful ambience. Beautifully restored, totally unpretentious, and great location."
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOFlQQWJ3EAE",
            "text": "We had an absolutely incredible stay here with one exception. The rooms are beautifully appointed with spacious living space, bathrooms and closets. I did not feel the typical cramped vibe that you can experience in NYC. The bar/lounge is spacious as well with old time feel. Although our room was next to the neon “hotel” lighted sign, it did NOT interfere with sleep, it actually added to the unique vibe. The only draw back was the door staff. At times there were 3 people working the front door and about half of them were actually polite, hospitable and helpful. I was not asked for help with my luggage, rarely was I verbally greeted (if so, I just heard something muffled and indistinguishable), and at times the actual door wasn’t even held open for us. So I don’t really understand the presence at the door as I can’t quite understand their function. For over $900/night I would at least expect a smile. Regardless, I would definitely stay here again!"
        },
        {
            "date": null,
            "language": "en",
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbjhEbGh3RRAB",
            "text": "Had the best five days staying at the Hotel Chelsea. Without a doubt the coolest hotel I’ve ever stayed in. The history of this place has intrigued me for years, so it was a privilege to finally stay here. If you want a modern feel, then this might not be the place for you. But if you’re looking for somewhere with soul, this hotel has really got it. Loved the home from home feel, the decor, the artwork and the neighbourhood. It felt like a real NY experience. They also have a great gym on the top floor which we made full use of. There are plenty of great hotels in NY, but there’s only one Hotel Chelsea. Thank you so much for having us and we will be back asap."
        }
    ],
    "reviews_count": 72
}