{
    "name": "Tapped",
    "place_id": "ChIJ84qR6Ikyw4kRR8zmvzJLQfI",
    "grid": "BX5",
    "address": "22 Henry St Unit #2, Middletown, NY 10940, USA",
    "rating": 4.4,
    "user_ratings_total": 514,
    "phone_number": "(845) 775-4216",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWk9EQlJaelZ0WlU1NWRXbFNOMUZ5VW1aV1IwRRAB",
            "text": "The fries here were sooooo good!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWVJFSmllbFZ2U2pSWVRtOXNlVlpZVTBsQmRGRRAB",
            "text": "I stopped by two days ago for my mother’s birthday and we loved it! Lauren was killing it with the fast service and multitasking!! She was bartending and immediately attending anyone who walked in! The music and atmosphere was a 10/10 we will for sure be coming back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNFoyeGphak5sTVd0WmFFdG1TbTh6YnpOcWQxRRAB",
            "text": "Tapped is such a great place. Whether it’s a Friday night out for drinks, weekend Brunch, or hosting a party or event in their private downstairs space. The staff is amazing, the food is great and I have never left not having had a great time. I just hosted a big event with almost 50 people and the space was perfect, open and felt private. Thank you to Paul and everyone for everything!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S1IwOVdVa0ZhUTJOQmJrNHdPRXBsUTNaQ1QyYxAB",
            "text": "Great experience! My husband and I dropped in to try a new place. It is late afternoon and the place was empty so I was unsure at first. I was pleasantly surprised to have great service and experience great food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTVZtaFRWa1JQY0RoU1dFczBaak5oV0Zwc2NGRRAB",
            "text": "The service was great, the staff was so friendly and the music was on point!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KM01WVlFlbXQ2YW5OTVp6ZFdhV1EyWXpCalZuYxAB",
            "text": "Had our wedding after party here and it was amazing. Food was great and so was the atmosphere. Paul was amazing in helping us plan it and making sure everything went smoothly. 10/10 recommend for anyone considering!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTFIxZHVVRzlsYUMxS1gydHFVVjlSV0d0dmJtYxAB",
            "text": "Not only are the food and drinks top notch but the service from all staff shows how much they care about their guests. Kevin is extraordinary. He makes you feel at home and his service is top notch. Thank you Kevin and all the staff at tapped that have made me and family feel so welcome every time we visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSlpWVk9lRjlqT1RSM1ozcFNRbXBPZG1rdGFHYxAB",
            "text": "2nd time there dinner took 45 min to get food. My friends dinner taste bad couldn't  eat  will never go back or recommend since partners split up this restaurant  went down hill. My other friends  that went there agree"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adVNsRnNjR1ZtVmtsVmREaExOREZGVTJGdVJrRRAB",
            "text": "This was the best brunch I've ever been to. There was a DJ and he played a mix of reggae, reggaeton, old school RB, rap, hip hop, etc. The servers were attentive and friendly. The vibe was amazing!!! A hunch of girls next to us where dancing to all the songs, we all were singing, etc. I would say everyone there was north of 30 so for us, it was like a daytime party rather than a quiet brunch. It was a lot of fun. The food was really good, well cooked and flavorful. Bottomless mimosas with different flavor options were great. Service was fast. The restrooms were clean.\n\nParking: there is a public lot pretty much connected to this place, but don't get confused and park in the police lot across the street.\n\nI recommend checking it out. The food is good and the vibe on Sunday was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWFNYSkNiRFJET1VOeFZETnJjbGRTVEVZd2VWRRAB",
            "text": "This is the second time I have booked an event with Tapped! The staff was so accommodating to anything we asked of them. The guests were all saying how good the food is! Highly recommend this place for  just a night out or for a party! Paul the manager is super easy to work with and made sure everything we asked for was in place. Highly recommend Tapped!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5amFIWkdXazloTFRoNVlqbFFSV3hXUTBoVVdYYxAB",
            "text": "Excellent food and beverage!   Excellent service too!   Cheers and thanks.   Enjoy peeps... Been back a couple times and consistent as well!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSemFEaFhhbVV3V25aNVlrVnVla1JzYlc1eGRsRRAB",
            "text": "I chose Tapped to celebrate my daughter's surprise college send off , first because both of my daughters love going there because the food, drinks and atmosphere are great, & after speaking with the owner paul, he made my decision even easier just because paul was so accommodating,responsive, & kind. The manager Lester was our go to person on the day of the event and Lester did not skip a beat.!. he was also so kind, attentive,  and just amazing..  the entire staff was great.\n\nI ordered trays of food for my guest and...\nThe presentation alone did not disappoint! I also had pitchers of mimosas.... and if you've ever been to Tapped, you know how amazing there drinks are, the bartenders really know how make a good strong  drink. No cutting corners.  Lol\nMy guest had an array of food options and we all had an amazing time.\n\nI can't thank Tapped and all the staff enough for allowing me to decorate and host such a memorial milestone there.\nIt was better than I could have ever hoped for!\n\nGuest count 44"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVNFdEdNR05vTFdkMVptMHpjR3BaWVZjNFVWRRAB",
            "text": "We always have an awesome time at Tapped when DJ Kev Watson is there! Good food, service, and good music."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUk5WRjBORGt4WjNGeFIyeGhVMTlET1RGcGIxRRAB",
            "text": "Had a get together at Tapped on Sat.with buffet which was ordered a few weeks ago. The owner was very accommodating, friendly & made sure we had everything we needed. There was a Band there which went out of their way to sing Happy Bday to the bday girl. Which was so nice. Also the bartender was friendly, kind & went out of his way to make sure we was good. Great Owner, & Staff, clean and friendly atmosphere. Thank you again Paul & we will see u soon ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdlA4NTdzenBXWVNREAE",
            "text": "My husband and I come here often , never had a bad experience with the food or the service . Today we did brunch for the first time and i t wasn’t a disappointment! We’ll definitely do brunch again. The young crew members are very nice and friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHJ2cXJsNDhENHBBRRAB",
            "text": "Really good atmosphere. And employees are very friendly. And the food is really good. They have a good brunch menu. And they are not pricey."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT1N0dHIxODdQdlFREAE",
            "text": "Had the most amazing experience food was delicious 🤤 drinks were delicious 😋 everything was sooooooooo nice 😊"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcV9IcU1nEAE",
            "text": "Amazing staff and great brunch"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvekl1bGNnEAE",
            "text": "Nice little spot to catch a beer and a breeze."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOFo3TWp3RRAB",
            "text": "Had my daughter’s 30th birthday party here and it was amazing. Paul was easy to work with setting up the details and everything was executed as planned. Food was great, service was outstanding and the vibe was perfect. Highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbVB2VWNnEAE",
            "text": "We had a bridal shower for my future daughter in law at Tapped and the food, service, and atmosphere were great! Paul was so easy to work with and the staff were terrific!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MVBXbFZBEAE",
            "text": "Wonderful place, great food and great atmosphere! We had our rehearsal dinner in the private party room and it was perfect. The food was excellent and the service was top notch. I worked with Paul from day 1 and he was great! He was very responsive and attentive and made sure that the evening went great for my wife and me. Highly recommend if you’re looking for a place to host a party!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbF9xUXpRRRAB",
            "text": "Accidently shorted me 3 wings. When I mentioned that, they gave me an entire additional order of wings for free. Otherwise, incredible drinks and service. Amazing place, highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRM0xXZDV3RRAB",
            "text": "So looking for a brunch spot online, a found this related very well spot. An let me tell you the food was SOOOO good! Got the fried pickles, an the BBLT, an the eggs Benedict and the home fries(potatoes omg so damn good) wait was great, the $15 endless Mimosas and the workers were attentive and very chill. We were lucky there was DJKEVWAT (find on instagram) was ON POINT HAD EVERYONE DANCING!! Absolutely the spot to come to!! I look forward to coming back again!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmFySlpREAE",
            "text": "Fun fun fun upstairs, karaoke and the food is fresh and hot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMzhYSzhnRRAB",
            "text": "Needs more seating, and the atmosphere is loud but food was good, service was great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcl9lQWl3RRAB",
            "text": "Brunch was good unlimited mimosa for 15 and the dj was a hit ❤️ definitely would go back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaWY3YWd3RRAB",
            "text": "Had dinner with the girl and the server just walked up and said \"sup\" never received water never got asked how was the food the cuban sandwich was on a hard roll with pulled pork from the left over BBQ took 15min to pay the bill definitely a mid spot"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeXFYNUJREAE",
            "text": "Saw a live show. They were good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMGYtWk5REAE",
            "text": "Great simple Bar to grab a drink and food!  All staff are very friendly with a good VIBE!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbTVpZlRnEAE",
            "text": "Food is amazing and Kevin, our server was outstanding!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubGFQTWJREAE",
            "text": "Brunch was a bit loud, but service was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LS16UEtBEAE",
            "text": "Great atmosphere, service, and most of all, their wings are exceptional! 👌🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bjhxbDVBRRAB",
            "text": "Great food i.e the wings, Buddha bowl all the food is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaHJHbC13RRAB",
            "text": "Great food but they included TIP so be aware the service was sub par for not a busy atmosphere it was a Sunday drinks were good.\nBut if not for my wife catching the Tip included (for 2 people mind you) the sub par service would have been  greatly over Tipped"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydk1mcnhnRRAB",
            "text": "This is a chill place to meet up with friends for a drink and a bite to eat. I really dig the karaoke nights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMHFlM3lnRRAB",
            "text": "Good food and nice beer list."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NGZMZmRBEAE",
            "text": "Stopped by for lunch. Not too busy on a Saturday afternoon,  seemed a bit unusual but the service and food were both good.  The beer selection was OK, nothing really brewed on the premises.  They did have some local options though.  Tried the special steamed clams for an appetizer,  tasty broth but they were a little chewy.  Ordered a Cuban sandwich with fries and it was huge and tasty, took half of it home for dinner.  I would go back again if in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNTh6anRRRRAB",
            "text": "I’m not one to write reviews but this place deserves it. Amazing selection of beer, amazing food. You won’t be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdjYyY1VnEAE",
            "text": "Awesome place to go hang out and eat with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdi16bDhRRRAB",
            "text": "From the minute I contacted Paul, he was nothing but helpful and accommodating! I contacted him multiple times in order to finalize everything for my husband’s surprise 40th birthday. He always got back to me almost instantly! The food was amazing, and anytime anything ran out there was someone right there to fill it so there was never a time anyone was looking for food. The bar service was also wonderful! I had the party in their private room, and if there was something that wasn't readily available at that bar, they got it from the upstairs bar that was open to the public with no issue. In the private room there are\nTVs also available for either putting pictures, etc. up for a party or just to sit back and watch some sports. If you are looking for a chill atmosphere to host a party with great service, this is your place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeDZqZTZ3RRAB",
            "text": "Excellent food and staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNmJiV1hnEAE",
            "text": "Came here based solely on reviews and pics.  It's off our usual beaten path.  It is completely worth it.  Got 2 different kinds of breaded wings; medium and spicy bbq.  The wings were generous in size and big on flavor! Hot the fried pickles too.  Biggest order I have ever seen and we finished them.  Comes w a great dipping sauce.  For our meal, we had smash burgers and chicken n' waffles.  Again, generous portions and great flavor!  Server (Paul) was excellent! But all the staff was kind and helped each other so there was never any waiting around.\n\nThe beer!! Almost forgot.  Had the Equilibrium on tap.  Delish!\n\nGreat meal! Great service!  Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNXJHWEpBEAE",
            "text": "Was a catered affair. Very small area, the sliders were very good. The Mac and cheese lacked flavor. The chicken Parm was moist but the sauce was sweet and nasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeHN6dl9RRRAB",
            "text": "Omg from the manager Paul to the bartender Dave to the drinks to the wings to my Cheeseburger This place is out of this world!! You all need to come out to Tapps and just sit back and unwind and enjoy a nice time out!! I WILL DEFINITELY BA BACK!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeHZpRVBBEAE",
            "text": "The food was amazing and the vibe is great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdTRHM3RnRRAB",
            "text": "Nice comfortable atmosphere, ok music, good food & great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc3Y2ZUl3EAE",
            "text": "👎🏼awkward and dark atmosphere, poor service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdDZfUHFnRRAB",
            "text": "Fun little bar, karaoke, the staff is fun"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcTd1U0ZnEAE",
            "text": "I had a surprise party for my boyfriend’s 40th here and it was great! Ed was a great help, super informative and responsive to all my questions. The space was great, nice and spacious. The food was great, and the service too! It was affordable as well! Michaela was a great bartender, super attentive and so nice! I highly recommend Tapped for your next event!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dFpHNzB3RRAB",
            "text": "The food was great. There was only one person serving and bartending, felt bad for him as we went during the lunch hours. The decor left something to be desired, but over-all I would definitely go back just for the food and the beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsM3RQYWJBEAE",
            "text": "We showed up here on a son whim. My husband ordered food from Doordash and said food was really good.. the wings were super crispy and tender inside.. the burgers were outstanding with great fries to accompany..I built my own burger..jalapeños, carmalized onions, American cheese and mudhrooms..my husband had the smash burger.. both very very tasty! He had a craft beer that was really good. I had a cider.. next time we go will order one of their cocktails that looked so good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaDlmbzNRRRAB",
            "text": "This should’ve been a 3-4 star review but thanks to our server, they get a 5 out of 5\n\nAsk for Kevin to be your server - you will never be disappointment regarding service and attentiveness. Kevin is the best.\n\nThe food the first time around wasn’t 100% but Kevin took the time to speak with the chef and the kitchen staff and made everything right. The chef came and spoke to the table and apologized for the mistakes but regardless of that, if it wasn’t for the service of our waiter I would’ve left without a question but I will definitely be back just to sit with him.\n\nThe food was great too lol but the service, even better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbk1YbndRRRAB",
            "text": "I was please you surprised to finally find a brewery that actually has good food. The pulled pork was so tender it melts in your mouth and you can taste that shaved ribeye in the cheesesteak sandwich. The atmosphere is great the staff are attentive. This is my new go to spot for lunch…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cE15NlJ3EAE",
            "text": "Had a 60th Birthday for my husband yesterday and it all was perfect!! Paul is a great person along with Nicole who bartended and Harrison who let us in to decorate early in the day.. Everything was excellent!!! Thank you♥️ Jizelle who works there took off so she could  attended our party!! She is always the life of the party 🥳💜🥳 We had a great night!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLd2JfT2NnEAE",
            "text": "Went out for a brunch/lunch date with my hubby. He said the quesadilla was great, but the garlic wings were just ok. I had the steak, which was just ok and buffalo wings were very tasty 😋…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOFpiMlFBEAE",
            "text": "What a great place, excellent atmosphere. Really good food (especially the quesadilla), a great selection of drinks! Highly recommended it. My bar tender/waitress was awesome, Mikaela was very pleasant and new her away around the bar. Will definitely return"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Ni1YS0NBEAE",
            "text": "Great gastro pub. Finished a wonderful day of biking the nearby trail with a fantastic meal and brews here. Loved the atmosphere.  Sat upstairs overlooking the downstairs with the large doors rolled up. It was a beautiful night and loved having those doors open. Very unhurried atmosphere,  so we were able to take our time. Enjoy the beer and conversation while waiting for meal. I chose the grain salad with quinoa,  cucumbers,  avocado beans, spinach and a delicious vinegrette dressing which came on the side, just as I like it! Hubby chose the steak tacos and did not regret it. He said they were delicious. Had a lovely conversation with the owner who was super friendly.  Told him we chose the restaurant for the great meatless choices and found out he is vegetarian also. Hence the wonderful menu choices. Will definitely go back next time we bike the area. I cannot recommend this restaurant enough! So hladcwe found it! Perfect end to a great day!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcG9TUFBREAE",
            "text": "Nice food selection, variety of Flatbread. Tried variety of area beers pilsner IPAs and stouts.  They have a dozen on tap.  I'm not a big IPA guy but my favorites were Woodstock Kan, Oktoberfest, Jack's Pilsner and surprisingly Pumking .  Great service by Ryan.  Def try beers and food in nice atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXR5T2hnRRAB",
            "text": "The service was good, food was good, but the kitchen was very slow, there was at least a 15 minute gap from the first plate to the fourth plate at our table for our party of four."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1enBfejFRRRAB",
            "text": "Really wanted to like this place but it just fell short for me. The service was AWFUL. Took about 25 minutes to get a beer and even longer to get food. We went for lunch and it took over 2 hours and the place was virtually empty. The wings were delicious I have to say. We ordered the honey BBQ wings. They were large, filling and came extra crispy as asked. From there, it took about 45 minutes to receive our lunch. Ordered the sliders. Server asked if we would like cheese, to which they charged $2 extra for. They weren't anything special. The meat was too dry for me. Fries were good. Finally ready to leave & the bill was incorrect. The wings are half off, so $5, from 3pm-6pm but they were charged at full price. Always check your bill!!! Also during this happy hour it says \"$1 off all beers\" but they said it doesn't count if the beer comes from a can. No where on the menu does it specify that but it just wasn't worth the headache to argue for $1. Also, they advertise Equilibrium Brewing heavily on the building and you can oversee the beer production but they don't offer the beer for purchase. I feel like overall the service, and managing fell short for me."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvLUlteUhBEAE",
            "text": "Absolutely love this place. Every time I'm there I get treated like a king. Friendliest staff. Im a craft beer drinker so I'm always to see what new beers their featuring. And the food? I'm yet to try something I havent liked. From their…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3NnJTZ1ZBEAE",
            "text": "Would definitely host an event here again!!!  My review is based on hosting an event at the restaurant and not a random bar night. With that stated, I couldn't have asked for a better experience.  We were having a wedding in Middletown and need a place to get all the out of town guests together after the rehearsal dinner.  The manager Paul, was amazing and accommodating. Went has far as to text me pictures of their group room.  Great elegant decor, private bar and bathroom to easily hold 40 people. Even a few pinball machines and TVs for sports.  Helped me set everything up over the phone seeing I live in DC\n\nLong story short, I booked from 8:30-10:30 but wedding chaos delayed us until 10pm.  I called them to see if I could save the night and Paul made my night. He and our great bar tender Gary, kept the place open for us hours after closing.  The were pleasant and polite and never angry with us for our issues. Just wanted us to have a great wedding weekend. Amazing atmosphere with great drinks in a great space.  We didn't have a lot of food but apps were good.\n\nHuge bonus was the prices for the quality.  Being from DC I expected huge tabs for liquor and beer and was pleasantly shocked when the tabs came.\n\nI hope to get there again for another get together at some point.  Great place and so easy to work with.  Thanks for making our wedding go so well!  I will always appreciate your assistance and attitude!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbE1fTGl3RRAB",
            "text": "Tapped used to have a partnership with EQ brewing next door. However, the owners had a falling out so they no longer serve EQ beer, but still have plenty of local craft brews on tap. We went here for lunch and ordered the Short Rib Sandwich…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNk52LWNnEAE",
            "text": "Great atmosphere Tiffany, was amazing. She made us feel like we were the only ones there. Great service. Tacos were delicious. And the shots were delicious!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdzZidHZ3RRAB",
            "text": "First time here for brunch and let me tell you I can’t wait to go back.The waffles were good and had a nice flavor to them. I like the fact that you get 2 of them you won’t find that very often if at all and the bottomless mimosas was just that! I appreciated the fact that you didn’t have to sit and wait for your next glass they were on point with the refills 🥂\nNot pictured is the steak and eggs they get 👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbExLQWhnRRAB",
            "text": "I had a birthday brunch with Tapped and let me tell you all the vibes were there I planned a 90z theme brunch  I was able to bring my own balloons I was able to have music and all .The bartender was immaculate. The food came fast and hott. We had an amazing time. I would suggest anyone to go for a regular brunch, lunch or dinner I will surely be planning another event with them."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdElqR0dREAE",
            "text": "Save your money and make yourself something at home. I never complain but this was an awful experience. They even scammed us on our receipt.\n\nThe service was awful. We ordered 3 appetizers for the table and they took an hour and 10 minutes to come. And only 2 of them came. We had to get 4 waiters to check for us.\nThen, our entrees came one at a time in sporadic orders with 10-15 mins in between.So we didnt eat together at all. We were here for 2 hours and 45 minutes plus.\n\nON TOP OF THIS, the food was disgusting. The steak literally was so well done it looked like a lamb chop. I wish I had a photo, it was literally leather. The bread of the turkey burger was stale and rock hard. The veggie burger itself was burnt.\n\nTHEY ALSO CHARGED US FOR 3 THINGS WE DIDNT GET hoping we wouldnt notice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bW9tdTVnRRAB",
            "text": "Great brunch spot! The bottomless mimosas are great. Wishing they had more bubbles when they hit the table but that's just me. The eggs benny are good but need more hollandaise."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoekt5MjFBRRAB",
            "text": "Nice location in Middletown, NY!\nWheel chair lift at entry!! Never seen that before!!\nNew nice and clean.\nI am not sure how connected it is to the brewery next door( there was  window to see into the brewery)\nWe went for Saturday brunch, the menu was good. I ordered the steak and eggs. This was a great choice, I enjoyed it thoroughly!!\nI will definitely go back again to try more of the menu and possibly a night when they have a band or a dj!!!!\nGreat spot in Hudson Valley to try!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNVlQOWZ3EAE",
            "text": "Seriously the BEST BRUNCH in Middletown! Food was fab, LOOK at this Bloody - YES that IS a slider and shrimp on top - the bloody mix  itself was the best I’ve had in a very long time. 💜 Breakfast burrito, half taken home for tomorrow, excellent bourbon bacon eggs Benedict and yummy potatoes for both.\n\nFriendly staff, super clean, great atmosphere, CANNOT wait to eat there again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4b1lXaVh3EAE",
            "text": "This is a fun place filled with friendly people. Thursday night features an open mic session with musicians coving every genre.  Food is well prepared and they have a wide variety of craft beers.\nI'll be back to Tapped!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVc09pbS13RRAB",
            "text": "Very hospitable servers and good food. Especially enjoyed bacon wrapped shrimps. Chicken & Waffles are fine, but can be temperamental at times. Saw live band playing on Saturday evening. Not the place if you are sensitive to sound volume during the live band."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbWM2VkRBEAE",
            "text": "Great food. Very loud for our lunch; should have sat downstairs. Great atmosphere. Our waiter was awesome! Biker friendly! US Military Vets MC, Hudson valley chapter"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMGF5TmxnRRAB",
            "text": "Food is excellent but when I read \"hand cut\" fries that is was I expected.\nNot frozen over fried fries that are greasy and soggy. And they're all stuck together"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLXZhQWx3RRAB",
            "text": "We had a Cocktail Party in the downstairs room Friday night. we had about 50 people and the drinks and the food never stopped coming and the service was amazing!  Great venue!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZZ19HSWFnEAE",
            "text": "Tapped has such wonderful bartenders and amazing food! The service you receive really makes you feel appreciated and the staff is super friendly and kind to everyone that walks in. Their event nights are full of laughs and fun!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaTRyTkRnEAE",
            "text": "Had an amazing experience at Tapped! My wife and I had our rehearsal dinner here, and everything was perfect. Food was great (salmon was absolutely amazing), drinks were great, and the staff were so accommodating and helpful. They really let us make the space our own. Paul and Harrison were amazing to work with. Would recommend to anyone!"
        }
    ],
    "reviews_count": 78
}