{
    "name": "McDonald's",
    "place_id": "ChIJRTVyMIjzwokRRAm--TXcIjs",
    "grid": "BX5",
    "address": "2630 Jerome Ave, Bronx, NY 10468, USA",
    "rating": 3.6,
    "user_ratings_total": 1636,
    "phone_number": "(718) 220-1982",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMVgxY3lSRGh1VG5OM2NYaHlNa1IyUWt0NlIwRRAB",
            "text": "Every time I go in there these two lgbtq plus employees one being a manager always give me attitude and are so unprofessional they leave my order sit there until I ask for it the food is good service is terrible"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1FqUTRWbmRLTUVSUGNVUXRNR1JUZEVOVVZtYxAB",
            "text": "I totally agree with that reviewer who made comments about a worker: Jazlyn. This young lady is a magnificent customer service technician."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUVdXWk9WbVpmY1RObWNHRXhlVjlPZW1WelpYYxAB",
            "text": "Clean, fast, quieter than others"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVVYyaHFjMGx4Y1U1alN6TnNkbU5tVlZkeVZIYxAB",
            "text": "As close as this location is to my job, I should’ve listened to the reviews upon reading them first. Don’t get me wrong the service was excellent, but their food is horrible. Some McDonald’s locations especially depending on the location food is always gonna be nasty. I do not recommend. You’re better off walking to the one on east Fordham road near the supermarket across from Walgreens. Ther service on the other hand is HORRIBLE but their food taste way better!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVZFMXhSa1JIYjNKcldVbHNNVUZuY0hCQ04xRRAB",
            "text": "I don’t like this McDonald because they always have a problem with what you ask for. We don’t do that is the worse thing to hear when you spending money"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWFpDMTVNbFp2VkhGaUxYTlJjM1ZoZERVNGJHYxAB",
            "text": "I’m place was super busy took a while but the food was good - staff was nice but obv overwhelmed … found places to sit - lots of kids not even had kids from what I saw just alot of kids and families - liked the vibes but yes just busy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNmMzcHJkV3A2VDFKNGFEa3pkbGcyWVhNMFUwRRAB",
            "text": "I had the Most Pleasant Experience this morning at the McDonald's located at 2630 Jerome Avenue and it is all because of Jazlyn the Employee who works there.She was very pleasant and knowledgeable. She actually told me about a promotion I was not aware of.Cant Thank her Enough . Keep up the Exceptional work.She knows about Customer Service. She should be Employee of the Year"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUlZEUjZjbGRyWlcxRFUyTXpNa05DYWtGaVUyYxAB",
            "text": "I went a order they took more than 5finutes to the delivery the food to mi table.iI have a service a lady came said  acting krazy  she  didn’t buy any food as you see in the video  ,she food from some place   I request to see the manager to guy was cleaned but he said he was busy  .have to leave me food to speak to her name is Maria.they always have many people I. Front store and  hanging out and homeless"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdmJEWnFhVGhaUjJGalMzaHJiSFJMVDIxRFVWRRAB",
            "text": "Ok"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRVgyaFNaRWxaYVRWNmIwdFVObVZqV1V0S2NHYxAB",
            "text": "I came back after diving for 20 minutes and they said there was a McDonald's store close. I see the app 24 hour open."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSVVUUklNRkZoWkdaZk5GSnNRazlKTVhaSlRXYxAB",
            "text": "👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMVJraFFTMEpwVkV4aE5HNVRTMUIwU1VJME1VRRAB",
            "text": "2630 Jerome Ave\nBronx, NY 10468\nUnited States this location so disrespectful especially 540 am when im on my way to work i order from the app and when i come to get my food everything closed when i asked for help they just shake they head and wave me off this is a 24 hour spot but they have they doors locked and driveway blocked off i just want my food and i have to get to work and a refund is 7 days when this not my fault this is outrageous never again will i order from here"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVGRqbEJZVlJITWtkM01FczNlVFJWVjJaSlNHYxAB",
            "text": "They take forever to give the food.. the night shift is horrible . In this specific location ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRFpWaEpUR0p2ZWxab1VtcEliR3RWVVVneFpFRRAB",
            "text": "I have been here twice since the snackwrap were released on June 10th (it’s only been two days) and on both occasions that i came I am being told there not in stock. Why advertise something you are not selling."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWT1owWkVRVk5HZDI0MGVXcGxSRTF1UkRCTk5VRRAB",
            "text": "Never open on time in the morning. Uber orders are missing utensils and condiments 90% of the time. They don’t listen when you order in person or through the drive through. My order is wrong so much that I have to write a review. Get it together"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbE5YSm1aREZHZWs5Sk0yVnpVVUpzWWxSd2RHYxAB",
            "text": "The manager name Daniel very nasty very unprofessional talk crap in Spanish about the customers makes u uncomfortable and does not put customer service first - served me cold food and water down drinks embarrassed me made a scene and  gets upset at you about it and talks very disrespectful attitude is nasty that’s not what leadership is - u have to bite your food to know if it is hot you can also taste when food is old  or been sitting out to long. He needs to learn more customer relations in a respectful manner ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRVFqTjRlVUZZYzB4MVdGVjRkMEoxTFdjNFYyYxAB",
            "text": "They seriously need English speaking people that actually work in the store. Also, the people were EXTREMELY slow and rude. The cashier, I didn't get her name was rude. She completely messed up my order. And on top of that, she forgot an order. It looks like only one person is behind her. The lines were slow. Do better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUFJYRnpUazV1WDJJeFdtOHpZbXMyY0dnNWFIYxAB",
            "text": "I went to this place to get breakfast and I saw a long hair in my food that is so disgusting never go there🤮🤮🤦🏼‍♀️🤦🏼‍♀️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPR0dzYlR2NDllMWh3RRAB",
            "text": "i think the people of McDonald's forgot what the definition of 24hrs means. Here I'll lend the knowledge it means unless a typhoon hits we open. Not close the store down at 2am, 1am, 11:45pm. this isn't the only location doing this...IT MEANS ALL DAY EVERYDAY !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKaVd0ZDJyMDZucVhnEAE",
            "text": "I was passing by, didn't go inside. What I could see from the shop windows was cleanliness and order.\nStreet :  No Comment ......"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbkpxVXd3RRAB",
            "text": "No good service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk96dUpBEAE",
            "text": "This place is dirty"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOHFIbEtnEAE",
            "text": "The combo was a little off for me but it was good, I hope they improve the quality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLW9hRWR3EAE",
            "text": "Gusto at the drive thru beware. He is horrible taking orders . He always gets it wrong. His staff learns from him so they horrible to. I got the wrong order from Gus several times. Don't recommend this location. Trash all around. If you have a card on file they will charge it without asking first. Just assume you want to use it Then got upset when he had to give me a refund and refused me the sale."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJakxUOFB3EAE",
            "text": "Fui con mi hijo almorzar , la atención es rápida y hay ofertas de combos de papas con hamburguesa, pero lo que no es bueno es que hay muchas personas indigentes durmiendo dentro del Mac"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaEtMWEZnEAE",
            "text": "Didn't receive the food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eDZPOUdnEAE",
            "text": "Nice"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N0tiQ3FBRRAB",
            "text": "First they got my order wrong then what I got was a chicken sandwich swimming in that spicy sauce thought I was having soup"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMGVPU3JBRRAB",
            "text": "Hoy hace 1-2 horas entré a este Mcdonalds para utilizar el baño.. como otras localidades en NYC tienen baño libre, pensé que este también (no importa si yo tenía que consumir algo pero traté de ver si como quiera el baño estaba libre), un seguridad se me acerca y me dice “tienes que tener factura para utilizar el baño” yo, inmediatamente le respondo, decentemente, “ok, me voy a comprar una botellita de agua”.. el hombre coge y se me PEGA hacia a mi y se pone a esperar al lado de la cajera a que yo pida mi orden. Eventualmente, yo me dirijo hacia el baño y este individuo me sigue siguiendo y yo, ya viendo la actitud que el cargaba, le digo que yo me puedo abrir la puerta del baño a lo que el responde “pues no lo uses porque soy yo quien lo abro”.. yo le señalo que el me comentó que yo necesitaba exclusivamente el recibo CON el código para entrar al baño.. y va y el viene. Para no alargar el cuento, el no me quiso abrir la puerta del baño hasta que finalmente lo hizo y me dijo “no seas tan hedionda”..\n\nMi pregunta es, esta es la clase de gente que trabajan dando un servicio en McDonalds? Yo simplemente quería usar un baño y aun así consumí como un cliente normal. Yo nunca le falté el respeto a este hombre pero SÍ me sentí incómoda como el se lo tomó personal conmigo siguiéndome y pegado de mi.. yo entiendo que a esa sucursal puede ser que vayan drogadictos e impertinentes a molestar pero tienen que manejarse mejor."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOWJ1NTF3RRAB",
            "text": "En kinsbrigde y Jerome Bronx siempre te entregan orden incompletas y es dinero que uno pierde porque no me Regreso y ya esto cansa"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbnFuSUtBEAE",
            "text": "Nice clean place to eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeGRpSTNnRRAB",
            "text": "They was faster than last time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc1l1ZFJnEAE",
            "text": "There was hair found in my food and I’m pregnant. They obviously don’t I force hair nets or check their food before handing it off to customers. Something needs to be don’t before the wrong thing starts to take place. They don’t need to be open if the service is not satisfactory to the customers who pay their hard earned money to get trash service!"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaGRLdEFnEAE",
            "text": "리모델링 이 완전히 끝나 깨끗해 졌읍니다"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOGNUa2dnRRAB",
            "text": "This McDonald's is horrible. From atmosphere to service, they didn't know what a soft drink was. They just told me that didn't have anymore. I think about this as I look at this homeless person sleeping as I sip my sprite and somebody's random music blast in my ear."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa2RTbzZRRRAB",
            "text": "Too many kids that hangout in here not an friendly environment for kids to sit down and eat with there parents mangers don't enforce no structure"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoc0lIZ3BBRRAB",
            "text": "Soy nuevo  viviendo en el sector y mientras hacia mi loundry  ,decidi pasar a desayunar a este lugar y me encanto , la atencion , el servicio, la limpieza . Felicitaciones a la manager tiene un equipo excelente. Me encanta"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJZ0pYWU13EAE",
            "text": "If you’re nearby and need a place for warmth don’t worry just come to this McDonald’s there is a person sleeping and multiple Latino men with Doordash, Uber, etc. bags taking up all the seats to the left of the place. There food is not worth it either. I don’t know where they learned to make a Frappe but I’ve never been to a place that made a frappe like this. This place disappoints all the time."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1czhDZkxREAE",
            "text": "It was a wonderful experience at McDonalds. They clean after each customer. I enjoy this McDonalds location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsazdpNWRBEAE",
            "text": "From\nManager to the coworker no customer service ….. Im Dominican but them Dominican need to go .. in the night time it’s the worst manager had to come from the back to bag my food w ugly French fries talk about they good .. they didn’t want to make me\nFresh french fries …"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOU5XRFRREAE",
            "text": "AS USUAL  THESE PEOPLE  WORK HARD AND WERE VERY RESPECTFUL  ,AND HELPFUL AND KIND TO ME AND MY FAMILY  THANK YOU SO MUCH GUYS"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaWQ3bVF3EAE",
            "text": "I have lived in this neighborhood for 10 years and I have never had a problem with your staff.\nI visit your restaurant 3-4 times a week because I have many children.\nToday one of your unprofessional girls attacked me.I didn't have a receipt, but I had a number to pay .Instead of asking if I had a receipt or an order number, she simply threatened me that she would not take my order.\nShe doesn't know how to express herself professionally and instead of realizing her mistake, she even called me crazy\"loco\".\nYes, I am not Spanish, but I live in a Spanish-speaking area. I understand when Spanish-speaking people communicate with me."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeXZ1eEJBEAE",
            "text": "This is one of the worst McDonald’s in the Bronx. The customer service is horrible and need diversity training immediately. One of the associates (who is a lighter skin man) told an employee in Spanish that I shouldn’t be ordering at the…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMl95WGp3RRAB",
            "text": "JUSTO CUANDO REVISO MI ORDEN ME DOY CUENTA QUE OLVIDARON PONER MIS NUGGETS CUANDO REGRESO NO ME DEJAN PASAR PORQUE ESTAN CERRADOS. PESIMO SERVICIO DEL EQUIPO DE LA NOCHE. THEY RE PLAYING, DEBERIAN PONER MAS ATENCION A LO QUE HACEN.\n\nMANAGER A CARGO:  CAROLYN C."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbVBLZDNBRRAB",
            "text": "The fries and nuggets were fresh and hot! The cashier was very nice and brought the food to the table! She even came back and asked if we needed anything else! Frappes were also good!<3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa01pd2xBRRAB",
            "text": "This store is consistently slow with their service. I work near by, and use them regularly. I can tell you, you will nearly always wait LONG waits. The staff that works mornings, say before noon, stand around and talk. They are slow walkers. They do not care at all if you have waited over ten minutes. Right now, I have waited over 25 minutes for a McGriddle, large caramel coffee, and large Reg coffee"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNFlPaWxBRRAB",
            "text": "This McDonald's is like any other one, in the sense that it looks like any other one, and the food also looks and tastes the same. But the atmosphere is really heavy in this location, especially at night , it's hard to enjoy your food if you decide to eat in. That's just my opinion, and about the drive thru I honestly didn't even know there was one so I can't say anything about the experience.  Other then that the food and the service are ok."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNl9pZ3hnRRAB",
            "text": "The people that is actually working here, around 3 or 4 in my humble doesn't fit at this place..today I was expecting some cashier in the line and I didn't know that I had to order in the digital kiosk but nobody care or even have the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa3MycFBREAE",
            "text": "I ordered double cheese burger combo from this fast-food and I received a very cold and old looking dry hamburger in the bag. The food was not fresh and was very dry. I was planning to return it back to the restaurant but I was already on the highway. I hope they stop serving cold food and cook fresh food. I was not happy at all with the food so I wouldn’t recommend this place to anyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN3JMZDZRRRAB",
            "text": "I ordered breakfast from the drive through, the entire order came out wrong. I ordered 2 sausage and egg McMuffins 1 hash brown and 1 large iced coffee. I got 2 ham egg and cheese McMuffins a cold hash brown and a hot coffee. I did not have time to have the order fixed as I was in a hurry to get to work. Spoke to 2 different people while placing my order, so that might have been why my order was wrong."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzdnVxbmN3EAE",
            "text": "I come here because I like how it is one of the few restaurants with the places to fill your own drinks but this place could honestly be kept cleaner. I understand that they get a large amount of foot traffic but I usually do not go in…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbDRMdnFBRRAB",
            "text": "Do not eat here I got 4 for $5 bag with the chicken sandwich so it was $6. I ate that food appropriately 30 minutes later I was throwing up with diarrhea. I wouldn't let my dog eat here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIN19TR1lREAE",
            "text": "I had to wait an excessively long time for my food at the drive thru. There was no one in the drive thru and they employee took my order and it took him over 10 minutes to have my order ready."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycXRXdEhnEAE",
            "text": "The last times i was on the drive thru some guy was complaining about an order the workers who bring the orders out  to the cars parked outside we're playing attention to this guy  and his order now i was waiting for My orders an extra  few minutes  they couldnt find anyone to bring me My order to me i had to wait an extra few minutes till i was able to get close  enough in my car to get to the drive thru  to get My order i don't go there alot but they have been getting very slow with the orders lately they're usually not like that unless it's crowded on the drive thru"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaWZXVXZnRRAB",
            "text": "Service and cleanliness is good. Never had an issue with orders here. The only reason they get a 4 star is because there is always a bunch of delivery guy with mopeds out front blocking the entrance and driving up so I have almost been hit a few times."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtci1EOEJ3EAE",
            "text": "Every time I use drive thru and the person at the window can never hear my orders.  The person always says it's the headset messing up. You would think management would've had that issue fixed by now.  it's been 2 years now I've been hearing that.  Then today hot, almost 90 degrees outside before 2pm, I order a smoothie to cool off and the lady says smoothie machine is out for the day because they just cleaned the machine.  WHAT???? Are they serious?\nDon't expect the best service and they're ALWAYS out of SOMETHING. EVERYTIME.\nPOOR MANAGEMENT. POOR INVENTORY."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cHAtbzFRRRAB",
            "text": "They say they are 24 hours but they have the door locked and when you go to the drive through because you’re not on a bike or in a car they deny you service.  I just came off a 12 hour shift and  cant even get food at this time.  Horrible customer service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLVBYZjVRRRAB",
            "text": "Dirtiest McDonald’s I’ve seen. Constant homeless people and crackheads digging into the garbage bin that’s next to the cashiers to grab bottles or cups so they could fill it up with soda, witnessed so many homeless people putting their hands all over the soda machines, all over the ice tray, horrific. Not one employee says anything. All the Uber drivers get free cups to get soda while we have to pay, unbelievable. Don’t catch me at this McDonald’s, not to mention the incredibly loud teenagers who are always in and out with such scandal. Sad to see a childhood memory turn into a nightmare. HUGE NO."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMnVMRTFRRRAB",
            "text": "Well what can you say it's McDonald's not Friday's!! Even still it's so ghetto the delivery drivers are inside in large numbers waiting to get a notification so it makes thr atmosphere uncomfortable. The food disgusting not fully cooked and to top it off any one can come in. Two homeless guys walked in and dug in the trash to get cups and then get drinks at the soda fountain!! Among others who walked in to get a refreshing beverage in there water bottles!! They didn't care at all and it shows every where. The food the vibez and the overall cleanliness as well the lack of consideration with people coming in to get free drinks without a say!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dnAtM3Z3RRAB",
            "text": "Idek where to start with this place! The store definitely needs new management. The place is always full of deliveries awaiting orders but honestly just look like a hangout area as they are smoking vape, playing around and talking extremely loud all the time. Sometimes there’s no place to sit because they take all of the space. The atmosphere is very uncomfortable with all these “deliveries”just doing nothing flirting with the workers and smoking vape. Many times they are all grouped outside the store smoking HOOKAH🤢.\nYesterday I was trying to enjoy a meal with my sister and some of the guys (the all appeared to be dominican) were trying to flirt with us disturbing our time at the store. We couldn’t eat in peace! I feel so bad for this place & the worst part of it is that the female workers entertain the “deliveries” behavior. Not to mention that the food is always undercook or overcook, but never cook properly. The order is always missing items."
        }
    ],
    "reviews_count": 60
}