{
    "name": "Just Jollof Kitchen",
    "place_id": "ChIJFxhXHAAzw4kRVp1tl4MYfL0",
    "grid": "BX5",
    "address": "39 W Main St, Middletown, NY 10940, USA",
    "rating": 4.7,
    "user_ratings_total": 52,
    "phone_number": "(845) 775-3075",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVlQzTlBha0U0YmxVNVFsUTVXR2R0YUZGVGFsRRAB",
            "text": "This is the worst African restaurant I’ve ever been. They got everything wrong and the foods were super cold. If you’re new in town, try as much as possible to avoid this place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd1VUTm9jMkpKUkd4VVQyVmFhamR5YlY5V1duYxAB",
            "text": "Such a cute spot. This was a first time experience and it was delicious. Warm and welcoming, family owned. You can tell they have a great love for their restaurant. We will be back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VWNubDBRbkY2YkRGNGRrOHhTbk5zTUU5NmFXYxAB",
            "text": "Stopped in for lunch and really enjoyed it. I just needed something light so ordered two appetizers; suya goat and akara bean cake, both were very tasty and satisfying. The homemade ginger beer was also really good. The staff were really nice too. If I lived in the area I would definitely be a regular."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFYybEpPREl3UWpsNE9IcGllbkY0YWtoVE5sRRAB",
            "text": "Was in town for a visit and decided to try Just Jollof for lunch. What a pleasant surprise! The plantains were just perfect.  The goat stew had amazing flavor. And the chicken clubber was huge and flavorful. I only wish we could have tried more. The service was great and friendly. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNFVuUnpPRUpvUkhOMGQxUmpTMFZrVTFwbFZXYxAB",
            "text": "Talk about flavor! Ive been on the search for some place that has fufu and let me tell you the beef stew paired with fufu was out of this world. I ate it all otherwise i wouldve taken a picture. The owner was so sweet as well as the girl serving me! I cant wait to go back to try the OG egusi soup!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFJVSktVV2hqU1RjMmNYRjFibUZEV0daMVEwRRAB",
            "text": "Highly recommend!  The food was truly exceptional, and very authentic. Middletown NY really needed this restaurant. Try the sampler appetizer and Egusi Soup!\n\nThe service my family received was 5 star, and we will absolutely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNFFsODJXVEJFZVdab1pFOXpVRmhKWm14RWJuYxAB",
            "text": "I was a little skeptical at first because I have never had African food before.  What a wonderful surprise!  I kept it basic with Saya Tacos and they were sooo delicious!   Seasoning was so good.  Tried a desert and it was also good.  Definitely will be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbVUyOWhSRXB2UldndGFuZFJiVlF6ZVU1TldtYxAB",
            "text": "Great atmosphere for churches, Christians, children, really love the ALL non -alcoholic beverages at this restaurant. Cozy atmosphere, great music, outstanding customer service. Overall 👌🏾👌🏾👌🏾❤️❤️❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc2FtOUZURWxoZFdOQ1ZHMXJjSEJwU1ZCNlJVRRAB",
            "text": "It's a beautiful place with an amazing server. I love trying the egusi fish soup with fufu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM1QwaHdSWEZ3T0dObVJqVnZaSEl0V1dSQlJVRRAB",
            "text": "plastic in my food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM2IxRlFWMHBtVnpkMFlVWmxOMWhMZUhWcmNsRRAB",
            "text": "My wife and I recently tried Just Jollof Kitchen in Middletown and we absolutely fell in love with it! From the moment we walked in, the atmosphere was welcoming and spotless, which immediately gave us a great impression. You can tell right away that this is a place where the owners take pride not only in their food but in the entire dining experience.\n\nWe started with the DR BEL SPECIAL CHICKEN WINGS as our appetizer, and let me just say these wings were out of this world. Perfectly seasoned, juicy, and so flavorful that they didn’t even need the house-made sauce (though the sauce was also excellent). For our main dishes, I ordered the Lamb Shank with Plantains, and it was cooked to absolute perfection. The lamb was tender, fall-off-the-bone, and full of rich flavor. The plantains were so good that we couldn’t resist ordering extra to take home. My wife went with the BEEF ME UP STEW with Fufu, and it was packed with deep layered flavors that made every bite satisfying.\n\nAnother thing we loved was the family run vibe. The mom is in the kitchen cooking with so much heart, and the kids were serving with genuine warmth and friendliness. It truly felt like being welcomed into someone’s home. On top of that, they have a zero bar, offering creative zero alcohol drinks and wines, which we thought was such a unique and refreshing idea.\n\nOverall, Just Jollof Kitchen is a gem. The combination of incredible food, spotless and cozy atmosphere, and genuine hospitality makes this place a must visit. We can’t wait to come back and try more dishes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUVpHMW5jVGMxYzBndFVteHFUWFZWYTFWbWEwRRAB",
            "text": "Atmosphere great! Food was okay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWVIwbE5WMWM0TUVWT1ZHWXdhVVJmYWpCTGNIYxAB",
            "text": "Service is excellent\nFood is amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR01EZEhZamM1ZEUxQ2VHWk9RbnBqTmxjd1QyYxAB",
            "text": "The food was very tasty- my first experience eating Nigerian food- but seemed very authentic. The beef stew was delicious- the flavor of the sauce-so good! Our waiter was super friendly and helpful, seemed like a really genuine, kind man- his mom cooks all the food- what a great family business ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbVJYcDVabFJyTjFNeE9GRTJSWFF4VDNRM09VRRAB",
            "text": "Stopped in with my darlin for a quick bite. Absolutely delicious beef stew and fufu. Haven’t eaten Nigerian food in over a decade and this might be the best I’ve had. Will definitely come back. Server was super friendly - what a great family run restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVFsWXRMWEpNWTNWV1VGUjJkVGhPTFZCeFRWRRAB",
            "text": "Writing this as we leave our table. Our server Amy was the best, she was super cool, helpful, sweet and so polite. We will definitely come back for some great food and service! 💖"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cWQwWlVUbk01Tm5KbFkyTXlTVEY1TVZwc04zYxAB",
            "text": "Absolutely amazing food and great staff!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saldrOXljMXBsY1UxSFNuQnRXVzFSVERjdFlWRRAB",
            "text": "Food was nicely seasoned and the portions were great. The ambiance was chic and has a great vibe. Would be good for dates or girls nights. Spent a bit more than I would like for lunch considering I had chicken and rice but would definitely return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYU1DMXZjVjlVVEhwaExWUTJkbnBLTjJkRGEwRRAB",
            "text": "The food was delicious. The service was an absolute joy and the atmosphere was stunning! 10/10 recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeGRqQlRSbWxPWWtoMGJHWjVTblpOTkRWQlVtYxAB",
            "text": "We stopped in for early dinner and had a great experience, our server had great recommendations and suggestions and was honest about all menu items.. we were hesitant because of the spice but he assured us the items we ordered wouldn’t be spicy and they delivered! We had the wings with Jollof rice .. delicious and took the egusi and fufu to go.. overall the food was amazing.. i would’ve have wanted a tad bit more seasoning but nothing that a little salt and pepper can’t fix to my liking! I would say the service can be a little slow but we did keep in mind it is a new restaurant and I’m sure they are still working out the kinks and get a handle of things. But definitely go expecting to wait a little bit for your food. I would definitely recommend trying this food and I’m happy we decided to try African food for the first time at Just Jollof! I already can’t wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUlYwUnNVWFI0ZWxNNVNuaEJVVTV2YUZaSVgyYxAB",
            "text": "We were excited to dine at Jollof Kitchen for our anniversary, and trying new food. Unfortunately that excitement was short lived. We ordered food to go along with our dine-in order, but ended up waiting for an excessively long time for both. The kicker is that the food was actually ready and left behind the counter the whole time but no one had let us know until we got fed up enough to ask (over 45 minutes). Overall the food was good but the subpar service really overshadowed our experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaGJrTTNaV0pTTlhOME1FWmxRbUo1U1hZNU1uYxAB",
            "text": "This is my first time trying Nigerian food. I see it all over the Internet so I thought I’ll give it a shot.  I LOVED IT!!\nThe food was so very delicious.\nAmy, The hostess was very kind. She even gave me warm freshly homemade bread while I waited for my food.\nI love the decor and the attention paid to the ambience. Must try!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeWVVNWxZV3RxVUd4c1drRkhPVVJpY1VvM1lYYxAB",
            "text": "It was Simply Amazing’y Friend is From Cameroon  and He Enjoyed The Food. I will Be Back"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdFNqSjRSbXB6YmxwTGEydDBNemt0UkdsM1QxRRAB",
            "text": "Much success to this new addition to the Middletown culinary scene! Delicious food and great hospitality from the owner William"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbWVGaERjVFJRYVhCblRFWklZMEU0WXpWNmRsRRAB",
            "text": "The food is pretty good and you can tell that there is a lot of attention to detail when they prepare the food. The ambience is very nice. The service was very friendly and was one of the best parts of the experience. The only thing I really didn't like and, unfortunately, it's the thing that will keep me from coming back often, is that the prices generally are way too high for the serving size. If you're a light eater, it's good but, if you're a big eater, it's not a great value at all for what you pay."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdVIzazNZMGxQUmpaZmIzaExkVEJ3TmtwVlNVRRAB",
            "text": "Service and atmosphere are great. I found the food to be flavorful, but watery and served in very small portions. I came hungry, curious and eager; I left with a positive view of this cuisine but still very hungry. I ordered the goat stew and fufu. The goat stew came in a tasty but watery sauce, and 3 tiny chunks of goat meat. I’m unsure if I’d visit again but I do think it’s worth a try."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWT1FrMXFhbWxYZGtKemQwTkhlRU5KYTFNeWFuYxAB",
            "text": "Very nice people and good food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweFF6bFZhM0ZpWjFOcU1FcFNjV1ZRVjJGMFlVRRAB",
            "text": "In a world where mediocrity is the standard, Just Jollof shines with pure excellence and heart!! It was our first time having Nigerian food and it immediately became a personal top 5 cuisine. The experience was truly beautiful. From the authentic flavors to the cozy atmosphere and amazing service, we were blown away by this new gem in Middletown! Also super cool that they have a completely non-alcoholic drink menu!\n\nFamily owned and operated, you can truly feel and taste the love-infused into every part of this business. Wishing Just Jollof much success now and into the future❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWk1XaFdOMHB4VEdka1pYZFJaelEwVTFNeU9IYxAB",
            "text": "OH my goodness !!!  Is all I can say the service was great the food was to live for they had this rice called Jollof rice it was made with Love it was so good I also had fish with the rice I couldn’t believe that for two people spent less then $100  trust me you will enjoy your self  yoo must try it and bring someone to enjoy your experience because it is a great experience , the owners are on site great people 💕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaGJERjZUVWhuZDI4eFVuWlNYMFpCVkVSU1RXYxAB",
            "text": "Exceeded our expectations from the food to the service. Highly recommend the peanut butter soup, chicken wings and the chicken sandwich. Only thing would be to be aware they are a zero alcohol restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb1ZsSlNkVzVrWm01V1ZFMTZXa0ZSV21GbFpWRRAB",
            "text": "Did 2 courses with a group. Everyone ordered different things and literally everything was great. Try the chicken sandwich and peanut soup! 5/5"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UGExUm1MV3hMY0Vsb2NIQkdURUZvVTNGUGMyYxAB",
            "text": "After moving to Middletown, I struggled to find good African food without driving to Harlem—until I discovered Just Jollof. I finally stopped in today and was blown away. I had fufu with egusi and Jollof rice with peanut butter stew—everything was rich, flavorful, and truly authentic. The service was warm and welcoming, making the experience even better. If you’re craving real West African cuisine, Just Jollof is a must-try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNGRrWmpkbXByTlZWeFRrZHdWakUzWmt4Rk9GRRAB",
            "text": "Amazing unexpected gem in middletown! Every thing was amazing the brunch special was worth it!!! Packed with flavor!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTmFFRnNjbHAyVkVaeGNVbFNPVVpLTlVaelQxRRAB",
            "text": "I was blown away by how amazing the food here was. I expected a lot from the reviews and I was not at all disappointed. It’s so hard to find vegetarian food that isn’t just a frozen bean burger but the moi moi was SO good and flavorful, and the bean stew and spinach strew were fire 🔥 with fufu. I also loved the dry bar, having a glass of non-alcoholic wine with lunch and then going back to work was awesome. I’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWU9GODJTVlE1VVcxNGVUQkphVE4yV2kweGVrRRAB",
            "text": "The food here is outstanding. I've been here twice and everything I've tried, including some of my wife's dishes, did not disappoint. Clean establishment and extremely friendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdE4wMW5lVjlqY0hFeGVYaEdOQzA1WlZOQlpGRRAB",
            "text": "The service was fantastic, everyone was so nice and personable. The food was just as amazing, I had the egusi soup with goat and fufu. The goat was so tender and flavorful 10/10 recommend. I will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM1IwZzRUMVZDTFZwQ2NUVjJSbUZ4TW1aaE5YYxAB",
            "text": "We were thrilled to have lunch on JUNETEENTH and let me tell you, it did not disappoint. We enjoyed the atmosphere, artwork, lighting and other patrons. Enjoy your time at this restaurant- have a nice appetizer and cool drink while your meal is being prepared. Wait for it patiently, let me say this again, wait for it patiently you will not be disappointed. The fish was so amazing. My Mom said it was the best tilapia she has ever had. And from the way she was eating it must have been because a woman walked over and said, you really enjoyed the fish! LOL\n\nThe owner and staff make you feel like you’re having a family dinner. You will return for me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPLWtyOC1tbU5HY2ZREAE",
            "text": "I ordered the beef stew & some fufu . Amazing seasoned , but meat was very tough! Would definitely recommend them. Staff was amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TFQxZDFWMEZ6ZW5wMloyVldWa2MyVkhZNFZIYxAB",
            "text": "Great service and delicious food. I got the Egusie and fufu, can’t wait to come back and try something else!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWlFuWnZjRzFCTVVoeVQzbzBhVkZsVVZWSk4wRRAB",
            "text": "Food was so delicious and owner was very nice and welcoming!! Definitely worth a visit or a  few!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVGJtSWJsdWFDYWJREAE",
            "text": "Been waiting for years for a place like this in this area. Born and raised on Ghanaian/African food and this place lived up to expectations 💯!!! #Jollof4Lyfe"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLN08zTXJKNHY2R0pREAE",
            "text": "Loved the whole experience"
        }
    ],
    "reviews_count": 42
}