{
    "name": "ONEWAY Cafe and Pizza",
    "place_id": "ChIJO4l4RUYzw4kRFFozugPh5jM",
    "grid": "BX5",
    "address": "11 Mulberry St, Middletown, NY 10940, USA",
    "rating": 4.8,
    "user_ratings_total": 42,
    "phone_number": "(845) 239-4171",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMVozWjFhVWhTT1ZSbFdtSk9NWGhGYW5kSVJVRRAB",
            "text": "Friendly and attentive staff, excellent food, clean restaurant, variety of menu options.\n\nWill definitely be returning!"
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTFVYbExObUZJYVcxcVZVbHphRXRLUlhGNE1WRRAB",
            "text": "Love the food! Everything tasted fresh and amazing service. Definitely going again"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYVNISkVla1ZuUW04eE4zVmZMVFZPZFhaaFptYxAB",
            "text": "THE BEST. EVER. Oh my god."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd2NsaFlRbUZJZWkxb2NGYzBTbnBGWVd0UFNWRRAB",
            "text": "Ive honestly never left a review for a place before but what Beautiful cafe and amazing owners, It was my first time trying it and the man behind the counter was very informative and such a good spirit, I ended up landing on the Philly cheesesteaks and a side of fries after he explained the menu and with a iced latte and a tiramisu for desert, the Philly cheesesteak was amazing and the jalapeños he allowed me to add topped it for me, the fries tasted genuine and so good with the seasoning he suggested to add (like a salty sweet) and the coffee genuinely surprised me with the taste and the fact that they use little iced coffee balls to cool the drink was so creative, definitely will revisit with some friends, couldn’t ask for better customer service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcVlrOXBZVlYzV1ZSeVRtOXZXRVZMYjFFNU5XYxAB",
            "text": "I don't understand why this place closes So early"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeVprUlNjemx1UXkxcmNub3lTMEZQTVZaeE4zYxAB",
            "text": "Food was very flavorful and fresh! Service was amazing! The atmosphere is welcoming and friendly! 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWYWFHeDJkSFF6T1Rab1RESTNSblZyUVZKV1pIYxAB",
            "text": "If you’re looking for some local food I highly recommend stopping by One Way Cafe. Food was delicious and service was amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQ2FHNXdSWHB6VHpRNE0xTllXbHBqZURWWlFuYxAB",
            "text": "This place is amazing the pastor and his wife are so loving and caring and the food was great. I recommend anyone who’s in the area stop here in the morning for the bacon egg and cheese reminds you of the city. Pizza is great and the all entrees have flavor so try everything if you can !!! much love"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUVoySnBWMFZRT0dGbWIyTjVWbWxwWkhSU2VrRRAB",
            "text": "My experience at the one way cafe was THE BEST! Not only is the service amazing, but the food is spectacular and flavorful ✨ Everything I’ve gotten from here always satisfies my hunger and they have the best portions as well ❤️ so whenever you get the chance definitely take a trip to the one way!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeFZWbERhMmQ0UVhKWU4xaDNkRXczUlVVMWNWRRAB",
            "text": "Cute little spanish joint downtown. Relleno was fresh and on point. Waffle was fresh and cooked right. Cappuccinos right. It’s slow because it’s all made to order. Totally worth the wait."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNVVFWnFabUZIVTI5VGVVa3dlSEZPT1hWTVMyYxAB",
            "text": "With a very tight schedule, I arrived at ONEWAY in the window provided by DoorDash.  Unfortunately, they were nowhere close to being ready with my order. In fact, I suspect that they hadn't even put it in the oven.  They showed me the order from DoorDash, which, indeed, had a later time.  This wasn't their fault.  What was their fault was their inability to step up the order, even after I showed them the window DoorDash gave me.  Of course, they were very nice about it, but my 8 year old still didn't eat dinner (and the Jamaican patty that I did manage to get wasnt homemade and tasted like rubbish.)\n\nWhat happened to the days when restaurants acknowledged a discrepancy and addressed it?\n\nAnd look at this image!  The email I got with the pickup window says 5:45 to 5:55!   And they were giving me 6:12 as the time.   I realize this may seem petty,  but when you're in a rush, you expect a cafe like this to either have the order ready on time or to be flexible.  But that's not how it works many times nowadays, and ONEWAY is an example.\n\nThis review would've been a 1 star, but I can't totally blame them for the problem with DoorDash"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTFJVTnlSRVJGWjJOSVZqWnNlVVJsZEhScU1FRRAB",
            "text": "We weren't planning on stopping at this restaurant but God had different plans. We were traveling from SC and were amazed at the hospitality of the owners. The food was spectacular and their Faith was inspiring. May God continue to bless them and everyone who breaks bread at their table."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTzcyS0dDb01uVUlnEAE",
            "text": "Very welcoming environment, everyone is so friendly. I had a great time there, definitely will visit again with friends"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d18tZi1nRRAB",
            "text": "When God lead to a place , that mean it time to check it out.\nI was searching for café  in middletown, ny and I found one. I check out everything before I went. It was where God want to me to go. The food, atmosphere and service was great. I went back not just once but twice in the same week. I try something new. My belly was full. I had to take rest of the food home. I  going let my other friend know and hook them up.\n\nIt was blessing to be blessing!\nPlease come and support this cafe. If you can not  cover them in  your prayer, it  is ministry."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbmYzb0dnEAE",
            "text": "This place has amazing food and the owner is super nice person puertoRican food as well definitely worthwhile highly recommended"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneWN1VUVnEAE",
            "text": "I purchased a trifongo with beef, and 2 alcapurris;  both were delicious. I really enjoyed the food. There is a very friendly staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMzZfVlVREAE",
            "text": "What a wonderful and peaceful place to sit and dine with warm hospitality and a loving atmosphere.  The food was delicious, reasonably priced and came out quickly.  More importantly, this is a restaurant where the presence of the lord is.  It is literally on church property.  Good for the body and the soul.  Stop by the One Way Cefe!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBX2JiRXFBRRAB",
            "text": "Awesome egg, cheese, lettuce, and tomato on a bagel, and kind service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dGRQdnZnRRAB",
            "text": "Pizza was delicious, staff very friendly. Beautiful atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LXZQTHp3RRAB",
            "text": "Places looks super clean and great!. Would love for you guys to be open at earlier for breakfast. I drive trucks and work early morning and would love to have food here!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ME56TmdBRRAB",
            "text": "Found this stop on Too Good To Go. Received two slices of pizza and a pin wheel. Great food and friendly owner. Thank you!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ME96MHN3RRAB",
            "text": "Super cute cafe. Had the pleasure of talking to the owner. Him and his family have a beautiful establishment and they were so gracious and kind. We got cheese steak pin wheels that were delicious. They said it was on of their first times making them for sale but they could have fooled me because they were so good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cmVhQ2NBEAE",
            "text": "Hubs and I stopped in for breakfast this morning (12/13/24)! We were speaking with the owners who were talking about how they started the business and it’s opening only eight weeks ago; and some of their upcoming events. The latte was delicious. The menu has a nice variety of items on it. I had egg, cheese and bagel. He had an omelette, home fries, toast and coffee. Everything was excellent. We are looking forward to going back again. Next time we’re going to try the dinner menu."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeVkySzFRRRAB",
            "text": "From the moment I walked in I was greeted pleasantly by the owner and staff. The menu was quite large in variety, with its cafe and lunch items. The staff made me feel at ease when ordering which was nice, I didn't feel rushed in the slightest, which a lot of places intentionally do. The Food I ordered was priced well and was big enough to feed two people. The quality of the food was shown by how fresh and flavorful it was especially how well the cheese melted together with my stake hero.\n\nEdit: I blindly payed too much for a meal here, but it immediately fixed upon (them) discovering it was too much.\n\nThis is a positive, some places will happily let you walk out paying way too much"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQblBtVWN3EAE",
            "text": "Welcoming and friendly staff. I wouldn't ask this of them but they stayed open just to serve some very cold customers after partaking in the Middletown black Friday parade. Great memories and worth visiting any time for some great food!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNDZMdGdnRRAB",
            "text": "Delicious  food! Great atmosphere, such a charming cafe! We have so many menu favorites. Convenient parking too. Mushroom and onion cheesesteak is a must! Yum"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd2VHTnJRRRAB",
            "text": "Good.  Food nice service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcDdTQXJ3RRAB",
            "text": "One Way Café was awesome. Food was delicious and very friendly atmosphere. I will definitely be going back!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbzRPWHdnRRAB",
            "text": "A beautiful quate place the food tastes home cooked and the prices are affordable."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbzUyTDNBRRAB",
            "text": "Cute little place, amazing food, everything is fresh & wonderful, great prices for the quality! :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzellpVm53RRAB",
            "text": "I love this restaurant! The food is delicious and the atmosphere is calm and peaceful. The owners are really nice and helpful. May God bless and prosper the OneWay Cafe and pizza."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcWFLQnpBRRAB",
            "text": "Beautiful family owned cafe. Inviting atmosphere, good prices, and good food. They give you a nice portion for your money as well. Try the cappuccino. You'll enjoy it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX3I2UTlnRRAB",
            "text": "The onewaycade has excellent food and service. It is a place where you can come have a delicious meal in a very tranquil place. It is family oriented and kid friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN19TbjdnRRAB",
            "text": "Pleasant admesfer excellent food .  Kid friendly , family oriented .😊👍"
        }
    ],
    "reviews_count": 34
}