{
    "name": "Lo Nuestro Mexican Bistro",
    "place_id": "ChIJlbMUTQQzw4kRs-DsGTmvDbk",
    "grid": "BX5",
    "address": "180 Monhagen Ave, Middletown, NY 10940, USA",
    "rating": 4.8,
    "user_ratings_total": 48,
    "phone_number": "(845) 239-4053",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMVlWVndWelZHZGs4Mlh6RnBVSFJLYjNaWmVYYxAB",
            "text": "everything was fresh and authentic. good service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaWJUZHhkMlptWkVWWlVIcFlTbEJRZUZsTlpHYxAB",
            "text": "We were visiting family in the surrounding area. It was our first time in the Middletown area and before we went we had the impression of it being kind of a backwoods small town without much going on. Therefore, I have to say that finding this restaurant was a really big surprise. Not only were the food and service great but it was quite authentic and not your typical Americanized Mexican food. I don’t claim to be a Mexican food expert but I have had many business trips to Mexico. The food they served was definitely freshly made. Not overly cheezed up like most other “Mexican” restaurants across the US. The lady was also very friendly.\n\nWe ordered all different flavors of their agua fresca in large cup size, and they came in these huge soup takeout containers 😄 and they tasted so good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRk1tZEtUbVJVUjNJek1YTklXRGh2ZG1kTVVVRRAB",
            "text": "I had 2 steak, al pastor, and 1 shrimp taco with a glass bottle coke to wash it down.  Al pastor & shrimp tacos 10/10. Although the steak was good it did lack a lil flavor I'd give it like a 7.5. Beautiful atmosphere 👌🏾 . The service was wonderful. The lady who took my order made sure I had everything I needed plus continuously checked up on me."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUDEtOEt3bFltdzR3RRAB",
            "text": "This is my boyfriend & I’s go to Mexican spot in Middletown. The gorditas, tacos, and tortas are always perfect & decently priced. The service is always friendly & the atmosphere is calm. The place is smaller inside so perfect if you don’t like a big over crowded restaurants. We always end up coming back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX2h3UFd3LU1hWEFREAE",
            "text": "This is restaurant is a must!   The food was absolutely amazing!  Real authentic Mexican food !   The restaurant itself is super clean. Anyone can tell they take a lot of pride in their food and restaurant!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX0pUblV3EAE",
            "text": "This restaurant is cozy, and the service is excellent\nHave many varieties on the menu. We had the enchiladas Suisas y fueron hechas como en casa. Also, they make your fruit drinks on the moment so they taste fresher.  No alcohol yet, but we were told soon they will have the license.  So if you want to have a good meal just like home.  This is the place, enjoy 🍻🍻🍻🍻🍹🧋🍽🍽"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eHFqODlRRRAB",
            "text": "Food was good. Friendly staff!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOHR2Y2NBEAE",
            "text": "Les recomiendo este restaurante\nSon amables\nMuy buena comida"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOHR2NEtREAE",
            "text": "Bathroom clean and the food was amazing best Mexican food I’ve had. I recommend it a lot."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOHB2RklBEAE",
            "text": "Les recomiendo este Restaurante mi gente es un restaurante muy bueno"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbHVmalNBEAE",
            "text": "I was really in the mood for an authentic tamale and this place really delivered! They had all different kinds but my favorite was a traditional pork. The chicken with green sauce + the chicken with mole sauce were also exceptionally good. I would recommend this to anybody who loves Mexican food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NTZxN0xnEAE",
            "text": "Amazing and authentic Mexican food. Place was a bit cold cause the heater was broken but the food was so good we forgot  about how cold it was 😅"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dzltSDRnRRAB",
            "text": "First off, shout out for the bathroom being so clean. The bathroom smelled divine. The hand soap was actual good soap, I still smelled it on my hands with my hands down on my lap for some time after using the bathroom. If the bathrooms are that clean, you KNOW the restaurant behind closed doors is clean.\n\nThe food was very good. I got the gorditas and 1 taco birria. I wished the gorditas had more meat inside. But the sauces were amazing, and the homemade nachos & frijoles that came complementary were great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLXZuOFh3EAE",
            "text": "We came here because a friend recommended it , so good!, The restaurant felt very homey and cozy, everything is really clean and the staff is really kind and welcoming!, as for the food its truly authentic Mexican food, the flavors are amazing and the enchilada was delicious!! If you are in town you have to stop by this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidnRtMXdBRRAB",
            "text": "Unexpectedly amazing! This place has a cozy feeling and balbenia is super nice.  The food tasted really clean so we went there for a second time. She actually made adjustments to the menu for us and is really sweet. If you’re in town, come and experience the authenticity and home felt vibes!\nMy wife is gluten free and vegetarian so we got her the Gorditas (customized)  with added black beans and she loved it!\nI opted for the quesabirria and IT HIT THE SPOT!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicHJELWNBEAE",
            "text": "For a “Mexican Restaurant” food options were extremely limited and the quality was very much lacking considering the High Prices. Service was quick and always making sure we were content, but the general Atmosphere of the place was eerily quiet with    empty tables and no music playing, with the occasional sound coming from the kitchen."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeEk2VDdRRRAB",
            "text": "Good authentic Mexican food.  A nice change of pace is that instead of the usual chips and salsa you get chips and black bean dip.  The melon agua fresca was superb.  The gorditas with chicharrón were delicious.  The steak tacos come in home made tortillas with very good steak, although it seemed a little salty to us.  May have been a one off.  Parking is tight here only appear to be spaces for two cars in the front of the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN0l5b2h3RRAB",
            "text": "10/10 tacos are amazing !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcHFPSmlBRRAB",
            "text": "Great food and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdi15bXh3RRAB",
            "text": "We stopped in on a bike ride and the food was delicious!! Fast, friendly service as well, we'll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREa19UMVZBEAE",
            "text": "Love, love, love it here. The staff is always so warm and welcoming and the food is on point.  I don't know why it's never busy in there. The food is excellent. Maybe a lot of people don't know this little restaurant even exists."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdk5MUnVBRRAB",
            "text": "Excellent food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OU03dUdBEAE",
            "text": "best mexican food i eat in town, and the waitress is very friendly. i totally recomended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOenRpVFJBEAE",
            "text": "I had been wanting to try this place for weeks and my husband and I finally got around to trying it this week. Everything was solid. Before our meal, they brought out a small bowl of black, refried beans and chips and my 7 year old thoroughly enjoyed the beans especially. The Al pastor tacos were served stuffed and they were some of the best I have had in Middletown. The service was also top notch.\n\nIt is definitely worth a stop in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMlBMZXdRRRAB",
            "text": "Just delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdjlDSGtBRRAB",
            "text": "Wonderful experience. Will eat there again"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cU9TTzlBRRAB",
            "text": "Los tacos de birria te hacen sentir como es tu país bien rica la comida"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabElDTGNREAE",
            "text": "We stopped here on our way to play disc golf in a nearby park. The complementary chips and dip at the beginning of the meal was great. The food was delicious, full of flavor and the hot sauces were perfectly spicy. The restaurant was very clean and nicely decorated.\nMilkshakes were an added bonus."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcmRhR053EAE",
            "text": "Good old authentic Mexican spot. Came here because of work. You want delicious original mexican food in the middle of nowhere, this is your spot. You know it's real when maybe only one employer speaks English lol."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdEtHQWh3RRAB",
            "text": "Buena comida autentica mexicana"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaC1MQkdBEAE",
            "text": "Came upon this wonderful restaurant in Middletown coming from Monroe and I had the most amazing experience here. I ordered their birria tacos and the amount of flavor was incredible!!! One of my friends ordered their salmon and another friend ordered their torta de milanesa de pollo. Their food portions are HUGE and definitely worth the price. I truly enjoyed my experience at Lo Nuestro and will definitely be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcV82Wm1nRRAB",
            "text": "We ordered the half roasted chicken with Mexican rice and the birria tacos and didn't love either. Just felt the flavors I was expecting were lacking and the dishes were kind of bland."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNGY3bElREAE",
            "text": "Incredible authentic Mexican food! Sweet family own & operate this place and the tacos here were the best we’ve had in Middletown and better than many places in NYC & beyond. The Birria tacos won’t disappoint and are served with consommé as is traditional. The guacamole was freshly made and seasoned perfectly  & the Al Pastor tacos were wonderful as well! Friends had two other dishes & the shrimp were filleted beautifully and were enormous! Sauces were delicious, and the housemade tortillas were just perfect thickness & flavor! Plus prices are incredible. We’ll be coming back many more times!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bGZDQTh3RRAB",
            "text": "Nice Mexican food right in Middletown. Great food!!! Mexican is delicious. Tacos and burritos all day. Would highly recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSemEzMU1nEAE",
            "text": "An authentic Mexican restaurant!! The tacos al pastor and carne asada were delicious.  The red and green sauce had the right amount of flavor and heat.  I Highly recommend you give this place a try. You won't be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoXzk2Y3ZRRRAB",
            "text": "Walking by and decided to take a look. So happy i did. I got an horchata and a chapurado. The horchata was REAL horchata and it was delicious.!!! She offered a concha and of course i said yes and WOW!! I have found my new go to place! The place is beautiful too! So glad there’s something on this side of town!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM19hNS1BRRAB",
            "text": "What a great Mexican restaurant Burris tacos was authentic and really great also had some  fried octopus was also great. We also had some really great pastry."
        }
    ],
    "reviews_count": 37
}