{
    "name": "Piccolo Cucina e Vino",
    "place_id": "ChIJwTkfL4gyw4kRXIDAWvm88nk",
    "grid": "BX5",
    "address": "17 North St, Middletown, NY 10940, USA",
    "rating": 4.7,
    "user_ratings_total": 473,
    "phone_number": "(845) 343-2233",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU01WaFlkR1ZUYW5OT2VHOXBOakJZZG1jM1UxRRAB",
            "text": "Best food I have ever eaten! Hands down a great and wonderful place from the food to the wait staff, everything was perfect."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V1N6RlBjbDl6Tm01MWFWWlZiM1JSZEVOc00yYxAB",
            "text": "Beautiful dinner with friends. Chammel met our every need.   Nice people, DELICIOUS food.  Every dish was so tasty!  Squash ravioli, rib-eye steak, linguini and shrimp, and chicken with fresh cavatelli.  Everything was fresh and delicious.   We can't wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0blYyZDBabGgyU21aemRIWkVSR2xHY2xScGMxRRAB",
            "text": "The food was very good. The waiter terrific. Will come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVNITkNWSFJZU0dkR2FuWjNVbkpITlhwVVEyYxAB",
            "text": "Great food make your own pizza is awesome best in middletown, everything is fresh. Great variety of items on the menu all Great chioces,they value quality.  They make the best wine sangria drink in town nothing compares.You get what you what you pay for and they truly deliver."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLVR4UDJiOXVUc29nRRAB",
            "text": "Outstanding meal. I loved every single entree"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnI3ejRRRRAB",
            "text": "Great food and friendly service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDl2TEh3EAE",
            "text": "Excellent dinner, service and wine!  Huge portions.  Deserts are not that great.  The red velvet cake was terrible!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bVpLR2JREAE",
            "text": "Good food, good service, good music and good vibes. We went on a Tuesday afternoon so it wasn't crowded, but I agree that seating can be limited."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTQyX2pnRRAB",
            "text": "Yum!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnd19lRGRREAE",
            "text": "Super cute place ! The service and food was amazing. Will def come again ! Must try."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdzVmd25nRRAB",
            "text": "Stopped in for lunch after stopping st Well Worn Book. Amazing wine selection"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfZ3VUTGlBRRAB",
            "text": "I rarely leave reviews, however, this place deserves an award for their authentic Italian atmosphere and food. It is so hard to find a true Italian place and I somehow stumbled across Piccolo randomly one day while looking to order a pizza. My absolute new favorite Italian restaurant. From someone who has had family members who own Italian restaurants, this place hits the nail on the head with everything!!! Absolutely love it here and highly recommend\n\nOnly tweak i recommend is on the sandwiches to add a bit more to the center. The panini bread seems to overpower the taste of the actual sandwich due to not much being in the middle."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmejQyUEx3EAE",
            "text": "Everyone has to try Piccolo’s Lentil soup! Its sososoooo good"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eXJqVndnRRAB",
            "text": "The food was delicious, waiter was patient, kind, and efficient. We had a very active toddler with us, so, you know, it could have gone very differently."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdzhPV21RRRAB",
            "text": "It was delicious, definitely coming back, and the service was excellent!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGYtZzRnRRAB",
            "text": "The server Shamir was excellent. Overall, the experience was brilliant and very, very good. I will recommend this restaurant to anyone."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcW9MSHVBRRAB",
            "text": "Beautiful place, the food was amazing. Service was not so good. be more attentive and check up on your tables."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5enVQTDBnRRAB",
            "text": "Absolutely delicious and amazing customer service 😋 Highly recommended!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc2J6cWZBEAE",
            "text": "The Pumpkin Chai Latte & Fig Pizza were delicious! The service was friendly. I’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIME1TNTFRRRAB",
            "text": "Great menu choices lovely setting and pleasant wait staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyemZLU0JnEAE",
            "text": "Piccolo is an incredible gem and amazing asset to the Middletown food and wine community.  We had an absolutely delicious meal, paced perfectly for relaxing and chatting. The service was excellent and very authentic - our server was attentive, kind, and friendly. If you haven’t been yet, you’re missing out. If you have, you know how fantastic this place is. 11/10 - we can’t wait to be back. Thank you, Piccolo! ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeXFQSXpBRRAB",
            "text": "The place is really quaint. Had a wonderful time. The only thing is that they didn’t serve pasta during lunch time. Otherwise, everything else was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb1B5S3BRRRAB",
            "text": "Amazing place❣️ Fabulous food. Fabulous staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdUt5UVZ3EAE",
            "text": "Go there at least once a week.  Love it! Recommend everything on the menu.  It's all terrific!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbHI2WElBEAE",
            "text": "Great food, staff was very friendly and the atmosphere was very relaxing."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBM29IWllBEAE",
            "text": "excellent food and atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdDk3dkV3EAE",
            "text": "Food was amazing. But the service was better. Our server (shemal) was funny, great recommendations, and overall just amazing. Made the evening pleasant. Highly recommend. Pumpkin cheesecake 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObnBiakNnEAE",
            "text": "Soo fresh and so good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcVBHZ3lnRRAB",
            "text": "We always enjoyed coming here when it was \"Something Sweet\". Anna made the best apple crisp ever! Now that it's Piccolo, we love it even more! The soups are ALWAYS amazing, and the new menu is 10/10. The Italian Chicken Stew is out of this world, as well as the Butternut Squash Ravioli. Anna, you are not only an incredible baker, but an amazing cook!!! This is on our regular rotation - highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWek9IaUh3EAE",
            "text": "The owners are totally the most unpleasant people  in the world. The place was very busy, and they did not even welcome us.\nGood coffee and pastries excelent service by the waitress, but i have 2 businesses, and every person at my stores is acknowledged  and welcomed\nSo you dont have the right to feel like everything  is the waitres' responsibilities\nReal small business  owners play a role in making the business, and the people welcome\nI was planning to come back for beers, but it was not worthy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbUtlcXR3RRAB",
            "text": "This place is great. Wonderful food and great service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdHJxalZREAE",
            "text": "Excellent service from Shamal!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1LUpxWk9BEAE",
            "text": "Being from out of town I would recommend this place to ANYONE. The food is insane, atmosphere is exactly what I was looking for at the end of the work day, but the staff behind the bar was the best part. Sad to be leaving town solely because this place was so great!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaHRuV3p3RRAB",
            "text": "Excellent food, the Servers were very knowledgeable and so friendly. When in Middletown definitely give this place a try. 😊"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodUlQeVNREAE",
            "text": "This place has outstanding food and for dessert, the toffee cake is off the wall!\nHighly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbk11ZmdRRRAB",
            "text": "Piccolo Cucina e Vino has become one of our favorite places to dine. The atmosphere, the food, the service is superb. We stumbled with this place by accident when we were left waiting for service at a near by restaurant. So, in my world this is a happy accident! The staff is so friendly, courteous, and you are always greeted with a smile; especially from Shamel. The combination of flavors will leave your palate wanting some more. Go for the weekly specials, those have become a favorite of mine. My husband goes for the classic plates on the menu. Either way you  will not be disappointed as the chef for sure pours her heart and soul into each dish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNUpDQk53EAE",
            "text": "Great Italian Restaurant! Reservations are highly recommended as they are small.  Selection of wines is incredible & food is delicious. If you are ever in Middletown, NY, stop in for lunch or dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OWJibE9nEAE",
            "text": "The only thing I can complain about is not having a child's menu for the kids.  About anything everthing was great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd2N6TW1nRRAB",
            "text": "My mother and I had a wonderful lunch here. The place is beautiful and the food is amazing. Little Gem in the middle of town."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeWRMa2VnEAE",
            "text": "Cute spot! It has indoor and outdoor dinning. Prices are reasonable. Service is great! Hipster/chic vibe. Would recommend!\n\nStreet parking available!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdG96M2JBEAE",
            "text": "Perfect date place also in area walkable with stores that lined the street , easy to park they had wonderful staff nicely decorated place just keep in mind dinner is not served until 5 we went at 4 and could not get any plated food ( pasta) only sandwiches or paninis. I definitely will return again after 5 for dinner and try some treats."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaTVfNlB3EAE",
            "text": "We had a lovely dinner here. The dining room is small but lovely. The waitress was very nice. We had the Caponata. It was good. The bread is quite tasty and served with whipped garlic butter. I had the Pescare. It was delicious! The scallops were cooked perfectly! I asked if I could have the roasted potatoes instead of the rice, and they were very accommodating. The potatoes were exquisite. My husband had the Risotto, and it was delectable. We had a Chocolate Chip cookie for dessert. It was soft and yummy. I highly recommend making a reservation. The dining room was filled with patrons shortly after we arrived. I hope to return to Piccolo soon. Enjoy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWI3cnRBRRAB",
            "text": "Spectacular spot, NYC upper west side feel. Marvelous service and entrees are top notch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocE52dVpBEAE",
            "text": "Smaller place. Not somewhere to feel relaxed when it gets busy, people are just loud. Food is great. No hard alcohol."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobl9EVXN3RRAB",
            "text": "We’ve been twice- once at the bar for happy hour and once for dinner. The people are super nice and it’s really cute inside.\n\nVisit 1: The happy hour small plates were exceptional, great prices and high quality food. We got the eggplant rollatini (SO good) and the shrimp. Both were amazing and I’d absolutely order again! It was PACKED there, we were able to get two seats at the bar but all tables were full and lots of people were turned away because they were so busy.\n\nVisit 2: We made a reservation for 5 pm on a Friday and were the first people in the restaurant/probably didn’t need a reservation. We ordered the Mediterranean small plate to start which was great. For our mains we got the shrimp linguini and the fusilli. Both were good but not amazing and not really what we were expecting with the upscale dining vibe they’re presenting- definitely something I could have made at home. We also got sticky toffee cake for dessert which was great! We will absolutely be back but I think we’ll stick to the small plates."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoamJyRTBBRRAB",
            "text": "Delicious food. Unique menu. Need to hire more waitstaff and have food and drink specials. Steak should come with patatoe, not just veggies."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLLXZlZ0FnEAE",
            "text": "Incredible food. So much variety and so many unusual food combinations, including vegetarian options, that you know that person in the kitchen must love cooking. So. Much. And also, cooking for people with all kinds of tastes. Beautiful atmosphere. Delightful, not too sweet desserts. What an amazing find!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4NHJTc1pnEAE",
            "text": "This is the first dine-in restaurant we ate at since the beginning of the pandemic. I ordered the hummus plate and mushroom risotto while my fiance ordered the crab cakes and the scallops. Hummus was great! Crab cakes can use a bit…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5N0lfdHpBRRAB",
            "text": "Located on a narrow street, and is not good on parking. I suggest parking behind the DMV, and walking back. It is about a block or so. Most of the desserts are a bit pricey, but I am sure they are all good. The Apple Crisp is AMAZING!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cUtXaDZ3RRAB",
            "text": "My husband suggested we try somewhere new for date night. We loved how quaint this sweet little place was.\nThe service was amazing and the food impeccable.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdkwzTWRBEAE",
            "text": "This cafe conveniently located at downtown Middletown, in a nice old corner building . Have both indoor and outdoor tables. We came here after dinner, so just got desserts. They were yummy. We decided to come back sometime and try their lunch/ dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtanFQWktnEAE",
            "text": "Went there to have a coffee and some snacks.\nThey have a fairly large menu, will be back for more!\nPlace is very nice, warm and friendly.\nThe big bar at the entrance is a concept that I personally appreciate.\nOutdoor /patio is well kept. 👍🏼"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOVBYb1ZBEAE",
            "text": "Super yummy with a nice interior and a colorful outside terrace area. Plenty of good pastries and healthy food. The tea and coffee were very well crafted. Enjoyed it very much."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNva2MtZFBnEAE",
            "text": "Cozy place in the center of town. Nice wait staff. Interesting soup choices and the artichoke dip is out of this world! Great for lunch or just coffee and a snack."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwOHNEcUJREAE",
            "text": "Great Find in the heart of Middletown! Stopped in on a Saturday night for dinner with the husband! We were seated right away and our server was super sweet! We sat in the enclosed patio and we felt like we were eating in the middle of…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzME9EazdRRRAB",
            "text": "My boyfriend and I are so happy we stumbled upon this beautiful cafe for dinner tonight! The ambiance was sleepy and cozy, the staff was wonderful and friendly, and their dinner food was just as delicious as their bakery goods and desserts!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM01xcy13RRAB",
            "text": "The food is amazing! Very friendly staff. A true gem in downtown Middletown!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMjh6Q0ZnEAE",
            "text": "Nice clean little place. They have a variety of sweet treats and sandwiches. I like their Roast beef melt on multigrain bread."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0anJ1Q2R3EAE",
            "text": "Great Service! Very nice atmosphere! The food has definitely improved since I last visited several years ago. The dinners are wonderful, the hanger steak was cooked to perfection. Appetizers, desserts, coffee and almond hot chocolate was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eUxXTFNREAE",
            "text": "Everything my husband and I tried was beautiful, unique, fresh, and delicious, including the peach spritzer!! So fun! Couldn't make up our minds on which desserts, so we got several to sample at home.  We were never disappointed with Something Sweet, and Piccolo Cucina continues the commitment to an excellent experience. Highly recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdktxUjNnRRAB",
            "text": "Had lunch and dessert here. Ordered the turkey & brie BLT for lunch. It was pretty good. The salad had candied pecans which was a nice touch.\n\nFor dessert I ordered the petit gateau. It was vanilla flavor that day I believe. Was disappointed with this one. The cake was quite dry and not much flavor. Chocolate coating was good though.\n\nService is good overall. It has a nice ambiance and is well decorated."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNW95SFpBEAE",
            "text": "Something Sweet is always good! And the best part is the vegan cupcakes! I'm allergic to dairy and I love being able to have delicious sweets that won't kill me. It's tricky to have great vegan cupcakes but they certainly pull it off. The food is great too!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDOU5mRUt3EAE",
            "text": "Absolutely Delicious!!! This place is quaint, cozy and intimate.  It's a great place for a date, family or hanging out with friends. The desserts are scrumptious. I have been here several times over the years and the quality of the food and service has only gotten better. And You're not just limited to dessert, they serve food too."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneXFHdzFBRRAB",
            "text": "Great coffee, delicious looking pastry, nice French and Italian inspired food menu. It's got a great atmosphere and the solarium is cozy and warm in a cold day. A little punchier flavors would be nice for contrast, but very tasty overall. New favorite coffee shop."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZdE8zT0lnEAE",
            "text": "I have gone here a couple times, for a quick cup of tea, to pick up an order, and to sit down and eat a meal. Food is satisfying and delicious, staff is super friendly, and there is a patio area to sit in that is climate controlled. They…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdDlqUDh3RRAB",
            "text": "A hidden gem in Middletown! From the staff to the amazing food, it is truly like you stepped into any trendy nook in your favorite city. Super friendly staff and yummy food from lunch to dinner to treats. Sit out in the glass dining area and order the Mediterranean spring platter. Yum!! Great place with lots vegan items."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZa3JYQ3NnRRAB",
            "text": "My favorite restaurant. I love the menu and all the sweet treats. It’s great to sit on the patio and enjoy coffee and dessert or come for a nice dinner. Very clean with attentive staff and great atmosphere. Highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5N0lIaDdRRRAB",
            "text": "Absolutely delicious every time. Love that they have good healthy lunches AND a great selection of desserts. I took a chocolate tart cake to this last Thanksgiving and it was the star of the whole meal."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0LTViN3l3RRAB",
            "text": "Quiet place. Great for chatting. Bring someone you love. Great food. Great deserts. Everything made in house. Good beer and wine list. All the food is very flavorful, including the deserts. Be prepared for you taste buds to go wild."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHd182WVpREAE",
            "text": "I haven't been here in awhile, and so I was pleasantly surprised about two weeks ago to see that they expanded into the courtyard. The food was as great as I remember. Great atmosphere too! You definitely need to check this out :)"
        }
    ],
    "reviews_count": 70
}