{
    "name": "HolyDog",
    "place_id": "ChIJ0eJBC2Iyw4kRPF8OjIFQapA",
    "grid": "BX5",
    "address": "44 W Main St, Middletown, NY 10940, USA",
    "rating": 4.9,
    "user_ratings_total": 830,
    "phone_number": "(845) 649-7495",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZek5DMTFNVFJoZWxsTlVHRlFTVkJUYzE5NWVGRRAB",
            "text": "Thank you for the recommendation Luciano(Herman) There are restaurants that feed you, and there are restaurants that transform eating into an experience. Holy Dog belongs to the latter. What makes Holy Dog good isn’t merely that it serves food; it’s that it celebrates food — elevating the humble hot dog from a fast-food cliché into something that feels reverent, inventive, and unexpectedly soulful. In an age where culinary trends lean toward the extravagant, Holy Dog stands out by making the ordinary extraordinary. It is a restaurant that understands that greatness lies in the details, and that comfort food can be divine when crafted with care."
        },
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTVkzcG5kRnBLWjBScVpGZ3RNVTlsUm5BeFUzYxAB",
            "text": "The absolute best!\n\nJesus 👑 that was a great dog!!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRlEzWmhVemxwVmtwa01tTnJORWhKZEZWek1VRRAB",
            "text": "Amazing place to visit, the BEST dogs I have ever had! Great guy! If you are ever in the state STOP HERE!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vM1pHUTBXVXhOWnpGWFYxbFBMV28zTWxkRmQxRRAB",
            "text": "The best hot dogs and sausage in the world. It'll leave you speechless. The line may be long, but the service is impeccable. Not too long and not too short. The staff is so friendly and it shows in the food and atmosphere."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTVlVZE5VSGxCTFRGVWVYbHRZMHBZYm5wVGRFRRAB",
            "text": "Phenomenal worth every penny"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200emJWWlVSa05rUlZaRU9EZHVTbTFOVGpoMlVsRRAB",
            "text": "Who doesn't love a good hot dog? This is hot dog 3.0!! Toppings insane. Chino fries a food party in your mouth."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVZURmtNV3RPYkhac09HRkNSR2swY1RZeGVtYxAB",
            "text": "I saw some video about these guys on YouTube and a week later work sends me to Middletown. I got there an hour before closing and they are out of fries, which tells me they must slay lunch. Got a be good, right? It was INSANE. I got 2 Chino dogs, and they blew me away. I even let one sit so it could get proper soggy, and it was great. The owner and staff were super friendly, and the dude has a personality bigger than the building. I eat a lot of dogs and thought I knew the best one to be in NJ, but this takes the crown. All bow down to the holy overlord."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWE1qWmxlSFZXWjJGV1RtWXlNMEZuUWpCSVRVRRAB",
            "text": "Chino and the auntie Vanessa who packaged my order were very kind despite the insane line leading out the door! I didn't have enough cash (completely my fault, so unprepared) but they gave me my order anyway. Shout-out to Eating with Robert on YouTube who brought me here 🩷\nCASH ONLY, the ATM is ancient 😄 but you will not be disappointed\n(Update: I came back to reimburse them and they hooked me up with a chicken slider. Amazing)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNGRWQkhhMlpOVGtoWlptWkJSM3BFYUdSM2NVRRAB",
            "text": "Short and sweet. This place is GREAT."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSVNGZG5VMWgwVVZKcFRWZERjelJGYldSVGFsRRAB",
            "text": "Chino is a total character and has a passion for hot dogs and sausage like no one in the universe! No pics of the dogs this time. Too hungry. Next time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWlpraDNRVlJWVGpWdVlXSmFWVFZ4Um1aNGNWRRAB",
            "text": "Next level hot dogs. Doesn't get any better than this."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQldWVnhUeTFyUlVnM2FYQlRhVjlzZGtGV1JIYxAB",
            "text": "Great food, friendly people, get the Chino Dog it's the best!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUGFHRXhRMU0yUnpCbE1GRnVXRWc0VlRWWlEyYxAB",
            "text": "\"The quest for the perfect glizzy has ended. I can finally rest.\" - Me\n\nThis place is a gem. Small, cozy, old school.\n\nCash only and worth it.\n\nArt comes in many forms, Chino is an artist at the grill, you can tell he loves it.\n\nThe vibe inside is relaxed and fun, can't recommend enough.\n\nGet the Chino dog, and definitely get a slider with it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVoxOXVTMWhNU0V4b2JHbG1WMVY1ZHpRMlUxRRAB",
            "text": "My only complaint is that the woman doesn’t change her gloves serves food handles money same gloves. People don’t get the fact gloves are there to protect the customer not to keep your hands clean 😢"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMlJIcEtXRFJ6UzIxcFVqUnhMV0pyTlVGUFExRRAB",
            "text": "Food  very  good\nPlp who work ther  very  nice\nBest  dogs  i ever  had\nAlso try\n\nSliders\nChicken sandwich\nSausage peppers onions\n\nMmmmmmmm"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjME9VaDZWV1UxY1VORFJYQlNhVUpJYjJaR1kyYxAB",
            "text": "🐐 this place is beyond goated. Chino is like if Bob was actually successful. He’s a regular old mushroom - that is to say he’s a fun guy.\n\nDefinitely try all the things named after chino - the dog, the fries, etc. If you yourself are a mushroom,  or you happen to find yourself there on a Wednesday, chino may offer you some off menu items. He is a wizard of the grill. Do not hesitate. It’s all hot dog based but the creativity is elevated. Iykyk."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMlV6aFplbnB6TTB4SVJFdHVOREYxV0dad1pGRRAB",
            "text": "Probably the best dog I've ever had. The owner was super friendly and was talking with every customer."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdldVdFNXakZTV2xGcU1qTkxkREpTZURGTlIwRRAB",
            "text": "Best hot dog place in New York, and the East Coast"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSlVsaFJPSEpXVWtacVNsOVhjRGRxUmpCMVgwRRAB",
            "text": "Zee best hot dogs in the east coast!! Sausage lol"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOYVVXZHNZVXRwT0hScE9XUmhRMkpoVTNGVlRVRRAB",
            "text": "What's to say. Chino makes amazing Dogs. It's a must visit if your in the area. I was on my way to Legoland and had to stop in."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU00ydGxhMmxuZWpOU1ZXZEhaa2MxWTFVNE9VRRAB",
            "text": "Best hot dogs and kielbasa we have ever had!  The Chino fries are amazing!  Chino dog, Chicago style dog, southwestern  dog, and French connection kielbasa…all so goood!  Dress appropriately for the weather, because the line for this deliciousness wraps around the little building."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMGQySmxRa05vVDNZd1UxVjFabWxJV2tSdlZYYxAB",
            "text": "If there was a patron saint of hot dogs it certainly would be Chino at HolyDog...  everything Chino cooked on that griddle was divine!  With more items on the menu that I was not able to try, I have been converted.  I must now make further offerings at the Church of Frankfurter!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGd1pWYzJRVVZ2VUd3NWNrcDROM1UwVkdGaFNrRRAB",
            "text": "Everything about this place feels welcoming. All the items on the menu were chosen with care, and everyone is welcoming. I drove 2 hours to get to this place off of a whim because I saw a social media post, and all I have to say is that it's worth it. It's a non traditional setup, but the second you walk in you immediately grasp how everything functions. The kitchen and dining area may as well be one in the same, 60 square feet, 30 for you and 30 for the staff. I genuinely don't know how to relay how I feel about this place, but what I should say is that the food is great, the people are great and the atmosphere feels warm. Not a lot of seating though, but even that's not a problem. The surrounding area has enough places to rest and enjoy your meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeGJEbHJka2hsUVdkc2QyOUJaQzA0UTBORmVIYxAB",
            "text": "I’m in the parking lot eating and I just needed to write a review this hotdog.. I didn’t know they could be this good???? Every bite is like heaven to me taste buds and I’m a dramatic person but I’m being so for real beat hot dogs I’ve ever had I’ve gone twice now I got the danish dog and now the chino dog it is $5 for a specialty hot dog and no one else is doing hot dogs like they are get in your car or on your bike or with your own two feet and go get a hot dog"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWWFrRXRSMHRWV1RBdFQzVlhTemsyVkY5d1ExRRAB",
            "text": "Apparently doesn’t close at 3. Closes whenever they want. Don’t go out of your way for it. May be closed. Can’t speak to the food since I didn’t have any"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkS1NERjBiMWR3YkUwNU4wNXVTMUYyVjBST1RrRRAB",
            "text": "As real and honest, so the consumer knows. Very small , almost no place to sit. Very smoky with poor ventilation.  You may have to wait outside. That aside, its a little pricey and be warned...cash only. Limited hours and when the food runs out, its done. Nuff said....the chino dog was slamming,  topping flavors are awesome. The \"girlfriend treatment\" dog was sweet sausage and another favorite. Overall I would eat there again, and say it was worth the trip."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeVQxb3daV0ZKVG0xSlZqSnNPR0kzU1c4eFduYxAB",
            "text": "Great hot dogs n sausage.  Real snapper with a nyc feel. Wait time is long but expected with great food."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relNtcHhSR0YxTjFsM1dteDBNbUYwUjBjeFUyYxAB",
            "text": "The only name acceptable is HolyDog.   Such a fun place to go to. The hot dogs are amazing. So many different things to choose from.  Seems like you could go back every day for a year and have a completely different meal!!!!  love this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa2FEVkRWelJmYUVjd1VGODFWR05wTjI5R1VsRRAB",
            "text": "Always worth the trip.   Great sausages.   Great service."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdzkzVjFRRRAB",
            "text": "Ahhh this place... delicious! You can taste the heart and charisma the owner cooks with in every bite. Being gluten-free, the owner easily changed my order to exclude the bread. The kielbasa was outstanding, he joked that it was the best and of course with a last name like mine I chuckled but the flavor and herbs he used knocked it out of the park. You want real food- skip the large beer “bro” establishments to eat at around and give your money to a business that puts their soul into cooking."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWlMycGxlRTB3VDBSTFVuQTFSVTkwYjJsYWFrRRAB",
            "text": "Found this place by accident and it was AWESOME!  Literally the BEST!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1ZzV1SzhnRRAB",
            "text": "Anytime I'm in the vicinity of Middletown, I go to Holydog. So delicious. The brilliant food, the jokes that flow from the grill. You're one of the gang when you go to Holydog. You're in the team. Can't wait for a reason to go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNVRWSnBlVWxKUVhaQlJGWlJYMlZOU1hCbmJYYxAB",
            "text": "Gino is a great guy. The food is great from the hotdog to the sausage and pepper. It’s all good food and I highly recommend this place to anybody who wants a good lunch?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNGFHWjNOV1prZG1wT1lqWnJTVGM1VW5aTVpuYxAB",
            "text": "The owner is generally biggoted and close minded. I would not recommend eating here if you are any minority."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRWNUQlFSM2d6VTB0TWNDMVBiRzk1VlZKQlZGRRAB",
            "text": "Great atmosphere & hot dogs are delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cFNHaFdZbVJ5TTNweU9GbG9jRzF5YjBKZk5rRRAB",
            "text": "Closed August 21, 2025- September 8, 2025.\nEnjoy Chino, you deserve a rest!!!!\nMark"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVU1uTnVNMDlXV0hCcE5FOVFZamxWTjI0NWEyYxAB",
            "text": "Great place. Ordering and waiting in line is like being in a friend or family members kitchen. Tried a little of everything. Dogs and sliders were excellent. The garlic aioli served with the fries was excellent. Sausage and peppers were great as well. Its not just a hotdog shop."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSlJtdFFlRGhpVnpGSVR6SlZOVVJWTkRGd0xYYxAB",
            "text": "We were instantly greeted with a warm welcome and a smile from Chino. Dogs came out great with fresh, well-balanced toppings, and were some of the best I've had. The fries were delicious, and when I started looking back at the board, I was offered a burger slider; I'm not sure if they're always available, but I recommend trying one. There was also a special available for the day, not sure if there always is one.\n\nSeriously, what an awesome vibe. We could tell the staff love what they do, and we loved the food and overall experience. We'll definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaGJtTjNZelZqU2twemJrVmpRbE5GVkZGMU5GRRAB",
            "text": "Sausage, hot dog soecialty shop. Great friendly service. Fun experience, thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQmQyNDJVMlpPWldaWVpuUjVOVVo1YkZWbGVYYxAB",
            "text": "I have been a loyal customer since they opened and today my experience was so disturbing. As well all know they’re very busy which is fine but I came in and waited in line to take my order and a guy that just walked in behind my jumps in front of me and makes his order. So I walk over to where he was standing to put my order in with the cook and I give him my order and he waves his tongs at me and says well  everyone else is waiting. I proceeded to tell him that well this guy jumped in front of me and you took his order first. They usually are super sweet but today it was rude and disappointing. The lady was being very short and hostile with me. It’s unfortunate but I will not be coming back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVenNTRXFRRRAB",
            "text": "Amazing. Simply amazing..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVJXa3RjV0YwT1hWSlpIWjJZMTh3VXkxV2RsRRAB",
            "text": "Best hot dogs in NY, and that’s not even the best thing on the menu! Owner makes everything with absolute tender love and care, totally recommend if you want a unique and amazing hot dog or chicken sandwich"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVlXTjVhUzFIZFRCU01IWk9ia05SVm1GTlUxRRAB",
            "text": "Love this place! It’s literally a corner shack with a few stools under a window. The owner grills up the hotdogs or sausage right in front of you. No fancy menus, bathroom or even air conditioning, but the best dogs hands down!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMU1XWmpRbXQyY3pFemVVZEJRMlJETlVweE9FRRAB",
            "text": "Some of the best food of my life!! Owner has tons of personality. Good prices too! Worth it!! Go now!!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnb3REbDh3RRAB",
            "text": "My mother always said, \"If you have nothing nice to say, then say nothing.\" I will summarize in a couple of words a tasteless  and dirty kitchen and restaurant. Enough said. I will never go back. Clean it, and I may reconsider."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT2VFWTBOVFV6U0c1MVRUVTRYMVZ0V0dWbVRHYxAB",
            "text": "Fast & wonderful Sabrett dogs. Great topping & service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMk1VVkVPVlJSZG0xQmNFVm1jRzFHWlhGWVpWRRAB",
            "text": "The best hot dogs in my life!❤️\nEvery bite was a burst of flavor!\nThe atmosphere was fantastic – relaxed, friendly, and full of good vibes.\nThe staff were warm and welcoming, and you can tell they’re passionate about what they do.\nChef gave us an extra portion. That was really nice🤗\n\nIf you're in the area, you absolutely have to stop by – it's so worth it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaVpWb3lhelZMUkRKd2NFSm9RbkI2TVZJdFdFRRAB",
            "text": "Man I’m from the city and I HAVE to come up here at least once a year for the dogs, burgers, the owner. They’re such amazing people and they have the best hotdogs I have ever tasted in my LIFE. Hotdogs that’d make Joey Chesnut slow down and enjoy the masterful craftsmanship of these hotdogs. If there was a way for me to place a crown on this establishment I would. I tell everyone about this place because I need everyone to experience what I have"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM2JtNVhRVXRvY25kWVQyVk9XSFp6UkRSSGQyYxAB",
            "text": "We just ate here and everything was amazing, especially The Girlfriend Treatment — hands down one of the best hot dogs we’ve ever had. The flavors were on point, super creative, and the quality was obvious in every bite. Holydogs isn’t just about food — it’s about fun, good vibes, and bold flavor combos that actually work. The staff was welcoming and the service was fast. If you’re thinking about trying this place, do it — and definitely don’t skip The Girlfriend Treatment. We’ll be back for more!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJanBxcmF0ak96UldBEAE",
            "text": "The best hot dogs in NY! The chef gave us a free hot dog on the house it was outstanding. Easily the best hot dogs I’ve ever had. Must try!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2enBidkF3EAE",
            "text": "We have eaten here many times and love it so much! The ingredients are super fresh, the flavors and combinations are expertly put together, and the owner is a true showman who clearly loves the food and sharing it with the community. The danish dog is my favorite, and my husband loves the Italian sausage with onions. Even the basic chili dog is better than average, and his inventive sauces add so much flavor to the dogs that they can’t be replicated anywhere else. The building is small and it’s crowded and dingy and sometimes smoky inside, but we truly feel that it adds to the charm and makes the experience even more unique. Just go - you’ll be so glad you did!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueDV6dnpRRRAB",
            "text": "Oh my goodness, the hotdogs were exactly what I would expect to find in New York.  Made to order so every order is fresh so there is a little bit of a wait but so worth it.  Great service and quick to take a order.   Thanks for the dogs!!!  There is a fee w seats outside, but that is to be expected in a small location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuak5UTGFREAE",
            "text": "Every now and then you find a place - this is it 😋 holy moly!\nPassing thru Middletown and needed some grub. First impression, gotta love it when the owner is it deep. That's passion for what you do. Turns out he's an artist and engaging you get drawn. Undecided on which dog, he prepped a Chino and hey, that was it. It's the moment I knew this guy knows what he's cooking. The owner also gave us a sample of an off  menu sample. It was a momma moment of goodness 😀\n\nOur group had the girlfriend (add the beans as suggested by the owner - super delicious 😋!), bacon wrap chili cheese dog, and the poblano dog (added the beans - hey why not).\nLoved it!! I'd definitely go back again and again. Yeap, it's unassuming and kind of just there but once you get pulled in - you won't regret it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3enR1ZmpnRRAB",
            "text": "Holydog in Middletown NY is a no frills, very small place with really GREAT food. You'll always find Chino the owner cooking, being very friendly and entertaining. Picture is a mustard & kraut dog and the Chino dog (suggested by Chino). A really delicious hot dog wapped in fried cheese and other spices."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMmRMamlBRRAB",
            "text": "What a gem of a place. Chino is the man, and the food is excellent. Cash only, but they have an ATM in-store for you. I'll definitely be back to try more of their offering."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiN3ZMWjhBRRAB",
            "text": "Holy Dog is probably one of the last known remaining facets of human prosperity since the beginning of man when God created Eden and his children; beings made in his likeness to cultivate his crop and be the seed of the new world: Earth. Not since birth have I suckled at such nourishment and splendor. THIS is sustainability manifest. I have never met a man in this lifetime to be a living embodiment of the holy trinity as much as Chino and all his blessings given to us mere mortals. 5/5 must eat again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdnNuT2dRRRAB",
            "text": "This place is so cute and you get exactly what you ask for. Hot dogs are great and service is great. Cash only tho (they have an atm inside if you don’t have any)!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMklDdjl3RRAB",
            "text": "Now, my all-time favorite hotdog spot! If I could award this place the Michelin star, I would. I don't know where to start so let's start with the buns. Just the way I like them, not dry, a little bit of sweetness and grilled nicely with a little bit of butter. Meats: Hotdogs (nice snap), sausages and hand-packed burgers (not too dense) are nicely seasoned. Great condiments including slowly grilled onions for the dogs and burgers (not jar stuff). We were so busy putting the food down our gullets we almost forgot to take a few pictures. We got a few dogs and sausages to go. All heated up very nicely over the next couple of days. And let's not forget about the terrific chef. Very personable and funny. Did I mention they are good hour and a half away from our home, but it was well worth the trip😁"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbTRHOGhRRRAB",
            "text": "My girlfriend wanted to try this spot because of the delicious smell that was circulating in the air while we were driving around downtown. We finally got at the location around 2 or so and I ordered the \"Polish Hawaiian\" and the girlfriend…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbFlEOFFnEAE",
            "text": "Very pleasantly surprised - that griddle has seen some things! Great variety of glizzy goodness as well as awesome sausages! Very recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCLWRleE9REAE",
            "text": "Closed on Sunday's. It's only open for lunch hours from 11-3 P.M. It's also basically a take out only spot. The owner was nice enough to provide a cup of free potatoe soup because it was cold outside. It doesn't look appealing, but it was very good in taste. The classic Franks cost $3.49. Specialty Franks cost $3.99. I recommend The Bacon Chilli Cheese dog is an excellent choice. The Southwestern Nacho Fries are a good compliment, but it is only good when it is freshly hot. At the cost of $6.49, eat that right away. Overall, not a bad spot for a quick bit for lunch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybzdDNXVRRRAB",
            "text": "Hands down the BEST hot dogs I've ever had in my life.\n\nI had a hard time choosing what hotdog I wanted so I just had a bunch if them. I had the Chicago dog, bacon and cheese dog, and the Chino dog.\n\nThe Chicago dog was their own twist on a classic and it was better than I expected. The flat grilled dogs really bring out the best tastes.\n\nI expected the bacon chili cheese dog to be standard as well but it was far from it. The bacon was crispy and the chili and cheese were fresh and flavorful. A nice treat coming from being used to gas station dogs.\n\nMy favorite of the 3 would have to be the Chino dog. I didn't see it on the menu but there was another tiny menu behind you when you walk in.\n\nStop in to a nice local joint for some good hearty and we'll priced lunch."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQN1BTczlBRRAB",
            "text": "This place is a hotdog heaven. One place if you are in Middletown NY you have to check it out.\nThe owner is super friendly and a great guy. We told him we were from Maryland almost about six hours drive. He gives us great suggestions and couple small simples. If you are in the DMV area you know about the DC famous Ben's Chili Bowl. This place is on the next next next level. Not even a debate. Each hot dogs here taste unique and delicious. People living here are so lucky to have this amazing shop. The owner is super knowledgeable and passionate about his craft.\nWe ordered a lot of food and waiting to pay for the food. The owner told us eat the food now before it gets cold. He said he doesn’t care about the money because he does this for the passion of the food. I wish everyone restaurant owner is like him.\nAnyway why are you still reading this review? Go check it out yourself."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURackxxaGp3RRAB",
            "text": "Down to earth/ good vibes/ comfort food at its finest. Love it.\nNeat menu, friendly and fast service, solid tasty dogs.\nLimited seating inside and dont be shy, ask for a fork if you need it 😄"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcE9hYnJnRRAB",
            "text": "Small local joint. No inside seating to speak of. Cash only. The hot dogs were great! I got the Southwestern dog and the wife got the Kielbasa. Both were great though the Kielbasa was quite a bit larger than the dog. We split an order of Soutwesthern Cheese Fries. Very tasty. If you're in the area, it's worth checking out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocDVqSm93RRAB",
            "text": "Holydog is a go-to in MTown!\n\nIt’s a sweet smaller food stop, cozy, serving a good variety of hot dogs.\nVery easy in and out, quick stop to grab a few hot dogs and be on your way.\n\nThe hours they are opened are very specific so just be aware of that.\nOther than that, enjoy your visit!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd2JpNW93RRAB",
            "text": "Amazing  food served by an amazing caring owner who makes you feel like a regular every single time! Food comes out lightning fast and the prices are super reasonable. Very little seating room but that’s part of the charm sitting next to two strangers on a tiny wooden bench using a windowsill  as a table. Absolutely love this place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRckxqZzVRRRAB",
            "text": "Had the best hotdogs here! My husband and I ordered almost every one except the special and the owner gave us it to try. That was our favorite! Would highly recommend for a quick bite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ3VEYVRBEAE",
            "text": "Possibly one of the best lunch spots in Middletown!! Made with love, very intricate flavors combos that work soooo well. Just try it as is,  don't add anything. Most favorite is the Chino dog. Very fair prices. Would drive an hr for this"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aGQzZkh3EAE",
            "text": "Stopped in for two dogs today. The owner was super friendly and a pleasure to talk to. He had just finished making his chili so I had one with chili and one with onions. Very delicious. The bench out front is for dining al fresco."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN1pxRk5BEAE",
            "text": "Great stop for a quick lunch when in Middletown🌭️ The owner is super nice, there are a ton of options, and the dogs are freshly cooked….However, the seasoning is really on the heavy side for me. Could barely finish one dog at once because it was too salty to handle😂I would recommend to get something that has kraut in it since personally I feel like it can the balance it out a bit :))"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bmFhZDNnRRAB",
            "text": "Holy Dog is the best hot dog joint in NY state, bar none. All of the dogs are made to order and the eclectic ingredients each shine through. My favorite is the Chilean dog, with the South Western dog a close second. And the slider just might be the best hamburger patty that I have ever had. I have known Chino for more than 25 years, since he owned the best Mexican restaurant in Brooklyn. His enthusiastic, kind and humorous personality hasn’t changed in all of these years. If you are within a 50 mile radius of this place, you really need to try these dogs. And bring your appetite, you will not be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MHJPeld3EAE",
            "text": "Was not at all prepared for how good these dogs were. The chef made us a special dog on the house too! Can’t recommend enough."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4el8yekp3EAE",
            "text": "From the OG feel this little stand gives you to the incredibly delicious food, you will be caught in a time warp to better days when food was soulful and love was put into it! The owner is interactive and will always make sure you are…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTMHVTZm9RRRAB",
            "text": "We went to this place for the first time last week and went back this week because it was so good. The food was delicious and the people were very friendly. This is definitely a place to grab a good lunch from. We will absolutely be going back to try some of the other menu items."
        }
    ],
    "reviews_count": 75
}