{
    "name": "Mt Hope Family Diner",
    "place_id": "ChIJW7dXhM201okRuuvx6xAOcv8",
    "grid": "BX5",
    "address": "1511 Mt Hope Ave, Rochester, NY 14620, USA",
    "rating": 4.4,
    "user_ratings_total": 1804,
    "phone_number": "(585) 256-1939",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbWJXdEJaazVSY0RoS1dYbE1jbUZyWlhVd2VtYxAB",
            "text": "Excellent!!!!!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMlRtTnhSemRtWjNkaVJsaGpRVzVLWDJSdUxYYxAB",
            "text": "Great service all the time!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ1N6QldZM1JPTldWb2R6Tm5kMkZoZDA1RWNGRRAB",
            "text": "Took about an hour to get our food. The waitress came with our check and only THEN realized that we didn't get our food at all.\n\nIn between, she didn't check to see how anything was going. Poor service for our visit doesn't come close to how disappointed my family were feeling. More like neglected."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUk1FWTFibVZMZG5CT2VuYzBSRGRCU1ZCamRsRRAB",
            "text": "a cute diner with great food and even better prices! our server, tyler, was incredibly efficient and served us with a smile."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVJHcGpRalk0Yld4M1JUSTVaV0o0YjB3MWVuYxAB",
            "text": "First time there...Great food and service!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcGVHMHhNVGR6VEdoWE9XWXpjVFo2VGpjMk1IYxAB",
            "text": "Great prices on super tasty comfort food. Servers always very friendly. Finishes a little dated, but hey it's a diner and prices can't be beat! When you can feed for for $50, enough said!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQlRtRlJaV1ZJU1haSmRXOHRjRTV5V0VVNE1FRRAB",
            "text": "The best place to eat in the US everyone need to eat there"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWlNWTm1abkE1Y1VNMlIwZzBOVXRNT1ZWd1pXYxAB",
            "text": "First time there and the food was not bad, but it was not the taste that I like. The cranberry juice was very watery. But the service was on point and the people was very nice."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSWQyRlFVMlJxWTB4clprNTRNVGx3Vkc5TmRHYxAB",
            "text": "We found this mom and pop restaurant on our way to the Rochester Airport. We had a great experience. Good food, good prices, and great service by Brandy. The proprietor was very friendly. We loved his words of wisdom.  \"Family is like peanut brittle. It takes a whole lot of sugar to keep the nuts together.\" 🤣🥰 I highly recommend a stop here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQlowcHBWR3RUZGxGSFowRkxXbkZWU1doQk1rRRAB",
            "text": "Everyone here is so nice and I love the chicken parm and omelets"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMVVqbHVkVmhETkRoWFRFbEtaR2cwYkU5eFNVRRAB",
            "text": "Really like this restaurant great food and fair prices"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZdFpuVmtWbTA0ZW0xek1Ia3lUWFZrVDA5R1NWRRAB",
            "text": "Very good service. The waitress was very nice. She said hello, asked what we needed, was timely with bringing the food, and made sure all was well."
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RWJsZzBaR0pLYW1Sd1ZYcDVkRU0yWDNvdFZYYxAB",
            "text": "Geleneksel ve kaliteli Amerikan kahvaltısı için mükemmel."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlZGaEZVVXhFUmtnNU5tVmlRV2xQUTJNMFZFRRAB",
            "text": "Food was delicious and service was fantastic.  I was in and out in less than 40 minutes.  Perfect if you are in a rush."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adFpYSmlhakZvU0dGR1RrVlhNak5aU0RWRlFVRRAB",
            "text": "Great place for breakfast and good prices."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTWFuaGlZMm96VFhKc1prTjNOVTlhU2xVeFZIYxAB",
            "text": "The place is full of people talking and little children can be heard happy and giggling.  The staff is very friendly and the food is very good.  An answer to my prayers! 🙏🙏🙏👍👍👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M2VqaFJjbHBUZWtOM1pDMURTa3N6UTNoTldIYxAB",
            "text": "Nice little spot for a bite to eat. Nothing fancy and great service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM2VVWk1TbGw0YjB3NFNYZHpkMG8yUTNOcmJGRRAB",
            "text": "Great diner, my favorite in the area, reasonable prices and wonderful serivce."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNFluQmtaR1pDUjJ0a1FsTnNNM2x1VURSa1NIYxAB",
            "text": "Went to diner for lunch today and had a terrible experience with the owner’s son over $1.85. The waitress didn’t make herself clear for a substitution I asked for and instead of him listening, like his father would have (who built his business off of customer relationships) along with the shortest waitress got very rude. She started yelling. I felt embarrassed they needed to behave like that over $1.85. It was laughable, but I told them I had no problem paying. I was just expressing that the waitress didn’t properly explain it. A real business person would’ve said I apologize for the miscommunication and I’ll make sure I communicate that with my staff moving forward. I never said I wasn’t going to pay it.  Instead, the shortest waitress there started yelling how I perceived it wrong, and he said it actually cost me less than what it normally would have. Neither one of them were listening.\nI just wanna give a shout out to the waitress with the dark brown and light purple hair. She was the only one who listened and treated me with any type of respect, and properly explained what the other waitress didn’t.\nI will spend my money elsewhere where the staff is more professional."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oME5EUjNTbWd3U1hSc01EaFJMVzV1WmxGd1QwRRAB",
            "text": "Staff very rude, dont listen and when you   talk to management about their staff he was just as rude. Father ran business much better and would not have accepted this at all. I wont be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oM2JHZFRWMkU0T0ZkRE5rOTVNemgzYTJsNFowRRAB",
            "text": "What a wonderful place to eat breakfast and fellowship with one another; and the food was delicious 😁💐🥞"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZk9VOXBkWFpvWW1Kbk5ITmZSWEJKTUVOWlNHYxAB",
            "text": "Great food and fast service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMU5GOW9WVXN0VGpObVJ6RlJURmc1WWpOTlEwRRAB",
            "text": "Came here around 12:45pm on a busy Sunday afternoon. This is our second time here. We thought for sure the amount of people that were in there that we would have to wait. But luck had it we were told to sit where ever we wanted so we did. It was extremely busy in there I wish I knew our servers name because she was absolutely amazing. As busy as it was she didn’t seem bothered by it, just kept smiling away, getting customer drinks, and taking orders. I had the Turkey Club and French fries with Beef Gravy so damn good Turkey is fresh and made in house it’s not that processed slimy crap that other places serve. The French fries had a taste I can’t put my finger on but it was very good. The gravy that was delicious as well. They had Beef Barley, Manhattan Clam Chowder and New England Clam Chowder. I absolutely love there New England and had it on my first visit but chose not to have it today. Can’t wait for my next visit very fresh, clean, friendly food and employees"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QmVsSmFlbnBSTmtwNlRtNXpPVTlvWTBSUE5tYxAB",
            "text": "Good food and service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSU5pMTFhREZtYmtoTmVqbG1MWGRQTkROeWEyYxAB",
            "text": "Pretty standard diner with creative selections."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4amRGaHBWa1l0Tmxwb1ozTjRUR2x4VDNCV2VHYxAB",
            "text": "Ordered door dash so I can't speak on service or atmosphere but wow that was the worst breakfast I've ever had out. Asked for home fries super well done and it's almost as if they did the opposite on purpose. They were basically boiled and completely bland to the point where I could not eat them. I don't recommend the sausage links, they're identical to those cheap frozen ones you get from the store that come in the small cardboard box. Super bland hospital food. Wheat toast was atleast edible, good job"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1N3ZUS09REAE",
            "text": "Biscuits & gravy were excellent. Great eggs and sourdough toast! Wonderful service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TFNHazRjRFp6Y0ROdFoxaDJaV2x0ZVU5eWJsRRAB",
            "text": "Diners are the best. This is the epitome of the neighborhood diner.  The absolute best."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaVJtRkhRemt5WVVoeU9GRndiREpDU0VVeGRIYxAB",
            "text": "The food was great, better than the other local diners, and much less expensive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeFZ6VkdYM0F5ZUVKVFJWRlVVM293WjJGcGQyYxAB",
            "text": "A family favorite. Great food and great people."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbTYxTWFGNXFPYjBBRRAB",
            "text": "I had such a great experience eating at this diner. I go here once every month or so and they never fail to amaze me. I always order a cappuccino and the famous \"Hat Trick\" with a side of rye bread.  I love looking at the old pictures of on the wall. The waitresses and waiters are ALWAYS so kind and helpful. Tyler is an awesome guy! He is always checking in to make sure you are doing good. Today Kelsey waited on me and again she is amazing! She's very kind and wonderful. So thank you to the crew for being so great and hardworking. I think everyone deserves a raise! You guys rock!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKWFE5OFhxLV9MdUpBEAE",
            "text": "Fabulous food and experience.  We had a mini family reunion with cousins from San Antonio, Buffalo, and Boston.  Mike, the proprietor, was gracious and allowed us to visit for hours.  The staff was charming and the service and food perfect!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS1NfTFQyMTUyVUlnEAE",
            "text": "What a nice surprise.  Been to many diners in Rochester. Wish I had been here  before. Really nice lunch !"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN1YzN0s0a3Z1ekdBEAE",
            "text": "Quintessential Rochester and upstate New York diner. The food is delicious and the service is very local love, will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLT0JvLWVSenIySVBnEAE",
            "text": "First time there and were very impressed with this old time type diner.  Everyone was gracious and smiling."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdjNudTJjN1BTU3d3RRAB",
            "text": "Nice cozy diner from years gone by"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQLVpxTGlQdThETWl3RRAB",
            "text": "They have the best homemade house salad dressing!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLVB5NGFqaUxLRm5RRRAB",
            "text": "Good old fashioned,  family friendly diner owned and worked by a local family. Food is good. Service and atmosphere are great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN0xoWTJ2eDd2NDlnRRAB",
            "text": "Great service, lots of food, and reasonable prices, even after the cost of eggs went up!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd1pmRUh3EAE",
            "text": "Good food, good service and excellent prices."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd0t5UXVnRRAB",
            "text": "My go to Diner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN0tiY3BRRRAB",
            "text": "We went in for a late breakfast and everything was delicious! The staff were very kind, the food came out fast and the prices were great. We will definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvM092MUVREAE",
            "text": "Regular diner with regular diner food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbDczYnRBRRAB",
            "text": "As always food was delicious waitresses in everyone else all staff are great people. Wonderful respectful courteous. Will continue to go there always."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc2ZTM3RBRRAB",
            "text": "It's always nice to find a good diner. The food is good, I like all the pictures on the wall. The staff are friendly and helpful.\n\nThe seats are not worn out 😉, plenty of tables and booths, and a nice large table for small groups."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMXJlSndBRRAB",
            "text": "Yummy"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc1k2dnFBRRAB",
            "text": "I love diners - comfort food, easy on the wallet, relaxed atmosphere - and I went with one of my all-time diner favorites: Meatloaf sandwich with gravy on the fries! The Meatloaf was everything I look for - and I LOVE Meatloaf. The gravy was nice. One thing i expect from a diner is PERFECT french fried potatoes - if I'm being honest they were good, but not perfect. I still ate everything...\nOh - I didn't catch her name - but our server was absolutely perfect to me - attentive but not hovering, good humored and efficient."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Mi1XTUF3EAE",
            "text": "Busy good sized diner, we got (11:30) there just in time to beat the lunch crowd. The place was packed by noon. Pretty large menu, and very reasonable prices. My breakfast was very good,  but I did have to pay an extra $0.50 to get peppers and onions with my home fries. Their Broccoli Chicken Cheddar Wrap was also quite good.\nBack for a second time, and again we just beat the lunch crowd. Due to the crowd service was pretty slow, but our waitress was very apologetic. Their roasted red pepper soup was tasty but a little too salty. My \"Hat Trick\" breakfast was barely above room temperature at best."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbGFiT2VREAE",
            "text": "Walked in at 2:15pm with a group of 11 and they were happy to seat us eventhough they close at 3pm. Waitresses were very friendly and accomodating. Food was served quickly. All of us enjoyed our meals and although full we chose to try the chocolate cake and carrot cake. We all enjoyed the cakes too. Highly recommend this diner to anyone visiting or living in the area. *note: 1 meal missing from pictures is chicken solvaki (sp?)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbjdfZlZ3EAE",
            "text": "Great food, service, and people. A little bit of everything for everyone. The food was fantastic! And the prices were great. Run don't walk to this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcU8yOUF3EAE",
            "text": "Excellent and fast service. The food was decent with good portion size. Their pancakes felt slightly below par.\nThe ambience was nice, but their cutlery is pretty old. The coffee mug was chipped off here and there, and the plates looked pretty worn out. I think it’s time for them to renovate because some parts of their roof had mold, which is not good for restaurants in general.\nAnd it wasn’t easy to find parking space on a Sunday morning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaThPeTlnRRAB",
            "text": "Great diner, great people, great prices, great food. Just returned to the area after almost 25 years away, and it's as good as I remember. Thanks, all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscnJTLXp3RRAB",
            "text": "Everything is so good and you really get your moneys worth. The waitresses are so nice if you ever in the area and want somewhere quick good and cheap to eat. This is your place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSenBxT2dRRRAB",
            "text": "Was in the area for a medical procedure and needed food right after. Stopped in just before it got busy on a late Monday morning.\n\nMy server was fantastic and had a great attitude. She also was able to get a really good read on her guests, and was incredibly efficient.\n\nFood was fast and tasty, no issues. Restaurant was clean from what I saw, and parking was not too bad at all.\n\nDefinitely stop by if you're in the area and want a lot of food for very fair prices with great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROODlPWDhBRRAB",
            "text": "If you want the classic diner experience, this is it.\n\nFunny signs everywhere, slightly too friendly staff who call you \"hun\" and \"sweetheart\", and inexpensive food.\n\nAlso, they do takeout and serve breakfast all day."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbFlDcmdBRRAB",
            "text": "great food great service. home cooked meal. good value"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaGVMVWFBEAE",
            "text": "Mt Hope Diner was great! Wife and I were hungry for some yummy diner food and we were not disappointed. We ordered blueberry pancakes and a Cuban sandwich both tasted great and we were stuffed. Price with tip was around $16."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOG95WjBRRRAB",
            "text": "A fantastic little family owned and operated diner right outside of the University of Rochester. On the weekends, it gets pretty busy with all the hungover college kids, but tables clear up quick. Always delicious and fast with great service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnenFMaDVRRRAB",
            "text": "Can’t believe I never visited this diner before. Very delicious old-school American food at amazing prices. I got a big plate of biscuits and gravy with eggs plus coffee and paid like $11 total. Almost all breakfast platters are (at the time of writing) less than $10. One of the best value diners in town these days and the servers are angels. Really feels like a great community spot that’s welcoming to everyone. Just a lovely place, I can’t wait to come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN1B6d3VnRRAB",
            "text": "The service was disgusting We waited over 20minutes before even being greeted or getting drink orders then another 35 minutes before being asked about a order .The food was then served cold an when asked to speak with the owner he said he was the son and standing in for his Father while visiting grand baby . Very unfortunate Service Son wasn't friendly did nothing to make anything right left food cold and only said they were busy it was like a zoo an the servers where being extremely snappy .An incredibly harsh to the younger gentleman bussing tables (Collen)By the way is the most sweetest person in the establishment. I have eaten at this for years and over the years the servers have gotten so nasty.An it's ashamed because the owner has such a beautiful spirit ."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSci1mMTNBRRAB",
            "text": "It is our go to place for brunch. Coffee is really good. Pancakes and sausage are so good. And place is also affordable. Staffs are friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwX2JMLXdnRRAB",
            "text": "Solid classic, no frills east coast diner 👍 Great experience coming here again after 15 years. Corned beef hash and pancakes are just as we remembered."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOUl5WFJnEAE",
            "text": "Cozy little diner tucked away near the hospital.\nGood coffee - never burnt, and the staff is always there, offering refills and smiles evenly.\nMy go-to, the Hat Trick is three wonderful fluffy slices of French Toast along with sausage and egg makes for a cheap and extremely filling breakfast."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNC1IZjdBRRAB",
            "text": "Fast and friendly service. The food was so yummy (we got breakfast). Clean and homey with a lot of Rochester history on the walls. This is a cute place if you're in the Strong Hospital area to stop and get a nice cup'pa Joe and some eats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza3FTS1B3EAE",
            "text": "Fun, friendly staff with fast service and great breakfast. Will definitely be visiting again and referred a few friends to this place. Had the NY Strip breakfast with two eggs, home fries and toast. I also ordered a side of grits and a slice of pie. Coffee was hot and tasty. Prices were reasonable."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbjdPQzVnRRAB",
            "text": "My father and I have been coming here for a few weeks now and we’re really enjoying the place. The staff is friendly and welcoming. The food is good. No issues at all. I highly recommend Mount Hope diner for breakfast."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLc1l1Mk5nEAE",
            "text": "It was my first time getting takeout from there. When I walked in, a gentleman greeted me. His and everyone's vibe was so positive and friendly. I asked about the quotes displayed. We had a little small talk. He showed me his favorite quote (in the picture).  The food was great. I would definitely go there again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcC1tOWZBEAE",
            "text": "I have been here a few times.  The food is normally good.  But my mom has received undercooked over medium eggs several times and they use damaged plates which poses a major food safety risk which their management knows about and doesn't care or doesn't know about and if that is the case why are they in the restaurant business."
        }
    ],
    "reviews_count": 68
}