{
    "name": "188 Bakery Cuchifritos",
    "place_id": "ChIJpxMVh4fzwokREgfgMcNN-x8",
    "grid": "BX5",
    "address": "158 E 188th St, Bronx, NY 10468, USA",
    "rating": 4.3,
    "user_ratings_total": 1089,
    "phone_number": "(718) 367-4500",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFNUTnZRMWhyVDJ0Qk0zQkxSRFoyZDJrMGRHYxAB",
            "text": "Foods good atmosphere…. Well it’s the Bronx"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVk1uUnpTVWh6YmtadGFtRmhjRUpETUZWTWJWRRAB",
            "text": "Friendly service food kept at a proper temperature, windows so you can be able to see the food, and the food is definitely handled with care."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeGRYVldjMUZ5TkVONGRXaENRMTlVU2xoaFdIYxAB",
            "text": "Been going here since birth!! It's still delicious!!! (The area not so good lol but I mean its in the hood of the bronx)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWGJrRm1UVEJsU1doTFJHVm1Oak5pUm04ME5XYxAB",
            "text": "The best!!! 🇵🇷"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc1pEQm9XakV5UnpSWlFXVnNjRUZGYjJsSlNsRRAB",
            "text": "Food is really good. The staff are very friendly and fast."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NmJqUTNaMVkwUm1aSWJtSkpOV001VHpodVMzYxAB",
            "text": "This Place Changed So Much Mom & Dad Use To Bring me here as a Kid And My God The Service here Sucks How You Run out of Pernil at 4pm On a Friday then made me wait 30 minutes for a Fresh Pernil To Come Out Shame on them lady with the Tattoos has a very nasty Attitude"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac016bGllVFJvWHpKSVJ6VnBRMDVEWkRaVFFrRRAB",
            "text": "Food was good!  Really glad we got to slip this in during our nyc trip."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUE5DMURZbTl6ZFROclFuSTBXRFJhZUhsamMxRRAB",
            "text": "Good food just wasn't enough beans for all the rice they give u. Besides that good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eFozQnRWSFpFU21wTVpVWm1WbVZXYnpkRlFsRRAB",
            "text": "Is not a Puerto Rico food, is a Dominican food. I mean, nothing bad with nationality, but I was looking for a Puerto food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelVqWlFSek5OVUhBelVuSnhSV28zVFRORVMzYxAB",
            "text": "Good selection and great flavor! Much like all businesses in the Bronx really small but that’s expected."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdGNWZHFUMHRhWVdGM1V6SkJkRmxmTTBSTmJuYxAB",
            "text": "This is not Puerto Rican food not even close to seasoning of years ago, this is now a Dominican establishment, everything is dry, try at your own risk"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMFVtNXdiVUZLYmpGUU1HVjFjVWhQVkdoRlkxRRAB",
            "text": "Worst alcapuria I ever had n it was made with cornmeal. 🤢 The rice, beans and meats are all cooked with Dominican seasoning, by a Dominican cook. So they should call it a Dominican Restaurant and not a good one at that. This food is not Puerto Rican at all. I can't post without a star so they get 1 even though they deserve 0.…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobFozaFhObTFEV1dGTWJYVldaRGxOZDFBM1ptYxAB",
            "text": "I was looking forward to my stuff potatoes, ana stuff alcarpuria... the potato & the alcarpuria barely had meat in it,  it was tasteless, and very pale, no salon, no flavor.  The blood sausage was almost perfect, but again had no flavor,  no hot sauce (pique). Sadly I don't recommend even after spending $45. In this place.  Purchased a whole chicken,  that was actually good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZldXTnJTRXBhUW1aNVRYZENUa2w1V0dsbVNVRRAB",
            "text": "Food is absolutely delicious!! The staff are so friendly and patient."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUlRqSndOR1Y0VEVsUFNEWkdYMUJ0Y214U04xRRAB",
            "text": "La comida no es criolla"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLUGF4TE9pbHJiMnN3RRAB",
            "text": "Great food, and light on the pocket!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeFkwbGhVVFJNWjJsSlgyTnhhR1oxU0hoeE0zYxAB",
            "text": "The best Puerto Rican food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZm12ZDY2dzVDWDlRRRAB",
            "text": "Always fresh and authentic"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaU80dnlvbnUzd193RRAB",
            "text": "One of the last Cuchifritos in New York, real tasty cultured food that you may never taste like this.  The coco drinks are delicious and refreshing.  It could be a bit or should I say watch yourself. But no body will really bother you. Get your order and keep it moving. Lol! The food is hood, it hit the spot, clean, fresh and won't break the bank. Get it! And GO! Lol"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVFA1T3lnelp5d3VBRRAB",
            "text": "This place is legendary, absolutely love this place, been coming here since I was a little kid, the staff is awesome, food is always hot, very fast counter staff, they don't sell sodas here but they have multiple fountain drinks and juices, they also have a small spot here for lotto and quick picks, lotto cards of all types, nice dude behind the counter, the owner is cool and very professional older person, they speak English and Spanish, I just wished they had a bigger pot for the lentils here but other than that, it's great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMR2Q0Nl9mMHZHOF9nRRAB",
            "text": "Finally...some real Mundongo!\nBacalaitos slightly smaller than other's , hardly no code in them either. Alcapurrias aren't so bad. That's all I had there...till next time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbUsyb3pJNHJLc0RBEAE",
            "text": "The food was so good, the chicken was a bit dry but it was still very delicious, the service was great & very kind. Prices are very affordable & the coconut drink is refreshing I recommend coming here for a quick lunch"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenBpdUF3EAE",
            "text": "No smiles when being serviced,  but food tasted good.  Although chicken was a little dry."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bVBXdTl3RRAB",
            "text": "We ordered morcilla, pernil, plantains, red beans and rice, apulchiria, tostones, chicharrons, and mofongo."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c01uNHhnRRAB",
            "text": "Amazing, brings me right back home ♥️🇵🇷…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMlk3R1RBEAE",
            "text": "When I want to eat alcapurrias o Morcilla con cuajito and coconut juice I go there I love it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNXNmbWZ3EAE",
            "text": "Great spot, old school owner keeping everyone on point!!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMHFXY1BBEAE",
            "text": "Los rellenos estaban bien saggy,los bacalaitos no tenia bacalao,es mas ni sabian a bacalao\nPedimos mondongo y lo que me dieron fue patitas,no lo recomiendo"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmck1lLXlnRRAB",
            "text": "Man that answered phone call had a rude attitude and refused to share his name when asked. I bought a dozen of frozen yuca pasteles and they were spoiled. Sour and gross."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bXRHUFpREAE",
            "text": "Great food, great customer service. Fast, good quality and great prices.\nDefinitely my top go-to spot for a good meal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbllqSzB3RRAB",
            "text": "This place needs the sanitation department to shut it down! They got a (C) disgusting"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLW91QUhBEAE",
            "text": "Treated to this eatery by my good buddy Oliver, and as usual, the food is all ways good, the servings are generous, and I always manage to take some home. Recommend.👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudFluTjdRRRAB",
            "text": "I ordered takeout. The food is always fresh and tastes pretty good.  They are always  busy. Their combos are affordable.  If you like a quick bite of fried spanish delights like relleno  de papa (potato balls), etc... i like mine with gravy. this is a good place to get it. The people that serve the food are rice, too. I recommend this place."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaHNPdU1BEAE",
            "text": "This place has been here ever since I can remember, brings back lots of childhood memories.\nTheir food is good. But they sell soup called sopa de Mondongo, I got a couple of times for my son, but there is no mondongo in it ,just pigs feets ? We won't be ordering that again, but besides that, thier good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMUtIOEF3EAE",
            "text": "Idk"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdm92cmdRRRAB",
            "text": "Delicious food"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3amVuTDJBRRAB",
            "text": "Comida está súper salada.No recomiendo el lugar.The food is salty. I don’t recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cXV5R0V3EAE",
            "text": "I love this place, only thing is there's NO PARKING!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibzREN1R3EAE",
            "text": "Great service and excellent food!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZzdXbER3EAE",
            "text": "The best staff and Spanish food selection around,the mofongos here are Great and flavorful,great spot for a quick and amazing experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiclBMZi13RRAB",
            "text": "Food is always excellent. Tight squeeze inside, so I’ve only taken my food to go."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdk9yY19RRRAB",
            "text": "Haven't been here in years, and they still taste the same! Good service, good food and refreshing drinks. I had the avena and it was delicious. Pernil on point. Chicharones Dominicano was the bomb, You have to try them, it's like butter.chicken chunks are always tasty. Parking still stinks!"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheHNHYkpnEAE",
            "text": "Visita Dic-19 Fui para el desayuno con mi familia y nos gustó mucho todo, sobretodo el sandwich de la foto. La atención fue muy buena, nos encontramos con una personas peruana que atendía así que nos explicó todo. Era la primera vez que íbamos. Puedes comer ahí en la barra pero también hay mesas.\n\nFuimos bastante temprano así que no hubo tanta gente pero luego ya empezaron a llegar más personas."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldmN6RnVBRRAB",
            "text": "Never again.  I wanted to try it out but. biggg mistake.  I ordered Moro de habichuela  with BBQribs and it was what I believe is white rice with mixed in beans.  It's definitely not arroz cob habichuelas junto.  You could see the sauce…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeGZxRzlRRRAB",
            "text": "Caribbean soul food on a budget! They have a huge menu & great drink options. The food comes out very quick. Staff is friendly & helpful."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhZ3B2R0h3EAE",
            "text": "I had fried pork with cassava. Very satisfying. Also passionfruit juice, after having a free sample of \"jamaica\" juice. The server seemed to genuinely care that I enjoyed it, which in turn amused me given the high traffic."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURja2R2bnFBRRAB",
            "text": "This place is amazing!!! It's a soul food paradise. The smells and freshness is amazing. It's not for diet food, it's the greatest fried delights. The service is fast and friendly. The place is small, and the prices are fair. They have barriers up for Covid 19 protection and you can order and wait outside for things to be done."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdjc2MzJnRRAB",
            "text": "Me he llevado una muy mala experiencia de este sitio, compre un combo que llevaba un pollo entero ademas de una orden de costillas.Llegue a casa con la seguridad de que estaría toda mi orden, pero para mi sorpresa habían agregado todo a excepción del pollo entero. Suelo comprar seguido aquí por lo que no se me ocurrió en el momento  revisar mi pedido, enseguida regrese para que me lo rectificaran.\nLa mujer que me atendió me dijo que había escuchado mal, que no podía ella hacer nada y simplemente se fue hacia la cocina ignorándome como si nada hubiera pasado.\nEs realmente decepcionante el servicio al cliente, siento que no podría recomendar a un familiar o amigo/a este lugar"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWFTRi1BRRAB",
            "text": "Check my YouTube channel aboricualifeinusa and Instagram and please..\nGood food and great prices. 20$ for two...Gotta try it..\n\nBuena comida y precios Buenos.. 20$ pa dos..Tiene que tratatlos.."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBanVyTGd3RRAB",
            "text": "This place is somthing to brag about(no wander Tony came here) the selection of plates and variaties of stews and meats is  which you can arrange your plate is unbelievable, there was so much food it was overwhelming, just rice there was…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbTlURFFnEAE",
            "text": "After $22 ordered and paid for a nasty roach went walking passed me on the counter.  Needless to say it all went in the trash. Even without the roach. I ordered pernil. She gave me scraps off the bone. All fat and hard dried grossness. Dont…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnN1k3QXhnRRAB",
            "text": "Of Parts Unknown fame - right outside of Fordham Station. Got the Dominican Pork - make sure to add lime and hot sauce, it's intensely deep fried so a little on the dry side. Overall food was okay, juices are really good and you can never go wrong w/ fried plantains\n\nI accidentally ordered a family portion (or what seemed like it) make sure you get a combo for one.\n\nIt's a fun spot to check out although I suspect Anthony Bourdain's visit didn't include a cockroach skuttling along the bar"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OVBIZi1nRRAB",
            "text": "So cool it gets 5 stars. Old school Bronx goodness"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzOGFhVXh3RRAB",
            "text": "- Small diner located in the Bronx, with the perfect blend of Puerto Rican culture/ food.\n- I had a Refresco/ Batida of Parcha (maracuya) and it was amazing!…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtblBHMUN3EAE",
            "text": "Pastelitos y chicharron lo mas asqueroso que yo e probado, super grasosos y con aceite viejo estan todos negros\nMe dio dolor de estomago...🤮…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMGZMWGlBRRAB",
            "text": "Who doesn't love some cuchifritto?!  My new go to for mofongo.  Alcapurias & pastelitos were good.  Service is fast & friendy.  Gotta try the chicharron :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiazUyVTdRRRAB",
            "text": "As long as I can remember this was the place to go to for really good cuchifritos ,not anymore. The \"flavor\" is no longer. I stopped by with my family after a long drive expecting the food to be tasty just like we remembered it to be.  Boy were we disapointed.   The papa rellena was emty , no meat filling,  and had no flavor. The alcapurias had no flavor. The pastelillos didn't have that crunchy outside and tasty inside .The jugo de coco didn't taste the same which is what I really wanted on a hot day .  What happened ? New cooks ? New management ?   Time to look for a new spot to go to .  I've never given a bad review. Sad. Oh and Citi Bike took up the parking spots on the whole block ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb3U3SXl3RRAB",
            "text": "Este fue un buen lugar para comer, pero después de hoy, nunca volveré a comer allí porque mi comida no estaba bien cocinada y le dio a mi familia un fuerte dolor de estómago. También le di pollo a mi perro y terminó vomitándolo, aunque me dieron mi comida rápido y la sirvieron bien, la comida no era excelente."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLU1ubVR3EAE",
            "text": "Love the food choices, quick service what can I say it's my go to spot. Fair prices too. Have to get the frozen passion fruit smoothe . The only bad thing is it gets crowded quickly . Only on street parking. Hey it's so awesome I have to double park! It's well worth it. No wheel chair entrance. No restrooms."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieXVYRG13RRAB",
            "text": "It's my favorite favorite Spanish food spot in the Bronx. The pollo guisado is way better than your mama's. Lol! I'm just kidding, but it's really damn close. Also, the fried food at the window is always bussin. Grab a potato ball w the gravy. Thank me later."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5anVMQUJBEAE",
            "text": "The food in this particular cuchifrito/restaurant is very delicious. I had a fried fish with salad and my wife had a soup/mondongo with white rice. We certainly enjoyed it.\nI must say that the seating is a bit uncomfortable and space is very limited. The tables are very small. I recommend taking out your food. There is no wheelchair access and no restrooms. However, the food is absolutely delicious,excellent,and sabroso!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdzV2RTJnRRAB",
            "text": "The food is good what is one thing that they don’t have they don’t have customer service especially does it dude they’re very disrespectful & rude, Also they like to close before the time that is listed inside the listed google they say they closed at 11pm but they close a whole hour early for"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaVlDYm5RRRAB",
            "text": "First off, this isn’t cuban food. But anyway, bought the most watered down kool aid tasting mango juice here. Not to mention the pastelitos I ordered were dry and cold. I can only imagine how bad the food is if they can’t get simple things right. Not sure how they got 4.4 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdi1qZDZnRRAB",
            "text": "I have been going for almost 30 years and I'm sorry to say the food does not taste like puerto Rican food anymore. I bought chicharon de Pollo boneless and it was not season it came with salad the salad was cabbage I think they lost a customer.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Mi15UUdBEAE",
            "text": "Excellent spanish food, great customer service, very busy place, table and chairs available to sit and enjoy your dinner. Great prices. Small size restaurant, no parking available, just street meters parking available. It's hard to find parking due to shopping stores available in the area. Small children high chairs not available for dine in. Lotto tickets are available for sale inside the store."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeE1TaDZRRRAB",
            "text": "It's off Fordham. Go enjoy some tasty Dominican dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOXFyakV3EAE",
            "text": "Never in my life have I eaten an undercooked morcilla until today. The red blood in the center was nasty.\nWorst part about it, I ordered 2 lbs to take home.\n\nI had high hopes for this place."
        }
    ],
    "reviews_count": 67
}