{
    "name": "The Sugarhouse at Finding Home Farms",
    "place_id": "ChIJKxfkCFU2w4kRmch-eXBg0Mc",
    "grid": "BX5",
    "address": "140 Eatontown Rd, Middletown, NY 10940, USA",
    "rating": 4.8,
    "user_ratings_total": 411,
    "phone_number": "(845) 355-4335",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Zlh6VlZTSGxWYm10VGRYUjJkamg1ZGtwamFVRRAB",
            "text": "Beautiful place, delicious food and coffee"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSmFDMUVUMTl3TlU5RVRubHpMVUUwZG01TFZVRRAB",
            "text": "I am giving 4 stars because I like the food when I dine in it’s amazing! Coffee is awesome! Take out looks like it’s hit or miss because I asked for grilled cheese on GF bread and I got this… not cooked. So just make sure you ask for it well cooked I guess(didn’t think grilled cheese required that statement but sometimes, and in this case yes it does)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOalVHRjRWVXRXYW1acVlqTkxaelkzZUVFeU1VRRAB",
            "text": "Always a pleasure to visit. The food, coffee, gifts are unique and amazing! Love loving local and going here. 😊"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR09VTkdUek50Y1RsalduaExTRzVqTVdwVWNFRRAB",
            "text": "Beautiful place, great service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMlVFOU5PRTFZYkRONGJWZzFkakZFTlU1VE5rRRAB",
            "text": "Of our families favorite local places to eat.  The atmosphere is amazing, cozy and warm. love sitting outside in the warm months and inside in front of the fire during the falls fb winter.  The Sugarbouse Latte is a favorite along with the waffles.  All the food is delicious and they have a ton of cool Knick knacks, gift shop and then there’s their famous maple syrup   Def recommend to anyone looking for coffee/breakfast or brunch in the Minisink area. 👍👍"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM2FIY3liVVpqZWtsdGNHeFFWWE5mYldKeFdXYxAB",
            "text": "I really enjoyed my visit yesterday. The food was tasty and the environment, pleasant. Can you have chamomile tea as one of the selections?\nFor some reason there were a lot of tiny flies annoying me, trying to get to my food. Not sure why they were there.\nI was hoping The fireplace would be burning. I’ll be back as I enjoy going there. It’s such a unique cafe."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaV82SUVREAE",
            "text": "Love this place.  Atmosphere is super and unique, people so friendly and good food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeFV6WkpkbTlrUjBocVIwVXRWMFZoYTBVeWJtYxAB",
            "text": "What a hidden gem. This is a must stop on a fall weekend!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCb1NrNVhVbDlaYWtFeVdtSlBVMFUzV21OSFoxRRAB",
            "text": "I’m usually thrilled with the hospitality at Finding Home Farms, but my recent visit left me feeling disappointed. The young lady behind the counter was actually quite snarky while I was trying to decide on my food order, using an impatient and annoyed tone when answering my questions. I won’t allow her to keep me from coming back but her attitude is not good for business. That being said, the food was delicious as always and I spent way too much on maple syrup for gifts!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oclJuRlliRkZ5T1RoT056bHpXVnBPU0Rac1VsRRAB",
            "text": "As a past Barista this was by far one of the best coffee places I’ve been to like EVER. My husband and I stopped while driving down from Catskills back home to LongIsland it was ten mins out of the way but if I knew how good it was going to be I would have driven an hour out of the way!!!! I just got an oat milk Latte with some pumpkin and the blend of sweetness with how rich the coffee flavor was was TO DIE FORRR. My husband got waffles, I got an egg sandwich and we split the Sweet Turkey sandwich and everything was delish but the Sweet Turkey was so shocking AMAZINGGG I would eat it everyday if I could<3 place was so nice and cozy and staff was very nice. The restrooms are super clean! Cute stuff to buy as well as a souvenir I got a baguette jelly cat keychain LOL. Would recommend to ANYONEEE"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dmRWSmZha3d0WjI1U2FqRlBNRGx1UzBWc2NXYxAB",
            "text": "One of my fav go to spots. The ambiance is the BEST! I love the gift shop area. Such amazing unique finds.  Lots of tasty food and drinks to enjoy"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNellWUjFSVTlTWTBKNVp6SXpTRGRHTUV4VFptYxAB",
            "text": "We love the environment.  Food is good but very small portions. Hate that they yell the orders out when they are ready. Ruins the atmosphere."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcDRuczVBRRAB",
            "text": "Very relaxing atmosphere\nGood food\nMakes you want to come back for another visit"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNUxXcFlZbEJOU21odE9WRlJWR2xoVDBkelUzYxAB",
            "text": "Such a sweet gem. Delicious, fresh food in a beautiful setting. Good coffee!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU1UySkhSV0pJVkRGc1VrNVFSelZmV1UxekxVRRAB",
            "text": "This is the most beautiful building in the area.  It has a lovely atmosphere,  excellent coffee drinks and tea, a charming gift array, and a friendly staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TFoxVjRPR2wwWjNGM01tSk9XRFZzTkdGek1XYxAB",
            "text": "Stop whatever you’re doing and come here. I legitimately want to move into this place. It is the CUTEST most cozy vibe. The coffee is beyond amazing, the staff are so sweet. It is the perfect place to meet with friends, to study, to go on a date. It’s all the things in one building!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFNHdzBOVGcwZVVoUE1HNDJSR0ozZGtWU2IxRRAB",
            "text": "I love the atmosphere of this place. The little shop is well curated, especially the books. The food fell a bit flat for me with the cost of what turned out to be a tiny frittata and $6 for a latte that was nowhere near hot enough."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aE4ybE9NVkJpVlVwZmVIVlVRMlphWTBwZlZrRRAB",
            "text": "Lovely place, fun and focused menu, great little gift shop and just the right amount of “attitude”!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ZmNYZHNabmgzYUhKcGExZFlVSEJuTm1wUk0xRRAB",
            "text": "Great service, great food and great ambiance.  A bright gem amongst the woods."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaFlsaDFaWHBLVkRWWVFucEZNSGxCUWpob04zYxAB",
            "text": "This farm is everything and more! My partner and I love to spend a couple of hours taking in the view, enjoying the food, and delicious coffee.\nWe recently purchased our wedding favors from the farm!  We can’t wait for our family and friends to get a little taste of this magical place ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMWFrbGpUV1Z0VlVwVFFrVldTWEp2WmxGbFVFRRAB",
            "text": "We came here for breakfast on a Monday morning with family. I was surprised to see the parking lot full of cars and some people were even sitting outside on the patio. We opted to sit and eat inside because of the summer heat. I loved my breakfast sandwich, which is egg and cheese inside of a heated up croissant. You can also add bacon if you wish to the breakfast sandwich. For my drink order, I had a hard time choosing from their extensive menu, but finally settled on the Happy Camper latte (which was on their specials menu for the day). I loved the smokiness and the cinnamon flavor of the latte and my sandwich was delicious and just the right amount of food.\n\nAfter breakfast, we looked around their extensive gift shop which had some of their own maple syrups for sale (which you can flavor for free in store), candles, kitchenware, coffees, teas, children's books, stuffed animals, and costume jewelry.\n\nIf you haven't been to Finding Home yet, I highly recommend it as it is such a peaceful spot for breakfast and their menu for both drinks and food is outstanding. Thank you to Joan for taking our order and taking such amazing care of our party of 6 on a busy\nMonday morning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Nk1XSkVNRkZ1VjB0eFJsbEJaVjlpY3padGNrRRAB",
            "text": "We love Finding Homes and everything about it!! From the food, to the employees and all the comfy seating both inside and out.  We always enjoy our visits ‼️‼️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQmJYWmlRMUo0VEUwdFNsWnVkREZ4ZFRFM1FrRRAB",
            "text": "Good place to grab a coffee and some food!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc29xaVB3EAE",
            "text": "The quality is on a decline. I paid $20 for the smallest,  saddest piece of quiche and a specialty coffee (April showers) that was actually just a horrible cup of coffee. The quiche took 30 mins to come out barely warm and tasted like mushy grass and they gave a side salad..... didn't ask just gave but I am not eating a salad at 9am with eggs, thank you.  Visually the place is beautiful, great location, opens at a good hr for ppl that work but the service is subpar and not welcoming at all.  It almost felt like I was a burden to take care of.\nI have no issues paying for great food and service.  This was not that.\n\nUpdate to Finding Home Farm's response:\nIt was not a male employee that served me.  Both owners walked up to the register while I was ordering and didn't even acknowledge me just started talking shop with the only female employee that was taking care of a bunch of customers.  And this isn't the first time this has happened as of late.  So I will not be returning."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdGNfRGlBRRAB",
            "text": "Very relaxing coffee shop\nWorth the trip"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVFpTMW9aREJKTlROc1ZHUndRWFp3Um14M1ltYxAB",
            "text": "Beautiful place, food was delicious and great coffee!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUVlVWXRXbk5xU1VsUVlWbEJOeTFhWlVkVGFYYxAB",
            "text": "Finding home offers good healthy food, no fries as a side dish , which is helpful when feeding children. The bakery selection is always outstanding as is the special coffees. The atmosphere is cozy and inviting. The staff are always friendly as well as helpful with dish descriptions when choosing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUmEzUmpWVVpGUTJoWFFXRTJVSGhzWjBKVVUyYxAB",
            "text": "A favorite spot when I’m in the area. Great coffee drinks, good light food, warm and cozy setting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM1dYSjBlazk2WVdoUlZVMXpZWEUyY2tKd1pXYxAB",
            "text": "Love FHF is my go to place to meet friends. Love that you have local author books there to support people in the community! Love the gift shop too I never leave empty handed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cVJsaFFaMk5rY2psSFpuQlJXa1JxYzBvMmFGRRAB",
            "text": "Such a cute spot to hang or study! I’ll def be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTllYUnpMV3BHWTNOS2JqQmtSVFZ1U2pKcGQzYxAB",
            "text": "This place is a great size with good seating options. It has a cute and cozy atmosphere, good food, creative seasonal menu, great coffee. The staff are friendly. There are also some lawn games like corn hole and giant connect 4. I love bringing visitors here. But it's also a great place to just chill for a while."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVVITm5WVzlrYjNkbk1tTlBjVTlQU1hCeGVsRRAB",
            "text": "Nice spot. Shady areas allow you to sit outside. Food is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMlpHNTNkRVowWkhCUVdFcHlYMnQ2UmxSelVXYxAB",
            "text": "I love this cafe! The food and coffees are delicious. Everyone working is very kind and helpful. The music is fun but not overpowering. There are quiet spots to study and great seating to have brunch/lunch with friends/family. Also the gift shop is great for quality, unique gifts you wouldn't find at a chain business."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONFRWcDZaSFZxZEZSRmVVeE1iSGhDV0VwamRVRRAB",
            "text": "Great atmosphere..delicious coffee as well as desserts and food , but wish the menu was a bit more ..great gift shop and most of all love the syrup choices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU1RraGtjMHRHT0VneWRFbHpiM1p5TTJsdGVYYxAB",
            "text": "Beautiful, bucolic, serene setting.  Like something out of a dream.  Great place to relax alone with a snack and a good book.  Or, an equally great place to gather with friends over a nice meal.  Regardless, between the wonderful selection and the exquisite service, you'll not only thoroughly enjoy your visit, you'll be looking forward to visiting again real soon.  So, if you haven't visited The Sugarhouse at Finding Home Farms yet, make the time to do so!  You'll be glad you did!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFFtTTNSV2g0WlVaR2FYcDJVbFV0TW5kRVgxRRAB",
            "text": "I have taken my grankids here multiple times to get Icecream and we always enjoy ourselves. The servers are very hospitable and amicable. We love this place; It helps that it is a esthetically beautiful. The charm the structure exudes is unrivaled."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b1RWQnlPRk5FU1ZJdFVtY3lWVmhMVWxZdGFYYxAB",
            "text": "A veritable hidden gem, ngl. Very cozy rustic interior. The second-floor seating is nice. Wafflecado toast is worth a try. Sugarhouse waffles were alright. Sugarhouse latte was aromatic and rich, especially topped with maple whipped cream.\n\nSources"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWT1FWWm9OblYzTFdobFMxVjFTeTE1UlhKd2VYYxAB",
            "text": "Food was great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcVJ6QmtlbTFyVTJ4aU1XODVTVk5qTTFaak1FRRAB",
            "text": "Awesome place to relax and enjoy coffee/brunch with a friend. The gift shop has so many wonderful items including their maple syrup, candles, household items, snacks , clothing and so much more. It’s a treasure set off in the woods that you’ll be happy you found."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbHV5NXV3RRAB",
            "text": "We love finding home sugar house!!!\nWe love the food, the atmosphere and the friendly service!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQlIzRTJVa2hsU2xaWkxUUlJSM0JVTTFGRFFtYxAB",
            "text": "This is a hidden gem. A very quaint place with great food, although my son (growing boy) said there wasn't enough turkey on his sandwich, nice place to sit and just enjoy the outdoors quietly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWkxVZFlTMkZITFhsTmFIbHNhMDV6TVVOVVpGRRAB",
            "text": "Atmosphere feels cozy and homely. Food is creative and fresh. Ample options for real maple syrup applications. Good selection of beverages included teas, coffees, and lemonades. Service is mid at best; kitchen is slow considering the menu, and unenthusiastic staff compounds the issue even during slow hours. Cost of items are slightly higher than average, but acceptable for dining in."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1VUQndRVFZWUVdzNWIxUTFlVWhKZEVWQ1ZWRRAB",
            "text": "My home away from home! Try lunch its actually my favorite over breakfast. To thw owner! Thank you for being in business! Its my oasis!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFVWVjNWamQ2YVd0aWNXTTVhSE4zUW5SS1YzYxAB",
            "text": "Love this place!!! The food is outstanding ! Healthy organic foods in the fun, unique gift shop! Can’t wait to visit again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMU9WVnZPVU53T0MxSWEzTkpYM2RRYTFGR1JrRRAB",
            "text": "My first time visiting and it wont be the last. I loved this cafe, service was great, food was great 👍.  Highly recommend it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUU9YTm5VV0pmTXpkblZFdFVZV3hmVWt0UFoxRRAB",
            "text": "Beautiful place to spend with a partner, family or just to drink a coffee while having a peaceful time for ourselves. Very friendly and polite service. 100% recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ek1tTnRSV3hoUVZKbWJEbHJUMGhTWlhaNFEyYxAB",
            "text": "The sweet turkey sandwich is delicious.  There’s a peaceful relaxing atmosphere here at sugar house findings.  A must try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa2JETk1hV1ZzTFdKdGNrVnBSVlExY2t3MVVtYxAB",
            "text": "This is a wonderful place to get brunch. The food is fresh and delicious; the relaxing ambience is unmatched and the service is always up to par. I have visited at least 4 times—and am so glad I stumbled upon this hidden gem! Highly recommend it—you’ll feel like you’ve been transported to a Hallmark movie. They serve their freshly grown maple syrup. I especially love the pumpkin flavored one."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVk5tb3lTV0ZJYzAwd1EzcFRabUpPWXpVNVdGRRAB",
            "text": "Oh my god, the cutest place ever! And the sweetest baristas in the world. Yella is the coolest, and made the best latte I ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS1RsNjJBdnJLSW53RRAB",
            "text": "The Sugarhouse at Finding Home Farms is an absolute hidden gem! From the moment we arrived, we were struck by the cozy, relaxing atmosphere. Nestled in the peaceful woods of Middletown, it’s the perfect spot to unwind while sipping coffee and listening to the birds chirping just outside.\n\nWe ordered the Sugarhouse Latte and a breakfast sandwich both were fantastic. The latte was smooth, flavorful, and just the right amount of sweet, while the sandwich was fresh, hearty, and made with care. You can tell they really value quality ingredients and thoughtful preparation.\n\nAfter breakfast, we wandered through the attached gift shop, which was filled with unique, locally crafted items everything from candles and home decor to gourmet pantry goods. The standout for us was the Rye Maple Syrup. We brought a bottle home and are already planning to stock up on more it’s rich, smooth, and unlike anything we’ve tried before.\n\nThe whole experience felt like a breath of fresh air warm, welcoming, and genuinely special. Whether you’re a local or just passing through, The Sugarhouse is definitely worth the stop. We can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUE41THJGeU02SEd3EAE",
            "text": "What a wonderful little out of the way place to visit and get some scrumptious food!  The sandwiches and desserts were delicious and filling.  If you are in the area and want a nice atmosphere and great food this is the place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOanc3N0tZdjZtNml3RRAB",
            "text": "Such sweet, friendly people. Great vibes and a great atmosphere indoor and out.  The french toast is SLAMMIN and the fact that they have a rewards program is perfect since I pass by almost daily when I’m working certain jobs. Highly recommend. Wish I had found this place sooner!!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvck1HVGZREAE",
            "text": "We come here at least once a week! It’s a beautiful cafe with a lovely staff. The people are nice and polite, especially the owner! The restrooms are clean and well maintained. There’s tables if you’d like, if you have bigger groups they allow you to move the tables (which we do every time), there’s 2 couches, and a nice loft area upstairs. Very nice atmosphere, we come here to letter write or to just grab a coffee and hangout.\nHighly recommend this cafe!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWG9pWXpCXzhTMXl3RRAB",
            "text": "A lovely find!  Amaaazing crumb cake-better than my sisters- and latte that was perfect.  Enjoyed the gift shop. Only sad it was a rainy day and we couldn’t enjoy all the outdoor seating.  We’ll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aGFlbUl3EAE",
            "text": "The interior had changed and the layout improved since I was last there some years ago. The large spacious building has two levels and you can sit on the mezzanine level out of the way and work on the computer. The outside  veranda has tables in the shade and some out in the sun,for me the music was a little too loud. The food and coffee are great well worth a visit if you’re in this area."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NUlhNzlBRRAB",
            "text": "Update January 2025: Still the cutest cafe in the area and their end of season deals in the gift shop are amazing too! ! Their food is good but I haven't loved their coffee. Also a note on the Winter Makers' Market held in early December - the first two years were SO good but 2024 didn't have as many vendors and they were not quite the style of prior years. Hoping some of the earlier vendors return for 2025.\n\nI just love this local cafe! And maple anything is always my favorite. Their coffee and waffle-pressed sandwiches are fantastic, the maple cotton candy is amazing, and I loved getting to see how they make their maple syrup. The gift shop is also adorable (pricy but that is to be expected) and both indoor and outdoor seating is lovely. My only criticism is that I didn’t love the ice cream. Everyone else who visited with me did though. I am so glad to have found this great local business off the beaten path."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNGMyT1hREAE",
            "text": "A cozy lunch spot tucked away in Middletown. Every part of the dining room welcomes you to gather and visit with friends & family. Outdoor seating is also available. The food & drink were fresh, unique and locally sourced. The retail space has kitchen decor, candles, and of course, maple syrup. I stocked up on a few bottles of the Hot & Spice Maple Syrup, my new favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOU9IcFRnEAE",
            "text": "Cozy atmosphere with tasty breakfast options. This spot also has a small store where they sell their own maple syrup. Plenty of parking outside, but the seating area is on the smaller side and it gets busy after 9am. Only con is the coffee, it wasn’t as great as I’d expect for a place like this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd0lyY0NREAE",
            "text": "What a great find!\n\nFinding Home Farms is such a cute, charming and inviting place. The 'Sugarhouse' inside 'Finding Home Farms' serves brunch and baked goods.\n\nIt's also a market that sells local goods, organic maple syrup, pancake mixes, jams, mustards, soy candles, home items, jewelry and more! We got to sample a few maple syrups too.\n\nWe ordered an iced pumpkin maple latte, iced cider, wafflecado toast, breakfast sandwich (waffled), and a cinnamon scone. I really liked the breakfast sandwich the most. The drinks were also delicious.\n\nBoth inside and outside seating areas are gorgeous, but we sat outside to enjoy the beautiful weather.\n\nDefinitely recommend visiting!\n\n@wanderlissa_"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMZ0lmNkZnEAE",
            "text": "Very nice quaint little place. My only suggestion is that the tables were a little bit sticky on all of them that we tried even after the lady wipe them down with the cleaning supplies,  I think maybe some pledge may help with the stickiness.\nOverall experience was very nice will continue to come back. Also, like that you could play connect four and cornhole outside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKdmlrT09oN0t2blJBEAE",
            "text": "Stopped by the Sugar House at Finding Home Farms and had a really nice experience overall. There’s plenty of parking, which made getting in and out super easy. The menu had a great variety of choices, and the drinks were excellent—definitely a highlight.\n\nIt’s a seat-yourself setup, and you order at the counter. Just be prepared for a bit of a wait—our food took almost 30 minutes to arrive, which was longer than expected. That said, the atmosphere is cozy and inviting, and there’s a cute little store inside to browse while you wait.\n\nAll in all, a charming place worth visiting—just don’t come starving if you’re in a rush."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaHZteTB3RRAB",
            "text": "The Sugarhouse is a gem of a café! The friendly baristas made us feel welcome from the moment we stepped in, and the service is impressively fast. The warm atmosphere created a cozy ambiance, perfect for our Sunday visit. We had several questions about the pastries, and the staff answered all of them with their recommendations. The decor is cute and charming, with a well-organized and very clean space that adds to the overall pleasant experience. The outdoor seating is incredibly comfortable, making it a delightful spot to enjoy your coffee and treats. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcklmbXBBRRAB",
            "text": "This is one of our favorite places to go for coffee and breakfast. I’ve grown up in the area and it’s so great to see such a wonderful place thrive! The coffee is always wonderful. But the food is even better. There is always a wide variety of things from savory to sweet. Waffle sliders and one of the wafflinis are usually our top picks. We haven’t even gotten to return for the ice cream in the summer but are looking forward to trying it out. The little store section is perfect and I’ve gotten so many perfect gifts for people there! Highly recommend for anyone from out of town or locals to check this spot out!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeWJXSW53RRAB",
            "text": "Updated Review…had the pleasure of having the White Chocolate Almond Cocoa. DEVINE. On a rainy day it was the perfect treat paired with the Pumpkin Crumb Cake. Bonus…whoever did the decor outside lifted our spirits with the inviting design."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCa2M2dlBBEAE",
            "text": "Great cafe food is always good. Coffees and teas are excellent. They have outdoor seating as well. There are lawn games to enjoy while visiting. Staff is friendly and welcoming whenever Mom and I visit.  They are very accommodating for people with mobility issues."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1X2ZtZW1BRRAB",
            "text": "Impressed to find such a gem in this area! It’s a pleasure to find a place so warm..\n\nHad a good coffee and pastry, sat down on a comfortable couch, read a book, watched people working and talking… ah… great!\n\nAnd: they have a fantastic maple syrup production going on, check their website… good job!\n\nHighly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYlU5THJuNXJLMldnEAE",
            "text": "Finding Home Farms is my new favorite spot! The maple syrup is incredible, the “tasting bar” truly makes it an experience and the food and service are excellent! The atmosphere is also very welcoming and relaxing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURyNDd4TRAB",
            "text": "The coffee is incredible, the food is delicious, and the atmosphere is beautiful, but the best part of the Sugarhouse is Laura and her amazing staff! My husband and I were so lucky to work with Laura in hosting a few people for a small post-wedding brunch, and she truly went out of her way to make the morning so special for us. We are so grateful to her and can’t wait for our future visits! :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbE1UbnNRRRAB",
            "text": "This place has a beautiful atmosphere and decor. The food is good but didn’t find it very filling. The sandwich’s don’t have a lot of their filling. Almost looked like toast before you look inside. The waffles seem to be the big draw.\n\nTheir maple syrup is fantastic. We got a tour a the owner, Dana, who was lovely and tremendously knowledgeable and willing to share what he knows. Grounds are beautiful and great for families to sit in front of and little one to run around.\n\nIt looked like a brand new barn updated to be a restaurant. It very pretty and a nice treat for the family to go and spend a meal there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaXZtcTh3RRAB",
            "text": "Five Stars? I could probabbly give them more. Cozy place, lovely decoration, for me is that kind of shop where You can spend hours... also is the Best Maple Syrup and You can SEE how they make it...literally making a tour in the process.. I can't wait till summer to enjoy the terrace.... oh...And I forget the most important thing.. the coffee and the food...to the moon and back..!! Please make a check in this Magic place..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNV96TXBRRRAB",
            "text": "Had a great time with family learning the process of maple syrup…theirs is delicious!  The cafe has a relaxed laidback atmosphere with lots of waffle based dishes to choose from. The Irish latte was out of this world."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweXRydWFREAE",
            "text": "This place is adorable, what a vibe. I wish it was closer to me. Can't wait to come in the cool weather and sit next to the fire pit with the signature latte. Enjoyed waffles, frittata, breakfast sandwich and croffin. Picked up a few of the flavored maple syrups as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaakptUE53EAE",
            "text": "This place is a hidden gem! Drinks are great services is great but what really makes this place amazing is the atmosphere.  Not many food options but the few they have are delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMUzVsNUx3eE1YZGtnRRAB",
            "text": "It was OK. The great reviews and pictures pulled us in to try it, but I did notice that there’s a lot of emphasis on the atmosphere and vibes. It is a cute, clean place but that’s about where it ends. The Farmhouse waffles we ordered and waited about 30 minutes for were mediocre at best. Nothing to write home about (& we’re visiting from MD). My husband also got a breakfast sandwich & it was just OK. Not terrible, but not outstanding.\n\nNote: it wasn’t crazy busy when we arrived, neither did it get super busy while we were there. 30 minutes wait for basic waffles and a sandwich makes you wonder what the kitchen is doing.. Are they back there with their feet up, on Tik Tok?\n\nMaybe other items on the menu are a notch above what we ordered, but we figured if they’re making maple syrup on site, and have all these waffle specialties, that was the best place to start. Would we come back? Probably not."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b2J6UGhBRRAB",
            "text": "Finding home Farms is one of my favorite places. The food and coffee is amazing! But even better is the maple syrup truly perfected and the best around. Try and get their maple whip on everything you can.  Laura and her husband make our community better love seeing them around and if you ever have a question always willing to help. Can’t wait to see what they come up with next !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzemJiR21RRRAB",
            "text": "Yesterday we went to Finding Home Farms' Sugarhouse, in Middletown. NY.\n\nAs per usual, I got a coffee, my wife got a latte, and the kids got hot chocolates. I love that more and more places have non-dairy options, as 3 out of 5 of us have lactose intolerance issues. (Not me, thankfully)\n\nTheir signature Sugarhouse coffee is delicious! This place is known for making their own maple syrup, and the factory was open that day, so we got to watch them make fresh syrup! As soon as we walked in, we got hit with a fresh blast of the smell of maple! They have 1,000 maple trees they tap from throughout the year!\n\nThey have samplers where you can taste the six different varieties of syrup they make, aside from the classic. I tried the coffee syrup and the hot and spicy. Amazing. Expensive, too. A small bottle was $18, but it's fresh from the tree syrup that they make on site, so... we only got one.\n\nTheir pastries were great, too. I had a brownie, which was a good size and super tasty. Not too sweet, but I still ate it in two separate servings, because, adulting. One of the kids had a cookie, and the other two had chocolate croissants. The wife had a muffin. All tasty.\n\nThis was one of our favorite places we've visited so far. The inside is big, and they have merchandise they sell, too. From coffee beans to keychains, this place is really nice.  Plenty of tables inside to sit, and tables outside, too, for the warmer weather.\n\nLooking forward to coming back here. Their coffee was spectacular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcktlWVF3EAE",
            "text": "From the moment you walk in, it feels like home. Food is fantastic and staff is even better. Maple latte is the best I have ever had. Absolutely love it here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaU5tQUlBEAE",
            "text": "Finding farms is so cozy! Makes me feel like I’m home having the best latte. I love to get your crouffles when I come in!  I got the strawberries and cream Belgian waffle sliders! Delicious ! Then I got the hot chocolate affogato which was out of this world amazing , because of your delicious maple ice cream! Chefs kiss! Ofcourse I had to get a box of goodies to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dE1DRjRBRRAB",
            "text": "Beautiful place! A must to visit in the Fall. Cute Store and great coffee/food as well. I've been in different times with my family and all food was great."
        }
    ],
    "reviews_count": 79
}