{
    "name": "Westtown Fare Restaurant & Bar",
    "place_id": "ChIJQc0ebdE5w4kR5emkZnj0Vms",
    "grid": "BX5",
    "address": "795 NY-284, Westtown, NY 10998, USA",
    "rating": 4.6,
    "user_ratings_total": 206,
    "phone_number": "(845) 683-1299",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Od2MxVnRjR1JVVG01U1ZHVnpRVFI0TTJOaGVIYxAB",
            "text": "Everything on the menu is amazing! Our party of six had a variety of apps, entrees, desserts and drinks. They all stood out as exceptional, so I can't say one was more impressive than the others. Fresh food and quality service, all around an excellent dining experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MlVFTTVUR0ZqZEdSMlJsOVRlR2x6UWxoT1pFRRAB",
            "text": "This place is awesome! Been going here almost 10 years and I've never had a meal I didn't love. The staff is awesome, the atmosphere is perfect."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQ05EWk1TR2RIV1dwbmMweFZZV3h5TkVoR1owRRAB",
            "text": "We had an absolutely fantastic dinner here! It was enthusiastically recommended to us by a friend, and all of our already high expectations were met and exceeded. The food was incredible (highly recommend the brussel sprouts appetizer and the beef Wellington), all the staff were exceedingly friendly, and the atmosphere was so cozy and warm and inviting. We had an absolutely wonderful evening and will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRWNuUlViSFF4UWs5MVVtTm5TblpzVWxKR09YYxAB",
            "text": "Great for date night! Amazing food....Wednesday nights is open mic. If you love Great music and Great food...this is a must. Super friendly staff as well."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWmRXYzVlR2RxTUVsV2JYWTJSMDFZZEdWemFsRRAB",
            "text": "I came here to celebrate a friend's birthday as this place came recommended.  Restaurant is very rustic and quaint inside.  The food was delicious, and each appetizer, entree, and dessert was meticulously plated.  The menu really had something here for everyone.  We opted for the grilled octopus appetizer as well as a special which was the stuffed zucchini flower.  Both were exceptional.  We both opted for the ribeye steaks for our mains, the steak was cooked to perfection and had a generous portion of truffle butter atop the steak.   For dessert, I chose the bread pudding and my friend chose the affogato with cognac.  Both were thoroughly enjoyed.  Overall I felt the meal was fairly priced, but I did spend over $100pp...worth it though for the farm-to-table experience.  My singular complaint was that the room was very noisy, and I found myself talking louder than I'd personally have liked.  I would definitely return to sample more of their menu, my compliments to the chef."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX0J1WnVZeFpTZEJREAE",
            "text": "So delicious! You can just tell each meal is handcrafted with amazing ingredients and love. Such a hidden gem."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLXJqY3FnRRAB",
            "text": "Chris the waiter was fantastic at his craft. The whole place was unassuming, and delightful, food was exquisite. A true hidden gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzRqMWRnEAE",
            "text": "I am not local, but visit the Westtown Fare whenever I can. The menu is innovative and the ingredients are of the highest quality. It is clear that the owner and chef Steve is dedicated to his craft and making that every meal served is something special. If you do not live nearby, I would encourage you to make the drive for a memorable culinary experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRekxUWXF3RRAB",
            "text": "Food, drinks, and service were perfect!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMk5XV1JnEAE",
            "text": "awesome! from cozy ambience, excellent and delish food options to great staff and patrons ;) big bonus the owners are great souls and their energy is contagious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdVBxWjF3RRAB",
            "text": "Always a great time. By far our favorite place to eat."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbDZYaUJREAE",
            "text": "Fantastic farm to table spot, perfect for a fine dining night out close to home. The grilled octopus appetizer is always exquisite and unique as it changes slightly through the seasons. We love coming here and are impressed every time we go.  These photos are from the past few times we have been here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcG96U1FREAE",
            "text": "A hidden gem :) ! The location is quaint, peaceful and loving. The chefs take pride in their food, which is seen and tasted! A favorite of mine is the octopus appetizer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucDVPTzRnRRAB",
            "text": "First time here. It is very welcoming and cozy. Incredible food, attentive and friendly service.\nThe best french onion soup i’ve had. We are so glad we came here. Thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucUp5OWZREAE",
            "text": "Food is over the top, amazing, and the staff is friendly and engaging."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINklpY2pnRRAB",
            "text": "Amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eHBlWlF3EAE",
            "text": "Hometown favorite of ours, stopped in for a few quick appetizers and they were incredible. Staff was friendly, attentive, and funny. Great combination of flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aU5yT3V3RRAB",
            "text": "We were in the area and wanted to try this restaurant. The staff were so extremely friendly and the food was very good as well!\n\nWe enjoyed our meal and the creativity of some of the items on the menu. The sweet corn ice cream was a nice surprise for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid3B1TnpBRRAB",
            "text": "My wife and I wanted to try the local eatery so we went on a Fri night in pouring rain and we had made  reservations. We were seated at a great table, our server was exceptional. We ordered cocktails, my wife had a blood orange cosmopolitan, she said delicious I a vodka martini. Wife ordered the cured salmon appetizer which was  surprising because she likes everything cooked well done but loved it. I had a taste and was sorry I ordered the patate and cheese board. Plenty of patate but just a dab of cheese, wish they evened it out a bit more. Wife had the scallops, again delicious and wouldn't share. They must have been great. I had duck 2 ways. Leg seemed a bit overcooked and a bit dry the breast was chewy and tough. Desert my wife had the cobbler again declared wonderful I the bread pudding with a bourbon glaze. Both served with a scoop of vanilla ice cream. I was surprised to find a nice slice of bacon tucked along side the pudding and was even more surprised how well it pared with the desert. All in all it was a decent meal,  I was not disappointed nor overwhelmed. The vibe was great, the guitar player was a wonderful addition to the evening. Just a couple of suggestions to the owners:  a couple is seated for dinner and the bread basket comes with 3 slices of bread? I couldn't get that. Also, maybe you can break the restaurant habit of not cutting the bread all the way through. Pulling bread apart is a major downer for me.   I love braised short ribs, perhaps an option to it being served with ravioli would be a nice scoop of mashed potatoes.\nWe will be back to try more of the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN09XQ1lBEAE",
            "text": "Loved this place. Food was amazing, service was excellent and ambience delightful. Will definitely go again. Scallops and shrimp special and veal sorentino. Corn soup was fresh and excellent!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldU15Qk9nEAE",
            "text": "Fabulous spot! Hidden gem! Food is awesome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MW9fYmdnRRAB",
            "text": "Service was perfect and food tastey! Beef tartar was ok. However, the burrata with vinnegrette and beans was a flavor bomb. So delicious! Seafood stew came packed and perfectly cooked. Husband had a wagyu steak, which was a bit too fatty for him but he really enjoyed the peppercorn sauce.  Blueberry cobbler was disappointing.\nWould recommend and we will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOUk2Z3FBRRAB",
            "text": "Absolutely amazing atmosphere of great people serving delicious food. Homemade pasta and fresh simple ingredients shine. Live music made the night fun and the food checked all the boxes of an amazing night. So happy to find a gem in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaHFqYUtnEAE",
            "text": "What a fabulous experience! Set in the heart of Appalachia country amidst beautiful farmlands, surrounded by lush flora and fauna- this gorgeous quaint restaurant was an added delight to an already delightful day of exploration and adventure. Indeed, the menu is exciting and creative offering classics like burgers and fish & chips,  whilst also appealing to more sophisticated palates with foie gras,  duck and Wagyu steak. Besides their meat offerings, there were several wonderful seafood and vegetarian options-  thus a menu for any diet.\nThe lobster pasta was incredible as was the warm bread served with a bean hummus spread and garlic butter.\nWe asked for hot tea and was presented with a beautiful mini box of about 10 different teas- adorable 🥰\nThe space itself is warm, inviting and cozy but the service is what stood out most of all- absolutely phenomenal! Every person who works there is genuinely kind and fun to chat with. I really enjoyed interacting with the team.\nMany thanks to the entire team for a spectacular end to an already wonderful day in your perfect town 💜"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5alBEWXlRRRAB",
            "text": "Food was excellent, really cute little place, drinks were also great! It's a hidden gem that more people should know about. I got beef Wellington which was excellent, brussel sprout appetizer and the chocolate platter, and not pictured was the poached pear dessert also super good and French onion soup was excellent as well! Would definitely recommend and go again! Little pricy though"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NUtHcGRnEAE",
            "text": "Nothing special at all"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aDk2TkN3EAE",
            "text": "First  I'd like to say the reason why we had went to this restaurant for dinner, is we have got a gift certificate as a Christmas present. Well it was a horrible experience asking us to move our table after we were snugged in. The server practically closed my menu as I was reading it when she wanted us to move our tables. My husband's $65 steak came out raw when he had asked for medium when asked if he wanted it cooked more he said no we were already done . And the steak was very tough. And the atmosphere I would definitely not call fine dining. So our Christmas present that I was very excited about was a fail.Dont recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkanFUbnhBRRAB",
            "text": "Amazing food and atmosphere. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkXzVuNS1BRRAB",
            "text": "If I could give negative stars I would. My husband and I are completely dumfounded by the lack of respect because we couldn’t hear what the hostess was saying over the phone. We were hung up on twice and then we called to apologize for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaHNid3BBRRAB",
            "text": "Great experience all around! Super good food. Really nice waitress. Plenty of gluten free options"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxM3Nta2FnEAE",
            "text": "Amazing fun atmosphere . Fabulous food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNzlHMW13RRAB",
            "text": "Had a great experience as a first time diner. We had the pork belly for an app which was crispy and delicious. I had the lamb lasagna and it was so good. I never get dessert but the bread pudding was amazing. Super fun atmosphere too with live music. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbHVhcl93RRAB",
            "text": "Went to Westtown Fare Hudson Valley Restaurant week because we had heard good things about this restaurant. Unfortunately we had a very poor experience. Appetizers we had were a bruschetta which was simple but tasty and the pork belly which was tasteless. The main courses were a boulliabase which was pleasant but benign without much taste and a short rib  sauerbraten. The dish was terribly vinegary to the point where it was almost inedible. The accompanying potato pancake was burnt and difficult to even cut. One of the offered desserts was unavailable and the banana foster was far too sweet. The coffee however was good. Service was not exceptional as one poor server was handling the tables and the bar as well. The young lady doing the busing wandered around like she was in a daze. In short, we tried the restaurant because we always like to find  new places and that's one of the best things about restaurant week. However, this restaurant surely did not put its best foot forward.  We will not be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c056MjZ3RRAB",
            "text": "Casual setting but very nice; rustic. Has a nice large center bar, several seating options including outdoor and inside.\n\nThe waitress was very prompt, friendly, and patient when we weren't positive with what we wanted. We received our appetizers quickly after ordering and the entrees came only a few minutes after we finished them.\n\nThe food was absolutely delicious. I ordered half a dozen oysters, the grilled octopus, and the beef Wellington. The Oysters were fine, I prefer blue point, but these were good. The vinaigrette that comes with the Oysters is nice and sweet. The grilled octopus was the best I've ever had in my life. I never had beef Wellington but I feel like this was prime example. It was incredibly tender, I felt like I was biting into ground beef but it tasted so good.\n\nI'd highly recommend this place. Expect to walk away with a $250 bill but well worth it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURza2ZTWjBRRRAB",
            "text": "Such a nice brunch 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN3FLeDlnRRAB",
            "text": "Great food and service!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGZ5OUpnEAE",
            "text": "Went to Westtown to celebrate my wedding anniversary. Service was attentive but felt rushed at times. Food was spectacular, really fresh ingredients and creatively paired. The food itself makes it worthwhile to dine here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNF9hNE1REAE",
            "text": "Probably the best place to eat in the area. Great for romantic dinner and great food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKemQyQjZ3RRAB",
            "text": "Octopus was exceptional. Very nice restaurant!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdEsyNF9nRRAB",
            "text": "Fabulous restaurant  food was great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dGZPZFlBEAE",
            "text": "Always a great dining experience. Love the seafood tower."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d1ktSjlRRRAB",
            "text": "The brussle sprouts were absolutely amazing and the service was excellent. We also had the beef wellington, which was cooked perfectly. It's on the pricey side, but it's worth the cost."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNThicXNRRRAB",
            "text": "Great quality food lots of cool options ! Staff was very friendly and welcoming 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMkpTaVJREAE",
            "text": "Interesting food, perfect cocktails and great service. Hits all the mark's consistently, it's a family run place and the pride shows in everything they do"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1allyaVp3EAE",
            "text": "Great food, drinks, staff and guests. Amazing time for all!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCN2JHaml3RRAB",
            "text": "Good old classic cuisine"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaWVQQWVnEAE",
            "text": "A small cozy local place centered around the bar. Brussel sprout appetizer was incredibly delicious and flavorful, made with maple, apple and almond. Highly recommend the chocolate trio dessert of chocolate ice cream, chocolate mousse, and a flourless chocolate torte. We went for a very late lunch/very early dinner around 4pm. Empty except for someone at the bar. Seems like a highly trafficked place by locals and they know their regular customers. There is a small parking area around the restaurant. If you enter through the bar entrance the are no stairs. If you enter the dining room entrance there are stairs to the porch and then two stairs inside down to the dining room. The dinner entree options can get very costly ($70) for the most expensive item, Wagyu NY Strip. The other entrees range from about $27-47. Menu can change. Looking forward to going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCM01lTjR3RRAB",
            "text": "My favorite restaurant in the area; food is always incredible. Beef Wellington, short ribs, Wagyu steak - they also often have game like elk chops or ostrich."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteXBtN3BBRRAB",
            "text": "The menu offerings were diverse and intriguing and the execution was impeccable.\n\nI look forward to returning and spending more time with family and friends in this charming and flavorful place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ0liRGJBEAE",
            "text": "Food and cocktails are top notch, you get what you pay for if you have a true appreciation for gourmet quality food. Chef is phenomenal, always order one of their daily special starters, they never disappoint! A solid dining experience in the western Orange County!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOWVuSXVRRRAB",
            "text": "Great service. The food is delicious. There so many good options that order a little bit of everything so I can taste it all. Price is just about right special for farm to table food."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dmY3YVRnEAE",
            "text": "An absolute gem. Been here many times. Amazing, interesting and perfectly made food. Fantastic service from happy, well trained staff and great drinks too. Plus, they don't stick you for the 4% credit card surcharge. Plus plus."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRc2E3X1BnEAE",
            "text": "Lovely atmosphere and wonderful food.  Stephen and Kris go out of their way to make sure you enjoy your visit.   Farm fresh to table, this place rocks.  Here is a picture of the fresh Buratta cheese on arugula with pistachios and watermelon.   Amazing food always."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhck83ZkJBEAE",
            "text": "I was there tonight and it was great.\n\nA really nice family atmosphere, the owners are so friendly and warm and the food was good. I had the stuffed fried zucchini flower and the fries. I planned on eating more but in the end was full with that so didn’t get a chance to try anything else. I went by myself and they were very welcoming, including the regulars at the bar! :)\n\nIf you’re in the area and looking for a meal, definitely stop by. I was told the rack of lamb was their star dish."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1M3Ezbl93RRAB",
            "text": "We have been here several times.  They always deliver a top notch dining experience.  I would highly recommend  this restaurant for an A++ dinner."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMzRLNkdBEAE",
            "text": "Don't make the mistake of thinking that Westtown Fare is just another country restuarant, because it's anything but that.  Tucked inside a remodelled colonial style home, there is also a large bar area and an outdoor seating area when the weather is mild.  The atmosphere is sophisticated and without pomp.  The food is an eclectic, American cuisine based on locally sourced products, which means that much of what you'll eat here comes from the Black Dirt farms of Orange Co.   Carefully selected ingredients are only the beginning, as the chef, co-ower and his wife tranform the starting materials into some truely wonderful culinary presentations.  Dinner entrees run from ~ $15 - $30, whcih will bring dinner for 2, including an appetizer, wine & a dessert to ~$100 (excluding tip).  Westtown Fare is a complete dining experience and such restuarants, regardless of price are few and far between.  If you reside in the Tri-state area then count yourself lucky to have such a great local restuarant and if you live fruther away, you owe it to yourself to make the trip. It's worth it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaEppY1B3EAE",
            "text": "Westtown Fair never disappoints! You just have to know that everything is always prepared with skill, creativity and love.  The atmosphere was - as one would expect-lively around 745 on a Saturday night\nWas excited to see the current menu,  but had even more to think.about, with the additional specials. The pate& cheese and jams.  were perfectly paired. Amazing! The oysters were fresh and so tasty.  My beet salad was so fresh and bright, I just loved it.\nI went with a special - dumplings w curry and lobster and oh my was it special.  Sooo unique, and I was too full from my appetizers to eat more than a few bites, but I sure know I will be enjoying every bit of the leftovers."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwcGRhaG1BRRAB",
            "text": "We have visited this restaurant twice with friends. They have yet to disappoint. All or almost all menu items are local farm to table. The food is always delicious. The Westtown Salad is incredible! My wife and I have tried different entrees each time with the exception of the beef Wellington which we ordered both times. The pork chop entree was quite good... the only reason I wouldn’t order it again would be to try another dish. I would highly recommend this establishment! The servers are always on point and friendly and the food absolutely speaks for itself. This combined with old farmhouse charm makes for an evening worth every penny that you spent. Don’t forget to order some homemade ice cream for dessert... the maple walnut has been my favorite so far... the cinnamon was also good!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1OXBfYXJRRRAB",
            "text": "The food is excellent. The staff is wonderful.  The ambience is the best.  Best lobster tails in the area. Sweet and fresh.  Best thick homemade hamburger I've had in Orange County.  Steve and Chris are great hosts. Jen and Shannon thank you."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLN2ZyYk5BEAE",
            "text": "The elevated reviews were misleading.  We made reservations in anticipation of a truly unique and appetizing experience.  Unfortunately, the food was tasteless and disappointing.  However,  I give 2 stars because the escargot appetizer was…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLby1fTzd3RRAB",
            "text": "You will not be disappointed by the ambiance and decor. That you cannot get a glimpse at a menu in advance is not such a good idea. Service was adequate; nothing spectacular nor disconcerting. Maybe it was the damp and four April night, but the menu did not overly impress. Nor did the menu have a fresh, only this week/month feel. In particular, the chicken breast on a bed of arugula lacked imagination and flavor.  I get that a specific corner of the market is the desired clientele, but with their prices one would want to be blown away by each dish. Aside from the salmon pizza, this did not happen. If one could get a glimpse at a 'new' menu in future weeks, I'd be ready to see if I might be too critical."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cXNXa1VBEAE",
            "text": "Went here based on all the positive reviews. VERY DISAPPOINTING!! We there last night for my birthday. We had reservations but were still waiting for 8 minutes to be seated. We were told they were short staffed. The whole night was a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N3VlR2dnRRAB",
            "text": "Off the beaten path, the laid back exterior hides a delightful locally sourced menu that has something for everyone. Desserts are incredible and the servers are friendly. The atmosphere is comfortable and the drinks are varied and all are good."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bmVXcGdnRRAB",
            "text": "Best Restaurant around. We had the Octopus appetizer and Bouillabaisse for our main plate. I studied gastronomy in France and had many Bouillabaisse dishes in southern France.  Better than anything I ever had over there. Every dish has love and art put into it. The Bread pudding is to die for. A must go no matter what! Fresh ingredients.\n\nThe chef even came out and spoke with us. Wait staff is great too! If you want a little piece of heaven go to this place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMmRybHZBRRAB",
            "text": "It was our first time there. Food was pretty good. The only 'complaint' we had was that the brussel sprout appetizer was not cooked to our liking. The flavor was good but they were a bit undercooked for us. Some people like them that way though. The escargot was tender. We shared a salad which was fresh and delicious. Also got the small portions be of our pasta entrees. Eggplant ravioli (4) and lobster over angel hair pasta in a cream sauce. Both good. It left us room for dessert. Must say the espresso was cold. Not worth it.  I'm not sure about the restrooms since I did not visit them. There is a parking lot. Not sure if there is a back entrance for wheelchair accessibility because the front door is not wheelchair accessible. If in the area we might try again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cllib1l3EAE",
            "text": "Great locally sourced food and drinks. The service was also very good. They have a menu of handcrafted cocktails made with many locally sourced ingredients and skillfully poured by an experienced bartender. I would recommend making…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdHRqcFVREAE",
            "text": "This restaurant is absolutely amazing! I’ve been dying to try it for years and I’m finally glad we did. The staff was extremely friendly and welcoming. Great drink selection. Unbelievable appetizers. The main courses were delicious. I mean…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBczYtc3VBRRAB",
            "text": "Amazing meal. Octopus, duck, rib eye, bread pudding, and blueberry cobbler. Everything was perfect. Fresh, local ingredients. Great surroundings, such a neat building. Super nice staff, and ownership. Dining room is so warm and inviting. If you are within 30 miles, make the trip. You won’t regret it."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bnNDS1lnEAE",
            "text": "This is our favorite loval restaurant. If you sit in the upper dining room it is very cozy and romantic.\nThe food is a nice mix of American favorites with some French inspiration. All the ingredients are locally sourced.I have never had a bad meal here.\nThe service is attentive without being annoying.\nOverall,a very nice experience can be had dining here."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeHBtamZ3EAE",
            "text": "Very Charming place to come for real gourmet food, much of it made from local ingredients. The owners and staff are great people and make you feel at home. Steve's weekly menu always shows his ability to pair flavors and seasonal…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbzRyb2FnEAE",
            "text": "The attitude my wife and I received here was enough to not want to go back. My wife ordered a steak and had to send it back.\nThe manager took it off our bill but offered ZERO apologies or replacement, in fact offered an attitude instead.   $110 For a meal with two drinks and thats without the bad steak on our bill.\n\nI will clarify and update my review: overall the rest of the food was ok, fresh tasting.  We felt as though the wait staff was super nice, it was the manager who soured our experience."
        }
    ],
    "reviews_count": 71
}