{
    "name": "Oak & Reed",
    "place_id": "ChIJsXVnCvYzw4kRqfQyt6vgyiw",
    "grid": "BX5",
    "address": "45-53 North St Unit 1, Middletown, NY 10940, USA",
    "rating": 4.6,
    "user_ratings_total": 696,
    "phone_number": "(845) 775-4200",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlNIQnVZMFpOTWtsc1IwZGlZbTR3TjBGTWFuYxAB",
            "text": "Tried the winter squash (starter), buttermilk fried chicken and the salmon. Everything was on point, ESPECIALLY the squash which is a MUST try, if you're in the area.\nThe blueberry mocktail is also exquisite.\n\nSpecial shout-out to the super friendly staff."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOb05XcERNbEIyVms5VlUycHZiV1ZyWlU1R1UxRRAB",
            "text": "Erica is amazing.  Best service I have ever received.  Amazing personality.  A big plus to your staff.  Great restaurant great service.  Erika is the best!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdGJFZGpTbDl1UTJkRU0yaExXazVvTUU1aVUzYxAB",
            "text": "Came here twice, first time for a rib eye, just got the burger, and I swear this is the BEST burger I’ve had in my life."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNVVrRlFOM0ZZWkdwclVrSjBjRVpKVFVsZmRGRRAB",
            "text": "What a great place. Fast, friendly service without feeling rushed. Good variety of dinner options without being overhwelming. Fresh ingredients. The winter squash appetizer is excellent. Enjoy!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUmIxQlRNbE5XWWxKcGJHbFlTVzR0Y0VOWVYyYxAB",
            "text": "Driving from Kingston to milford PA. Needed a place to stop for dinner. We weren’t really expecting much but we were so pleasantly surprised! We had the burrata, the caraflex cabbage, veal, and burger. All four were excellent. Will def stop by next time we’re in town."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSlMzRk5UakJtY0hSdmJVRm9iMFJzTVc1b2FsRRAB",
            "text": "The 3 of us were in the area for vacation.  We all thought our meal was fabulous ! The venison,  the beef bolognese, and the pasta were amazing.  Service was great and the atmosphere was very pleasant."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVk5YbFVVWEZETUhCSVMwc3dOMEpvZW5seFpGRRAB",
            "text": "I had the venison and it was amazing! Pr\nPerfectly done! Out whole group was really impressed!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcVJFcE1UWHBtU1RWUFNIQkZaVnBUYlRKVVdtYxAB",
            "text": "Came here for the first time recently and didn't really have the best experience. For the image the restaurant is trying to portray along with the prices (totally agree with another recent review) it's way off base. It was totally off rush hours when we came so not many in the restaurant and we had to wait for tables to be cleared and set. For $14 a glass of wine, it was the smallest pour we had ever seen. The food took a long time to come out. Went to restroom and I myself had to open the cabinet to restock the hand towels. Thankfully they had them in there. At least the staff was friendly enough but didn't seem to be able to answer many of the questions that we had. Will not be returning and definitely disappointed for the price point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGclN6ZHZOVEpGYlY5NGIyRmlia3RwYVc1dWIxRRAB",
            "text": "The server Erica is so sweet. The cookies were great. They felt like a warm hug. ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWVpESk5iMHgxYkZGa1FXWjRjbk5vTjFSS2RtYxAB",
            "text": "Really nice atmosphere for a date. I got the chicken and waffles and my wife had the steak and mashed potatoes. Both dishes tasted great! Our server Laura was very attentive. We'll definitely be back at some point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRVluSkdOa2gwY0hkU1YyOWFjbTVrTmpKb1IyYxAB",
            "text": "Very nice restaurant inside the City of Middletown. I was not expecting it to be so good. They told me they vary the menu, which I really do think is a great idea. Seasonal dishes can be fantastic. Had shrimp appetizers. Korean broccoli, and buratta with mango salsa. I ordered French onion ravioli for dinner. All of it was very good. I forgot to take pictures we were doing a phone free dinner. Only got the blueberry spritzer.\nBeer and wine only served at this time. They had a very nice selection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dlVrSjBYMFoyZHpSQlRXNTNjRWxKVEhwSVdHYxAB",
            "text": "They are trying to do something nice here and the menu is quite thoughtful, but at the prices  the service was not up to par. The service feels like a diner. Example: We had reservations for two and a high chair. The hostess brought us to the table left us standing there for five mins until I went back and asked. Then we waitied twenty-five  minutes for a single appetizer when there were only four other tables in the place. The meal was another 15-20 minute wait. After we finished we sat there for another ten minutes until I flagged down the server for boxes . $140 for food, no drinks and mid service. If you're charging $45-50 a plate, treat me like I matter. I don't want to be treated like I'm at a diner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MFgxcEhZa1ZDVmpOWGIxVmZSbmMxTFdsU1dXYxAB",
            "text": "Attended a baby shower here and the food was amazing! Service was wonderful. Will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NWVIaFhVMFJPTlRKa1FXRnRPR1ZzYzFCUmJIYxAB",
            "text": "We had my daughter’s baby shower Saturday.at Oak & Reed and did a sit down brunch. The food was delicious, the staff was amazing. It was a beautiful shower!! If you’re looking for a space for a party, you won’t be disappointed with Oak & Reed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNlZuSnBSak5YUnpWdmR6RnljRzB4UjB4VFEzYxAB",
            "text": "Two other patrons at this entire place, a bunch of staff by the bar talking and giggling while we sat at our table waiting. Nobody came over to offer us water, bread, nothing. Walked out after 20 minutes, extremely disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc2JHUkRSblZsVUVoSU9HTTJjR2RvVTFoM1NXYxAB",
            "text": "I went here for the first time this past weekend with some friends. I got the O&R 10 oz Burger and it was incredible. The meat was perfect and the fries were seasoned to perfection. I ordered chocolate chip cookies for dessert and those cookies were the best cookies I’ve ever heard. I’ll definitely recommend coming here 11/10!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aFIwOTNNWEF0Vm1Kc2FHNTFkR3g1YWxKMFNWRRAB",
            "text": "First, I ordered a Ketel One martini but was told they don't have a full bar, which the bartender said was because they're across from a church. No problem, I ordered a Pinot Grigio. Then, I ordered the corn and bacon chowder and was told after a long wait that they were out of it. I nixed the appetizer and ordered the grilled pork tenderloin.\n​Meanwhile, I heard the staff \"86\" several items—lines, line juice, and some other food I didn’t catch. My wine was finished, and the bartender, who was very polite and professional, brought me bread I hadn't asked for. Still, I was the only person at the bar and still waiting for my food. Forty minutes after I ordered, the food finally arrived. I ordered a Pinot Noir, hoping for the best.\n​Unfortunately, the meal was a disappointment. The pork was cold on one end and undercooked. It's worth repeating, though, that the yams were awesome, and both glasses of wine were very nice. I was leaving the restaurant hungry.\n​I changed my review to a 2. When the manager stopped by, he compted the meal portion, but I requested they also comp the wine I didn’t finish since I had no meal to accompany it. The answer was yes, but even after an hour in the restaurant, I was still hungry.\n\nThis is a next morning edit: \"2\" was a little harsh. I was hungry...."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twM1JVZDBlRkptV0hFemFtODVMWEIzY1cweE9WRRAB",
            "text": "Are you looking for something special, looking to treat your partner or family to some good food? Well you found the right place. Food was fantastic, service was perfect if not a little bit slow. Come try this place out you deserve it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlgwWk5ibXhRTFdGRFNXaGtURlpwTkhCVFUyYxAB",
            "text": "Macaroni and cheese is absolutely tasteless. It is barely edible. Headed right to the garbage. Kraft Macaroni and Cheese would have been a better choice. Thoroughly disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMVdYVXRaRXBoVTJkaVFqUkRORVpQVlRoZldXYxAB",
            "text": "We hosted my daughter’s bridal shower at Oak & Reed and I couldn’t be happier with the entire experience. From the very first conversation, Laura was kind, accommodating, and attentive to every detail I had in mind.\n\nOn the day of the event, the staff gave us a bit of extra time to set up and were incredibly helpful — constantly checking in to see how they could assist. During the shower, the service was excellent, the food and the drinks were absolutely delicious (10/10!), and the atmosphere was just perfect for our wildflower theme.\n\nA special shoutout to Isabella,, our server, who went above and beyond to make sure everything ran smoothly. Truly a wonderful place with a beautiful vibe. Thank you, Oaken Reed, for making this day so special!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201c1JIRnhYMHA2TldGZlZtdzRibTEwZURKaVZFRRAB",
            "text": "Excellent food and service !! Get the fried chicken!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFdFeFNZbmwyYmxZelkzVTBOalJ2UzFsS1pFRRAB",
            "text": "Hair found in cold appetizer which also took 45 minutes to come to the table. Staff seemed resentful rather than apologetic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQldXTnlRbUp0UW1wQ1NsVktRbUZTU1ZWTFYyYxAB",
            "text": "Modern, chic, laid back atmosphere with amazing food. My go to is definitely the Buttermilk Fried Chicken. I've gone on dates and on my own and its never a miss. Total recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMlJteG9Ra2RXU2tOcFVHMVlSR1U1TFdjNFEzYxAB",
            "text": "Food was delicious. Love the fried broccoli appetizer. And dog-friendly in the covered patio."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWFJHeDRUVGQxYjJKTVMwNDVZMmxHZWxGMGRHYxAB",
            "text": "Came here for dinner with a friend and was not disappointed.  We ended up sharing 3 appetizers and I'd recommend the Korean fried broccoli and the Yellowtail from the raw bar, both were great.   For mains we both opted for the lobster rolls with a house salad.  Finished off with dessert, where we both agreed to go with the lemon curd with berry compote...dessert was outstanding.   I know the menu changes seasonally...I'd definitely like to sample more from their menu as everything was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdGRFOWZhMjkxVmxCU05UQlhlWGg1U2tkcGFFRRAB",
            "text": "Food was great, service was very good as well. It was a little difficult to find parking near the restaurant though. Had to park behind. And a little weird on how to walk in but food was worth it. Burnt ends were tangy and sweet and burger needed no sauce at all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVFVHWjNia05GYVZoUFlsOW1MVlU1TXpWWmNIYxAB",
            "text": "Their fried chicken is just sooo good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1JIUXdaVmsyVkdkTGFuUjVVMDQ0U1UxNGNsRRAB",
            "text": "Stopped by Saturday night last minute as our plans had changed, William was very accommodating, giving us the option of a table or at the bar. Erica was our server, was so fun and personable and both made our last minute plans so much fun. The entire staff, from bussers to servers interacted with us, laughed with us and made our impromptu night a 5 star experience. Always love coming here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNMnh0N0t5c2JlYXZ3RRAB",
            "text": "We're glad we gave this place a shot because we weren't sure at first. We enjoyed everything we ordered. The corn bread was maybe a little dry but the butter for it makes up for that. Totally worth it. The Korean Broccoli was so good. Probably my favorite! I had the fried chicken, mashed potato and collard greens with the syrup. The chicken and mashed potatoes were yummy, I'd skip the greens next time. Loved the syrup.  My husband's vegetable lo mein was really good! Be prepared for a small lunch menu but I'm sure everyone can find something they like. Would definitely like to try other things. Definitely nice inside. Service was very friendly ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST1IzWlhRVGRhZVZSelZYUjRTVzVLUW1KUE5HYxAB",
            "text": "We waited over an hour and never got our food. The restaurant was not busy and I ordered a salad. We were a table of 4. Our water was not refilled no explanation of why it took so long. No bread was offered just bad customer service they…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNWFUwNnJlcExmZUdBEAE",
            "text": "Stopped by OAK & Reed for lunch after checking out their online menu, which looked great with plenty of options. Unfortunately, when we got there, the actual lunch menu was just a single page — a big letdown, since there wasn’t much that caught my interest. Still, I decided to give it a try and ordered something anyway.\n\nThe server was really sweet and attentive, which I appreciated. The food was okay — nothing mind-blowing, but decent. The place was pretty quiet during lunch, with only a couple other tables seated, so the vibe was a bit flat.\n\nI might come back for dinner to see if the atmosphere and menu pick up a bit more in the evening. Lunch didn’t leave much of an impression, but I’m still open to giving it another shot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOMlQ2cVMxeWViX3ZRRRAB",
            "text": "Good lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLUU5WXF0cktiUHJRRRAB",
            "text": "OMG the snapper they had for Mother’s Day needs to be a regular on the menu!!! It\nWas so fresh and tender and just nicely\nMade!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMS0h2S3pzZ2ZuRXh3RRAB",
            "text": "We had a party of 8...food was good..they forgot to cook one burger.  I understand, it happens.   The host finally brought it over when everyone else was done.  But why not discount it, comp it, free desert, or drink? Something!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN1AtSUNQbExTbnpRRRAB",
            "text": "Great place, ive been there 2 times previously and i returned for my 3rd for takeout. Great atmosphere!! Food is amazing!!!A+++"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcS01b1hpbGJqNVFREAE",
            "text": "Had Brunch here today for Mother's Day. Enjoyed the experience. Didn't make reservations but they still accommodated us. Plan on visiting again sooner than later."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNajV5UDM0aWFmeWxnRRAB",
            "text": "Oak & Reed showed some initial promise -- I've been here at least six times since it opened -- but is now highly overrated and underperforming in both service and overall customer experience. Our party of four had a reservation for 6:30 p.m. on a Satuirday night; the table wasn't ready and we stood around waiting to get seated for at least 20 mninutes. After being seated and drink orders taken, no bread for the table was offered/brought until we asked and received the answer that there wasn't any available, currently, \"because they're backed up with it and 7 tables are also waiting.\" Eventually they brought the bread. The drink order, for me, was wrong and they corrected it letting me keep the wrong drink along with the right one. There are hardly no vegetarian entrees -- I went with Tofu Curry, which was okay but not as standout an entree as you would get at either a good Chinese restaurant or an Indian one -- and I found myself wondering why you can order a hamburger here with about 15 variations of add-ons, but can't order a veggie burger with any of the same because there are no veggie burgers on the menu. This the kind of old-fashioned mess in which a vegetarian can order, say, two or three appetizers and try to call that a meal because of a lack of choice of entrees. My friends who were looking forward to fried chicken with mashed potatoes and collard greens were told there were no more collard greens -- at 7 p.m.? -- so they'd have to accept broccoli instead. Finally when it came time to be done they were really slow with picking up the check. They felt disengaged the entire time and it just like customers don't really matter here much. So...a restaurant on a busy Saturday night with no idea that bread would be needed for 8 tables, reservations not able to kept up, collard greens unavailable when they're featured on the menu....kind of a mess."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ3ZpZW41NnZ5dmxnRRAB",
            "text": "Upbeat ambience, portions are generous and favorable, beet salad was top notch. Overall a very pleasant stop nestled inside a small narrow walkway."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd3ZhaHBRRRAB",
            "text": "I had the absolute pleasure of enjoying lunch with friends at Oak & Reed, and I can confidently say it was one of the most delightful dining experiences I’ve had in a long time. The atmosphere was relaxed yet refined, the food was fresh, flavorful, and beautifully plated—but what truly made our afternoon unforgettable was the exceptional service from Erica.\n\nErica was warm, attentive, and effortlessly professional. She anticipated our needs without ever being intrusive, and her genuine enthusiasm for the menu made our choices that much easier (and better!). From drink recommendations to seamless pacing of our courses, she elevated the entire experience from a great lunch to a truly memorable outing.\n\nOak & Reed is lucky to have her—and I’ll be coming back just as much for the food as I will for that five-star service. Thank you, Erica, for making our time so special!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXVXT1ZnEAE",
            "text": "We visited Middletown and were very excited to dine here. Unfortunately, after reading the positive reviews, we had a mediocre experience here. It took 30 min after being seated to get drinks and bread for the table. We ordered the crab cakes as a starter. For the price, I expected more crab in them. Not big chunks necessarily, but definitely not as many breadcrumbs. The flavor was decent though.\n\nFor dinner, I had the beet salad, which was substantial and had a ton of beets in it. If you only kind of like beets, this is not the salad for you. You have to really love beets as they are very prominent. I also had the asparagus soup which was slightly over seasoned, and the beet salad was somewhat under seasoned, which could have been throwing off my palate. The asparagus soup was good though, definitely the highlight of the meal for me. My husband had the skirt steak and really enjoyed it.\n\nFor dessert, we shared the angel food cake with strawberry and rhubarb, it was good.\n\nOverall, the biggest ding was the service. If the restaurant was very busy, I could certainly understand, I just hoped there would have been more communication about some of the delays."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMkxPUWN3EAE",
            "text": "French press coffee was the best. Burger was overcooked in half, cook chopped my burger in half and tried to cover up with chz (salut to the kitchen) chicken was undercooked. Bread was stale same as service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NGI3YUdnEAE",
            "text": "Amazing food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3X09PbTdBRRAB",
            "text": "Everything we've had is delicious and the staff are so friendly and attentive."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNDhEVFB3EAE",
            "text": "Fabulous place, atmosphere and food off the charts!  Service was outstanding…. Thank you Erika!  We will be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNi1XTG5RRRAB",
            "text": "Oak and Reed is exceptional! Laura will help you out from beginning to end in the most professional yet personable way to make sure your event goes smoothly. She communicates every single detail and takes pride in what she does. Having Laura’s help made my wife’s surprise baby shower a memorable experience. The ambiance is super nice and welcoming. The whole restaurant is immaculately clean. The food? Great and tasty portions from entrees to dessert. The staff will treat you like family. Thank you Oak & Reed!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdk9UOGhRRRAB",
            "text": "Had the pleasure of dining at Oak and Reed today with a very large party, almost 20 people. The food was absolutely delicious! Had the curried sweet potato soup, the patatas braavas and the beet salad for appetizers…excellent! The fried chicken entree with the mashed potatoes and collards were a 10/10! The fried chicken was juicy, well seasoned and crispy! Also the portion was huge have more than enough to take for a meal the next day.  I can’t even begin to start on the homemade chocolate chip cookies, buttery and chocolate perfection. However, more than the food itself the service was out of this world! Nicole was excellent! She was attentive, conversational and patient especially with such a large party. I live in the city and would definitely come back just to come here! Thank you Nicole!! Can’t rave about you enough.\n\nAlso if you want to try the skirt steak and the burger and fries and the kids Mac and cheese is a hit as well!\n\nOak and Reed you did THAT!\n\nWish I would have taken photos but the food was too good and I was too greedy. lol"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbk5LalVnEAE",
            "text": "My family and I decided to have a baby shower here at Oak and Reed and I can’t even begin to tell you have wonderful our experience was. From the begin to Laura was so incredibly helpful! Letting me know what to expect every step of the way, helping me with the menu and being so accommodating! The day of the event the staff allowed us to come early to set up and assisted us when they could! The servers Nicole and Julian were so attentive! They were running the food and drinks back and forth, we literally didn’t have to get up! They took care of everything! They were so kind and patient with us when taking the order (because ya know how it goes when everyone is walking around and talking lol it can be frustrating) At the end we cleaned up as much as we could to make it as easy as possible for them when we left and the host William insisted on us relaxing and not worrying about anything (being in the food industry we just can’t not help lol) William took care of all the popped balloons from the arch and was super helpful!\nNOW FOR THE BEST PART- the food!!!! The food was incredible! Everyone was taking about the chicken and waffles and the eggs Benedict all day! The cinnamon rolls were sooooo fluffy and the home made icing was outstanding! From beginning to end the party was incredible! Every penny well spent, and I will be recommending to all my family and friends moving forward! I would give more starts if I could! Thank you again to Laura, Nicole, Julian and William! You guys made this experience a 10/10\nI will definitely see you guys soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnXzhlcEVREAE",
            "text": "No, I had a great experience at Oak and Reid! Their Korean broccoli was out of this world. Best broccoli I’ve ever eaten actually so I was only in there for a quick minute while my EV car was charging, but so I only had a few light dishes, but it was really really great and I love the atmosphere too, and the service was impeccable"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3VTenZBRRAB",
            "text": "Small menu, but everything was very good. Clean restaurant with nice atmosphere"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeDd1TGx3RRAB",
            "text": "Food was amazing waitstaff was exceptional the whole experience was great. Our waitress Nicole was excellent she gave us some ideas and we loved it! Kept coming to check on us to make it such a great experience While we were enjoying our meal, a man I thought to be the manager running all over the place checking on tables! Wow, so nice to have people taking care of us while enjoying a wonderful meal"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ1lIbS1BRRAB",
            "text": "I had the pleasure of working with Laura to plan my baby shower here at her restaurant. She made everything so super easy and accommodating. The place is beautiful, the staff is amazing. It was all around just perfect. Laura is so sweet and you can see that she takes pride in what she does along with taking care of her employees. My guests couldn't stop talking about how good the food was and how cute everything came out. We chose to do a lunch buffet style so that everyone could try all the great dishes they have to offer. I would definitely recommend this restaurant to anyone looking to throw a party. Thank you so much for making my baby shower so so special! We will definitely make a stop in to see you with our new baby."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd0pMU0ZnEAE",
            "text": "We were staying in Monticello and decided to check out Oak and Reed for dinner.\n\nIt's located in a cute and charming little town.\n\nThe interior is spacious and inviting.\n\nThe starter bread is so good and fresh baked! We ordered the New England Fish Chowder and Korean Fried Broccoli as appetizers and the Buttermilk Fried Chicken. Everything was so good! I especially loved the New England Fish Chowder and Buttermilk Fried Chicken. The Buttermilk Fried Chicken portion is huge. Can easily be shared!\n\nThey don't serve hard liquor but I tried one of their fermented agave cocktails and it was yummy.\n\nOur server was so sweet and attentive.\n\nDefinitely recommend visiting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZ0xTX1p3EAE",
            "text": "We had the pleasure of dining at Oak and Reed recently, and it was an exceptional experience from start to finish!\nWe began our meal with the cornbread served with apple spice butter, which was a delightful combination of sweet and savory. The broccoli cheddar soup was rich and comforting, perfectly seasoned and a must-try! For our main courses, we enjoyed the O&R 10oz burger and the buttermilk sandwich. Both dishes were crafted with fresh ingredients and bursting with flavor.\nOur waitress was attentive and pleasant, adding to the overall warm atmosphere of the restaurant. The attention to detail in both service and food quality made this dining experience unforgettable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjZEbWtRRRAB",
            "text": "The Korean fried broccoli was one of the best appetizers I've ever had in my life.  Loved every bite.  The short rib and eggs was also amazing, very good serving size.  The chicken and waffles were the only disappointment.  Didn't really care for the waffle and the fried chicken was good but the ends were pretty dry, I think it was fried just a bit too long.  Overall a fantastic lunch and our server was great, attentive but not all over you the whole meal.  Also had the mango Margherita which was awesome."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeW96YzNnRRAB",
            "text": "Delicious.  Imaginative menu. Thoughtful presentations. Recommend the corn bread and the chicken and waffles. The duck quesadilla was good, but the hoisin sauce overpowered the dish. The cocktails are non alcoholic mocktails. Good beer selection.  The food overall was excellent. The only minor issue was we had to repeatedly ask for a water refill. The entrance is in the alley second door."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMVp1WVFnEAE",
            "text": "The fried broccoli is legendary!! Buttermilk chicken surpasses its reputation! Cornbread taste like it’s straight from a southern kitchen in SC. If you’re in Middletown NY and you like delicious food, great atmosphere and great service, DINE HERE!!!! Erica was our waitress and she exercised excellent customer service. She was even sweet enough to sing happy birthday to my Son.  She’s a keeper. We will definitely be coming back and bringing the whole family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaE5Eb3B3RRAB",
            "text": "I hosted my daughter’s Baby Shower on Sunday and I couldn’t be happier with how everything turned out.  I already knew the food and service to be superb, but this was a brunch event for 50 guests and it was perfect. PERFECT. Everyone loved it all. The food was replenished at all times. The servers were attentive and cordial. The one manager, Dan, made himself and the restaurant available to us the night before to set up, and was very helpful and friendly. The owner, Laura, was present just about throughout the entire event, making sure our needs were met. And they were. I couldn’t thank the entire Oak & Reed team more. They really made it ann amazing experience all around. ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua012T3JnRRAB",
            "text": "Absolutely loved this place!! Amazing atmosphere & food!! The Korean broccoli appetizer was out of this world!! Our waiter Julian was phenomenal!! He was so sweet & extremely efficient!! He is a true asset to Oak & Reed! Five stars for Oak & Reed. Absolutely loved it & will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eDllejRRRRAB",
            "text": "I was really blown away by the ambiance of this restaurant. The open kitchen is such a treat and the staff is very friendly. I came here for the first time during restaurant week and everything I ordered was phenomenal. They change their menu frequently which I’m a fan of. The cocktails were also delicious and there was so many unique options. I can’t wait to come back and try more!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodU1idzdRRRAB",
            "text": "Fabulous Pre birthday Meal!\nVisited with my sister to celebrate my birthday and this place never disappoints! Nicole was our hostess and she was patient, kind, and knowledgeable. We enjoyed the Korean broccoli and corn bread as appetizers. The main course we enjoyed the Buttermilk fried chicken which was amazing. Definitely a family favorite! When looking for a great meal and ambiance this place is perfect for a solo or group experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaDhITXlRRRAB",
            "text": "Had a delightful meal at Oak and Reed. Me and my wife stopped in on Sunday night for a great meal along with excellent service. We tried the halloumi fried with a whisper of honey,Fusilli Beef Bolognese*, Ancho Pork Tenderloin, & Horchata Rice Pudding  all were delicious light and flavorful. The service was excellent we were constantly checked on recommendations were made and suggested all in all a great experience. I also like the Amber tones of the atmosphere inside with the moderate conversation level great friends, family & groups all in all a must recommend in Middletown."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkemJHLTZRRRAB",
            "text": "My daughter and I went to this restaurant one evening after a long drive from the city and we were definitely hungry.  To start the ambience is romantic with dim lights and candles on each table. The waitress was very nice as well as helpful with the menu items. To start I had the broccoli and smoked gouda soup, which is excellent. For my main course I chose the  balsamic pork chops and my daughter had the bang bang shrimp. We had no complaints. We will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmJDVmV3EAE",
            "text": "ALLERGENS BEWARE\nWhat I ordered is not what arrived.\nIf you’re going to take the time on the menu to write out ingredients, put them all.\nWhen the waitress was asked what extra ingredients they were she had no idea.\nAlso ordered a “slightly pink” burger…..nothing slight about red.\nAll in all don’t come here if you have allergies or want good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScExmRURREAE",
            "text": "I am really liking Oak & Reed. The food is so good. Andy, our waitress was a sweet heart. She was so kind and friendly, did a great job caring for us, thank you. The emporers marshmallow/coconut stout by Equilibrium, they have and I love it. I had a mushroom vegetarian dish that was so good. Their asparagus soup was fresh and nice. I am so much enjoying restaurant week. Coffee creme brule, nice nice nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcDlDMHR3RRAB",
            "text": "Went during lunch. The service was decent. I had the Fried Chicken, which was very good. The Collard Greens was a good side choice. I didn't care for the Fried Broccoli. It wasn't nasty, but it had an usual taste to it. Other people like it, but it wasn't for me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOXJxelRREAE",
            "text": "Fantastic! I remember I found this restaurant one day we were in the area and every time I go Upstate I'm happy to take a little detour to go there again. My absolute favorites here are the Apple Cider Sangria, the Korean Fried Broccoli - sweet and spicy - and the Fusilli Beef Bolognese... OMG. so so so good!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaWRTaGtRRRAB",
            "text": "Amazing! Highly recommended, Great quick attentive friendly service.\nFood was tasty, well cooked and presented. Burger I had is one of the top one ever, no joking.\n\nThe place gives a very warm feeling, it’s neat and clean and you can tell there’s a lot of attention to details.\nCongrats!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaDhHeUlBEAE",
            "text": "Great restaurant!! The food is wonderful and changes daily. Their beer and wines-by-the-glass list is one of the best in the area. The space is modern and open, leading to some ambient noise, but it does not significantly detract from the overall experience. Will definitely be back. Pro-tip… arrive by 6:00pm for easy street parking!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbC1qYlhnEAE",
            "text": "Such a pleasant experience! My boyfriend and I decided to try it out for our anniversary and it was wonderful! We went during the week on a cold, winter night and got right in. Quick, lovely service. The food was HOT like almost too hot to…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMW9PNjRRRRAB",
            "text": "I had the lovely pleasure of enjoying a nice glass of wine and a Burrata Salad at Oak and Reed. The salad was absolutely to die for couldn’t get enough of it, 10/10 recommend. The servers were beyond kind and did such an amazing job. Definitely can't wait to go back for brunch next time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNmV6Snh3RRAB",
            "text": "My family, now-husband and I dined at Oak & Reed the night before our wedding. Everything was perfect! Laura and Isabella got back to me quickly regarding my inquiry and for the price point it was a really fantastic experience. They design a menu for you to fit your theme and the quality of the food was outstanding. My family all raved to me about the food throughout and after the event, asking \"How did you find this place?!\" My family and I consider ourselves foodies and I was nervous as I'm not familiar with the area at all, how and if I could even find a place with the kind of ambience and food quality I was looking for. Upon finding Oak & Reed, I knew I hit the jackpot. Not only was their food absolutely delicious, from the appetizers all the way to dessert, but the servers at the restaurant were really wonderful and went out of their way to ensure we had a great experience. So glad we found you guys and thank you so much for a wonderful night!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b1lQUm5nRRAB",
            "text": "This used to be my favorite place to eat out.  Last night failed completely except for the service.  I dont know who is doing the cooking now but the chicken was burnt.. looked like the oil that was used was old.  The collard greens were too salty to eat and the potatoes tasted like they were out of the box.  I hope they change back to whatever they were doing before.  The highlight was the waitress . She was efficient and polite and a pleasure.  ** the picture is of the food in the take out container..I salvaged the chicken at home.. making chicken salad..I left the greens** This was a big disappointment!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyamRuMXlRRRAB",
            "text": "Surprising Fine Dining Experience. We weren’t dressed well enough but this was such a great experience, food and staff. Great steak and pork chops. Delicious side dishes and very nice dessert. I’d highly recommend you try the Oak & Reed for any occasion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaGZuSU93EAE",
            "text": "Our family came for lunch, and it was a delightful experience. Creative food options, cozy environment, and friendly service.\n\nThe menu is smaller, but they managed to fit different ideas onto it.\n\nWe will come back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDbDhuSm9nRRAB",
            "text": "Fantastic place. It was a buzzing spot, very lively. The food was creative, super fresh, and tasty. Their mexican street corn had an amazing fresh pop to each bite. You can tell it was local. Their buttermilk fried chicken was amazing and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMW9XaFJnEAE",
            "text": "Food was great, service was good, and the atmosphere was also good.\nWhen we first arrived the manager was not sure he could seat the five of us. It started off a little weird, but when we were seated the waitress was on point."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSM3JiZTVBRRAB",
            "text": "Muscles were nice size and good portions.  The chicken in buttermilk batter was very good, mash and collar greens 😋.   Flat iron steak with chimichuri sauce and potatoes. Absolutely mouth watering.   They had good 🍷wine selection. Oh did I mention the corn bread with lemon poppy butter? Yummmmm"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWNfVHFBRRAB",
            "text": "Oak & Reed in Middletown, NY has caused a delight to many since its arrival!\n\nThey offer a fresh take on the dinner scene by providing a nice dim lit ambient, good food, and great hospitable service.\n\nAlthough I felt the burger was 3/5 star rated due to dried, hard bread and cold avocado($3), overall, I enjoyed my experience.\n\nThank you for the treat ✨"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ0xEeUxnEAE",
            "text": "Great service, great food. Stayed open late to accommodate our group of 6. Waitress was attentive (never had to ask refills, never had to make a request twice). Food is a bit rich but good if you're in the mood for something that's warm and comforting in an upscale way."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHc0pDSkxREAE",
            "text": "Fantastic gem. Not because this place is the only great game in town, but because Oak & Reed was surprising and amazing.\n\nBe sure to make a reservation because this place fills up quickly. We started with the corn bread with apple butter (great texture and consistency), soy braised pork belly (melt in your mouth amazing), and Korean fried broccoli (good sauce but some pieces were too big or over breaded).\nThe espresso rubbed venison was a MASSIVE portion, perfectly balanced with sweetness of the parsnip-apple purée and crispy brussel sprouts. The duck could have had a more crispy/salty skin which one looks forward to, but held a nice balance with the roasted turnips and wild rice.\nGREAT meal. Look forward to coming back nice time we’re in the area."
        }
    ],
    "reviews_count": 80
}