{
    "name": "Pugsley Pizza",
    "place_id": "ChIJ_9Abw4H0wokR54WowS3eOzI",
    "grid": "BX5",
    "address": "590 E 191st St, Bronx, NY 10458, USA",
    "rating": 4.6,
    "user_ratings_total": 666,
    "phone_number": "(718) 365-0327",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdE9UbG1RVGhsYjBKMlJ6bFNTV3REU0dOMlZHYxAB",
            "text": "First time there — what a great experience! The owner, this friendly older gentleman, even invited me behind the counter to bang on their bong. What a blast!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1lucG9WV2Q2YUU1MVozUk1lRVJFWVRsbFZsRRAB",
            "text": "Humongous slices and the loveliest people working there!!\n\nWe got a whole penne vodka pizza and it took us 4 meals to finish, so worth the money."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSFlVUnBka05XUmpaRWNtMTRkV3RHVG5wemMwRRAB",
            "text": "The food is amazing thank you SAL\" we love you ❤️✌️🙏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMWMyY3lMV2RGWlRsWU4weDBOVzFsY0d4VVVsRRAB",
            "text": "Good pizza... friendly owners"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVk4wWnRVR0ZuYVdobGIwOHRNRWc0YlVWTGQyYxAB",
            "text": "Delicious and affordable!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyc3FtbGNnEAE",
            "text": "Pugsley pizza is very good, don’t get me wrong but they are too expensive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0c1kyZDBlSEZwZDNoak9IVlJWWEpMTTJkYWRIYxAB",
            "text": "Sal, his family, friends, and the pizza are a LOVE BOMB! GONG!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT2NYcElkRkpWU1VaUU9ETm1NekZvUWxkeVRFRRAB",
            "text": "From the minute we were greeted with enthusiasm and warmth by Salvatore and his wife to the gong with delivery of food to the last bite of pizza, we loved this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM2MzbDNTRzlaY1d0MGNrczRZVWx2V2xCeldtYxAB",
            "text": "This is a place that is above and beyond just a pizza place\n\nThe owners the history behind them are just incredibly sweet\n\nAnd pizza is delicious\n\nCrisp light and delightful\n\nBravissimi…ci vediamo presto\n\nThanks for sharing the gong and the vibes\n\nFederico"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kalJGTk5PVWhWVTJSblFubFdUSEp0Y25wUWNuYxAB",
            "text": "Best pizza in the Bronx, great prices, comfortable atmosphere."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNS0yeVJ3EAE",
            "text": "TWILIGHT ZONE!!!! O.M.G  MY UNCLES SON FROM  ORIGINAL ARTHUR AVE. BROUGHT ME HERE I SAID NO WAY ITS NOT HIM SAME NAME I WAS WRONG I WALK IN AND I SEE SO DECORATED PIZZA STORE LIKE NO OTHER THEN ON MY LEFT I SEE A MAN HIS BACK ON SAXOPHONE SINGING HAPPY BIRTHDAY TO A STUDENT, THEN I HEAR A GONG PIZZA MAN HITTING A GIANT GONG L.M.A.O NEVER U SEE THIS ANYWHERE!!  I CANT BELIEVE ITS SAL PUGSLEY!!!   IM 50 NOW LETS GO TO 1982 IM AT P.S 246 ACROSS THE STREET FROM POE PARK GRAND CONCOURSE 196ST BRONX ITS TUESDAY !!!! YEAH.   RIGHT AFTER SCHOOL HUNDREDS OF US WILL RUN TO PUGSLEY PIZZA 196 BRIGGS AVE. FOR 2 SLICES AND FOUNTAIN SODA FOR 1.OO YES ONE DOLLAR ,WHEN I GOT THERE LINE WAS 2 BLOCKS.    GUESS OTHER FAMOUS PEOPLE WHO WORKED THERE WAS TONY AND BROTHER HILL NOW FAMOUS FAMAILIA PIZZAS NYC , ALSO MARTIN OF BEDFORD PARK PIZZA,  OTHERS , SAL WAS ALSO BEFORE AT 194 ST VALENTINE AVE. BLOCK UP , I CANT BELIEVE I FOUND SAL AKA PUGSLEY !! HE REMEMBERS ME EDDIE CUZ FROM DA BRONX.  PIZZA IS SO GOOD HIDDEN ON 3 BLOCK STREET BEHIND FORDHAM UNIVERSITY ONE BLOCK NORTH OF FORDHAM ROAD FEELS LIKE U IN RIVERDALE OR WESTCHESTER QUIET DEAD END STREETS."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKc2VWaHNXamRTUms5TVZGcFVlaTFmT0RZNGEzYxAB",
            "text": "Great pizza, however, the pizza shop should be more clean.  I saw some dirty tables and the floor."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZlg5ZXllak9EOFB3EAE",
            "text": "Buenísima la comida la recomiendo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKYkNnb0M5OWMyZ25BRRAB",
            "text": "Took an Uber from our first Yankees game to try the amazing pizza that we heard about. It's too bad that the listed hours were wrong. Showed up at 11:20 pm, online listed hours our until 330 am and they're closed. Cost us a ton of time and extra uber fees. I wouldn't eat her if it were delivered and free."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMzUyTGZJaG9iSkFREAE",
            "text": "Amazing amazing amazing and definitely a vibe!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbTNfYkdKcm9xLUZREAE",
            "text": "Always a must stop at whenever in the Bronx, so many pizza shops to choose from but I’d pass 19 to get this one instead. Great vibes and delicious food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM2sydWFzcS1mR0dREAE",
            "text": "Delicious pizza. Sal and Pia are the sweetest. A wonderful and adorable family owned pizza joint. Wouldn’t change a thing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZUd3YXphOC1UQ293RRAB",
            "text": "Very good NYC pizza, like when I was growing up in the Bronx, which is very difficult to find now.  The owners are very nice and work at the restaurant. It's located on a small street parallel to Fordham Road, behind the BP gas station, so you have to look for it carefully."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNX1c5SlBxOEtQQzBnRRAB",
            "text": "A hidden gem located in the Bronx where you could just miss it. The owners are the sweetest couple that work in the back together making great pizza! The dining area is very intriguing and antique- like which is what brought us to try it out and so glad we did."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2NLWnBnRRAB",
            "text": "Great food with a community atmosphere that’s hard to find anywhere else. They even have a gong inside the kitchen, which they ring when they bring your food out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGZfa2dnRRAB",
            "text": "Cheese is mid, crust and sauce are good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvem9hQnpRRRAB",
            "text": "Great time, great pizza, lovely owners"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaGZQS3F3RRAB",
            "text": "Most delicious pizza ever🍕😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMHBDNThBRRAB",
            "text": "Came all the way from Kansas for a Yankees game and a proper NY slice. We weren't disappointed. The food and the service were absolutely awesome!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJamZlX213RRAB",
            "text": "Amazing place !! Delicious pizza."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOUtMbURREAE",
            "text": "Cool place to have pizza. The sicilian pepperoni was nice but I expected better from the plain slice. Pizza is way overpriced as well."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcll5M2RnEAE",
            "text": "Excellent pizza great selection friendly staff"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OGZUMHV3RRAB",
            "text": "Love it here...we had a craving and decided to visit.  Now I cant eat just any other slice.  The taste is so different here! Oh and the owners are lovely."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b3RHc1ZBEAE",
            "text": "GREAT pizza and great food. Everyone was friendly and helpful"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bC03dFFBEAE",
            "text": "The best pizza I have had in a while, crunchy crust and the perfect mix of sauce and cheese ; they have a bunch of flavors so be ready to try them all !!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdUoyVm5RRRAB",
            "text": "Environment and atmosphere are unbeatable.  Time of my life with a live sax performance and food is amazing.  There is a gong that is played before every pizza comes out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdmYzYTl3RRAB",
            "text": "I placed an order for pick up i ordered a love pie half pepperoni, when I picked up my pie it had no pepperoni I brought it back and they put frozen pepperoni on it and handed it to me not even heated up or anything frozen pepperoni. This isn't the fiest incident I just figured I'd give them the benefit of doubt. Never again. Pizza is always burned and has no flavor."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeXRPN3VBRRAB",
            "text": "It's like visiting family"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2ZmMFh3EAE",
            "text": "Rating: ★★☆☆☆\n\nI recently had the chance to try out Pugsley Pizza after seeing a glowing review on YouTube. With all the hype, I was genuinely excited to indulge in what I hoped would be a delicious pizza experience. Unfortunately, my enthusiasm quickly fizzled out after my first few bites.\n\nI opted for the half penne and half cheese pizza, which seemed like a fun fusion idea on the menu. However, the execution left much to be desired. The dough was far too chewy for my liking. Instead of that blissful stretch and crunch one hopes to find in a good pizza crust, I felt like I was battling through a workout just to take a bite. It was a significant drawback that overshadowed any potential flavor the toppings might have brought to the table.\n\nAs for the toppings, they were decent but nothing spectacular. The cheese was adequately melted, but the overall combination couldn’t compensate for the less-than-ideal crust. I had built up such high expectations, but what I got was a pizza experience that felt more like a chore than a treat.\n\nIn hindsight, I really wish I had tried a slice before committing to a whole pie. The disappointment was palpable, and I can't help but feel that I may have missed out on better options in the area. Unfortunately, based on this experience, I don’t see myself returning to Pugsley Pizza anytime soon.\n\nIf you're someone who prioritizes crust quality in your pizza, you might want to think twice before diving into a whole pie here. I truly hope my experience was an outlier as I’d hate for anyone else to feel the same letdown I did. I'm sure everyone else has their preferences, but for me, Pugsley Pizza just didn’t hit the mark. 🍕"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbTVyemZnEAE",
            "text": "Wonderful service & atmosphere. The pizza was mid."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd3FyaXpnRRAB",
            "text": "Great little spot!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdmVPbjN3RRAB",
            "text": "Colorful pizza joint with great pizza filled with chatacter!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2JDc3RBRRAB",
            "text": "Truly a hidden gem. The people were so friendly and enjoyed talking with us. They even let us behind the counter to ring the gong. Great NYC vibe on the inside."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcHFHMXNBRRAB",
            "text": "Don't let this place overwhelm you. It's a small hole in the wall with awesome food and awesome people. A must try if you are in and around Little Italy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc3RLdWdRRRAB",
            "text": "Awesome pizza! Called and placed our order the night before to have it delivered the following day. Just what me and my fellas at work needed on a Friday afternoon! Highly recommend! Delivery was quick and arrived just as we started our lunch break. We need to go in person one day! 👍🍕💯"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzajhQUm13RRAB",
            "text": "Very unique place. Pizza is okay."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOTYtYW1BRRAB",
            "text": "I just ate a meatball sub so good that I don’t see the point of ever ordering one anywhere else."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdE0tVWhnRRAB",
            "text": "it was fine"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYajU2djBRRRAB",
            "text": "My go to place for pizza and fun.\n\nA family owned and managed place.\nOn a special day, ask for Sal and tell him about it for a special treat :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcm9MTDFBRRAB",
            "text": "Delicious and thoroughly amusing to watch Mom and Pop cook and entertain 🎷 🍕❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNzgzT2F3EAE",
            "text": "Pretty great little place in the Bronx. One slice was definitely enough for me, though I tend to eat a bit less than most. But it absolutely filled me up. My boyfriend's friend treated us so I can't quite remember how good of a price it was. I wish they had better drinks available, and the seating was not very comfortable. Otherwise, quite the little hidden gem!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNGF5NXlBRRAB",
            "text": "A must do when in the Fordham area of the Bronx! Sal (Owner) is awesome. If you’re lucky you may even get to do the gong."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNWNHMmdBRRAB",
            "text": "My favorite pizza in The Bronx! Seriously delicious. The Margherita and Penne Slice are my go tos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHBlNERREAE",
            "text": "This pizza spot is truly a time capsule, run by a charming husband-and-wife duo. It’s a no-frills place, but that’s exactly what makes it so special. We stopped by while in the area and ordered a regular slice, a buffalo chicken slice, and a vodka chicken roll. Everything was fantastic – especially the house-made pepper toppings, which added a perfect kick to each bite. The owner was incredibly friendly, taking the time to check in with us while we enjoyed our food. If you’re in the neighborhood and craving a slice, this hidden gem is definitely worth the stop!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcklhRXV3RRAB",
            "text": "Horns, gongs, a graffiti wall, outdoor patio seating and a time capsule of a pizza spot are just some of the things you’ll experience at Pugsley Pizza.\n\nOur first time here today, and we’re ot’s a husband and wife team running this joint, and both are a delight.\nThe guy making the pies has a larger than life, upbeat and outgoing personality, alternating between slinging dough, hitting the gong and making his rounds chatting up the tables. A very upbeat vibe, the food’s old-school great, with a nice variety between the pies, heros and calzones/rolls, and would definitely recommend for families."
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaExpTkJBEAE",
            "text": "Frische leckere Pizza zu einem sehr guten Preis. Man kann ganze Pizzen oder Stücke bestellen. Wir haben eine halb/halb Pizza bestellt: halb Veggie und halb Meat Lover. Sehr zu empfehlen :). Die Knoblauch-Knoten waren auch sehr lecker. Plus zwei Soft-Drinks waren wir bei $30 und satt. Die Besitzer sind ein älteres italienisches Pärchen. Sehr liebenswürdig und charmant. Man kann entweder draußen oder im Restaurant sitzen. Es hat einen rustikalen Studenten-Charme. Sehr cool :)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydHRfSGJnEAE",
            "text": "Best Pizza in Da Bronx Pugsleys won our trophy best perfect pizza Pie Champions , there quality in ingredients is what makes there pizza 🍕 better than the others there crust is amazing and there cheese and sauce with the best olive oil Partanna Company from Sicily the owners of this establishment are absolutely beautiful people you can meet, this is a fun pizzeria I’ve ever been too ❤️❤️🍕🍕 they make pizza with love that’s Amore"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aXQ2X3dBRRAB",
            "text": "I havent been back here in a few years but so glad to see the amazing couple was still healthy and doing well thru covid.\nMy friend and I always have a great time when we come. Pizza is fresh and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOd3U2TjNRRRAB",
            "text": "I ate here for the first time yesterday with My Beautiful ( That’s what I call my girlfriend 😍)& I just can’t believe it! The Pizza is Perfect - The Owners are Wonderful - The Atmosphere takes you way back\nI urge everyone in NYC & NYS that if possible GO TRY THIS PIZZA !\nI’m a real person & real reviewer who LOVES PIZZA & I have eaten pizza at over a couple of hundred pizza shops all over the USA\nWhen you do go & fall in love with this pizza =  👍🏼✔️my Review"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeHJxdkdnEAE",
            "text": "Full what ?????   Oh full moon.  iDK.  I had always been a full moon kind of guy but I don’t know. This pizza was perfect.    Defiantly one of the top 5 NYC pizza places.   I’d have to go again in order to truly rank them but I  think I’d skips the lines at Joes and come here instead.  Plus I’m only 12 blocks away.  Been wanting to try this place for years and glad I did 5 stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5clpEVm53RRAB",
            "text": "I have a Margherita pizza and a breaded chicken ricotta calzone, both delicious. I like the quality of the cheese, which is not the cheapest and greasy from most of the places. If you like spicy, ask for the hot oily peppers, it is really good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMTctQXlnRRAB",
            "text": "If you are looking for an authentic, Italian, New York pizza experience, you just can’t go wrong with Pugsley.  The slices are generous, the homemade sauce delicious, and the crust divine.  We recently stumbled across Pugsley and we will definitely be going back the next time we are in the Bronx."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MklUQTNRRRAB",
            "text": "So glad I found this place! The food is really good. It felt like it was made with love. Nono Sal is so endearing and funny, from the moment i called and ordered, he had me laughing/charmed🙏🏽❤️🍕 I've been back several times since I originally posted. Love this place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMS0zVzF3RRAB",
            "text": "Stopped here on a pizza tour, Sal and his wife have a wonderful restaurant.  They are also very nice and made us feel at home.  The pizza was very good"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBN3U2QWtRRRAB",
            "text": "Here the ambience is better than the food unfortunately. The slices are comically large and lacking in flavor. I added pineapple to mine and even though I love pineapple pizza, their version seemed like the pineapple was added on as an…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybklhbWdBRRAB",
            "text": "Great little old school spot just off Fordham rd that feels as if you are 1000 miles from the Bronx. Really good  standard slices and there is a super chill outdoor dining area with a flat screen tv. Would be the perfect spot to grab a pie, some beers amd watch a ball game."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMnNXRVlnEAE",
            "text": "It can be little hard to find Pugsly Pizza but it is well worth it. The pizza is great and the decorations are very eclectic. We'll worth looking for."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdEl5VWVREAE",
            "text": "I've really liked them in the past, their pizza and pasta is good, but don't order a calzone if you actually want a calzone and not toast with some cheese piled on top of it. Pictures are what I ordered vs. what I got."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjcXV1eDhnRRAB",
            "text": "I don't do five star reviews, but the pizza, the service and the ambiance here - on a take out order during a global pandemic- was phenomenal.\nSal is a true gentleman.\nThe pizza is phenomenal.\nCan't wait to go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOXM3dnNRRRAB",
            "text": "I had a relaxing time at pugley Pizza order few slices of pizza 🍕, French fries 🍟 and soda 🥤 the lady and the old guy was great and funny 😁 like the place…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMDR5ZlFREAE",
            "text": "I ordered a Meat Lovers personal pie ! And OMG Let Me tell you it was soooo Tasty .. And the decor is so cool ..its a Gem .. great food great atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqd2ItcWV3EAE",
            "text": "Delicious, solid slice. Haven’t had much pizza in the Bronx, but so far this is the best I’ve had."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQya0lYSVJnEAE",
            "text": "It’s the slice to beat. Best NYC pizza without a doubt. Great flavor great bread, and sauce and I swear when you look at the cheese slice you know it’s good. You need to try it you haven’t."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWRPSkV3EAE",
            "text": "Everything we tried was incredibly tasty. The pizza is top-notch, definitely in my top 3 pizza spots in NYC. Staff is super friendly and the decor is inviting, you can tell the owners put a lot of love and personality into the place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNDYyTGt3RRAB",
            "text": "AWESOME Hidden Little Spot The Pizza Is Amazing The Pasta Well Pretty Much Everything.\n\nTHEY  Will Also Teach You Hands On To Make Your Pizza If You Choose On The House\n\nCant Go Wrong With The Place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOX3JUUVZnEAE",
            "text": "Stopped by for a very quick lunch after a tour at Fordham University. The owners were very friendly and care so much about this community."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODVHejhBRRAB",
            "text": "Our family loved this old school pizzeria. The pies my family had were tasty, and I was even able to enjoy a gluten free pizza. The service and vibe was excellent - one gentleman even came out and played my daughter happy birthday on a saxophone! It was so thoughtful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcWVEX0VREAE",
            "text": "Avoid. Tomato sauce out of a tin on my gluten-free- pizza - worst ever had in NY. One person in my party had an aubergine regular which had onions and capsicum where mercifully the sauce had been spared tasted better. Was charged$ 68!!!…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMkx6SkFREAE",
            "text": "One of the best chicken rolls ever. A Fordham institution that I keep visiting 18+ years after graduation. Charismatic owners and delicious pizza. Love is it."
        }
    ],
    "reviews_count": 74
}