{
    "name": "Tino's Delicatessen",
    "place_id": "ChIJGcIwxID0wokRGUI5xZYQt_M",
    "grid": "BX5",
    "address": "2410 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.5,
    "user_ratings_total": 458,
    "phone_number": "(718) 733-9879",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcWVYRlJ3EAE",
            "text": "Top notch Italian food with awesome service.  Products from Italy 🇮🇹 that will make your mouth water"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRWNtUmlZVVZuUWxGV2JtcDJYMEptUkZSWWIwRRAB",
            "text": "food excellent and delivery was early"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xck4wa3dURzFLTWpCWFVuUnlRV2wyZEhGTlFXYxAB",
            "text": "I love this place.  I have been going since 2002. Rosa makes the most delicious hot food. The deli staff have been there forever and are lovely! You will not be disappointed. Subs are also great."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMWRFcFpWa3Q2WkhWSmRsaHdkMEV0VjJsdlFWRRAB",
            "text": "Nice ambience and service.  The sandwich was mediocre,  mainly due to dry bread (maybe a wet content will make things better) and too much bread to contwnt ratio"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSE9UUldTamxsVTJkR2IyTk5UVFJaWkdvNGFsRRAB",
            "text": "Top notch sandwiches"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTVkxbElWVFZvV21WMlpuRkVNelJhT1ZGSWVVRRAB",
            "text": "Delish!!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMldqSXRXVXBEYWpsbWNsRnVOelI1YVc5aVdIYxAB",
            "text": "Le patron, un Napolitain, est passionné de vins Français et moi j'ai un faible pour les vins Italiens, l'échange fût intéressant. Très bon rapport plaisir/prix pour les plats choisis qui étaient copieux et goûteux. Le four à pizza n'était pas allumé...je serais obligé de retourner à NY pour tester les pizzas..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM2VsUnphbTU2U0ZWRVVUTktNMmt0ZUZWblRtYxAB",
            "text": "The food was excellent, however, I found it difficult to order additional sides from the website. Part of my order wasn’t delivered although it was written. The UBER eats delivery guy didn’t deliver my food to my apartment although I specifically asked for it. Of course that was not the restaurants issue. In the end, I would order their food again. I’ve been a long time customer more than 20 years."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFpXZFdkMlJhU0c4elZtMTFSbTQyT0RZMlUwRRAB",
            "text": "Foood was unbelievably good and the customer service was even better.  The owner took time of his day to welcome me and treat me like Familia!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMWNqWkdhRlF3ZW14UVNXSjVkRW8wVUZCQ2MwRRAB",
            "text": "This is an extremely authentic Italian joint on Arthur Avenue.\n\nI had a ham and egg omelet and coffee.  Simple but perfect.  All fresh.  Prompt service with a smile.  Loved it!\n\nLots of prepared food behind the glass.  All of it looks amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaU5qVmlPRXBuVVY5dlRUUjNUVTU2UkROUVFsRRAB",
            "text": "My daughter and I walked in for dinner on a whim one day. This was her first time in NYC, and my first time since seventh grade. Neither of us had a clue about what we were looking for or where to find it. I’m not an especially religious person, but if someone told me that walking into Tino’s was divinely inspired, I wouldn’t scoff.\n\nThis is the kind of place I’d eat all my meals if I could. Coming from Portland, OR, I couldn’t have realized how much I loved NY Italian food until now. The sauce on my spaghetti was the best I’ve ever tasted. It’s my new inspiration for every sauce I try to get right cooking at home. My daughter ordered a Margherita Pizza which I couldn’t resist finishing once she was full. Absolutely perfect crust. The light, crispy outsider layer delicately gives way to the tangy, moist center. The sauce was exactly what it should be. No showboating here - just balanced, fresh, masterfully baked ingredients. So, thanks to Tino’s, I’ll be obsessively working on my red sauce for years to come, and building a brick oven in my backyard.\n\nBy the way, the sweetest ladies work here. Traveling across the country with my teenage daughter, leaving my wife back home, was a bit harrowing. The warmth and kindness from these ladies here left me feeling a sense of comfort that I needed in that moment. I’m grateful for that."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNVluZEhXVkJPZWw5MGNuZDVhRmRLWjFCalZWRRAB",
            "text": "Excellent experience owner and staff are amazing"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNDhic21BRRAB",
            "text": "Great hot Italian food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obWMwMVlWV2RFZVZRNE5GaE5SbFoyT0V0TVRsRRAB",
            "text": "Food was delicious and it had such a great family atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWE5rTnFWWHBoTjNWWmQyeHdSWFU0U2xCSmJsRRAB",
            "text": "Tino's is a true gem. As authentic as it gets. Myself, I go for their incredibly high quality cured meats, well-curated selection of pantry goods, the killer (REAL) olive oil in 3L tins, and, of course, the warm and familiar faces of the owners and employees who make you feel like family. Shop local - support family businesses - and keep the culture of Arthur Ave alive!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eVFWUjRVbk5WUVhwelgyNVRiV1pyWTB4WlZVRRAB",
            "text": "They have a very good and varied selection of Italian specialties."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cU0zZHRaek0zZGtkMWFqWkpOMDVZWTA1NlluYxAB",
            "text": "Incredible food and drinks. Love taking the family here."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMTg2NE5nEAE",
            "text": "Food is great and freshly cooked every day. Service is slow."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWE16UllhQzFPVWs1YVNYWk1ablpIVkhsUmRIYxAB",
            "text": "Love it!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNTy15T3JjOVlldTdBRRAB",
            "text": "Eggplant parm hero was not saucy, cheesy or hot, the bread was cold and stale, very sad and odd."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONmhuTGpHenBqYkd3EAE",
            "text": "Great spot. Stopped in for cannolis and ice coffee. Everything was delicious, fair prices, and good service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZm0wUHJCdHRHdEpBEAE",
            "text": "Very friendly and clean love it will come again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYnFodTdlbV82OFVBEAE",
            "text": "This has been my favorite place to frequent as a Fordham student. The pasta fagioli and lasagna are the best. Love Tino’s!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaE5uZ1dBEAE",
            "text": "Best Italian food...friendly atmosphere 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbGR2WW53RRAB",
            "text": "Decent but way more expensive and not as good as the other deli’s in this neighborhood. You pay at least 20% more here and it’s not justified by the taste at all"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcjRTMTVnRRAB",
            "text": "Great southern Italian style food. Staff was warm n welcoming, food was fresh n scrumptious and we enjoyed our dinner"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwMnI2XzlBRRAB",
            "text": "Excellent. Italian specialties all over the place. Imported goods, pastas, sauces and cheeses. Amazing Hot Tray will keep your mouth watering all day. Wide range of food, sauces, products, cheese 🧀 meats from Italy 🇮🇹 Gian Carlo & Rosa are excellent hosts."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndmZ6M213RRAB",
            "text": "Ordered a sub for pick up. Order was ready on time and accurate. Delicious and fresh. Would definitely order again!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnck51X0FnEAE",
            "text": "Best spot for sandwiches hands down service food and atmosphere tinos is your place u need a sub go to tinos"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfal9DQzBnRRAB",
            "text": "My go to spot anytime I visit Arthur avenue. Food is so fresh and the owners and staff are always so sweet and accommodating!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb29QelZnEAE",
            "text": "Amazing experience! This is the read deal. John Carlo makes the best eggplant parm sandwich I’ve ever had. Well worth the trek. Check it out!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMGQ2bkZBEAE",
            "text": "My wife wanted to have my 50th birthday party catered, she was looking on City Island where we reside but the prices were out of control. I reminded her of Tinos, where we have in the past got 3 foot heroes and antipasto platters. We called and that was all she wrote! Delivery on time and the food was out of this world!! Anna hooked us up. We will be going with Tinos deli from now on. Thank you so much!!!! Everything was Amazing!!!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MnJ2NERnEAE",
            "text": "Great place to eat and shop pastas oils everything Italian  staff is always happy respectful and great environment love the food give it a try"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeUxEeVJnEAE",
            "text": "Got the Hero for 48 (roast pork sandwich), and it was very delicious! The fresh mozzarella really adds a lot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMV9LYkZnEAE",
            "text": "The hot food, coffee, sandwiches, and PIZZAs can't be skipped. The ingredients are fresh, flavorful, and well made. A great place to sit down and enjoy food.\n\nThe grocery store is really nice too and has a variety of ingredients/pantry staples for your kitchen or for gifting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM2JhUUtREAE",
            "text": "Best chicken parm hero in the city"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMXVqaFFREAE",
            "text": "Ordered the eggplant parm.  Can only be described as a bland moist flavorless mess on mediocre bread"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudk1UQmdBRRAB",
            "text": "Didn’t even get to buy any anything .\nCame here with family and the old guy at the register was being super racist and trying to kick us out of the store just so we were looking around!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaEpqYzZRRRAB",
            "text": "What makes Tino's special is the quality of their ingredients. They have real Italian charcuterie.\n\nThese days, most places use American processed cold cuts that barely deserve the Italian names. I'm so tired of mediocre prosciutto and Genoa salami that has no flavor. At Tino's you get the real deal.\n\nThat's why, the moment I walked in, I knew I had to order mortadello. It's my favorite, but at so many places it just tastes like overpriced baloney. Tino's has the real thing, and they slice it thin. So, you get that silky fat and coriander/mace\n/nutmeg flavor. You get that tender emulsified force-meat mouthfeel.\n\nThey served it with provolone, roasted red peppers, a scatter of shredded iceberg lettuce, and balsamic vinegar. It definitely satisfied my mortadello craving. I was thrilled with lunch.\n\nLook, it wasn't the best sandwich ever, but that's not what I was expecting anyway. I just wanted good Italian charcuterie and that's what I got. Also, the ambiance is top notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidTRqVWFREAE",
            "text": "My favorite spot on Arthur Avenue.  The eggplant and rice balls are amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicHJYQnVRRRAB",
            "text": "Great as always"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNFkzQjlRRRAB",
            "text": "Love the experience at Tino's Dlicatessen. Excellent service, delicious food, and  great prices. This place is so cute and peaceful. Had a great time! Recommend it one hundred percent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN2MtY3BBRRAB",
            "text": "Food is decent. Prices are ok. Staff/owners are nice. The sandwiches used to be much better. Id be happy to pay more for a better sandwich. One of the best imported cheese selections in the BX. The store is a bit cluttered and it was really hot inside. I sat by the fan.  NYC gets hot every summer...it's not a surprise. More efficient Air Conditioning would have made this lunch more enjoyable."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXNlekpBEAE",
            "text": "Petite boutique visitée lors de mon voyage touristique a New-York. C'est typiquement italien avec de beaux produits présentés comme en italie personnel tres sympathique."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX0xpbmlRRRAB",
            "text": "Over all poor customer service… food was bland. Would not recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cktIbWpBRRAB",
            "text": "I have ordered the club sandwiches for my organization for a gathering of about 20. Each time the sandwiches have been fresh, and delicious! The eggplant supreme is a favorite. The order was available on time. The side salad and pasta also fresh and appetizing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6anN2RGFnEAE",
            "text": "Sandwiches are huge, great quality, affordable, and huge selection of meats and cheeses to choose from. The mozzarella is great, and I love their hot peppers! Place to sit inside or out is a huge plus too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM0xfa1BnEAE",
            "text": "Excellent sandwich and Pizza was phenomenal. Can't wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNEeEtNUBAB",
            "text": "I have ordered from this place before and enjoyed their sandwiches in the past. However, I just ordered from them and the bread tasted stale and the \"fresh mozz\" tasted and smelled very funky. Was very disappointed, especially since they brag on making fresh mozzarella every day. It surely didn't taste like it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMFBQNVR3EAE",
            "text": "It was a good place with good food and really good service. Parking is a challenge, but it's worth it."
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxc3FpaHdnRRAB",
            "text": "Their Prosciutto sandwich was awesome.\nIt is real authentic Italian food.\n\n미국의 진짜 리틀 이태리\n여기 프로슈토 샌드위치 존맛탱"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdFl2TGJBEAE",
            "text": "I have been coming to this deli for years, and the atmosphere is so welcoming and cozy. The food is high quality and delicious! 😋 You can find an array of imported pastas, sauces, olives, cheese, cookies and other great treasures.\n\nIf you come during lunch time, you will most likely have to wait in line- because this deli is THAT popular.\n\nBut if you come during breakfast time- or late afternoon, you’ll be able to enjoy your meal quietly.\n\nThe owner, Giancarlo, is an absolute sweetheart- and his wife is just as friendly. 😊The cooks and staff are all very personable and will do their best to accommodate your requests.\n\nThe woman at the cash register doesn’t seem too happy with her job- and it’s best to double check the total on your order- I have been overcharged more than once.\n\nOther than that, the service is fantastic- and I highly recommend anyone visiting Arthur Avenue to come check out the shine of this wonderful establishment. ✨"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5a3FfYlpBEAE",
            "text": "I absolutely positively love this place.\nAmazing staff. Super clean. Really friendly. Family forward place. You will always run into the owner and his wife. They are really sweet people.\n\nI havent tried the hot food YET but I've read good things about it. It always looks delicious as well. One day I will get some anti pasta. It looks SO good. What i have tried is the Tino's Combo sandwich. My biggest regret everytime is not buying TWO for myself. The sandwich is SO good.\n\nThe hero sandwiches are pretty big. You can eat half and be full. This past Saturday i got a sandwich and ate the entire hero.... in ONE sitting and i did not feel bad about it. The fresh meat, soft hero and pickled peppers on the sandwich make it so hard to stop eating. I could honestly get a sandwich from here once a week and still love it. The gentlemen making the sandwiches are really nice. I was instantly greeted by them when i walked in and asked what i wished to order. He also made my sandwich really good...and always does. I've ordered the Tino's combo 6 times so far. My husband always gets a pepperoni, ham, salami and provolone sandwich. You can literally have them customized a sandwich to your liking.\n\nDuring my last visit i noticed the refrigerator towards to front door has fresh filled ravioli for sale, fresh pasta sauces and fresh pasta. I'm excited to come back and buy these, especially the lobster ravioli - yum!!\n\nThe shelves along the wall are filled with dried pasta's, jarred tomato sauces, dried herbs and a ton of other amazing italian ingredients.\n\nNeedless to say, I'll be back this weekend. If your in the area - come hereee!! You won't regret it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcDd1TGZ3EAE",
            "text": "The chicken parmesan is absolutely delicious! The \"Balsamic Chicken with peppers\" is truly a culinary masterpiece not to mention their \"Sausage, pepper and onions Calzone\"... Finger licking good!!! The prices are just right and the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaU5hN1l3EAE",
            "text": "Balsamic chicken with peppers was so satisfying.  Great lunch spot when visiting Arthur Avenue.  Their eggplant parmigiana is very delicious as well.  Food is fresh and savory.  Large selection and service is really fast."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNlltR1hBEAE",
            "text": "This is a great gem of a place on Arthur Avenue which is surrounded by many restaurants offering Italian food and specialty items. The heroes especially are so delicious. I'm in love currently with the \"Tino's Combo.\" I'm sure all of their…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnel96cEJBEAE",
            "text": "I came here after dinner one night hoping to get dessert and coffee. We walked in without realizing they were closed, and the owner was having a full on Italian style family dinner, but graciously helped us out anyway. She served us the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNnBLUFVREAE",
            "text": "I was here 2 times had some eggs and ham and 2nd time meatballs they where good! the worker are the best they always smile and ready to serve you. will be back to try other dish."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvN2NfQXZ3RRAB",
            "text": "Excellent variety of hot & cold specialties.  Great prices on the fresh mozzarella.  Bread is born in the Bronx good.  Another great spot on Arthur Avenue “the Real Little Italy”."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eXJMakNnEAE",
            "text": "This is the place that makes you feel you have family in the Bronx, Giancarlo is an amazing person. He will go out of his way to ensure you are taken care of. Thank you always for your kindness and care, we will see you soon.. Ti apprezzo dal profondo del mio cuore.! ⭐"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5a3ZLMXdnRRAB",
            "text": "We go to Tino's every time we visit our son at Fordham University.\nBest food, nicest people.\nSo glad they are still open!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNjduVzFRRRAB",
            "text": "Always a great local choice. Their sandwiches are a classic staple of The Bronx and their drinks come from Italy. If you want something different then this a place to stop by. One of my favorite places to have lunch at in the spring and summer weather permitting as well as a good start to your mid day any time."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwX3QzMGxnRRAB",
            "text": "Loved my Elegante sandwich - smoked turkey, brie, spinach sandwich. Try their Tiramisu, it's delicious. Highly recommended!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNemNfaVJnEAE",
            "text": "Rosa & Giancarlo are the nicest, most generous people. The food is delicious,  as if you were going for Sunday dinner!  Can't say enough about it!  If you love Eggplant Parm, this is the place to get it!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLME1XVUVnEAE",
            "text": "I have been coming here since college (like 15 years ago!) and it's really gone down hill.. couldn't believe how little mozzarella was on my mozzarella/tomato/basil. Mike's has like ten times more."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cl9XdzRBRRAB",
            "text": "A nice place on Arthur Ave. with some good chicken parmesan sandwiches. 🌯🥪🥙🥤🏙…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGamRfczNRRRAB",
            "text": "Very good food! So this place was highly recommended as this is my friends' go-to sandwich/pizza place. I've only tried their sandwich (Infierno, Davide, Gian Luca) - they were really good. Infierno is a bit spicy and the other two are not. We also love eating the peppers with goat cheese in olive oil. As the owner wrote, service is personal and it is. The owners know their customers really well. I have yet to try their pizza but will come back for an edit if I ever end up trying it. Their Gelato looks good too."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMGZ1X1ZnEAE",
            "text": "Great local Arthur Ave spot for hot foods, sandwiches, cheeses, pizzas.  Little known secret: you can have wine by the glass with your lunch!\n\nThe owners are always there and the quality is awesome!  Been going there for years and will continue to do so.\n\nThey've also got some specialty Italian products for sale (olive oil, pasta, spices, etc.)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOFAzYzFBRRAB",
            "text": "I'm in love with this place. We did our 10 yr anniversary brunch here. We sat down out doors on a beautiful fall morning. We had delicious paninis accompanied by foamy cappuccinos. They have everything here. Hot breakfast/lunch/dinner menu,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0czdEYjBnRRAB",
            "text": "I was going to say hello to Tino while having his lunch in front of the TV but I didn’t.\nThe sandwich I had for $12.50 was awful Chicken Cutlet #1 and I mean awful. Tino serve a nice piece of chicken cutlet instead of eating breadcrumbs. I know he would not eat that himself.\nServe nice pieces of chicken. I don’t want to give anyplace a bad review. I just paid $12.50 for nice bread."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeTlLY3N3RRAB",
            "text": "This is more than a deli it’s a place to go get lunch or dinner, prepared food and authentic Italian food. I’ve been coming here for about five years whenever I work in the area. One day I found a place nearby that wasn’t too bad because it was late at night and Tino’s was closed but I don’t think I have ever been working in the area needed to get something to eat and said to myself no, let me go somewhere other than Tino’s. The chicken cutlet Parmesan melts in your mouth. I really have no description that can accurately portray how delicious it is. Sometimes I’m there by myself and sometimes I go with five or six guys from work, and for the people who don’t go there often or have never had it before it is cathartic.  I frequently go there and take food home like their sauce and containers of lasagna etc. They also have good dry pasta that goes great with their sauce."
        }
    ],
    "reviews_count": 71
}