{
    "name": "TOSCANE ITALIAN RESTAURANT",
    "place_id": "ChIJKwsxQAAxw4kRDP-oQ4gtq6A",
    "grid": "BX5",
    "address": "2920 US-6 # 3, Slate Hill, NY 10973, USA",
    "rating": 5,
    "user_ratings_total": 18,
    "phone_number": "(845) 697-5095",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV1dWTklUVWd6WTBrd1UwMDFTVUZ6UlcxSFQyYxAB",
            "text": "A hidden gem in Slate Hill. All dishes appetizer and our main dishes delicious! Huge portions, took home each of our dishes we couldn't finish. The owner who served us was extremely friendly and helpful.  Place is very open and warm atmosphere.  Will definitely be coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odmRpMXVZbTlxVlU5TFVFMXdPVEpyWms5cE1XYxAB",
            "text": "Excellent italian food with wonderful staff. We will be back again"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMlVtSk1kV0ZqU1dadmJrMVdXSFI2U2xKMFgwRRAB",
            "text": "Food is delicious and plentiful everyone loved the fresh garlic knots"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdk9XOUNiRkJVVFU5S1gxUjRjMUZxYW14VWJFRRAB",
            "text": "Nice atmosphere and great food. White cloth tablecloths and cloth napkins created an elegance to dining here. The staff was very friendly and attentive to our needs. The food was fresh and spectacular. As of now they don’t have a liquor license but they are working on it and will hopefully have it soon. They did let us bring our own wine bottles and the waiter was extremely helpful to others wanting wine. We will definitely return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRWEyVk5VblEyZUhGT04ycHdiR0ozU0RoclkzYxAB",
            "text": "Visited Toscane for the first time and had an amazing time. From the friendly staff, especially our server Jenny, to the delicious food it was a great dining experience. We look forward to visiting again very soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YVVrdzJTVmt5VXpCc2RWTkxNVWt6VUVSc05rRRAB",
            "text": "I would certainly come back. Nice atmosphere great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTlgxbHRNV2Q2VXkxTlpVTlFWekZJTlZoSk5VRRAB",
            "text": "Excellent service .Dinner was delicious ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMlVtZzNkVlJrYkZKUE1HUTBkelpoWkZoSVpVRRAB",
            "text": "We ate here for dinner while we were staying at a hotel nearby. The reviews were good so we decided to give it a shot. The food was excellent and our waiter was very attentive. We were surprised that there were not more people in the restaurant given the quality of the food and overall dining experience. If we lived locally we would go often. Great italian food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUmFUTk1MVXRKZHpWcU9XWTRVbWcyY2tsTFExRRAB",
            "text": "My husband and I went to Toscanes for my 66th birthday.   What a wonderful experience we had!   The premises are what I would call understated upscale comfort.   There is a stage for live entertainment…which they plan on utilizing soon by having Jazz artists perform, as well as other genres.    For dinner, we had calamari (as an appetizer), a well made tossed salad, garlic rolls with a buttery garlic dipping sauce, succulent lobster ravioli,  and a ribeye steak with grilled shrimp and wonderful mix of vegetables.   I have to say the steak was so moist I didn’t need a steak knife to cut it.  😊\n\nI highly recommend that you give this new gem a try.  Enjoy!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eU5YZ3lMV2RzVFMxVmJXTTFhVGh4TVRsMk5VRRAB",
            "text": "Fine home cooked fresh like grandma made. Old school. Highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVNHd3pUMnRGVWxnek9HZzRUMGRuTm1odlVYYxAB",
            "text": "Wonderful service with a delicious authentic Italian meal! Loved the garlic bread and had chicken franchise which was cooked to perfection!  Liquor license one week away so can not wait to go back- prices are good too!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFRWaHhPVmhrTFVaSVlqVTFSVWRvYzNocVJXYxAB",
            "text": "Best Italian Restaurant In NY!! Highly Recommended, Very professional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTVRXWkZZbkZNVmpGNlVXNUhhM2QxYlRKNlpIYxAB",
            "text": "I am very afraid this restaurant will not get the credit it deserves.  We very much enjoyed our meal, service and atmosphere.  The unfortunate thing for them, on a Friday we were the only table. I want to get the word out.  This restaurant is an undiscovered gem and needs to be found. We will absolutely dine there again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WclVtZEtNRzF5VEZoWmVXb3pNbU5TUkRkc1JuYxAB",
            "text": "TOSCANE is the best Italian restaurant around. All the food is incredible — from the appetizers to the fresh pasta, seafood, and desserts. Every dish is full of flavor and beautifully made. The staff is friendly and the atmosphere is warm and relaxing.\n\nIf you’re looking for authentic Italian food, this is the place to go."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NlZXSk9SbmRTWldKWmRIazVZa1kxTUZneVFVRRAB",
            "text": "A wonderful place to enjoy some freshly made Italian food with am amazing atmosphere and wonderful waitresses"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reU1qRTFNMUp6ZDNabk1XMTJhWE5xY0V0a2RFRRAB",
            "text": "I have no idea what would prompt Randy Deckers review. We came here on June 30th 2025 for lunch and was blown away. The calamari was fantastic along with the bread and oil. That was just our warm up. I'm not one that likes to take pictures while eating. But I had to make sure I did. So far we've had chicken Alfredo and chicken piccata. We will definitely be coming back."
        }
    ],
    "reviews_count": 16
}