{
    "name": "Bottoms Up Restaurant and Pub",
    "place_id": "ChIJs33BVzwxw4kR9GefxqGFSYU",
    "grid": "BX5",
    "address": "1965 NY-284, Slate Hill, NY 10973, USA",
    "rating": 4.6,
    "user_ratings_total": 585,
    "phone_number": "(845) 355-2886",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT1JHOXFkVmRDYVVOMloxRmpjVU5DVG1aVFpYYxAB",
            "text": "1. Cajun steak lacked seasoning otherwise the steak was cooked ok\n2.The fried mashed potatoe didn't taste like anything\n3. Chicken Parm - excellent\n4. Apple Cider Sangria- if you like sour/tart it's for you\n5. Schnitzel - excellent\n6. Potatoe Panckes were small silver dollar size and over cooked"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYVJuVjRZWFpNUkUxSWJsRXdSMjVMZG01RWIzYxAB",
            "text": "It's warm, friendly, great food!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWFlXTldiREprY0hGdWFtOVpibkZzV1VZeFFsRRAB",
            "text": "Amazing Food, Amazing Drinks, Amazing Service. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdUxYSXdOVnBSWjJRM2FVWm1ZbFJqZEVKeldtYxAB",
            "text": "Service is good. The food is very excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsc2MxWjRiRVpwWkdObE4xSlBhRzFVV2s5TU0xRRAB",
            "text": "Incredible food. Excellent selection. Amazing service. Fantastic dining experience. You can tell from the clientele that it is very popular and the locals love coming here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MlNsVldhVzVOVjJObGFGVnlMV1J3Y3pod2FYYxAB",
            "text": "A very pleasant surprise.  The food was great and to top it off we enjoyed a hot homemade apple crisp for desert which was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReU9XbFRRVGR5ZGxOak4zbFVhekYzY0ROamNtYxAB",
            "text": "Great food!!! Just had the best burger 🍔 and I love burgers 🍔  Bloody Mary's are great also! Nice cozy atmosphere and great vibes definitely will return for more!!!@"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc1UwZDROVU40ZEMwMGFuSlRXRkpyWm1sR2JtYxAB",
            "text": "First time going and glad we stopped. Will definitely go again! Yum!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NGRISmZjVk5PU0ZSNGJUTlZZbFZIYjFGVlNWRRAB",
            "text": "The food was good and quickly brought to our table and the portions were just right. The staff was friendly and efficient and this made for a nice break on our drive north."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVlowdGxaamhFUWxSSVQyRjFORTFsV1RCQ1dtYxAB",
            "text": "Food was great and very tasty. The only complaint I have is the service I received. I went there for a birthday dinner and it seemed every request we asked the waitress for she seemed a little annoyed. We still tipped her well but the service could have been a little more accommodating. Overall the food made up for the mediocre service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMFZFUjNhMEpsTW1wTVNtNTVkRFpaUVhCSlQyYxAB",
            "text": "This place is remarkable. I love all the appetizers. Crab Cakes, Asparagus, clams, shrimp tempura, it was all delicious. Service is great, they are very attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVNXNUxWMEpaU0ZOUVptdzFSMWRRY0RGc2FYYxAB",
            "text": "Very friendly staff excellent service and food. Sat outside and had a great meal. Highly recommend you try it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZmExQjRiVGRKZG5sU05YWkdSazFIUm10dVpVRRAB",
            "text": "Food is ok. But the people and the atmostphere were top notch. It may just be my preferences with the food, but I feel it could be elevated a bit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVE9TMDJRa3RMYjFKU1MwTlZkSFJNV1dWd1FtYxAB",
            "text": "Food was delicious! The steak was cooked perfectly and the special peach salad was very tasty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trd1ZrUmpWSEV5VWtRNFgzb3hVbTlLU2t4RFExRRAB",
            "text": "What a great place to eat !! 6 of us went for dinner, the steak, chicken marsala,clams casino,lobster cakes, everything was excellent!! The service from Amy was outstanding!! We will be returning!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSDA4b0tvX01XRDl3RRAB",
            "text": "Wonderful!  Food is delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYjU4ZGozLVpQMTJ3RRAB",
            "text": "We had our daughter’s First Communion celebration here and it was absolutely wonderful! Everything was so delicious—from the appetizers to the main courses, our guests couldn’t stop complimenting the food. The owner was amazing to work with and made sure every detail was perfect for our special day.\n\nI especially loved the party room—it had beautiful big windows and a lovely view, creating such a bright and welcoming atmosphere. Thank you for helping us create unforgettable memories! Highly recommend for any special occasion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONnR2THI3MTdUMGJBEAE",
            "text": "Cathy was an amazing server, very attentive and fun! The food was very good and plentiful. We shared the Zucchini flower and the Tuna Tartar. I have the Chicken Danielle and my hubby had the halibut, delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJblhyS0tiamZMalV3EAE",
            "text": "Bottoms Up is our favorite go to place! The staff are lovely and attentive. The food offers a great variety of quality meats, seafood and fresh produce. The flavor combinations often impress me. The martinis are always amazing as well!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUFZsOWJUajVXQTNnRRAB",
            "text": "⭐⭐⭐⭐⭐ Bottoms Up Restaurant & Pub is an absolute gem in Slate Hill! The atmosphere blends rustic charm with modern elegance inside a beautifully restored 1880s building. The food is top-notch. The staff is friendly, attentive, and truly make you feel welcome. Whether you're there for a casual lunch or a special dinner, this place never disappoints. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJU2xvdU9mZ01YOTN3RRAB",
            "text": "Nice place, service was great, had a Dill salmon dinner was fantastic!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDVPbUZnEAE",
            "text": "Very good food and service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN05EWU53EAE",
            "text": "Bottoms Up Restaurant in Slate Hill is an absolute gem! The food and service are impeccable, with every dish prepared to perfection. The staff is incredibly friendly and welcoming, making you feel right at home from the moment you walk in. It’s the kind of warm, family-friendly local restaurant that keeps you coming back. Whether you’re stopping in for a casual meal or a special night out, Bottoms Up never disappoints. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcE5hOWlnRRAB",
            "text": "Food is always amazing and filling. Drinks are delicious and service is great. Will always come back here when in the area"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMktDYjR3RRAB",
            "text": "Awesome well kept secret!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneTY2THpnRRAB",
            "text": "Food never disappoints. Atmosphere is so inviting. Staff is AMAZING. Drinks are delish! Can’t say enough great things about Bottoms UP."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaV9uQkVnEAE",
            "text": "We had a group event there, it was good but we didn't sample much food. Some from our group are regulars and they recommended Bottoms Up. I wouldn't mind trying it for my own meal.\nStaff was good, place looked nice."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncHE2c0pREAE",
            "text": "Overpriced food and drinks, small portions (shrinkflation). $10 for a regular pint of Guinness, not even an imperial pint. Absolute joke. Brown water pours out of the sink when you wash your hands, bartender seems like she wish she was doing something else and just wants to go home. Chef forgot key ingredients on my entree. Place has always been a rip off even prior to new owners."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMFBDX0JREAE",
            "text": "Great food always and awesome service!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLM2ZQRXZnRRAB",
            "text": "Always  a great time"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcWF1ZUVREAE",
            "text": "Ate recently here on NYE. All the staff were so accomodating, as we were a large party coming in late. Food was delicious, definitely one of the best meals I've had in America. Amy went above and beyond serving us. Absolutely wonderful experience. A good restaurant is always worth the $5 or $10 extra for a great meal!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcmE3dEpnEAE",
            "text": "We went here for our office Christmas party, and everything was perfect."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNXZ6Tk1REAE",
            "text": "I had heard good things about Bottoms Up several times and finally had a chance to stop in for lunch. The building has been a restaurant for well over 40 years with varying success.\nWe arrived a little early for lunch and were seated immediately. They have a nice variety of beer on tap and also a nice wine selection. I chose an IPA. Our server was very pleasant, friendly and accommodating. We placed our order and as we waited, the place started to fill up. Obviously a good sign. Our order came quickly and was absolutely delicious. The prices were also quite reasonable. While there we checked out the full dinner menu and will definitely return for dinner and also lunch again. It's worth a stop to check it out. You will not be disappointed. Highly recommended."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSejZyNXpRRRAB",
            "text": "Food was good but made us feel heavy. I had the mahi."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OWJYcFJBEAE",
            "text": "Great place, Great food, Great people! Cannot go wrong!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2a1pLcTN3RRAB",
            "text": "Thank you for making my daughter's baby shower so beautiful. The staff went above and beyond, and the food was fantastic! The restaurant had a very cozy atmosphere, and we will definitely be back for lunch/dinner."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NHBfMTF3RRAB",
            "text": "If you are looking for great food, attention to detail, professionalism and the best service around…Bottoms up is the way to go!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M1B2VmVnEAE",
            "text": "We love going here for dinner and/or a work lunch! Food is always delicious and the staff is nothing short of fantastic. My wife and I also had our baby shower here. I couldn’t recommend this restaurant enough. Catering to each of our needs and ideas for our special day.  Delicious food, friendly staff, and an enjoyable environment is why this restaurant is a hometown favorite!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbVl2VlpBEAE",
            "text": "Sat in Dinning room 3 large tables were occupied and it was extremely noisy. Was hard to have conversation.\nOrdered the crab cake dinner. The veggies were great but the crab cakes are spicy and I could not eat them. Took them home but eventually tossed them. Everything else was delicious.  Don't think we will return anytime soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMElyZnNnRRAB",
            "text": "Excellent food very nice dining area,just wish the entrance was grander"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcWNEbndRRRAB",
            "text": "The restaurant was very busy, and we didn't have reservations, but the staff made us very welcome, and were able to seat us at the bar. We started with Apple Cider Mules and they were autumn in a cup, so delicious! The entire meal was amazingly delicious, served perfectly, with very generous portions! Every bite was literally perfect! I have never had a bad meal here, ever. Don't hesitate and visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOXZmb2lRRRAB",
            "text": "The restaurant is lovely. The food was fantastic. I had the steak and my companion had the Reuben special. The steak was cooked perfectly to liking. We also had cappuccinos that were very aesthetically pleasing as well as delicious. For dessert we had the tartufo and pecan cheesecake. Overall I would recommend this restaurant and will return to visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnNXYTV3RRAB",
            "text": "Great service and amazing food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNF9lekl3EAE",
            "text": "We are extremely happy we chose this venue for our son's and daughter-in-law's Rehearsal Dinner (50 people) and Welcome Drinks (70 people) the night before their wedding. Kathleen, the proprietor, was a pleasure to deal with and was helpful with the planning. The staff was accommodating and delightful; everyone said their food was delicious and enjoyed the festive atmosphere. I highly recommend this restaurant for casual dining and special events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdmJlQlNnEAE",
            "text": "Great food, nice atmosphere. We also had a great waitress!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaE9Qa3p3RRAB",
            "text": "The food here is excellent.  I just had big Mac egg rolls with special sauce dip. Fantastico!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURici1DVThRRRAB",
            "text": "Always a great experience at Bottoms Up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicWNmRVF3EAE",
            "text": "My cousin had her 40th birthday party here, great atmosphere the food was delicious. And most importantly my cousin had the best 40th birthday surprise ever!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidHJ5X213RRAB",
            "text": "At lunchtime, I enjoyed an appetizer of fried asparagus, then an Angus Swiss Mushroom Burger. I finished with the 5-layer chocolate cake. The 3-course entree was spectacular. The waitress, Erin,  was informative and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybDUtb3RBRRAB",
            "text": "Wonderful service and delicious food!!  They went above and beyond for my sisters birthday party! I’ll have all my events here now. Thanks so much!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOC0yOFhREAE",
            "text": "Always a really solid place to eat. Food and service has never disappointed. The portions are hardy without being overwhelming. I had the halibut brushetta and it was refined and super flavorful ( idk if they changed chefs because I've had this before, quite awhile back, and it was large pieces of tomatoes and cheese... I like this newer diced version much better!) My husband had the fra diavlo lobster ravioli and the sauce was fresh, thick with just the right amount of heat. I had a lemon drop martini... Cold, tart, sweet and strong... Just the way I like them!\nThe only drawback is if they are full swing busy it's loud and hard to have table talk but basically that's any restaurant...so what are ya waiting for? Go make a reservation!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbTdyWU9REAE",
            "text": "Surprisingly wide variety of choices: from ahi tuna to steaks. Appetizers were plentiful and delicious. Biggest wine serving I've ever seen!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMHJhQkJREAE",
            "text": "My parents took us to this place over the weekend and we were pleasantly surprised. The staff was very friendly, and even joked around with my mother, who is QUITE a handful.\n\nI ordered a Manhattan, which was straight up and yummy. A perfect way to start the weekend. Then I got the Seared Ahi Tuna with veggie soba noodles. It was excellent. Next I shared their salad special with my better half and was also impressed. It had walnuts, apples, dried cranberries, gorgonzola, and raspberry vinaigrette.\n\nFor dinner I had the Salmon which was smothered in a tomato and sausage bruschetta, and sat stop a yummy pile of sauteed spinach and vegetable. Dessert is something I usually pass on, but you don't come by Blueberry Cheesecake every day, and when I heard it came with vanilla ice cream, that got ordered without a second thought. Of course it was great as was the whole experience. Check the place out if you have an evening free. But be sure to make a reservation, because it's a pretty popular with the locals and a great spot for dates."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROGJ2N0F3EAE",
            "text": "Always great service, food and atmosphere. Big private party room. One of our favorite places to relax and have dinner and a drink.\nWas delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcmN2VmRREAE",
            "text": "It’s been a couple years since I’ve been to Bottoms Up. Used to dine in once or twice a year going back 15 or so years. I thought the food this evening was incredible. I had the beef vegetable soup for an app, which was tremendous, tons of beef. Great flavor. Scallops Carbonara for entree was insanely good. Very nice sized portion consisting of 6 or 7 massive seared scallops and probably 8oz of fettuccine pasta. Sauce was rich and tasty. The best Carbonara I’ve ever had. As usual, Crème Brûlée for dessert. I found the Brûlée to have a different taste and slightly different texture. Orange zest, perhaps? It was excellent, but I will say I preferred the traditional crème brûlée they used to serve. Still, it’s not like I didn’t eat it and enjoy it.\n\nPrice was reasonable, for sure. Service was good. Also good to see their longtime waitress now owns the business. Obviously they’re doing an excellent job. I’d recommend Bottoms Up over any other establishment in the area."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa0lQSjlRRRAB",
            "text": "This was the first time at this restaurant and it was definitely a good one. The atmosphere was cozy and I loved the odd layout of the dining room. The food was really good with large portions, our waitress was really busy so it took her a…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVZzZiZkxnEAE",
            "text": "This restaurant is next level. For years I've been on this odd quest for the perfect tomato soup. Oh my gosh. They nailed it. Everything we ordered was delicious and perfectly plated. I tell everyone I know who's a foodie that they NEED to stop by this place. I wish I could give ten stars!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOV9LTzdRRRAB",
            "text": "Bottoms up Restaurant is a staple in the community. It is a family owned establishment with amazing and delicious food.  I enjoy dining here with my wife. It is the perfect environment and ambiance for a romantic dinner.\n\nI have also visited this place with a group of couples for Valentines Day and for Christmas party events.  Bottoms up never disappoints, the food is always delicious.\n\nToday, I had the Halibut, and my wife had the salmon. It was just super delicious.  Cindy was our head waitress, and she was very attentive, suggested the perfect wine to complement our food. We had a perfect evening as usual. Love this place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMnFyM2NnEAE",
            "text": "All the food was great. The staff was friendly and welcoming. I'll be going again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcmFySkR3EAE",
            "text": "superb friendly service. elevated culinary menu. comfortable atmosphere. moderately priced. highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleUpxVXJRRRAB",
            "text": "Went on a Tuesday for girls night. Caitlin & Erin were amazing  I had the zucchini flowers and Greek salad  - delicious!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzODk3WkhREAE",
            "text": "Great place to eat and enjoy the bar also the suveris is awesome and the staff here are awesome too please come if you're ever in the area its great"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cklUT3RRRRAB",
            "text": "I would definitely give food 5 stars but tonight on my birthday they also had a big party and food came out really slow for us."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0ck9ITUJBEAE",
            "text": "Awesome lunch specials and delicious drinks! Great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOUwyTF93RRAB",
            "text": "Lovely staff who made our visit for dinner very enjoyable. The food was awesome...clean, fresh, and beautifully plated. Halibut, scallops, and lobster ravioli fra Diablo were our meals. Topped it off with an amazing chocolate cake that the 3 of us shares. We definitely will return!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnb2ViR0dREAE",
            "text": "Yesterday was my first time here and it didn't disappoint. Bartenders were friendly and the food was delicious. Will absolutely be stopping here again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDa00tVlVBEAE",
            "text": "The food was absolutely delicious!  We sat outside on the back deck which was lovely.  Cocktails were pretty good too.\n\nThe service was a little slow, but I will attribute that to the cooks taking their time on the delicious food as the servers were attentive.\n\nEdit: Have been back several times and upped my review to 5 stars. It's our favorite restaurant !"
        }
    ],
    "reviews_count": 67
}