{
    "name": "Chianti Cow Restaurant",
    "place_id": "ChIJ-YjR9cI3w4kR4qq2xuC6KIc",
    "grid": "BX5",
    "address": "1483 US-6, Port Jervis, NY 12771, USA",
    "rating": 4.4,
    "user_ratings_total": 275,
    "phone_number": "(845) 856-7740",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMlZIaElZVUZNTFhGdldISkJTelJmWW1OS2RVRRAB",
            "text": "A very inviting restaurant. Friendly and attentive staff. The food came out at a good pace and was very well prepared and tasty. It was our first time there and will return. My dining partner asked me to include in my review how good the coffee was. She felt it was very fresh and flavorful and better then she had experienced in most restaurants.\nOverall a great experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRVNWOTRYMnRaVERGM1dHaHBVMVp1WTJGMWFrRRAB",
            "text": "Truly impressed with the atmosphere, service and meals. Wonderful place for intimate settings, family and crowds. Beautiful cozy settings that bridges old world charm with a modern touch. The country exterior does not do justice to the  inside, amazing. It's what me and my wife was looking for, to relax and converse while having dinner and talk of our old days. Thank you so much. WC Port Jervis NY"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdloxWnRiMlpRZG5OWGMyaDJYM0UxZUhNMmNuYxAB",
            "text": "Great place to bring the whole family. Our server Abby was great. My steak was cooked to perfection as well as the scallops. They were not chewy at all. Definitely would recommend, and will be coming back ."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbHBqSzFBRRAB",
            "text": "This was our first visit, and we WILL be back!\nThe food was outstanding - incredibly well-cooked, great balance of flavors, and such a wonderful variety.\nWe had apps, a meal and half the dessert menu.\nThe staff was friendly, responsive and such a pleasure.   Truly cannot say enough about Chianti Cow.   HIGHLY recommend it!\n\nSecond visit last night and extremely happy that we went back!    Food was, once again, superb - the pork with mashed cauliflower and bacon was to die for, my mother-in-law had the chicken street tacos and RAVED; it had the lamb shanks wellington and it was the best lamb I've ever eaten.   Amazing food and atmosphere.    Go there!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNRERtcVR2bkw3RzV3RRAB",
            "text": "Terrible experience.  Very unprofessional and the food was horrible!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1FsUkxZeTFtYlZOWGVGSXRaREJvZDFoa01rRRAB",
            "text": "Service was terrible. Food was not that great. Went there for Father’s Day buffet. There was no sign posted about the price and when we ask how much it was and was surprised by it was approached by the chef and then given attitude asking do we have a problem here very unprofessional will never be going back there again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MmVGTkRSMDl4Y1UxWk4yRjVNMVJEZEV4SGVtYxAB",
            "text": "I visited Chianti Cow Restaurant recently, and it was unfortunately a disappointing experience. We were told to give our name for the buffet and come back to get a plate, but no price was posted or mentioned at any point. We were very surprised to find out the buffet was $30 per person after we had already started.\n\nThe food didn’t match the price, and instead of addressing our confusion politely, we found a rude handwritten note left on our car, which felt unnecessary and unprofessional.\n\nI hope the restaurant will consider posting clear pricing for the buffet and treating guests with more courtesy in the future."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNy1YV1RBEAE",
            "text": "I have to say, this place has the most potential I’ve seen in a small farm to table establishment! The owner and chef is a true gentleman with class and cares about his customers. His motives are clear, he wants to serve his public and create an environment of tasteful food and friendly atmosphere . I am so grateful for this place. We will definitely come back and recommend this place to anyone we know. Thank you to the owner and staff for making us feel so welcomed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnamNTQlp3EAE",
            "text": "What a gem! Would definitely come back to this place, everything was top notch."
        },
        {
            "date": "9달 전",
            "language": "da",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeTV6T3BRRRAB",
            "text": "❤️CHEF ROBERT ERVINE❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfal95RW1BRRAB",
            "text": "We went Saturday ...it was fantastic. The food the people the place all fantastic. They just need to get a ramp for accessibility...and accessible bathroom. We will definitely be going back. We all loved it"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd3ZQcFRBEAE",
            "text": "WOW!!! How have we never been here before!??!!!!! Food was INCREDIBLE !!!! Farm to table, fresh ingredients … great food with a lot of love added in!!! Can’t wait to come back!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZ2JXaURREAE",
            "text": "The food and service were absolutely impeccable I would come back to this place in heartbeat we had such a good time"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQZ1lpY01BEAE",
            "text": "First time this weekend trying out Chianti Cow. We will definitely be back. The food was absolutely delicious and looked like pieces of art on the plate. The pumpkin pie martini, our server made was insanely delicious. I had the lamb shank Wellington and it was still frozen on the inside. It was so good that I ate around it but our server took it off our check. I didn’t expect or need that but that was an act of good business. We were recommending this restaurant before we even left the parking lot. A definite go to place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQemVQQzhRRRAB",
            "text": "Great time and food was very good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbnM2TEl3EAE",
            "text": "Very good food, a little expensive great outdoor venue when it's nice out"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcG95ckJBEAE",
            "text": "I wish I could give this place more stars honestly. GREAT food and service! This is the perfect little spot to enjoy a delicious dinner farm to table style!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud09PenVRRRAB",
            "text": "We were looking for a restaurant that we haven't experienced yet .I have heard of the Chianti Cow so we decided to give it a try .The restaurant is very nicely decorated. The serves were outstanding .They checked on you often to see if you need anything and to see if you were enjoying your meal .We had the caprese salad and the homemade corn chowder. Both were delicious. For dinner we ordered lamb wellington and chicken francese.Both were very good .We ordered Apple Crisp a la mode .Also a delicious ending to our wonderful experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHZuYml3RRAB",
            "text": "Had a great anniversary meal at the Chianti cow. This is my first time here with my lovely wife. It is a small but quaint. Spot has a very country bar vibe feel with a hint of a family atmosphere. The conversations and tones were light and easy-going. The staff energetic, and friendly, a very family environment atmosphere I love the fact that even the owner and the chef would come out and just say hi and talk and have easy conversations with you.  for such a small quaint and tucked away spot. The food was very elevated and next level. Had the Chianti cow burger, and the crab cakes with hash all was delicious flavorful and filling even the fresh baked bread was great very easy-going drinks along with the atmosphere. We were able to finish off the meal with the small little cheesecakes a truly great experience definitely will go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMb3NTZ2JREAE",
            "text": "The family that owns this place is doing what they are destined to do.The food is to die for, the wait staff is super, especially the owners daughter.The italian food is like ,none other in the area.We had 2 different dishes and one was a great as the other.Do yourself a favor and if your in driving distance of Greenville NY go try this place,I know we'll be back! The CC's seasonal pasta and CC's pasta special are the meals we ate also the Seafood Arancini balls,and French onion soup for apps."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb2Vibm1BRRAB",
            "text": "The food was barely edible. The chicken was dry and burnt, the brisket was remarkably chewy and my barbecue chicken sliders were not barbecue flavored and not any kind of delicious. It took 45 minutes for the food to come out and it was mildly warm. The waitress took my sprite to refill it and came back with water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2FiZUlBEAE",
            "text": "Food took nearly an hour to come to my table. Meats came out very burnt and flavorless, sandwiches were soggy, and prices were quite high for the portioning. The quality of the food wasn't great either."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6ejR6R2pnRRAB",
            "text": "Food and staff is outstanding.  Highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMktqMTZnRRAB",
            "text": "Everything is always delicious! The atmosphere is friendly and inviting. Great job Keith & Lisa\nJac & Patty G."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c3FpaHhRRRAB",
            "text": "Very meh. The service was ok. The dining room simple. The food looked nice, but was bland. Very very bland.  Too expensive for what it is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eE5IMEpREAE",
            "text": "They never miss the mark! High quality, exquisitely prepared food in an area that desperately needs it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNzliTF9BRRAB",
            "text": "While I have eaten here several times, this last time was so fabulous.. you see I live in Virginia but wanted to get dinner for a family member who had had surgery. The person who answered the phone was fabulous and gracious and kind.\nTheir burgers are some of our favorite and I can’t wait for the summer to be back up in NY and eat there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOFpEX19BRRAB",
            "text": "Ambiance and service were excellent, harbingers to the simply delicious entrees which followed our very unique and tasty appetizer- petite potato pancakes and deviled eggs. Main course was lamb shank Wellington (outstanding) and crab cakes (delicious), both presented with a gourmet flair, by friendly and attentive waitstaff. A truly wonderful dining experience, in this bistro-like gem of a restaurant, situated in a rural country area. Highly recommend this great place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcVlMX1B3EAE",
            "text": "Great food, great atmosphere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMExqaFZnEAE",
            "text": "Local people, local fresh food, friendly atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROeV9TemVBEAE",
            "text": "What makes Chianti Cow such a pleasant dining experience is that CIA-graduate Chef/Owner Keith O'Connor really cares. He cares about the food he serves and he cares about his customers. The Chianti Cow is not the most pretentious, nor the most expensive (far from it), nor the fanciest restaurant in Orange County, but in many many visits to this out-of-the-way bistro, we have never had a meal, or even a dish, that we didn't enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObUpIWG13RRAB",
            "text": "Our servers were very polite and friendly.  Will come back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc0pPckh3EAE",
            "text": "The food was excellent. Service well done."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWZzZmUzVnRRAB",
            "text": "It was ok. Possibility won't go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWdkpqZURREAE",
            "text": "Great. Awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsN3NfNXp3RRAB",
            "text": "Nearly everything was room temperature or lukewarm. Based on other reviews, this isn't uncommon. Don't order a cappuccino.\n\nItem descriptions were lacking.\n\nI had salmon that was swimming in a sort of, pureed fennel sauce that was not mentioned in the description, only that fennel was an ingredient and not how it was prepared.\n\nMy desert was described as a custard, it was more like a cobbler or a tart.  It was probably the best thing I had, next to the bread or the cauliflower appetizer.\n\nThe pasta special had a strange astringent flavor to me. The same kind of astringent you get from using too much nutmeg.\n\nI was concerned by how cold my chicken dumpling soup was, but I let it slide. It was a beautiful soup, regardless of the temperature. But the food safety side of my brain was screaming at me to not eat a cold chicken soup. I also didn't think that nearly everything else I ordered would be the same temperature.\n\nMy salmon dish was just.. weird.  The piece of salmon  was perfectly cooked though, which made it worth it.\nA good portion of the ingredients were bitter and starchy, it did not compliment or contrast the salmon in any way.  I thought  the fennel puree was very nice, until I became absolutely overwhelmed by the third bite. It would do much better as an accoutrement, rather than be such a large portion of the dish.\n\nThere's lots of great quality ingredients, but the flavors don't mesh well. Myself and my partner left full, but unsatisfied.\n\nI admire what's being attempted, but I don't think I'll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa002OTRRRRAB",
            "text": "Awesome farm to table experience.  Staff was friendly and the food was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbXBHS3ZnRRAB",
            "text": "It my #1 restaurant to have great quality food! Would not dissapoint to celebrate any special occasion!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1el9hRVFREAE",
            "text": "Pumpkin raviolis the best I’ve ever had. Crab cakes awesome. Desserts are the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MmN1OHFBRRAB",
            "text": "Interesting choices, like lazy lasagna.  It was delicious.  All the food served to us was very tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadGVHNUtnEAE",
            "text": "We were a party of four and we found the food to be excellent.  Cozy inside.  The service was very good.  Beer nice and cold and drinks were good.  Catherine was our server and she was top notch.  There was a 15 year old girl assisting and she messed up with our coffees.  So what, she made a mistake.  I give her credit, as she's out there working.  Her name was Kayleigh.  Young lady, keep up the good work, you'll get there.  We certainly will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaFlPeDlRRRAB",
            "text": "Food was delicious, service was great very personalized."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacHB1M1NBEAE",
            "text": "Hands down one of my favorite restaurants!! 😊 Chef Keith comes up with the most amazing foods I ever had 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNablkyaGtBRRAB",
            "text": "Typically delicious food and is apart of our favorite restaurants to go to but... The last few times our food has been taking such a long time to come out of the kitchen ( we dine early and there was one other table) and it's been cold. My husband got the Mac and cheese and the cheese wasn't even melted, I was so looking forward to my Salmon ( usually sooo good) but mine was cold and my piece of Salmon was very small. Than we asked for cappuccinos with our dessert but the dessert came no coffee... When coffee finally came guess what? It was cold. Our waitress said the machine doesn't work so they warm the milk up on the stove, than she offered to microwave it... Ummm no thanks. I'm giving it 4 stars in the memory of past dinners ( and honestly the wait staff are all super friendly and seemingly doing their best) but these last few times have definitely left us questioning if we should keep them in our restaurant rotation.\n**Side note.. take cappuccinos off the menu and save yourself and staff the hassel!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc2JtOXBnRRAB",
            "text": "Loved the friendly and helpful service, ambiance, and the food - must try the Harvest Chicken. Vegetables are locally grown, bread served is made in-house, and it comes nice and warm with butter."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbnYzWkh3EAE",
            "text": "The appetizer I had was very expensive and not much food but dinner was great.  The bench seats hurt our backs and bottoms and suggest better seating.  Service was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOU02eEp3EAE",
            "text": "Very cool little restaurant. A little crowded as I was there for a celebration of life, but overall everything was great!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMGNYbkhnEAE",
            "text": "This place is a Gem, hidden away but when found and explored rewards the senses on every level. Service was friendly, professional and precise. Food was great and cooked to desired preference passing my expectations 💯 i dont work here and have been a vegan for years before becoming flexitarian so if i loved it here you might too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd1lMYU9nEAE",
            "text": "Service excellent  food fabulous"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaDZEMk1nEAE",
            "text": "I live in the general area, but I found out about this place from Restaurant Impossible with Robert Irvine. The food here is always excellent! My only complaint is that sometimes the service is hit or miss or sometimes they are out of things on the menu. One time they were out of butter for bread LOL. Anyway, it’s one of my favorite places in the area. It’s one place I will keep coming back to."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMU9IZGNREAE",
            "text": "This is the kind of local restaurant we need to support. Rather than eating at a big chain, come here for a great meal!\n\nCozy, tasty food, great service.\nLoved the stuffed pork.\n\nOnly thing: Lights were too bright for me, but not a big deal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bWR5LVJBEAE",
            "text": "Brought the family out for dinner, couldn’t have been more impressed with the food and the service.   Staff was on the younger side but attentive and very pleasant.   Food and drinks were superb and reasonably priced.  Will be back again for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZy15V2VBEAE",
            "text": "Amazing find for us. The food was farm to table, locally sourced, and came out fresh and hot. Their menu selection accommodated our groups varied tastes. The wait staff was very helpful and prompt. We are looking forward to our next road trip just to make an excuse to come back to this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Z3JyWEhREAE",
            "text": "We were so excited to try this place for the first time, but what a disappointment. I ordered land and sea and the scallops were like jello and undercooked and my filet was so overcooked you couldn’t eat it. My husband ordered his ny strip…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROGRyV0lBEAE",
            "text": "I came here once for their Octoberfest and loved it. Good beer, good wings, and good pizza. Now I’ve been here for dinner. Chicken wings are still good, chicken piccata was very very good and had a pecan brownie sundae . The staff is very friendly. The inside is cozy and has a nice little bar. Quite a little gem on route 6."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNlB5WVRnEAE",
            "text": "Came all the way from Central NJ, had a wonderful time, staff was helpful, food is good. Would stop by again when nearby."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa2FmUWlRRRAB",
            "text": "Absolutely horrible....\nGarlic knots are dough,  not even cooked and I could literally pull it apart like uncooked dough.\n\nPizza looked fake, but gave it a chance and also not impressed. Does not taste horrible but I'd rather by a $6 pizza from sams club and cook it at home for a 10x better pizza.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdnJhb1BBEAE",
            "text": "This was our first visit and I'd highly recommend it!  We were there on a Friday evening arriving a bit after 5 with a group of friends.   Really started getting busy about an hour later.   I had their Seasonal Pasta which was absolutely delicious!   Multiple friends had Steak, and one had an Eggplant dish.  Presentation was beautiful and the food, (I know I said it already) was really, really good!  Everyone totally enjoyed their food and all said we want to go back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMktYNzRRRRAB",
            "text": "We stumbled on this restaurant  and had a fantastic dinner! The prices were very reasonable, the service was attentive and the  meal exceeded expectations. I had a cocktail special which was well crafted. Our server recommended some…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcTRTamhRRRAB",
            "text": "This is a cozy little restaurant with excellent food and the wait staff is extremely nice. The only downside was, our dinner order got \"miss placed\" and we wound up waiting over an hour to eat. Between arrival and departure we were there about two hours and thirty minutes. That includes waiting to be seated, appetizers and the dinner.\nIt was a shame but again...they were very nice about it and even gave us a free order of baked, stuffed clams.\n\nWe will go back, the food was very good and we'd like to give them a chance to improve on the wait."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNHAtc0FREAE",
            "text": "I haven't been inside since the restaurant was on Restaurant Impossible. I loved the food before and love it more now. I had the stuffed chicken with roasted veggies and mashed potatoes. It was awesome! Melted in my mouth. The potatoes and veggies were cooked perfectly and the chicken was moist and tender! I only ate half because I wanted to enjoy it again the next day as well and it was just as good.  As for the inside, it was very nice and seemed brighter than before just not sure about the long table in the middle of the room. We sat in the small room off the main dining area and was very nice and quiet. I would absolutely go back again and again!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHb05USlBBEAE",
            "text": "Went for dinner tonight hoping the 3rd time would be the charm, however we left disappointed once again.\nMade reservations but was not told they had a large party there, knowing this would have swayed us not to go. We arrived and were placed at a table that was sticky. As we were seated the waitress advised it will be awhile due to the large party. After 10 minutes another waitress appeared and took our drink and food order, she was told we’d like the salad before our meals. About 10 minutes later our drinks (seltzer and watered down iced tea) appeared. 20 minutes later our salad, which had wilted soggy iceberg lettuce under the fresh kale and apples. minutes after the salad arrived our dinners did, we sent them back as we had just gotten the salad. Once we sent back the salad due to rotten iceberg lettuce they brought out our heat lamp dried dinners. Mine was the pumpkin ravioli special that had some sort of garnish on it that wound up burning under the hot hold lamps you would think a chef  would notice and remove it and add new garnish but no out it came. My husband Octoberfest platter was just dried and overcooked. Sadly this place is in need of a competent food manager to run it, I’m truly surprised it is still open with how it is run.\nBut talking of running please do it in the opposite direction of this place and to any other restaurant unless of course you are looking for less then mediocre quality food at high prices."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoa0lTVEt3EAE",
            "text": "The food here is worthy of a Michelin star however what separates this place vs a similar restaurant like The Farmer's Daughter in Newton, NJ is organization and quality of staff.  The Farmer's Daughter has a lovely aesthetic, the same high quality of food and books up for dinner/brunch at least three weeks in advance.  The Chianti Cow should be at the same level, if not above.  Have dined here three times.  The first time I had a lobster roll special that I still dream about.  Almost did not get a reservation because when I called the person was insisting they were not open that day even though I was looking at a social media post saying they were.  Encountered a cranky hostess but had a rock star waitress who was a one woman show.  The second time we walked in to find our reservations missing even though I had a text confirmation from them.  Didn't shock me because when I called the person who answered kept asking me what I wanted to order even though I kept repeating I would like to make a reservation.  In this instance, we were seated after some scrambling.  The meal was excellent, the staff was kind but there was an air of chaos and disorganization throughout the staff.  The third time we visited we were brought in by the advertised specials.  Unbeknownst to us, they were \"slammed\" the night before so by 6PM on Saturday, they were out of probably 50% of the specials they were still advertising online and on the menu they handed us.  What was intended to be a fun, relaxing evening turned stressful as options for plant based/pescatarians were quickly whittled down to two options.  This was compounded by not being able to get a glass of name brand wine even though they have a fully stocked bar.  Your options are nameless house wine only unless you want to buy a full bottle, which is double the price of what one would pay down the street at the liquor store.  I did appreciate they offered to open a bottle for me to have a glass of wine that I liked, but it was a process of asking the owner if it could be done.  Prior to that visit I do not recall being limited to house wine, so this must be a new rule?  I would suggest they either revert back to offering a curated wine selection by the glass or bottle or switch to BYOB. This is probably one of the best restaurants I have eaten at however will not be returning to."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMk9LMUtnEAE",
            "text": "We had an intimate dining experience. I wouldn't take company here, just a romantic get-together in the Chianti Cow.\n\nThe menu is diverse, and the cooking combines familiar but fresh ingredients in unusual and interesting ways. For instance, the lobster ravioli was definitely lobster-forward as it should be, but the dough contained cinnamon, a stimulating pairing of two familiar flavors. Further, the chef layers these novel combinations in any single dish, using a variety of scratch sauces. Lots of love in this cooking.\n\nCan't wait to go back, especially during harvest season. I have a feeling we would not have dined there if we hadn't gotten there early without a reservation on a Saturday night. Next time I'll call ahead.\n\nOnly suggestion I have is that the full-bodied espresso should be served with a biscuit and lemon peel."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMV9qWmlnRRAB",
            "text": "We were anxious to try this restaurant after seeing it on Restaurant Impossible. Unfortunately, anything that Robert Irvine taught them, they forgot. The staff was all over the place. They were either huddled by the bar chatting or talking…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2a3ByaEdBEAE",
            "text": "Went for dinner. We had the pork stuffed tenderloin, salmon and the burger. The food was fantastic. The cauliflower mash is as to die for. Make sure to say yes when the offer bread it was great too. Staff was pleasant and helpful. Bathroom and restaurant was spotless."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeDQ2bTl3RRAB",
            "text": "Went for Restaurant Week 2021. Had Brussels Sprouts, Crab Cakes, Chocolate Mousse. All of the food was excellent! I am a good home cook, and the mousse & crab cakes were better than I have ever made! I was surprised at the portions, bigger…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzeHZyLXhBRRAB",
            "text": "The only good part of this restaurant was the server. We ate a local family who figured we would give this place a shot. 4 dishes were all incorrectly cooked. We made it very clear what temp the meats needed to be. Rare doesn’t = well done.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeGVhenlnRRAB",
            "text": "Where to begin, well I guess at the beginning...we, like I assume many others, were hoping that the Chianti Cow would turn things around after the Restaurant Impossible makeover. My wife and I just took our first vacation since COVID-19 started and decided to give them a shot since we were staying only 15 minutes from the restaurant. Our lodging host recommended other restaurants in the area (not a good sign), but we decided to go for it anyways. We showed up on Saturday 2 hours before close and we didn't have reservations, but the place didn't seem that busy...we waited 5 minutes for them to clear a table for us, which was fine, but we were informed that there was a private event going on outside and things may take a little longer, again this was okay to us. However, everything after this point was inexcusable, slow service, but we were one of only 3 tables in the place. Every table was left not cleared after guests left, servers were chatting with the locals the entire time, and ignoring our drink order. It took 10 minutes to get the drinks that we ordered and it seemed as if they were a little light on the alcohol that should be in a cocktail. We still had not been given silverware or offered a glass of water. Finally we placed our order for food, a pork sandwich special and a harvest chicken dinner. The food came quickly and the presentation was fairly good, but again you cannot put lipstick on a pig and expect anything but disappointment. The pork was significantly overdone and beaten to death before breading and then putting it on more bread and then the sauce was inconsistent on the two halves of the sandwich, with one being so watery the bread became soupy and the other half was crunchy. The worst part however was that as my wife made her way through the chicken she got to the thicker part of the breast and discovered it was mostly undercooked and fairly inedible. At this point we were both over it all as the servers have no idea how to run a front of the house as they could not figure out how to make a pot of coffee or if they had a blender to make a drink for one of there signature cocktails. It was about this point that one of the servers parents called the bar and she chatted with them for a few minutes and then the whole family arrived and sat at the bar 30 minutes later and clearly got preference over other customers. All and all this was a completely underwhelming experience and that is just so disappointing given there are much better restaurants just down the road in neighboring towns. We will not be back. I wish I could have given a better review."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z2VQajJBRRAB",
            "text": "I haven’t been here in a long long time. It was Carmines last time I was here!. I give it a big thumbs up. I had a NY strip steak, and my wife the stuffed pork. Both were great. We started with seafood bisque and minestrone soup. Chocolate mouse to finish was also very good. I rate Chianti Cow up with the Tom Quick Inn, and the Walpack Inn. Short distance from I84, so stop in. Very close to everyone in the tristate area."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOGVma19RRRAB",
            "text": "I heard about this place from a friend. It’s certainly off the beaten path, but definitely worth going to. I had the braised lamb shank Wellington. The lamb was fork tender and the pastry crust was crisp. My companions had street tacos, stuffed pork, bistro burgers, onion soup and seafood arancini. Not one complaint. They also had desserts which they devoured.\nI gad a Expresso Martini which was a bit dry for my taste, but still good.\nThe restaurant is n a former pizzeria, not very big and certainly not fancy. It’s obvious that they put their money into the food, not atmosphere. That’s fine with me. Good food and fancy don’t always go together. Especially when the prices are so reasonable and that they have a bar.\nThis is the type of restaurant I’d find in Manhattan, in the basement of a brownstone. The menu is eclectic and creative. I believe that the chef is a graduate of the Culinary Institute of N.Y.  This is on Rt. 6, between Middletown and Port Jervis NY"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbzU3eFB3EAE",
            "text": "Place looks so warming and fresh after the remodel. I also would suggest keeping the menu small but refreshed weekly or biweekly depending on local fresh ingredients maybe just a 2-3 appetizers, 1 salad and 3-4 entrees. A family style…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld1lyVGJnEAE",
            "text": "Although we just stopped in randomly for apps and drinks, the Chianti Cow was a really fun choice. The wait staff was incredibly attentive and the food and drinks were great. If you find yourself in the middle of nowhere, relatively, be sure and stop here. You won’t be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWVPSjdRRRAB",
            "text": "Chicken dinner was very good. Fish and chips had good homemade potato chips but two rather small portions of fried fish. French onion soup was excellent. Service was outstanding. Everyone was very attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydE1uT19BRRAB",
            "text": "This is a weird review because I have yet to visit. However living 1847 miles away your restaurant is screaming and calling me.\nI see the passion in the dishes. I promise soon on my adventures with my new husband that I will there. Until then y’all keep going and I’ll see you soon. Yummy"
        }
    ],
    "reviews_count": 75
}