{
    "name": "MIX N MAC - MAC & Cheese",
    "place_id": "ChIJSStNmWQtw4kRRIHiTlLlZ7c",
    "grid": "BX5",
    "address": "280 NY-211, Middletown, NY 10940, USA",
    "rating": 4.6,
    "user_ratings_total": 951,
    "phone_number": "(845) 381-5536",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RlMxVjJlVUkzVWs1WVYwbzJkVlpyYmxoQ1NsRRAB",
            "text": "This was my first time here and it was absolutely amazing. Tasty and cheesy. Highly recommend!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GZlF6TXdTbXBNZUZsdlZqWldhRmRUUWxsbVVrRRAB",
            "text": "Great food, bad service. Ordered online, came in and told them my name and then sat and waited at least 15 minutes while 2 other groups got their food. Finally asked again if it was ready and it was just sitting there, got it 40 minutes after placing the order"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGNHVkNRbkJRUlZsa05FNWlUM2RvTVZNd2NWRRAB",
            "text": "The cannoli cheesecake is so delicious as are all the mac and cheese items."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25selpXMDVXa0ZpVnpONVZVbFRSbGx4T1haVmRVRRAB",
            "text": "LOVE THIS PLACE!!!\n\nJust wish it wasn't so $$"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podFZUUmxkekpLVjBzdFZFRjRXbVJrY2w4dFQyYxAB",
            "text": "Nom nom nom...mmmm good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bU1YVjFha3RZYVVSamVsVklUV1l5TFhKa01GRRAB",
            "text": "All sorts of mac n cheese combination to choose."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paa1UxaHdObTgwYlRWYWNIVmhSbEpsYm5ObFFsRRAB",
            "text": "Delicious... I had the Chicken Marsala and enjoyed it thoroughly.  I even had enough food to take home.  I would definitely return to try other creations!!\n\nVery friendly service and the owner was extremely informative and kind.  We were greeted immediately and with enthusiasm.  That's an A in my book!\n\nI eat black pepper on EVERYTHING, even foods cooked with pepper.  That's my only negative comment - they didn't have black pepper."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMk9YVnFZM1ZUTW14S2VqZG1lRU5IUTJGRGRsRRAB",
            "text": "It was a first time for us just visiting from Paris and we followed the reviews and oh my word!!!!... We were not disappointed 🤩🤩🤩\nBeautiful and comforting food with  so much choice.\nThanks for the owner  and  his waiter we had such a good time and we enjoyed the all experience very much!!\nA must go place if ever you visit the area it is worth it . And the pudding is divine!! Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNGFsTnpNMFpEZFZvMFNUZEdhWGhOZUZseGJXYxAB",
            "text": "Visiting from France, this was our first experience trying real Mac&cheese and it definitely set the bar higher than we expected...the food was warm and comforting with so much flavor, ( added bonus for the garlic balls 🧄)\nThe owner and waiter were friendly and ready to share their experiences and recommendations for other local businesses.\nWould definitely recommend for anybody and everybody passing nearby.\n\nPs- the cheesecake is definitely worth it ( even if you're lactose intolerant ;) )"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObWNrZGZSMnBWYWtsMExTMUVVWFpIWVRCU1NGRRAB",
            "text": "I’m from Michigan and was excited to find some great gluten free food while visiting New York. After reading all the positive reviews, we decided to try out Mix n Mac and it definitely lived up to the hype! They had so many delicious options. I tried the American, BBQ Pork, Crazy Whitey, and Spinach Artichoke. All of them were gluten free, creamy, and full of flavor. Even better, the prices were super reasonable and the portions were generous. My whole family loved it, gluten free or not! It’s hard to find mac and cheese this good when you have dietary restrictions, but Mix n Mac totally nailed it. We’ll definitely be back next time we visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSGNFOW5aM05JV0VOUlVqVnFWM0pxWkRRNWMzYxAB",
            "text": "Intimidating menu offering amazing mac options!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQ01ubGpWbVZSU0ZCU1JHOWFaWEo1YWs1WVRWRRAB",
            "text": "The options are almost overwhelming with how many they have! & the portion sizes are well worth the cost! Right off the bat, I LOVE the gluten free option! So far every combo I have tried has been delicious. This has quickly become one of my new favorite spots! They also have a good drink selection."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMWJEUkVYekJuWlc5V2FuTllObDl4WVdaa1VWRRAB",
            "text": "No vegan cheese :( . Some good options near by though. Edit: This place comes up in Google maps when searching vegan, although bangin vegan mac exists (VioLife cheddar, home made cashew/tofu, etc.) , it doesn't exist here. Unfortunate for a place with so many mac options"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVlVUUjZjR0kxUTB0MWFYTlpOMXBET1VsQ1NYYxAB",
            "text": "The amount of options is unreal! They offer a take and bake at home option which is pretty slick. Driving through the area, I will take and bake at home! Great find on a travel sports weekend\nSo good, you may want to nap after your done!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ3R1c0RRNktQQndnRRAB",
            "text": "Super reliable, consistent quality, lovely employees. This place is awesome"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LTlqUHd3RRAB",
            "text": "Great place !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKWDMxTXZhcnVEMFVnEAE",
            "text": "Obviously not a 5 star Restaurant, but good food , at a decent price . Really very yummy stuff, and service with a smile."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYmhpc3ZjMUx5VVR3EAE",
            "text": "Mix N Mac is one of my favorite Hudson Valley restaurants. They have endless options to pick from, and it is also one of the CLEANEST restaurants I have ever been to. The staff is always super friendly, and they always have the best music on. The atmosphere is incredible. If you are looking for delicious and well priced food, this is the place to go! From the Mac's to the Salads, you cannot go wrong! They also have an extensive gluten free selection."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKcW5uZWlCdm9UUG1BRRAB",
            "text": "Ordered for delivery.  I've ordered a handful of times and usually was very satisfied with what we ordered but this time it felt like there was barely any noodles and sauce it was more shredded cheese than and and want even melted it was stringy and tasted like plastic."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNTHg3YWIxM0pYeG5BRRAB",
            "text": "This is by far the best Mac & Cheese I have  ever tasted. my favorite is the cordon blue mac & cheese.. Try it you will not regret it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHN6VG1RRRAB",
            "text": "Excellent food and service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdF9TV1RnEAE",
            "text": "The person at the register acted like he couldn't be bothered to help us with them menu. It was our 1st (and last) time there. The cheese was not even melted. Terrible customer service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXV6WmdRRRAB",
            "text": "I found a long blonde hair baked into my Mac and cheese one night and never ate here again….. it made me sad because I’ve ordered from here previously and never had an issue…. It was such a turn off"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjkzY2ZBEAE",
            "text": "I didn’t eat here, but it smelled absolutely delicious! It should be noted that they do not have vegan or dairy free cheese anymore."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcHV1RjJnRRAB",
            "text": "Absolutely delicious! The cornbread is so sweet and the butter is tasty! Onion rings had a great flavor too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcDZmMlFnEAE",
            "text": "Small eatery with a big taste. I consider myself lucky to have a restaurant like this locally. Having good Mac n cheese in the wild is rare, but having a place that specializes in that and with a boat load of different flavors is heaven sent. I'm a big fan of Mac n cheese and there are a few flavors that I love from here. They've all been pretty good but there are certainly standouts for me, including the 'Carnitas.' Big fan of the light spice, pulled pork, and white cheese. Their Mac balls are awesome also. I highly suggest this place if you've never been."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLU5XR2hRRRAB",
            "text": "Food was when it 1st opened but the staff is very friendly"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRanB1UUdBEAE",
            "text": "Portion sizes have gotten progressively smaller.  Mac and cheese was not very creamy or tasty.  It was just ok .  Staff ok .. gets the job done.. not particularly friendly or welcoming."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndFBMY21RRRAB",
            "text": "I've been visiting this establishment since 2012 when they were featured in Hudson Valley magazine. I haven't been there in two or three years due to work scheduling. The food is just as good as it ever was but the service was seriously disappointing... the wait for our food was about 15 minutes and the music was so loud we couldn't hear each other. I'll probably go back but I'll order ahead & take it home."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncmYyM1lREAE",
            "text": "Food was awesome in the area for work for the week wanted to try something wasn't a chain glad i came across this place on google it was so flavorful and filling most defiantly will come back again maybe take a day trip with the Wife"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMGNqT01BEAE",
            "text": "Horrible service the never answer the phone I’ve seen multiple people comment the saying the same thing but they refuse to admit it I called 15 times one night trying to inform them of an allergy because they kept messing up my order and they would answer and just set the phone down and never greeted me. And then I called again only for them to pick up and say oh my god leave me alone and the Line is go dead I will never eat hear again and they are probably gonna respond with some bs we always answer the phone or please email us cause they refuse to replace the lousy staff they have."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBb0ppMG93RRAB",
            "text": "Tried this place and will definitely stop back in. I went with the Nashville Hot and it was very flavorful and had just the right amount of heat. The fries were tempting, but the portion size was so generous I would not have had room!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bFB6VFN3EAE",
            "text": "Itsl's amazing. I didn't even now I have soo a gem few minutes from home. I order the Mac and Cheese Carnitas from a 40 + variety. All the same tentation. I when safe and oh boy! I LOVE. IT!  Its creamy, cheese, I litle, milk spicy. With lots of flavor. Litle hight on salt. But, maybe its me. I have low salt tolerence. Even so, I will purchased again. It's Approved!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N2NpLWxBRRAB",
            "text": "my favorite restraunt for real. Sucks it’s an hour from me or i’d go there every week. Open a poughkeepsie location!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQN2MtZ3NnRRAB",
            "text": "don’t expect these people to pick up the phone. what you should expect is to wait 20 minutes for a personal size mac and cheese."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQN2RxbTBnRRAB",
            "text": "If you’re trying to order via phone, don’t even try. They will not answer, ever. Then when you go in person and ask why they don’t pick up the phone, they just just stare at you with blank eyes and have nothing to say. Terrible customer service.\n\nIf only you answered the phone with the same urgency you answered this review."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcUw3aVBREAE",
            "text": ".. came back and they no longer had the Frenchie, huge disappointment, tried some of their other flavors but wasn’t too impressed. Bring back the Frenchie please.\n\n__________________\n\nBest Mac and cheese I’ve ever had! I drove 1 and a half hours to get here and it was well worth the trip. I had the Frenchie and it was surprisingly delicious!! I can’t wait to try other flavors during my next visit."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMU9teWJnEAE",
            "text": "Not bad, flavor wise wasn't anything to write home about\n\nIt was \"O K\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZ29mUlNnEAE",
            "text": "Loved the single serve when we order in person...to the point I requested two catered trays for my son's first birthday. All I can say is that I'm pretty disappointed, and that I will not place another order there again. The whole top layer of both mac & cheese trays were completely burnt....that was all you can taste. Not quite sure where the quality control was, but how can you be okay to serve that to someone. Waste of money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdWVybEpnEAE",
            "text": "This place does one thing and does it very well: Mac and Cheese dishes.\n\nThere are a ton of options, but I highly recommend the siracha hot honey chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILWJ6dzlBRRAB",
            "text": "Always incredible food. Their menu has expanded too. Went with friends. Tried their chili fries which were great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmF1YVdREAE",
            "text": "This place is amazing if you love mac n cheese. I just visited this past weekend and tried one of the newer flavors and it did not disappoint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiajhQZWlnRRAB",
            "text": "Always good. I love the chicken, marsala, Mac and all the balls. Yum! Yum! Yum!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybWZQQ0FnEAE",
            "text": "We ordered 4 different types of Mac and cheese, and the cheese balls. All were very good, BBQ pulled pork was my favorite.\nThey do need to invest into some shades for the front windows, we visited in July and it got HOT IN THERE. It made it uncomfortable to eat it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycWMzTlh3EAE",
            "text": "If you haven't tried it what are you wanting for?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMEthLUl3EAE",
            "text": "My favorite place to eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNEpMZTdnRRAB",
            "text": "Amazing Mac and cheese!! Probably some of the best I have had!! Me and my wife got the lobster and the broccoli cheddar and just so good!! We will definitely be coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMWVfdnp3RRAB",
            "text": "We ordered the bbq chicken and broccoli cheese, and they were incredibly delicious. They are also very celiac friendly and have great gluten free options. Would definitely recommend and have it saved for my next trips around the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMmVqTTVnRRAB",
            "text": "Wonderful colour scheme that played well with the theme of the food. It's nice being able to see them cook and prepare your food from a clear view.  The workers were very friendly and took care of the food quickly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqM05MYUxREAE",
            "text": "For the second time, Mix n Mac came through in the clutch with a health dose of deliciousness in the form of a hefty Family Size batch of Mac n cheese when we had a bunch of friends over recently. It was an absolute hit! Fantastic people behind the scenes there making mac n cheese magic, couldn’t ask for a more simple & seamless order/pickup process with great customer service! The only problem we had was choosing which mac n cheese to go with from their insanely awesome menu. Well played Mix n Mac, WELL PLAYED👏!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMDk2OUNBEAE",
            "text": "The mac and cheese at this place is crazy good! I had two mini orders which leaves a little leftover for later! It seems to be mostly a takeout place, but there are a few tables so you can have your yummy food right there. Staff is awesome, and their choice of music makes the wait a great experience. Huge thumbs up!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNVlhOGxBRRAB",
            "text": "I was a little skeptical at first when I heard the a Mac and Cheese place was one of the best spots to eat in town. My wife loves mac and cheese so I figured we had to try it out. Overall this place is pretty amazing. There are a time of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2X2VhU2ZREAE",
            "text": "I don't give 5* often, but this is well deserved. The thoughtful combinations are so tasty, the ingredients were fresh and they were vegetarian accommodating (\"we can make anything vegetarian\"). All this with friendly service, very good experience, thanks!\n\nOh and spicy means spicy, with flavor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdWNheGZnEAE",
            "text": "This place is great! First of all the whole place is very clean and just walking in the door you can smell the delicious food. The ladies that work here are extremely friendly and very helpful. The variety of choices when it comes to the food is great I couldn't decide what I wanted. Who knew that you could do so much with mac & cheese? Not me. The food is absolutely delicious. You can see the cheese just stretching with every bite!! It's amazing and the have children's options as well. I will definitely be returning!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3N05EQkZBEAE",
            "text": "Low prices & delicious Mac and cheese. can't go wrong. The best place in this area to eat.\n\nPictures showcase the Nashville Chicken Mac n cheese. 10/10 HIGHLY recommend this dish."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbTZ5VkdBEAE",
            "text": "I have tried 3 different types of Mac & Cheese here. I usually get the Lobster Mac & Cheese, which is my favorite. The Big Mac almost tastes like a real Big Mac. The Shrimp Scampi could of had a little bit more shrimp but it was still good. I am impressed with their variety of Mac & Cheese. Decent prices for a great place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdXVmRm9BRRAB",
            "text": "ABSOLUTELY DELICIOUS!!! A meal in itself. Not salty, not greasy or oily, but just delightful on your palate. The pasta is cooked just right. Even the broccoli is fresh but cooked perfectly to retain firmness but soft enough to blend in with the consistency of the pasta. I would definitely recommend this place and visit again when in the area."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLUphdWZnEAE",
            "text": "The owners at Mix N MAC in Middletown New York have truly created something special with the mix of comfort food, and well, almost anything else you can think of. I've had the pleasure of trying numerous dishes and they are all delicious.\n\nThough seating is limited, I was able to find a place to sit and eat each time I’ve gone. With the mix in and ingredients being fresh though, my wait time when picking up has always between about 7-10 minutes.\nI’ve brought home three of their macaroni and cheeses here recently, the American (classic), the SHB (sriracha, honey sauce and bacon) and the Chicken Bacon Ranch. My family loves them and they were promptly devoured.\n\nI’ve also tried and loved all three types of their fried Mac Balls, standard, saucy and smothered, all were just too easy going down! They also make salads, both green and a noodle salad on a bed of lettuce. Did I mention desserts? They carry everything from a churro and smores based creations, to seasonal rice puddings.\n\nThe staff is very friendly and I personal cannot wait until they open their second location in Dutchess County in 2019!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbHVlMjdRRRAB",
            "text": "This is not your normal let's get something to eat kind of place. This is an experience into the mac and cheese world like no other. If you are a serious mac and cheese fan, this place is the mecca for you. As a serious fan of Mac and cheese, it is expected to taste sup par macs. Not here! This is a stroll down the lane of creamy decedent rich and delicious mac and cheese.   The menu was a little overwhelming as everything is jam packed into a small piece of paper. We had 3 different dishes, and all were superstars. The original was so creamy and rich with tandelizing flavor. Then, the chicken bacon ranch with chuncks of chicken and bacon smoked goodness. I had a cheese steak mac. Which was flavored with sweet caramelized onion and shreds of beef with a delicious green pepper accent.  I don't like green peppers, but this dish made me a fan. I encourage everyone who is even near Middletown to go have an experience here that you will never forget. No doubt we will be back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOS1pSnd3RRAB",
            "text": "Tiny place, about seven tables and a single unisex restroom. Very clean. Two folks working that I could see, one taking orders and one cooking.\n\nExcellent service and very helpful for first timers. Appropriate number of ball puns, which I can certainly appreciate. Plenty of options and everything is made to order so allergy issues are easy to resolve.\n\nFood itself was excellent and well prepared. Crunchy breadcrumbs on top are a must as well. Overall excellent experience, definitely go here if you're in the area."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROEtfQ3N3RRAB",
            "text": "The best Mac and cheese shop you never knew you needed. Imagine a food truck for Mac and cheese on steroids and you’ll have Mix N Mac. They have so many combinations (chicken and waffle being my personal favorite) that you’ll have a hard…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpNG8zRmh3RRAB",
            "text": "Out of the numerous times I’ve passed this place while being in Middletown, finally stopped by with some friends. Small joint with limited seating. But This is Mac & cheese heaven. They have every and any kind of Mac & cheese you could…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdXJMX0RBEAE",
            "text": "First time here..couldn't wait to try( I was stalking for a while 🤣)\nTried the  swiss burger and swapped out noodles for cauliflower 😮 and an order of Bacon balls.\nThey really do have the best balls!!! There are salads and things too...everything is mixed up right in front of you and baked! And you really want to order everything!? Comfort food lovers UNITE😋💪\nPics below...be thankful I left some to show you...lol\nGO GET SOME!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMmZHVkR3EAE",
            "text": "Out of state visiting for a couple days and ended up visiting here. Food was incredible and the staff was very nice, especially since it was our first time and being overwhelmed with the amount of options on the menu. Wish we were closer to visit again. Thank you for the great experience! -JIm-"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcExMX0FnEAE",
            "text": "Visiting from out of town and my sister is obsessed with mac and cheese so we checked it out. Pretty cool. Lots of variety and different things to try, something for everyone. Very tasty. Definitely would come back and try something else if im out here again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjNnV1N0NnEAE",
            "text": "Awesome place with a super friendly staff. I got the Buffalo Chicken Mac and Cheese and it was fantastic. The perfect amount of kick without being overpowering. I would definitely recommend this place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOEw2MUl3EAE",
            "text": "My family and I were on a road trip and I was so excited that i found a mac n cheese place that has vegan options! I got the vegan cheese with broccoli and buffalo sauce and my kids got regular vegan mac n cheese. The flavor was quite delicious. The cheese was quite clumpy in my dish but wasn't so with my kids dish so maybe I just got too much cheese (if that's a thing).\nFor $10 the portion is a bit small for my liking. I included the fork in my pic for reference. The worst part of our experience was actually the music. They were playing a mix of pop and rap songs that were unedited. So when Eminem and 50 Cent came on and every other line was a swear word I took my food and my kids and walked out and ate in our car. I'm kinda bummed because i can never find a vegan mac n cheese option, but this was quite disappointing."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOTdqVU13EAE",
            "text": "$$. Like Subway, but for Mac & Cheese. Have it your way. Many cheeses, meats, and many other toppings. Friendly service. Does take ten to fifteen minutes to cook, depending on the number of patrons and what you order. It was a steady flow of customers when I was there."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcWJLZGRBEAE",
            "text": "Delicious mix and match Mac and cheese of more than 35 options of additions. Gluten free and vegan options also expansive and delicious!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNlpLNXBBRRAB",
            "text": "Preordered our food, which I am glad we did because the place was slammed on a Friday night. The service we found a little lacking, no one looked up from their conversations to greet us or ask how they can assist us (there were 3 of them).…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNGJycHhBRRAB",
            "text": "This place is absolutely amazing, the portions are good for 2 or 3 meals.  had the lobster mac and cheese that had real lobster!! not that imitation nonsense at the Chinese place.  will def be back"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bk95RkdREAE",
            "text": "This Mix n Mac is amazing! Each dish is customer driven as the owner Michelle expertly guides you to your culinary delight.  This is NOT your father's \"mac-n-cheese!\" This store will dazzle your tastebuds and fill you for hours to come!  This should be featured on \"Diners, Drive-ins and Dives!\"\nMy wife raves about the appetizers of fried mac-n-cheese balls! The dipping sauce rivals fra diavolo sauces I've had in restaurants!\nThis is an absolute MUST ON places to dine in Middletown!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOWNPa0lREAE",
            "text": "Have always loved this place since first opening. Staff is great! Sad I moved so far but always have to make a pit stop when around."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcGVXSGdnRRAB",
            "text": "Always a great experience. The food is always good, and everyone is very friendly. They can also make a large amount of thier menu gluten free, which is great!"
        }
    ],
    "reviews_count": 74
}