{
    "name": "Jimmy's Grand Cafe",
    "place_id": "ChIJLYdCe9v0wokR6n-y9iGpW74",
    "grid": "BX9",
    "address": "1001 Castle Hill Ave, Bronx, NY 10472, USA",
    "rating": 4.4,
    "user_ratings_total": 4278,
    "phone_number": "(718) 319-1200",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReGIwNUJXV280YnpCS1NrMWxaRkpLYldFeE5VRRAB",
            "text": "Excellent experience - we had a TIME! Celebrated our Sistagirl's birthday and they honored our table change request to accommodate the additions to our party. Few of us chose the 2hr unlimited window for Sangria or Mimosas. The food was ahhhh-mazing, the music on point, the photographer appeared at the best times and sometimes out of no where it seemed; our server, Lisandro, was pleasant, accommodating, and his service team flowing and present. Overall great experience for intimate gatherings and celebrations 🍾"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbFIyNXFjbUpJVHpKU1VWZFRPRzlQWkRWdk5FRRAB",
            "text": "Always good vibes at Jimmy's! Service and food good!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUE9VdERNREZ4U1VSblYzcDVWRUZyVUdkNFQyYxAB",
            "text": "Excelente lugar. Mí familia y yo nos encantó el trato y la comida."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSFlVbDBYemcxUmtwdFYxOU9TM0pTUkhsQ1dYYxAB",
            "text": "Food comes out fast..it's ok."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVFQzUnNVRWhSUW5JeFRFVTBabkV5TlRsaFIzYxAB",
            "text": "The atmosphere is beautiful but the place is overrated.  I've eaten here twice and I wasn't wowed by the food. The food is passable."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMU1rMHlZMUV3Y2tsUmFrdFlNa001U0RabmQyYxAB",
            "text": "I love coming here for Brunch. Never a disappointment!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS1IyWkVSREZTU0d4NWVXRlRTM1IyYkROa1dHYxAB",
            "text": "Me and my wife and brother went there the other day for my first time the food was delicious, my wife and I had the pernil with rice and peas the pernil was so big we both had to bring some home. We will definitely come back soon the waiter was very helpful and kind I will tell my friends about it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poZk9UQldWbTV1VFU5WVoxSnRhV3RQVUVkT1IzYxAB",
            "text": "Awesome staff, delicious food and reasonable prices.  The amount of food is worth it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdFRDMTNUSFJmVEVJeGJVTTRiRk41UmtaQmJGRRAB",
            "text": "I celebrated my birthday dinner there. I recommend this restaurant. I will definitely be going back there soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sblJWWkhaMHBpU3pselFrNU5kRk41WlZGSk9WRRAB",
            "text": "I order delivery alot pretty quick and pretty good quality and lots of food 👌🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWVtRXphMTg1VWtsa1preEpRMlEyVmt0QllrRRAB",
            "text": "Brunch was good worth coming"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKelUydGpjakZOY2tjNFZWcFlWV2xwUjE5VFNIYxAB",
            "text": "I placed an order of nearly $100 and unfortunately had a disappointing experience due to repeated mistakes and lack of acknowledgment from management. I requested BBQ wings over the phone, the receipt showed “whiskey BBQ,” but I was given what appeared to be Asian-style wings resembling a sweet-and-sour type sauce and they forgot to add my soup. Even the hostess acknowledged they smelled like the Asian sauce. I waited an additional 10–15 minutes for the order to be remade, only to find once again that it was not the BBQ flavor I requested. Unfortunately, when I returned to my car for the second time, I discovered the wings were still not prepared as requested. At that point, what appeared to be the manager or owner came out, confirmed I wanted “just BBQ,” and he explained that whiskey BBQ and the Asian sauce were “nearly the same.” In my opinion, these sauces are completely different, and I was unclear how the order could be confused twice given the distinct flavor differences. At a minimum, confirming the order details before remaking it would have prevented the repeated errors. Considering the size of the order, and the fact that the wings were made incorrectly twice, the forgotten soup, I expected a sincere apology or some gesture of goodwill. While mistakes can happen, what I found disappointing was the lack of acknowledgment of the inconvenience, no apology, or a genuine concern from management. I felt as though the wings could have been compensated due to the avoidable errors. I left feeling that the situation was handled without empathy, which unfortunately overshadowed the rest of the food experience.\n\n(I’ve attached a photo of what is clearly not BBQ sauce for reference.)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cGVGRkZaa2c0VUVscWNVdDRaRlE1YUZoS1gxRRAB",
            "text": "I ordered a simple egg and cheese sandwich, and it came smelling like FISH. Called the place to let them know, and instead of apologizing they gave me ATTITUDE, saying nobody cooked fish today. Went back to get it replaced, and the second sandwich came with soggy, wet bread. Absolutely disgusting. Never again eating this nasty garbage."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWVlqQjJNMVZKWlRndFNVVnlVeTFNY1RaSWNHYxAB",
            "text": "Good food. Fast service. Typical diner atmosphere which i like. I got Mofungo which I'd never seen at a diner before. It was very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSlFtbEZSR0Z2WmpaT01tcE9ibFl4VDBSclJFRRAB",
            "text": "Good food, great service,will come back here for sure"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndGVVNUJOalV0YjI1U1IwcDVSR3hKTjI4MFVGRRAB",
            "text": "What a great place, food excellent, service excellent, best coffee I have had since Costa Rica. If you are in the area this is a must try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4YWRGWXRXazVsVHpaZk9UZHZOQzAwTmxreGFYYxAB",
            "text": "The restaurant is a good size so seating was no issue. The service was really good, our server was there and ready for whatever we needed. Bottomless coffee!!\n\nFood was really good, the pancakes were fluffy not dense, hash was delicious and portions were on point maybe a touch too much but that’s what takeout containers are for."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNlIybFVZM2gzTlROVmJFYzBMVGRWVUVkaVVWRRAB",
            "text": "i had the grits and egg i ever tased they did so good and go to there place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONFZHWklhekpQYlhCb2RucFNXbWwxWld0MVIzYxAB",
            "text": "A great place for breakfast. Good prices, amazing food and coffee and the staff is friendly and attentive."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNzVPcS13RRAB",
            "text": "I love this food 😋 yummy 👌 😋 #yummy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQmMwOWxaMHhEZW5OMWFYVlJiVkZOZGxGdUxYYxAB",
            "text": "I come here here often..  Great selection of food choices. From your traditional breakfast, to your flavorful spanish, Italian, or Greek options.."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNnNiOXl3RRAB",
            "text": "Meeting here for breakfast with the girls is always a pleasure. Our food comes out quickly which gives us time to chat before starting our busy days. I have never had a bad dish here. The portions are plenty and they also have great cocktail choices for anytime of day. ;)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcmFUQTRVMVJRYW5aSVpIVkhNR0pUTVd4dFVYYxAB",
            "text": "Service was ok but the food wasn’t good at all. I ordered Ropa Vieja and it had a fishy taste to eat. I would not recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dFluSldOR1pHUVZFeGVsRnhjbkZGZFRrMVpGRRAB",
            "text": "The food, service and vibe is great. Drinks are amazing. You can eat and watch sports and listen to great music...all at the same time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFp6aDVNbUpqYUZWak0wbDBjRnBhZUVoVmRtYxAB",
            "text": "Never come to this place . They jus disrespected their guests over something simple. Food isnt all that . Rose was the only professional and kind person"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR1ZHZGlabXhPYjAxdGQzZHFUVU42Um5GclRYYxAB",
            "text": "Bad customer service.. aggressive and disrespectful 😡 .. Homeboy accused my guess of having extra bottle of Hennessy stashed in his vest ! How disrespectful can you be ?\n\nThen when he realized he's wrong,he wants to apologize.. nope too late buddy ,not after the disrespect.   Plus their food is garbage 🗑️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRGNuRlpaMlI2UTFKMk1sWlhabVp2VWpoeGFVRRAB",
            "text": "Extremely disappointed at the fact that me and my fiancé went for our cravings of chicharon de pollo con hueso and ropa vieja combo. I have been in other restaurants for these exact dishes and I have never been more disappointed. The ropa vieja tasted like if it was cooked with fish. The Platanos that came with the chicharon de pollo con hueso was soggy. The chicken was extremely dry. Also the chicken soup that came with the meal the soup was dry and the noodles were extremely mushy. I’ve also been here in the past and never had this problem before. But I do not know what was happening with the cooks or pans on 8/15/2025. But it was definitely not to our liking. Hope this message finds you well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUWRXSlpla2M0TVZwS1VEWndZVXRTWWt4MVZXYxAB",
            "text": "The best food I’ve ever tasted in my life"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYVJHaFJSRzFmYzBSdlZVNXBlbWxvZVdsbVIxRRAB",
            "text": "Really nice spot.  Parking too. Food was great"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cDlYUVl3EAE",
            "text": "This is My Spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cWNFcHllbXgwVlZOSFNHRlhVSFExWjJSaGVIYxAB",
            "text": "Had a truffle burger. Tasted stale and bland. No salt. They used canned mushrooms. The meat was dry and I was too busy trying to get the ruffage (you know, the little parts of a cheap frozen burger that when you chew feel like cartilage) out of my mouth to enjoy it. The prices at this place are way too expensive for that kind of food to be served. They serve Spanish food as well. I once had a tres colpe there for breakfast once. The mangu was hard and tasteless so I asked for chicken stew sauce to maybe soften it and add flavor and I swear I was eating Campbell soup. It was grosse and the onions weren't seasoned either so it was a complete fail. I've had other forgetable meals there for lunch and dinner because I keep giving them a chance to redeem themselves cause I live close to them. But I've concluded you can only trust them for eggs and bacon maybe waffles? Who can mess that up? Overpriced and underwhelming. Reservations aren't required because the place is empty. Only holidays are popular because I believe people that once upon a tinr had a good meal there long ago (cause I want to believe they at some point they served good food) are chasing that experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTk1uSXhUV1JzVVdkR1p5MTVTMmxNZDNwbU5WRRAB",
            "text": "I ordered the eggplant parmesan with pasta and meatballs. The meatballs are bland (no seasoning). The food was bought to us lukewarm."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU2FUTnBUR0pWVGt3M1RHVnBMVVJhTjFSRlptYxAB",
            "text": "Breakfast was good, food came out fast and was plentiful. Server was attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keVFqVjFORFpqV1hkWk1YbGpNVXhVTW1wQmNWRRAB",
            "text": "Will visit again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV1VqQldZelp2YzFWVGNtbHhRbmRCYW5kblVGRRAB",
            "text": "First time there and it was a very awesome experience. The Service was great and the food was great as well and it came out fast. The place was very clean. Will go again when I come out to the Bronx."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnelk2T3dRRRAB",
            "text": "Great place for both Spanish and American food\nBreakfast lunch dinner. All fantastic. Full bar .Eat in, take out.  All magnificent.  Try the coconut shrimp and the chicken Madera.  Great burgers and platinos tasty. Beer and special cocktails they do it right"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdHMtaV93RRAB",
            "text": "Love the food and drinks wonderful.  Update went on a Saturday last week it was terrible the drinks were watered down i mean down smfh food nope 🙅🏾‍♀️ not good any more so surprised just sad they need to revamp food and really the Drinks"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnN1l2YjJBRRAB",
            "text": "Love this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oc1dsQm1OR1JQUkU1Vk1qRnhRMTlWZVRaNmNtYxAB",
            "text": "I love Jimmy's. The food and vibes are always good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obFZXOWtWbU5aVG1GR2F6aGhWbGQxTjBkcGRIYxAB",
            "text": "Great service and ambiance. The veggie burger and wings were good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTFZrdFNRbWczYlU5S2JGbHZVVmRpVDNGWFUyYxAB",
            "text": "Food wasn't great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdU1HRnhTRTh0TFV4R2VVVllTVFJ6ZDNGdllYYxAB",
            "text": "THE FOOD WAS DISGUSTING!!! I’m sitting here as we speak - don’t know if I should even PAYY!! I complained that a fly fell in my scrambled eggs the waiter going to tell me “she didn’t see the bug in my food” - AM I SURE ABOUT THAT? Then proceed to say is she drunk that she can’t see the bug that was right in front of her.\nNOW the fly flew on to the guy that was next to me eating, & it flew on his strawberry we showed her & she going to say: “it’s the black thing that comes with the strawberry -  don’t worry about it”. 😒🤮\nImagine how the kitchen look & how they don’t give a heck about the people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaGFqUlZPREJRWmxwSlRuSmhZMk5mUkd0SWFGRRAB",
            "text": "Old bacon eggs were trash !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMFVFdHZSVTg0Tlc5YU9IcFpkRW93V0dsTVoxRRAB",
            "text": "8/10 love this place ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214b2RrUjNSVUZNTjNaVFJHOHpaRE5uVm1Zek9VRRAB",
            "text": "Mostly the food are frozen!! Not much things are fresh !! Don’t order the burgers !! So so so bad"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kc2JrVlRZM0pxVm01TlVrbGlkM1l5Y0dGMFEyYxAB",
            "text": "Enjoyed the Granddghtrs graduation celebration here.  Great gathering space😊great food & portions are more than you expect.😋😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaURqWWpENGRpQll3EAE",
            "text": "Today we celebrated my  sister's 50th birthday at Jimmy's and while everything was great, I would like to say a special THANK YOU to our server , VIELKA. She was so friendly and so patient with us. Her service was amazing and we want to thank you and we can't wait to not only come back to Jimmy's but we hope to see you again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN3VMOVJnEAE",
            "text": "In terms of decor, space and setup this is probably one best in the bronx. Even though they have a wide variety of food options I think food is very average level. \"DO NOT GET THE DOMINICAN BREAKFAST❗❗ that you see in the menu booklet, its a rip off it looks nothing like that when it comes out, very misleading and disappointing. The salmon crockets are not even salmon taste like tuna or they mix the salmon with something else it was awful too soft on the inside and lacked flavour❗also, the coconut coquito french toast was underwhelming. It didnt taste remotely close to what the menu describe. Everything else just tastes  ok, nothing special."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcDhQVmt3RRAB",
            "text": "I really enjoyed my time at the restaurant.  This is my 2nd time visiting, and it won't be the last. The service and the food are great. No complaints from my end. The food portions are perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMEtyUVpnEAE",
            "text": "Loved this place. Food was sooo good especially the pasta 😍. Service was professional and friendly. I would definitely recommend for solos, dates, families, businesses lunches or events. And the prices were not bad at all. My sister and I went on a Friday afternoon around 2pm. Parking is a little bit of a pain though but there are metered parking and street parking if you can find one. They have a small parking lot but I think it only accommodated like 8 cars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaUpYcERREAE",
            "text": "Ambiance was beautiful! But if I had to point out one thing out it’s the stains on the fabric chairs. Waiters were really nice but the host who sat me down could have at least tried to smile. The food was amazing and I loved its presentation. Affordable and good quantity of food. Defiantly worth the visit!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGJ5eWNBEAE",
            "text": "With the music loud, yet nice enough where you can have a conversation, a nice atmosphere of lighting, and delicious food, this place is a great spot. We were a party of nearly 15-20. The drinks were good too! They have frozen drinks (fave), beer and liquor. The pernil was delicious and came WITH THE BONE. Not sure if that is a regular occurrence-we were super grateful! With our party being so large, i can understand why it was confusing for the servers attending to us. They did a decent job of 8/10. If you enjoy eating our regularly, this is a place to go!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdS1HdG9BRRAB",
            "text": "Amazing ambience,  staff, and food. Everything was muy delicioso. We ordered Dominican breakfast, frittatas, and pancakes with eggs. Everything was fresh and mouth watering. Price is worth it for amount of food. Cleanliness is impeccable.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdkt1MjFRRRAB",
            "text": "I visited on two different occasions once for dinner and once for breakfast and I was impressed both times with food and service.  The food is a good portion. The drinks are strong especially that rum punch and everything was well seasoned. The menu is extensive it's so much to choose from so whatever your in the mood for they have  you covered. They also have an upstairs so in the event that you need to do a private party they can accommodate that as well. Overall I had a good time and will definitely visit again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreVQwNTRTSGhpYjFseFUwaDNlVXhhZFdOTlNGRRAB",
            "text": "The restaurant’s ambience is nice. We had an early dinner. Service was just ok. Food was mediocre at best. My burger was a taste less frozen patty. Curly fries were warmed over. The best thing about this place was the cheesecake. They won’t get my money again.  For a city that’s supposed to have the best food, I definitely was not impressed."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdWZpQTBnRRAB",
            "text": "I will always recommend this place. I come here for alot of different occasions and they have never disappointed me. The food, desserts and drinks are amazing. This place is also kid friendly. They can accommodate a big group of people as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aE9idlJBEAE",
            "text": "I would just say this restaurant isn't what it seemed. I came to celebrate my graduation and my family and I were high disappointed. The waitress wasn't clear and also confused our food multiple times. Along with the food just not being the best smell. This food shouldn't look this way, and a clicking noise was sounding the whole time. When it came time to speak with the manager he ignored us."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxc0k2Z05REAE",
            "text": "It’s a nice place indoors. I can see potential in holding a future gathering with a large group here. My reason for not rating it more is because I just don’t like flies flying around my food. They just seemed to be all over the place. I’m unsure if staff realized it but it was quite annoying when you keep having to shoo them away from your food. The food was mediocre. One can order the same stuff at Applebee’s in my opinion. I felt that the coco shrimp had more coconut than shrimp. The chicken was quite dry in my Cobb salad, but there was a lot of chicken unlike other places that try to skimp out on giving a lot of protein in a salad. The steak quesadilla was alright. I didn’t think it was worth the price it was charging. Couldn’t really go wrong with burger and fries though. I do like that for the amount of food I ordered, the price was rarely decent. I was quite shocked with my bill. I would say if you’re looking for Applebee’s type food with affordable pricing, this cafe is good."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa3Y3SlJBEAE",
            "text": "Celebrating our mom's birthday w grandkids and great grandkids,nice cozy, romantic atmosphere, Nice music 🎵 and Great Cocktails ❤️ check out some of the dishes 😋 yeah it says 18 on her candles 😁🤗 she really 81!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBX1p5RUl3EAE",
            "text": "This is my first time here, I came with my veteran group for brunch. The decor is very nice the as well as the music. The staff is very attentive. The wait time wasnt so bad. I recommend making a reservation. The bad this is there is very…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibUl6RXlnRRAB",
            "text": "I was disappointed with my dish of French toast and corn beef hash. Which was made with regular white bread, not challah. Also, the hash was overcooked and not tasty. The other people in my party enjoyed their meals."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNjVYTlB3EAE",
            "text": "Never have a bad experience when I come here! The food and drinks are always on point! The wait staff always attentive and helpful. And the place is always clean. I would recommend anything on the menu, but my extra recommendation would be the coconut coquito french toast!! (Insert greedy moan here) make your way to Jimmy's you won't be disappointed!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcDd1cml3RRAB",
            "text": "TRASH! Save your money and actually spend it where there will be at the bare minimum good customer service. We paid $65 a head to eat clumpy pancakes and frozen food. They stiff you with the unlimited drinks that never came. While the servers, a spanish blond girl and an Indian guy kept giving out the horriple service of he will bring drinks to she will bring the drinks swap stories. Have some respect for your hard earned $ and do not spend it here. TRASHY AND DISRESPECTFUL!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNnB1ZWZ3EAE",
            "text": "This was the 1st time going and we absolutely loved this place !! The service was quick and the waiter was very attentive. The music wasn’t  crazily loud and overall a relaxed environment. We’ll definitely be coming back soon!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eXR6MGZREAE",
            "text": "Update: I went back recently and all the seats were upgraded and new. Makes me feel like they take their customers reviews seriously. Even if it wasn't because of my previous review, I appreciate the change. Also, my waitor Julio was excellent.\n\nThe decor could use an upgrade. The chairs looked a bit dingy. But the food was outstanding and the service was quick. I would definitely come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMVBlVllBEAE",
            "text": "The wait staff was really friendly. The food and drinks were good, kind of on the expensive side but you get decent sized portions. This place can get really crowded around lunch time so be prepared to have to wait for a table. Would definitely visit again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dWRQaFFBEAE",
            "text": "This place  was full of hospitality so many positive attitudes.  The hostess was nice.  Our waiter made jokes and definitely read the crowd.  Before our drinks were empty he was already at the table asking about another round. their dining area was semi-full. They didn't take our temperature at the door but there was a thermometer and hand sanitizer present. There was a birthday and they sung the song not sure if they provided the cake.  Bathroom was clean and they do have a changing table for babies.  We started eating before I remembered to take a picture it looked so yummy.  I would go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcVZHa3RaakJoWXpWMFlsOVdPVUY0TWxsNlYyYxAB",
            "text": "My family and I went after a funeral ceremony  to celebrate the life of our loved one.  Our loved one was friends with the owner Jimmy.  We called the restaurant, and the accommodated us.  We ate, the amount of appetizers was small and the order was not on the menu.  We were charged about $82 for 6 small samplers.  that was NOT on the menu.  There was a lot of us.  No restaurant charges for something so small.   But we were so exhausted emotionally, we didn't call 911.   We covered what our tables couldn't cover, including family members who did not have for payment due to financial hardships. If it happens to you, that is a crime.  You call 911, trust me you will get your money back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqam9YLWhRRRAB",
            "text": "Ive been wanting to eat from here for a while now. First time ordering from here and I was let down. I had ordered a grilled chicken cutlet hero with lettuce, tomato, mayo, well done bacon, cheddar cheese and avocado slices on the side. With a side of truffle fries. Sadly my truffle fries weren’t throughly fried which then made them soggy, my bread was soggy & my avocado slices were inside of my hero. When I went to look for them they were not put to the side and they were already brown. I had called the restaurant and the manager wants to tell me that she wasn’t aware that I wanted avocado slices on the side and that she was there when they opened a fresh avocado. That manager must have been lying or doesn’t know what a fresh avocado is. It was brown and mushy as hell. She said she could give me credit for whenever I come in person. Good thing for GrubHub for helping me with that issue because credit for a restaurant that I won’t be going to isn’t going to help me."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMWEdwZnluZ1lmMDBBRRAB",
            "text": "Rien à dire, les plats sont excellents, généreux et à prix plus que raisonnable. De plus le service est parfait, 10/10."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxemFybHJBRRAB",
            "text": "A Bronx staple, Jimmy's is the place to be for brunch. There's plenty of variety on the menu. I had the waffle sundae. Of course, my food came back nice and hot. And the white Sangria was very tasty too. Can't end the review without mentioning how on point the customer service is. The environment is clean and social distancing is in effect for worry free dining. If you're in the BX and looking for a classy experience and amazing food, look no further."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbE9QV1N3EAE",
            "text": "Had breakfast here the other day and very impressed a spot like this exists in the Bronx. Have driven past multiple times and am kicking myself for not coming here sooner. Food was well cooked, portioned and price. Service was amicable and…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcmVLbmR3EAE",
            "text": "Great service and atmosphere. Delicious cheeseburger for an affordable price, but the french fries were flavorless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabzVDX2hBRRAB",
            "text": "Excellent atmosphere on a Saturday evening/night. DJ on the turntables. They make your drinks how you like. Food how you like. Drinks on point. I’ll be back for my bday in April."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbGNxeGV3EAE",
            "text": "The food was excellent and the service was great....great vibes..price wise, I would definitely say great compared to most, if not better... I am going back with more family...it was truly a great night.....thanks so much for the great hospitality...birthday dinner for the queen"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbTR5TndBRRAB",
            "text": "Nice enviornment. Came for breakfast, but would love to see what it dinner is like, and experience an evening vibe. Love my mimosas! Steak and hash were good, but that eggs weren't prepared well. Friendly staff!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMdUV3ZE95MDRxT2JnEAE",
            "text": "Waitress was rude through introduction and awkward, she lightened up and became friendly afterward. One of the last things I want when treating relatives to dinner. Great food and atmosphere though"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOHBYeWVREAE",
            "text": "Food was delicious nice cozy restaurant and our sever was prompt and friendly"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc3BTZnR3RRAB",
            "text": "The food was good though nothing that will blow your mind. I had french toast, my partner had pancakes. The service was great and the place had a fantastic ambiance. I'd visit again to try non-breakfast related foods to see if that was something worth noting. I'd suggest you try it out for yourself."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRZ05fX1dnEAE",
            "text": "Amazing food and lovely ambiance. Customer service can be improved just a slight bit. Other than that, highly recommend this place. The menu has everything you are craving."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MDhiNnZRRRAB",
            "text": "Excellent breakfast. 2 eggs over easy with corned beef hash and potatoes. Friendly staff. Nice interior. Nicer than most diners, actually.  Not crowded at 8am on Sunday.  The following week I had the Huevos Rancheros. Very good."
        }
    ],
    "reviews_count": 81
}