{
    "name": "Maravillas Bar & Grill",
    "place_id": "ChIJo3Ka3yX1wokRS4aOV3PdvR8",
    "grid": "BX9",
    "address": "264 Soundview Ave, Bronx, NY 10473, USA",
    "rating": 4.3,
    "user_ratings_total": 390,
    "phone_number": "(718) 618-7440",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoS1MzRlRRMDlSYjB4RWNHbE5WMmxsVlZGWmQxRRAB",
            "text": "The Ecuadorian cuisine was sensational. I have longed for a decent, clean, and classy Ecuadorian restaurant in The Bronx. The food spectacular that the waiting time was worth the waiting. I will go again and again. The menu needs Caldo de…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeE1XdDNOVlZ5TlVGTmMwdFdUbTlYYkZOM1RYYxAB",
            "text": "Service was good, Food Was Delicious  so Ecuadorian flavor, of course had to wait for the food because i was fresh done, not like other place that they have some thing alredy prepare. We Enjoyed ."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWU9VSXhOelJrU1hNelRUUnVXbWRmVUUxSExXYxAB",
            "text": "Divino divinas las humitas gracias"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1NrZDRkRkZ1UkhaWGMxOUxkWEV5Y0haSlZtYxAB",
            "text": "I went in very politely and asked if they had a restroom I can use and there was a guy sitting on one of the tables saying no they don’t have a restroom with an attitude and rude . I had went out my way just to find the closest restaurant because they usually have restrooms . However I understand some places don’t allow access to restrooms unless they purchase anything , but the guy just straight up said “No” in a very rude way . Everything starts with customer service, I don’t care if the food is even good I wouldn’t even eat here for free just because of that . I went there 10/1/25 At around 8pm. Very poor hospitality do not go here"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbGIxcHdjVVJ6WXkwMmNFZ3dWV2N4VjJseVZWRRAB",
            "text": "Pero que rico. Gracias por todo lo servicio."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4V1kxWldVVGhvU0UxRVEycDBORFZqWlhsTWMyYxAB",
            "text": "Lo mejor del bronx #1\nnew york"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ndE9GOXJYMngzT1U5dWVYUkNkbE5JUWtkVVIwRRAB",
            "text": "18% service charge considering that he didn’t put in my order is crazy. After 50 minutes of waiting I asked and all he said was “sorry”\n\nI ordered the seafood platter but it never came. I thought since it was seafood it would take longer but the 18% service charge is was ticked me off since he didn’t even provide a service"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdjkyLTlBRRAB",
            "text": "Primera ves que fue a comer ahí no me gusto estoy hablando de mi\nFirst time I went to eat there I didn't like it"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNGNyN0t3EAE",
            "text": "The food was good except for the salad I believe either it wasn’t fresh or had too much vinegar it just tasted very sour and the spicy sauce on the table also didn’t look fresh. The service could improve since the food is cooked downstairs the servers are taking the order and also are traveling back and forth for other tables and just seemed a lot for just 2 workers. Taxes and gratitude are added to the bill."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN0tmcGVREAE",
            "text": "Delicious and cozy restaurant"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHAyd1VBEAE",
            "text": "I’ve come back to edit my review because first impressions were one thing but the reality of what the restaurant is, is another. They don’t have consistent prices I’ve went countless times and been charged higher each time for the same item. It seems as if they don’t change their oily frequent and you can truly tell by the distant old oil taste in their food. Their customer service is honestly terrible if you go in to pick up and order you could be standing there 30 minutes just to find out they haven’t even started your order. This place needs to get it together. After an extremely nice renovation it has so much potential to be great…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbWZHdFpREAE",
            "text": "This establishment was originally in another location on the same block. Due to a fire at the old location, it moved to a more spacious area. The new location looks more inviting as well. The ambiance is filled with appetizing scents and great music. When my group and I arrived, we were directed to sit where we wanted. Our table was only the third table occupied yet the owner still had to finish setting up the table. We placed our order of ceviche de pescado, chaulafan, encebollado de pescado, viche de pescado, and fritada. We ordered Ecuadorian sodas which is a must at an Ecuadorian restaurant. Our drinks arrived two minutes after placing the order and then no one approached our table until the food came 20 minutes later. The food then arrived and everything was delicious. The pork fried chunks were flavorful. The encebollado was filled with pescado and the portion of the meal was plentiful. By the time we finished our meal, there was only one other table in the place. We were sitting with our empty plates in front of us for about 10 minutes and no one approached our table. After realizing no one was going to approach our table, we walked to the front, paid the bill, and left.\n\nOverall, the food was delicious and plentiful for the price. The prices for the soda did not match the price on the menu. If I had to propose a suggestion from a fellow Ecuadorian that wants to see this business succeed, I would propose two. The first suggestion would be to provide your customers with complimentary chips, nachos, or even popcorn. This would give your customers a chance to snack on something before their food comes. The second suggestion would be to be more attentive to the customers. Our table was only approached three times: when we placed our order, when we received our drinks, and then when we received our food. No one asked us if we wanted another drink or how the food was.\n\nThe million dollar question: would I revisit this establishment? Yes, I would."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMWNXd2d3RRAB",
            "text": "FOOD IS SOOOOO GOOOD def 5 stars never disappoints second time eating here and their sea food is always bomb with a good taste!! And their habanero sauce so yummy !!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMUw3WHVRRRAB",
            "text": "We had previously ordered takeout, but this time we decided to dine in. The food and service were both excellent. However, we were surprised to see an 18% service charge added to our bill, along with an option to provide an additional tip. I am curious as to why we would be expected to pay both a service charge and a tip. Is it customary to pay both, or is one or the other more appropriate?"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ajVPYkl3EAE",
            "text": "Excelente"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bnREUFh3EAE",
            "text": "Pésimo servicio, me pusieron comida que no pedí y la comida no estuvo para nada buena 👎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bDZ6bDRRRRAB",
            "text": "The service very slow I waited 45 mins for drinks the staff had bad attitude. I ordered churasco with rice french fries the food came as I was eating it I found a bug 🪲 in my food they didn't even apologize to me the the only thing they did didn't charge me for it. I wouldn't recommend this place to anyone. They are very short staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NTZQS0JREAE",
            "text": "The previous location was way way better staff were friendly and food was good. Staff was constantly arguing with each other. Phone was ringing non stop and no one would bother to answer. Wasn’t the only person disappointed with service and 18% for this service. Need someone in charge or old management back"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MU12bVdnEAE",
            "text": "Comida costeña hecha por costeños. Primera vez que fui y ordené encebollado, caliente como debe ser y sabores espectaculares. Y el precio muy bueno."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eWVfU2FnEAE",
            "text": "Dirty place with horrible old\nFood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUanFYTGdRRRAB",
            "text": "I’m Dominican and my wife is Ecuadorian. This is the best Spanish food place that I have eaten at They treat us with love and respect and make us feel right at home.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeV9TZTlnRRAB",
            "text": "Great food, great portion for a great price. Primary language is Spanish."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMWZ6ZkdREAE",
            "text": "La bandera riquísima sin duda..el caldo de mariscos lo mejor pero el bollo no me gustó 🫤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMUozVU1REAE",
            "text": "Bad service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aU1iUFdnEAE",
            "text": "I had take out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cjlLR3NBRRAB",
            "text": "Food is always great! It one of my favorite places to eat authentic Ecuadorian dishes"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxanB5VjJBRRAB",
            "text": "En el Bronx la mejor comida ecuatoriana"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNjdYSW1nRRAB",
            "text": "This is really unfortunate I went to this restaurant to have a steak to go but when  I got home was only rice fries and two small pieces of steak for 20$ was not worth it  they Should be honest and tell me that they don’t have steak but not take advantage that my order was to go and just packed rice and fries. Definitely not recommend this place at all this is ridiculous."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNElhR29nRRAB",
            "text": "Acabo de comer aquí con mi hijo y el servicio fue excelente, pero el encebollado con pescado y el caldo de patas no tenía sabor y simplemente no era bueno. No recomiendo venir aquí."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdFlxcmFBEAE",
            "text": "Pésimo servicio"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGaGRDUlNREAE",
            "text": "Deberían dar clases de servicio al cliente a los empleados , siempre tienen una actitud no vuelvo a llamar a este restaurante sarta de incompetentes llame para un delivery y solo te dan actitud como si estás llamando para pedir comida gratis ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1OS15Z2VREAE",
            "text": "We felt discrimination.  No water was served. And we were charged 18% fee for nothing . All in all very bad experience.  Wouldn't recommend to anyone. The waitress is rude and the manager is not to far from the waitress ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bDdqRmN3EAE",
            "text": "I found a roach in my rice and the owner was rude and told me to go eat somewhere else. I'm filing a complaint with nychd."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad2VULUlREAE",
            "text": "Caught the ferry from Manhattan and had no idea what was in Soundview.....Maravillas was the closest restaurant within walking distance of the wharf. This was home cooked food made with care.\nThanks for the delicious introduction to Ecuadorian cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeTctN013EAE",
            "text": "The food is great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdHVhYkl3EAE",
            "text": "Thought we were going to experience a local favorite, a hole in the wall with delicious Ecuadorian food. Unfortunately we were disappointed. The food was very bland. I had the hen stew with rice, slaw and plantain and my husband had the grilled chicken (churrasco and we requested chicken instead of steak). For 16.99 I would have expected at least a drumstick or breast, instead they gave me a neck, foot, a mystery back/spine piece, and another mystery piece that may have contained some thigh. It was very minimal meat. The flavor was good but there was very minimal seasoning. A little salt and pepper would have transformed this subpar experience into a solidly good experience. The rice was plain but good, the slaw came with avocado and it was good, and the half of plantain was naturally delicious. The grilled chicken platter was also bland and barely grilled. The guava and blackberry juices were good. Gratuity/service charge was included. Total bill was a little under $60. The place was packed on a rainy day so it seems we’re the only disappointed ones. Try for yourself and see how it is."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURKOUlVbhAB",
            "text": "Encebollado mixto 3 is the truth."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdmZhUnJ3RRAB",
            "text": "Delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNTd6NUpREAE",
            "text": "It depends what you order. I just had fish soup and shrimp with eggs, rice and beans food was good,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaS1IZmNREAE",
            "text": "First time I went there, Food was Delicious... Will definitely visit another time"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOUlLSWl3RRAB",
            "text": "Demasiado delicioso"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bTlTb2R3EAE",
            "text": "La comida es excelente ya que mantiene el sabor tradicional de la comida ecuatoriana."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGNxVFVnEAE",
            "text": "Pretty pricey and the food is okayyyy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4emJ1WlpBEAE",
            "text": "It was nice. Food was ok. I was just shocked they didn't have certain type of Ecuadorian food especially on the wkd. Sopa de camaron no tenian. Ni caldo de salchicha. My daughter's didn't like the juices they said it wasn't home made the lemonade and the maracuya passion fruit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScGJ5em5RRRAB",
            "text": "The service was not rude but could be more kindly and friendly as a restaurant I would expect a glass of water,maybe they don’t offer it since they want you to consume their beverages,I ordered a chalufan and it was salty kind of looked like a rice pudding and don’t forget the mandatory 18% surcharge + tip\nFor a small restaurant and the food quality it’s it was very pricey."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaE56LW5nRRAB",
            "text": "la comida es buena pero no es lo mejor.\nlo que si me molesto es que x 2 almuerzos t cobren olbligado los tips osea son 2 almuerzos no platos al carta y mas creo que cobran 2 o 3 dolares por comer ahi…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbGRLa0NBEAE",
            "text": "Todo excelente ,de primera todo,te sientes en Ecuador tanto en la atención como en la comida"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb1pYbjZ3RRAB",
            "text": "Food was good, it depends what you order. I just had fish soup and shrimp with eggs, rice and beans"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoenRlMTZBRRAB",
            "text": "Algo parecido a lo ecuatoriano . Pero demasiado caro un bolon con bistec y huevo , 18 dólares.  Ya es un abuso"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMHQyaDFBRRAB",
            "text": "Fui ayer como a las 2pm, empezamos con una orden de muchin y corviche que estaban muy ricos. De ahí pedimos un bolon mixto con bistec y huevos, buena porción y estaba delicioso, yo me pedí un ceviche pulpo camarón y pescado wowwww que delicia! Volveré para probar sus otros platos. Me gusto el servicio y hasta el local parece una hueca auténtica ecuatoriana.\nLo del 18% en dine in y deliveries me parece razonable ya qué hay gente que no entiende que los meseros y delivereros viven de las propinas."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN1bmFRNBAB",
            "text": "The price for the amount of food given is okay the rice and beans tasted absolutely delicious the fried pork could’ve used alot more seasoning. Very nice host and the food for takeout was extremely fast. If it wasn’t for the seasoning on the pork being a bit Bland I would’ve given it five stars. Overall a good place to get some decent Ecuadorian food, I will try it a second time to see how the seasoning is on a different dish."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdXZia21nRRAB",
            "text": "A-MAZING ECUADORIAN FOOD HERE!!!! PERIOD. I love this place SO MUCH!!! they serve the BEST Ecuadorian food and the service is GREAT. They’re professional and very friendly. I recommend to EVERYONE. The food is soooo good! And they taste…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOWZ1dHZ3RRAB",
            "text": "Im Ecuadorian and would not recommend this place to anyone. Very greasy , old food. The food is not authentic. Dipped and overloaded with oil . Not Ecuadorian. It is true, there are not many Ecuadorian places in the Bronx , but GO ELSEWHERE. I tried this place bc it’s close to me - but I would have rather crossed the bridge to queens. HORRIBLY MADE “food”."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNVpya2NBEAE",
            "text": "Good Restaurant, cozy and welcoming. Great service. No drinks -"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNta0tEZ3VnRRAB",
            "text": "Me and a friend went there this past weekend. The service is bad, not even a glass of water. I ordered encebollado which was just water and salt, the fish and shrimp felt old. I literally just took two spoons and left the rest. As for my…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobmZ6QXNnRRAB",
            "text": "El encebollado que pedí hoy sabía a puro ajo, algo que los que saben de comida ecuatoriana eso no es admisible, algo horrorosamente incomible. Lo peor que tuve que tirarlo y costo 15 dólares. Me quedé sin almuerzo, mejor eso a que me diera un dolor de estómago o diarrea de tanto ajo. Ya no es que lleve ajo, esque el encebollado no lleva ajo. Ese encebollado no fue hecho por alguien ecuatoriano... No debería decir que venden comida ecuatoriana si no es así. Respeto todas las comidas, pero, cada comida lleva lo que lleva, no inventen...."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4amVDZUJ3EAE",
            "text": "Un excelente lugar de comida Ecuatoriana  mucha variedad y los platos son esquixitos como los de mi querido país 🇪🇨 recomendado…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdlphb3F3RRAB",
            "text": "The wait was very very long about one hour. The service and food was acceptable. Check your bill very carefully though. When the bill came each literally each food item was marked up 2-3 dollars extra and also ontop they sneak themselves an…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMThpWkRnEAE",
            "text": "My friend and I went into the establishment and sat down. Generally your suppose to get water as soon as you sit down,  but it took ten minutes. We ordered simple food that does not take long to make. After a half hour of talking my friend and I noticed that our food still had not arrived. We asked the waitress and she said that a large table was ahead of us,  but that did not make since. I ordered soup and the same dish I ordered a gentlemen behind me who arrived 10 minutes before I did got his food. The waitress said it will take 15 minutes more and I immediately replied it's OK we will be leaving because that's 45 minutes to an hour of waiting to eat. You cannot enjoy food after waiting that long. Their food is decent, but not worth waiting long for,  service is not warm or inviting. My recommendation is that you go to Castle Hill where you can find a more quality place. It may take longer to get to from Soundview, but you will be happy in the long run."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMnZXenV3RRAB",
            "text": "Love the ceviche taste great , food is always fresh and service is excellent"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbGF6Z093EAE",
            "text": "UPDATE: left a review a year ago. This place is one of the best EcuadorIan restaurants I ever been too. They have the best and freshest food!!! I feel like my grandma in the kitchen. The ceviche, the humitas 🤤 . Incredible and they built an extension it’s beautiful!!! I originally gave 4 stars but have definitely earned the 5!!!\n\n1 Year ago: They had good food. Atmosphere could use some work but food was on point and so was the waitor"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXamNtLXlnRRAB",
            "text": "Impressive and flavorful!\n\nI'm selective where I eat, I’m a food critic because I’m a good cook, my husband braces for it every time we dine out! 😂.\n\nI visited this place once before the pandemic and took note of how neat the kitchen area is for a small space that’s a very good sign of cleanliness.\n\nToday I ordered a vegetarian meal and OMG the lentil beans were delish, the salad had avocado and red onions, ALL fresh! Kudos! tostones freshly made.\n\nOh love the spicy mustard sauce, thought it was salad dressing, was it?  I ended up using it on everything it added a great twist to the meal.\n\nThe staff was very courteous, thank you for the great meal!  I would order from here again and try something different."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpa0lPeFZnEAE",
            "text": "I have been coming here about a year and a half. Since being with my BF who is Ecuadorian. We have ALWAYS been greeted with smiles! The food is ALWAYS fresh and delicious! We have always been accommodated weather we were two or ten!!\nCeviche is the best! The bass, empanadas oh the list goes on! Stay exactly as you are!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBa3VhTHFnRRAB",
            "text": "It's a hit and miss for taste, quality, and service. My advice is to CHECK YOUR BILL very careful. On my last visit the owner included a unknown/additional charge like some places do for large groups. There were only two of us and it was…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNblptaWlBRRAB",
            "text": "The food is delicious and made with fresh ingredients. I ordered the seafood soup, which was the best I’ve ever had. The staff is also friendly, professional, and accommodating. I had a great experience and will definitely be going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcy11cE5nEAE",
            "text": "Food is amazing but the customers service is terrible. Bought breakfast a few weeks ago which I do everytime I get my hair done at the salon next door. I ordered food that was expensive with a drink. The lid to the drink wasn’t put on properly and the juice spilled out the cup. When I returned to let them know abt the spillage the manger started telling me I left the premises and basically would not replace the drink. I was very upset because I didn’t ask for another full breakfast just a replacement for my drink.  The owner of the salon constantly promotes this place however I will never eat there again. It’s a shame because I work at a nursing home facility in the area and was going to use them to place a huge order for the staff holiday party. After the terrible customer service I will not spend another dime there!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbDhQTjRnRRAB",
            "text": "This place has some of the best Ecuadorian food. I love the balon here and the ceviche. It’s a bit small but the food is fresh and delicious. Definitely a good place to enjoy brunch or dinner."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMXNDa0d3EAE",
            "text": "Came here on a whim because wifey and I were taking the NYC ferry service for the first time. Came all the way up here from the rockaways and needed to grab lunch. Saw this spot on maps and decided to check it out.  Food was great!  Very…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtXy1uMUhBEAE",
            "text": "Went to buy gallina soup (caldo de gallina) for my sister who is sick. Also Ordered the lunch special for my kids and I, and today was creamy chicken soup and rice with chicken stew (seco de pollo). All of it was so tasteful! Will be coming back here often. Reasonably price and so tasteful!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdS1udGpnRRAB",
            "text": "Prices decent / service good, but had the encebollado de pescado  for lunch and it wasn’t what I expected. First it had too much (white)onions, large pieces of fish not enough yuca and the hot sauce it came with tasted like it had mustard mix into it"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRa1pEbXFRRRAB",
            "text": "I stop by on december 31 2017 , we was a party of 8 ,,,presentation was ok. But the food was horrible. The soup had no flavor. Plus the main dish ( encebollado ) was mostly water with adobo and the fish was old. think the owners notice that…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNWEybUJREAE",
            "text": "Was visiting the Bronx and I do impressed! They were so kind and mace me a spicy Chicken dish with rice and vegetables. It was so good! Everything was so fresh and tasty. New tradition for sure!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0dVlYQWhRRRAB",
            "text": "Tilapia Cocado. Order it. You're welcome."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMFBHNmh3RRAB",
            "text": "Les doy 2 estrellas porque las dos veses que e comido encebollado muy malos , el Quaker estaba quemado, el aguado de camarón sabía a agua con adobo no tenia sabor ahora no todo es malo porque la guatita y la casuela muy rica . La presente de la comida es muy bonita. Necesitan un mejor chef . Gracias"
        }
    ],
    "reviews_count": 74
}