{
    "name": "Isla Cafe",
    "place_id": "ChIJqwjBksH0wokR4QzuRuD_aeo",
    "grid": "BX9",
    "address": "1859 Westchester Ave, Bronx, NY 10472, USA",
    "rating": 4.1,
    "user_ratings_total": 538,
    "phone_number": "(718) 828-3800",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNmFuQnVkVVpNU2xaU1dITmpUMnBpUTFWVE9FRRAB",
            "text": "This shouldn’t be a restaurant just a bar with friends, I walked in and sat at the bar waited almost 30 minutes for a drink and over 2hrs for food… the tall bartender had her back turned towards me on her phone and when she would get off the phone she would only serve what looked like her friends in the corner. I have heard good things about this place but I was very disappointed. The food was cold when it finally came out, service horrible."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdGF5MW5kSGxPYW1aQ2NUaHdhMkpsVUdwcFQxRRAB",
            "text": "Bartender Melissa is very rude! Very unprofessional! Disgusting attitude! Doesn’t need to be working in this field if she doesn’t know how to properly approach paying customers correctly. More focused on smoking vape and talking to People at the end of the bar lounging around than to actual customers."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc1lrcDJkRGRKUWtGeU9IY3RaM0ozUm1sclYxRRAB",
            "text": "Loved this the workers r kind 💕"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VGNXNUllR3RZUkRneldqSm9UMWxDV1V0a1gzYxAB",
            "text": "Me cobraron 8 pesos por una serveza y el dj no me gustó tampoco"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNVNFUjRhM1owY0RKTUxXTkxUV1E0U1haVE1XYxAB",
            "text": "HORRIBLE SERIVCE ALL THEY DO IS PLAY ALL THEY .. I ORDERED ALMOST 2 HPURS AND JUST STARTED MY FOOD"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbmFVMXpjakZEYURKSE5reDFXVlIyVjNKd05uYxAB",
            "text": "The food is outstanding.  The drinks were on point. Vibes are good. Waitress with the Red fit that serve us is very beautiful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NmVXbEljRzFQTWtGQlgydHNNMkpRVG10cFRrRRAB",
            "text": "Burned food made the experience less than pleasurable. Staff is friendly, drinks are decent but I am really disappointed in the food. Either oil was old, or someone forgot to oversee my meals. Won’t go back, even if it’s the last place to eat."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ek0zWktVeTFRVDJGYVozVlJZWEkzTnpWcFZYYxAB",
            "text": "It's a great place if you plan to host an event or party. The owner and lead bartender Mel (manager?) are amazing  and very accomodating. Always a great time and the music is bumping, the baked chicken is SO GOOD and the service is great!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4Mk1GaG1WMHRwWDFkYVZITTNNV0pvYUV4d1dIYxAB",
            "text": "This is bar smelled like bar I guess the humidity\nI was impressed by the food,it was good,\nI finished everything it was yummy."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvLUtfdWJREAE",
            "text": "Great energy from the staff and service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbklfaW1nRRAB",
            "text": "i went here yesterday and i didn’t feel welcome long wait for food wasn’t good, hookah wasn’t done well and was over priced & the waitress brought wrong food to our table and took long to come with mine. looks like she had to much drinks while working, it was uncomfortable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaUtpdVdBEAE",
            "text": "The server we got seemed to be too busy chatting with co workers and smoking hookah the whole time. My friend & I ordered our drinks I simply ordered a soft drink & I never got it. My friend ordered a blue isla drink & I was so deprived from waiting I asked the next person who passed by to get me the same drink as my friend. Also the food came out an hour late and was very dry & bad. I barely ate it my friend also said their food wasn’t great. I asked them for an extra lil garlic container & they gave me a big one never told me it was an extra charge. Also the server came out of nowhere bringing my friend and I another round of blue isla drink that we never asked for we didn’t even drink it because one was fine we didn’t want another drink I’m thinking it’s on the house cause who brings out drinks if we never ordered them, next thing u know it was on our bill, they were so slick they did that to every table so beware!!! Also she lied about happy hours so I just let it go but I should’ve known it was a red flag from the jump, horrible customer service, long wait, bad food, I wouldn’t come here again just because of this experience!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMllYdk5BEAE",
            "text": "Love the vibe"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndnJLaFpnEAE",
            "text": "I love isla cafe , you can come here on any day and always turn up. The food there taste AMAZING . Taste exactly how true authentic Puerto Rican food is supposed to ! Come enjoy yourself . Even if you go alone you’ll have a blast ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2X0pXeThRRRAB",
            "text": "This place was popping even on a sunday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN3VYSjF3RRAB",
            "text": "Charged as soon as you sit is incredibly unwelcoming. Hookah is way below average. Was expected to meet a friend here and cancelled. Experience was disappointing. You smoke twice from a hookah and it's dead."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIenBERGpRRRAB",
            "text": "We had my husband’s 60th birthday celebration and it was such an awesome experience. Intimate setting with staff being very attentive to our guests. Owner, Candice communicated with me throughout and everything was perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMm8yZlhREAE",
            "text": "had really, really good food. went for brunch with about 20 people and everyone enjoyed their meal & drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMa19LVk93EAE",
            "text": "I had such a great time the food and the drinks were excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOE9iMklnEAE",
            "text": "La comida peruana super rico"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMmZhZENnEAE",
            "text": "Taco Tuesday was so much fun. Music was nice, some drinks were expensive but good. Would go again when I visit nyc."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUd3UtUjB3RRAB",
            "text": "This place is definitely a vibe!!! From the food, drinks,music,hookah and beautiful women that works there 👌🏽 I will be going back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNUdUp3MxAB",
            "text": "Great food great music great vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbVBlMllREAE",
            "text": "Isla Cafe is a great restaurant to eat and spend time with your family! the food and service is great!.. real authentic Puerto Rican food especially the alcapurria! .. was fried to perfection! would for sure be going again.\n\nYOU MUST GO TRY FOR YOURSELF!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdjU3VzhBRRAB",
            "text": "What a great place and experience. We hosted a special event and everything was beyond our expectations"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcnIzUXRBRRAB",
            "text": "Gave it 4 stars on the atmosphere cause it deserves to be bigger , love it here and the food never disappoints."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOU9TTEJBEAE",
            "text": "Excelente servicio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGd2ZmN213RRAB",
            "text": "Love it there. Everyone is so nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1M0xURmpBRRAB",
            "text": "Food was great. Good vibes. Will visit again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1blBxQVZ3EAE",
            "text": "So we have seen this establishment posted on Instagram and it looked tempting. We visited the restaurant on Monday night and upon walking up to the restaurant we saw garbage strewn all over the side walk and street directly in front of the restaurant. That should have been a dead giveaway but we were starving. Once inside there was music playing and the volume was super loud for it to be a restaurant. There was an odor that seemed like something like a mouse or other rodent had died and was behind a wall or something. (When you live in the city you get to know these smells) Like  I said earlier we were hungry so we stayed. The waitress came after some time and we gave her our order. We didn’t hear or see her for some time and after 30 minutes we called her over and she said that our order was never submitted and she didn’t know how long it would be or if our order could be prepared. Really?? We left still hungry LOL"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlM0xYdmRREAE",
            "text": "The music is mixed with freestyle to current. The atmosphere is cozy and decorated for the holidays. I enjoy this establishment and recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLTlEaS1RRRAB",
            "text": "Nice place great food and music,  will definitely go back again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNW9PQTlRRRAB",
            "text": "It was pretty cool. Only downside for me is that their chicken was flavorless. I ordered chicken wings regular but at least expected to have some flavor. But overall I absolutely loved their drinks! The Hennything possible was pretty good. And their incredible hulks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeTRiSldREAE",
            "text": "Very inclusive"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKenZfTG5nRRAB",
            "text": "Place meets every need when going on wit ur friends for a night out n the happy hour is dope too!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eWZfZ2l3RRAB",
            "text": "My gf and I came here today we sat and waited for about 20 minutes. There was one server that didn’t even look our way and attended other tables who already had food and drinks. We didn’t even get water. We walked out.. HORRRIBLE SERVICE"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MU5EZkZnEAE",
            "text": "Music was banging good atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LU5tWUR3EAE",
            "text": "Great date spot, music, drinks, games, friendly people, wide selection of hookah, drinks, and food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMk92eDZBRRAB",
            "text": "Great place to have Good  food and drink always friendly bar tenders and people who have a good time never no drama or fights when I go here try it out"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJa29lR253RRAB",
            "text": "Great fun vibes , dj is a ball of fun , friendly staff , hookah lounge,picaderas and drinks 🍹 are not so bad ,but the chicken wings were my least favorite/ street parking"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OU5MS2RREAE",
            "text": "My bartender was grace. Amazing service I was on a date she kept the drink and the good energy flowing! so helpful suggested food and made our drinks perfect. Someone deserves a raise tbh. Thank you grace! Can’t wait to go back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaUpPRDBRRRAB",
            "text": "Decent place to hang out and have fun. On the weekends it gets a bit to ghetto for my taste but during the week they do specials and events such as game night. Food is pretty decent depending on what you order. Bartenders are okay could use…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlM29uVFNnEAE",
            "text": "Went for my grandsons birthday.  It took 45 minutes for the food to come out. 3 out of 4 of us got their food n mines came out when they finished theirs, they didn't bring it out as ordered,  my son never got his appetizer. They never came…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdUtpZm1nRRAB",
            "text": "I had a great time. Music was on point and the food was delicious. I'll be back. #8-4squad was in the building"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOTktRHdBRRAB",
            "text": "Had the chicken stuffed plantain cups, grilled chicken breast in creamy garlic sauce w/ mashed potatoes, slow roasted pork w/ rice+peas, plus margaritas w/ top shelf liquor. Everything was delicious and beyond my expectations specially since the place was practically empty when I walked in. Was attended by Joslyn. I highly recommend this place and will be back to eat here and try something new next time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHa29yUF9RRRAB",
            "text": "Love this place! Super cool spot for a turn up at night and a good Sunday chill spot for games and salsa. Love the bartender Grace, she the real MVP, keeping this light and making sure you’re comfortable. Music is live, great vibes. Oh, and they have hookah!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOE5tM2dRRRAB",
            "text": "This place is awesome! I was invited to a Drag Brunch to see Stormi Von G perform. The entire staff was in costume. The music was popping. The mimosas & sangrias were never ending!!! Food was great! Steak was so soft and juicy. The…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMmVhZDlBRRAB",
            "text": "Went on Sunday for 1 drink and appetizers  lol.. needless to say 1 drink turned into many.\nMy cousin and I had a great time.  The music was great.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNc043T3J3RRAB",
            "text": "I meet my husband at this place to have dinner.  After almost 45 minutes we never got out food just one appetizer.   Unbelievable we waited and waited   We even bought 2 beer buckets.   After an hour wait we told the waitress to cancel our…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cWJXanV3RRAB",
            "text": "I went for a birthday brunch w/ my husband & kids. Natalie was our waitress & she was great. The food was great & she was very attentive. The music was great. Environment was great & the prices are even better. Cant wait to go again!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdXBidW9BRRAB",
            "text": "I Had my daughters sweet 16 there this year and not only was the service amazing but the food was delicious (that penne was to die for lol) and the DJ was awesome! My daughter had an awesome time with her close family and friends. The owner allowed me to decorate to my liking and she even bought balloons that I was not charged for to decorate according to the colors I was doing. Candice was patient and answered all my questions. My family said the food was delicious and the bartenders were amazing and attentive to all their needs! The hosts were incredible! We were taken care of and I already am planning my next party!!! Great food, great drinks, great music and great atmosphere!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcE9hcGpnRRAB",
            "text": "This was the worse night of my life... I finally went out to have a good time with my friends from Yonkers and they were so disappointed with the place because they were charged at the door and then they had horrible service. We all paid to get inside for NO REASON. We walked in looking to buy a bucket of beer and a hookah, they made us wait forever to the point where we just ended up leaving . I’ve been there so many times in the past and it has never been this bad. While we were leaving one of the workers came out asking if we still wanted the bucket of beer 😒.. is she serious..... We left because no one was attending to us. AND top of that the place wasn’t packed. I will not be returning to this place. I do not recommend this place for anyone who is trying to have a good time in this area.... the experience was absurd."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyZ29uZ2t3RRAB",
            "text": "Food was by far spectacular very fresh and flavorful. Drinks were subpar at best , the mojitos were made more of mix than equal amounts of mix and Alcohol. Plus staff continue to hover over you in a sense of rushing you if you aren’t ordering more items. Will not be returning."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNUlHSVZBEAE",
            "text": "It's a great place to hang out during the week. There's a $5.00 Happy Hour until 8pm and $5 appetizers with games during the week and $1.00 mojito drinks on Monday's during Happy Hour. I wouldn't go on the weekends as it tends to get too…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NThiTDRRRRAB",
            "text": "Nice place during happy hour. They offer hookah in a variety of flavors. Open late and becomes a lounge/nightclub after hours. The bathroom is very small and the speakers are located on the bathroom wall so you will feel full bath while using the restroom. Overall a good experience with a trendy  crowd."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaWF5M3hRRRAB",
            "text": "Great vibe, great drinks, & great hookah! The only reason this spot didn’t get 5 stars is because the food was mediocre. The tacos were trash! They had hard shell tacos like Taco Bell. I get this is Puerto Rican food but damn, get someone in their to make some good tacos if you gonna have them on the menu! Smh! But like I said, if you want some good drinks and hookah, its decent. If they get that food menu fixed, they’ll be a hit!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNk1uZm5BRRAB",
            "text": "Just visited today 7/17/16 all I can say is I will not be returning to this piece of garbage place. The food was disgusting the drinks came in small plastic cups the types you get at a small family cookout. I wanna go on but I'm on a better place called \"STEP IN\" I don't have time to waste. Oh and the hookah state like ash and burnt plastic mind you i ordered mango....i had ash bits in my mouth. They also charged a tip on my bill for just two people wow that's a low blow. The waitress did this because she knew she was not getting a tip from me at all. This place is horrible me and my wife will not be back. Also the music was blasting on another level too much for a Sunday at all. Also the waitress was a short fat girl trying really hard to be sexy with her gut out and her mean overbite thumb sucking mouth."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyenVUQUh3EAE",
            "text": "Food is amazing, anything you get from wings to the main dishes are super tasty! Definitely Puerto Rican taste and some with a twist. Every single person from the managers to the bus boys are friendly and welcoming. The DJ’s will have your out your seat from Spanish music to hip hop to r&b etc. Prices can not be beat!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRME5yek93EAE",
            "text": "Great music, great prices, amazing vibes. Only problem is that food takes forever. It's usually busy so the kitchen always has back orders. However the food is great once you get it. I suggest ordering as soon as you get there"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnM0xDU1lREAE",
            "text": "Place is small but nice. Good music. Service maybe a 7 of 10. Went with a party of 3. Ordered food, drinks and hookah. My 2 friends finished their appitizer and then I recieved mine. Hookah was good though."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNVpQcDhnRRAB",
            "text": "My fiancé and I went here for his birthday celebration on 3/27/21 and his CoWorker Omar was one of the performers there ( he did his thang on that dance floor). This place is dynamic, the people are very friendly and you don’t have to wait to be serviced. After the performance was over it turned into a night club and we had an AMAZING time dancing the night away. What I really loved about this place is that they were strict when following COVID protocols. I loved that they cared about our well being. They had different flavor hookah and the drinks are AMAZING!!!! The bartender also gave us two free rounds of Fire Ball shots. If you order food you need to try out the boneless chicken chunks with the yuca fries. I can’t forget about the DJ, he played all different types of genres of music. They are um um gooooooddddddd!!! Can’t wait to see his performance again soon to dance till we drop. I have definitely recommended this place to my friends and family and I would definitely recommend this place to others. Good job Isla Cafe 💜"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzenRieFdREAE",
            "text": "DON’T USE YOUR CREDIT/DEBIT CARD HERE! After receiving just ok service my friend and I were paying with our cards. I told the waitress/bartender how much to put on one card then the rest on the other. After a while they come back with one card. I ask why did they only charge one card instead of both of them were told there was only one card in the folder. I looked around the restaurant and did not see my card anywhere. The manager comes less than 10 minutes later saying he looked at the cameras, there was only one card. LIES! Before leaving one of the bartenders that was serving us said on our next visit she’ll comp our meal. We exchanged numbers. I contacted her to let her know we will be coming by the next evening. I also asked if she heard anything about my card, since there was no suspicious activity it must be lost somewhere in there. She replied “The boss informed me that u had ur card all along. That u had found it before u left n told the waitress n manager.” MORE LIES!!! I didn’t speak to the waitress I gave my card to because she was too busy playing around with male customers which I’m sure is why my card was lost. I saw the manager outside smoking not doing anything about my situation, I did not speak to him after he lied the first time. I asked her if her offer still stood the next night to no avail. I guess cheap drinks equates to cheap service and lies!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncGF2VURBEAE",
            "text": "Not what I expected!  I went there last week with coworkers. When I arrived, my coworkers warned me about the poor service but I decided to still give them a chance.  So I stood by the bar waiting to order a drink.  I waited, and waited, and waited...bartender never came. So finally, more staff comes in.  So l became hopeful, not sure why.  In comes this tall woman, obviously staff,  and asks if everything was ok down on our end of the bar since she noticed the bartender was completely devoted to the other end of the bar(completely neglecting us).  At that point I expressed how I was waiting to be served for over 20 minutes and no one cared to serve us. She asked for my order, I was like, \"ok cool...finally I'll be getting my drink on\".  WRONG!!! I waited another 15-20 minutes...she never came back with the drink. So many things were wrong that evening...I'm not even sure why, the place wasn't even that crowded! It gets better!  I decided to go join my other coworkers on a table, to possibly order apps. Since they had already finished their apps, the very same tall girl, who obviously wears many hats there, came to the table after yet another 30 minutes to kick us out of the table because the table was reserved.  First of all, I didn't see a reserved sign on the table...That is no way to treat your customers ladies! If your goal was to only serve your regulars, then you truly succeeded.  My coworkers and I will NEVER go there again!  I will be sure to spread the word to all my fellow teachers...DO NOT GO TO THIS PLACE IF YOU EXPECT PROFESSIONAL SERVICE...the staff there is completely unable to perform!  I'll rate them as ineffective!  We ended up at a place directly across the street from them, Olivia's.  They clearly know how to serve their customers...we ended up having a great time!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NEszWUF3EAE",
            "text": "Food is great drinks are awesome and the girls are pretty. Great deals everyday. My favorite is $1 Mojito and Margarita Monday's, $5 hooka, $5 drinks & appetizers and $3 beer. At 8 pm the dj comes through always spinning great tunes. A must visit."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZemV6MVp3EAE",
            "text": "Use to be a popping spot pre covid. But all the old staff is gone and the events they use to have is not as frequent. The hookah is mediocre. The drinks were not really good either but we went during happy hour so I only wasted 5 bucks lol."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHOXVyRlFBEAE",
            "text": "Today was my first time here & the reviews about the service was right! The hospitality is out of this world & the waitress Christine is such a sweetheart. I’ll definitely be coming back highly recommend. Oh & the food is delicious 😋…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMmJMT1J3EAE",
            "text": "This is nice spot the food was delicious. very professional excellent customer service. The girls inside there very cool laid back and didn't have a problem with resolving problems with food orders."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Mk9IaERnEAE",
            "text": "I didn't sit in the restaurant but are out of the express side. Price is right, with plenty for five to eat. Empanada was flying out on site and mainly for the beef. I don't eat beef outside so didn't try it for myself but I notice it was a big hit. Kids like the food, I love the coffee and my husband was content."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndmFDZGZREAE",
            "text": "Food was okay but the service was extremely slow. They were really unattentive. I went during happy hour and it wasn't even crowded. We asked for a table but they would walk past our table multiple time and not provide us with service until we asked for someone. Won't be going back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbmZtdktnEAE",
            "text": "The food is good with great portions. The service is great. The music is diverse and the atmosphere is fun. I love it there. So glad my cousin introduced me to this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcEl2Q0lREAE",
            "text": "I don't know where to start. The Bartenders are are heavy handed and super friendly. So you won't be disappointed. The food was an upscale Puerto Rican island cuisine def worth having. I had the fish and Yuca, my partner had the Picadera. Both was EXCELLENT.\n\nLastly the DJ for brunch was ooooo nnnnn point! And took our request, so def made us a happy camper."
        }
    ],
    "reviews_count": 71
}