{
    "name": "Underhills Crossing",
    "place_id": "ChIJG3TgE66SwokRX0scyzq-V6o",
    "grid": "BX9",
    "address": "74 Pondfield Rd, Bronxville, NY 10708, USA",
    "rating": 4.5,
    "user_ratings_total": 514,
    "phone_number": "(914) 337-1200",
    "reviews": [
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlb3IzdVVREAE",
            "text": "Always an exceptional experience. Just one part of my dinner was not as perfect as it usually is and I mentioned it in passing, everything else was great,mentioned it merely as an FYI but the issue was addressed immediately, exceptional service thank you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZk4yeDJURGN3ZFhWNVR6Uk9iakZIV25WSlpuYxAB",
            "text": "Food great, atmosphere is great and the waiters were very attentive."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sblZEQk1aMkpZVVhCWFFsWjBSVkV0UmpGTVdIYxAB",
            "text": "Roger is the Best!!\n\nBut the entire staff is great 👍🏽 👌 👏 😀"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad2JubHRMWEZ3VEdGcVZWZFpZM2sxT1RWNGVXYxAB",
            "text": "My family and I have dined here a couple of times, and I feel after three trips I feel impelled to give them 5 stars!! Each time we have come - exceptional service, food and it just feels like we are VIP - every single time!!! We have had a few waiters but Mike stands out the most as server and Kevin the bartender is incredible! We have also interacted with the manager Danny on multiple occasions and he has always gone above and beyond our expectations!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTlltWlNhMGw1YkVGcmFpMXZaVTlXUjJKamFHYxAB",
            "text": "Great bartender, Kevin,  Great piano player and fabulous pasta dish"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROF9MSUl3EAE",
            "text": "A little bit pricey but worth the money very nice patrons"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNGNVRlphV0ZETW5adE1VSndUbDh3VUZsUlIxRRAB",
            "text": "I had to leave this review before even leaving the table—Underhills Crossing truly impressed me. Adam, our server, was an absolute breath of fresh air with his energy, warmth, and genuine love for what he does. His recommendations were spot-on, and we trusted him so much that we let him order for us. Every dish was phenomenal, and the service matched the quality of the food—superb all around. This is the kind of dining experience that makes you want to come back again and again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bFIyWjVNWEJDWlZkUGVrSTViMnA0U2pKSmIyYxAB",
            "text": "Great dinner, as always. Food was terrific, vibe exciting but not too noisy, piano on the background lovely."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRFlYWkxOR0kzZG01TFZuaFRXRjlaYVZBMlYyYxAB",
            "text": "Love the restaurant, ambiance and gourmet dishes and appetizers too.\n\nThe owner Steve is the nicest guy and very down to earth. A bit pricey, but servers expect a big tip and get annoyed with customers.\n\nOysters, Chilled Lobster and all the luscious deserts."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTlJFMU9RV3hZZERoQmIydHlRVWgyZUVWVFpIYxAB",
            "text": "Excellent service, delicious food and vibe was A+++"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMlFUaFVRV05ZZG0xVVRpMTVNRXBpYVdGUFdHYxAB",
            "text": "We’ve been to Underhill’s Crossing for brunch several times now, and it never disappoints. Went with family most recently and had yet another great experience. The Challah French Toast was picture perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQmFVVnhVbHBCWHpoaVpVUTBPRk56Vmtkdk5IYxAB",
            "text": "Underhills Crossing never disappoints. The Santa Maria Seafood tower had the best, tastiest shrimp and lobster I ever ate. The oysters and clams were fresh and delicious. The bronzino was cooked to perfection and a great portion size. Get the donuts for dessert as they are light and airy. You can tell the staff are true professions as I felt so cared for and catered to. An ultimate dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21semNqVk1aVGczVDJ4S1V6RkJVekJ5V2kwME1sRRAB",
            "text": "We came here for a late brunch and had a pleasant time.\n\nSince it was a nice day, most people were waiting for an outdoor table but we opted for an inside one and we were seated immediately.\n\nFood was great and service was fast. We're planning on coming back to try their dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeVVHdzFkMm8yY2tOd1NuWmpWVTlVU2tObVJFRRAB",
            "text": "My friend and I recently dined at Underhills Crossing on Pondfield Road in Bronxville. The restaurant is quaint yet elegant with a staff that creates an atmosphere of comfort.\nThe menu is both extensive and  flexible. Danny, the Maitre D, took the time to explain the menu in detail. Several dishes are offered as an appetizers or an entree.\nOur meal was meticulously served and was delightfully delicious with the accompaniment of live piano music in the background. I had a Soft shell Crab Sautee as my appetizers and the Pan Seared Scallops with a side order of asparagus as my entree. Both appetizers and dinner were everything one would expect while enjoying a fine dining experience.\nUnderhills Crossing affords its patrons a completely pleasant and most satusfying dining expierience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScWVXeFJSVEUwZG5ScFMyaENYelpZUVVSVlpIYxAB",
            "text": "A Manhattan dining experience outside of Manhattan. The food is good quality. The atmosphere is nice. Adam is an exceptional server and brings this place to life. Although this place has different options I would recommend the duck and steak tartar."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFpWSnhla294ZVc1eFZsVk9RMjFpVlhKMGFWRRAB",
            "text": "So classy and fun.  Love Kevin the bar tender.  Super nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeW4tOEhuMjZmbUxBEAE",
            "text": "This was my fifth visit. Another excellent experience. Highly recommended"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPandvT1RRM1pTb1JREAE",
            "text": "Always great!! Always a delight!! If Adam is your server it's your lucky day!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOU2dzZFd0cUtiQXFBRRAB",
            "text": "This review is long overdue. If you are looking for a LUXURIOUS experience look no further. The Underhill Crossing is AMAZING!! There ambiance is CLASSY!! The food is EXCEPTIONAL and their staff is WONDERFUL! This restaurant goes above and beyond for their customers and their service  is unmatched. No detail or request is too big for them to fulfill. I have experienced many staff (Axel, Kyra, Roger, Alex, Cesar, Manushka, Adam) to name a few and they were all welcoming and great. Mike the bartender is the best!\nAlthough, I have been here several times I just had a 85th birthday party for my Father and everything was PERFECTION!!\nThe Underhill Crossing is PHENOMENAL and worth the visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYU1wdDZkX2NHNmRBEAE",
            "text": "We love it here! Service is Michelin star level. Food is outstanding. Drinks are incredible. Great spot for any occasion or a night out!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLSzNrYUt1dTYtY3RRRRAB",
            "text": "Great place for a special day. Expensive but worth a splurge."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKcUpnLWlRN08tdnpnRRAB",
            "text": "Good lobster bisque and French onion soup.  Ok chicken Milanese but lousy soft shell crab.  But, ABSURDLY EXPENSIVE. ALMOST $200 for 2 people with one drink and one glass of wine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWFk2NTdJbl9ENkRBEAE",
            "text": "One of the best restaurants I have ever been to. Amazing piano live, with non stop service from talented and experienced waiters. The food was just phenomenal and was ultimately delicious. I definitely recommend the Escargot 🐌 and Salmon! To anyone reading, you HAVE TO GO!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKX3lrNURmb3N2c2VBEAE",
            "text": "Had a great meal in a very fun spot. Great ambience and the service was superb"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeWI3clhvMUw2QVpnEAE",
            "text": "Great for first date outing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLcVAyOG5xNE9MWlFnEAE",
            "text": "As you enter the hostess is respectful and elegant\nThe bar tender greeter is refined, the server is outstanding\nSo what is the problem! Yes the arrogance of the Chef! Late food, arrogance, disrespect! A fine place, Fire the Chef!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM0piNG5nRRAB",
            "text": "Had a fabulous lunch, everything was perfect. Our waiter Adam was very friendly, attentive and knowledgeable of the menu. I will be back soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbWRiTXJBRRAB",
            "text": "Food was outstanding and the service was fantastic.\nExcellent service by Adam!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveHItSlBnEAE",
            "text": "Exceptional service! Ask for Adam and you'll quickly be booking your next reservation."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJenYtYk1BEAE",
            "text": "Underhills is always a wonderful experience! Have loved it for years!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dTlIOTVRRRAB",
            "text": "Adam was and the staff were excellent as usual 👏"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a29XRjV3RRAB",
            "text": "My first visit but not my last. Everything about this restaurant I loved. Our hostess Sophie was fabulous as was our charming waiter."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcnJyVDBRRRAB",
            "text": "The staff is over and above with service. The food is typical single portions so if you get sides they can add up. Prices are high. I had one of the best steaks, the powerhouse, in decades. So good"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcElXeWNBEAE",
            "text": "Always a fine meal. Perfect all around,  definitely will come back."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJLXNhcDZnRRAB",
            "text": "Rude people. Good brunch. But not worth the bother for the nasty atmosphere from the hostess and staff."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOVktQS1BRRAB",
            "text": "Absolutely delicious food, fantastic service, warm environment. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcEtmNGd3RRAB",
            "text": "Eden is the BEST!!!!!!!\nWe love it here! Food is amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaFBLMnZnRRAB",
            "text": "Best service in the area."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ3UtQ09BEAE",
            "text": "This is such an amazing restaurant! Definitely attend when they have live music . They always have delicious specials . I’m never disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmLTVLMmhnRRAB",
            "text": "Excellent"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LUpuNW5nRRAB",
            "text": "Ambiance is so chic and welcoming! The food is impeccable! Strangolapreti beautifully al dente and the duck was perfection!  What made our evening so very special was our server happy smiling Luisa!  Wonderfully attentive!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OHB6TVBREAE",
            "text": "Love!! The food, the service, the atmosphere all 10/10! Will be back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cU5HdjZ3RRAB",
            "text": "The revamped menu at Underhills Crossing is perhaps their best yet. Last night I had the Barramundi over asparagus risotto that was out of this world. The only other time I tried Barramundi was in its native Australia and this was better.\nManager Danny, the kitchen and wait staff are at the top of their game and owner Steven has created at atmosphere unlike any other in Westchester County. From the moment you walk in, the piano music transforms you to another place and all the worries of the week are put behind. Excellent experience and meal!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbTduMTVRRRAB",
            "text": "This was my second time coming to this place and it was absolutely incredible 💯\n\nWe had the tuna tartare which wasn’t exactly what I expected since it was a sweet version of it but it was very nice anyways. The oysters are the best thing on the apps. And we also tried the French onion soup and it was insanely good.\n\nFor my main I requested from my server James to have a variation of the salmon and I just ordered a creamy risotto and a salmon with a side of asparagus, everything was excellent !!\n\nThe salmon was on point really crusty outside but nice and soft inside and the risotto had the perfect texture and flavor.\n\nFor dessert we shared the profiteroles and the tiramisu (this last one is made in front of you at the table). Both delicious.\n\nJames didn’t miss a single detail he was very helpful with all our requests and gave us an amazing experience.\n\nPrices are a bit high but totally worth the experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbEpXcFNREAE",
            "text": "By far, my favorite restaurant in Westchester County.  Staff is excellent and food is amazing 👏"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNWR6RF9nRRAB",
            "text": "Service was rather slow but otherwise a nice experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3ZEcF93RRAB",
            "text": "Food was exquisite, with large portions, waiters were attentive to our needs, and the neighborhood was very nice, The only issue is parking can be iffy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIenFENnNBRRAB",
            "text": "Lobster bisque was just ok. 2 pieces of tough lobster. Chicken scarperalla was just ok. Service was not attentive. Wanted a 2nd drink before dinner, nobody ever came to ask if I would like another. Had to ask for a 2nd glass of wine. Wait staff never checked to see if anything was needed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bmVIc2NREAE",
            "text": "Ax and Eric were great. I absolutely recommend this restaurant. I will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cWF5QlpnEAE",
            "text": "We stopped in for the bar. Really upscale place. I felt under dressed. My gf got the passion fruit margarita, I got a bourbon old fashioned. The bartender Genaro made excellent recommendations for a dessert Espresso Affalato. Spelling maybe off I made a video. The staff was courteous and inviting for the most part until their hostess asked another patron to sit outside over a dress code. I’m not one to normally care but I felt as though I was under dressed and for them to even ask someone else to sit outside( which was being set up) . It didn’t affect me , but that wasn’t right. We were there at noon what would be the dress code at that time is beyond me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdWNxMlpnEAE",
            "text": "There is nothing to critique here.  We ordered half dozen oysters, hanger steak, while lobster with mussels and clams over a bed of bucatini spaghetti and a softshell crab.  For certain a lot of food.\n\nMy wife and I shared all.  They delivered the food already separated on the plates so we didn’t have to partition it.  They also brought out the food in the right ordered and adequately spaced out.\n\nOur server is Adam(in the photo) he brings an old school service which brings the right mix of entertainment and empathy all wrapped up with an undeniable energy which makes you feel like you have known him for years.\n\nThe food is perfect combined with Adam, makes this an unprecedented culinary experience.\n\nAll this carries a premium price tag,  but well worth the price.\n\nA must go."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCanBiVEVnEAE",
            "text": "We enjoyed having our Christmas Eve dinner here (outdoor dining was available, but with temperatures in the teens, we dined inside).  The food was well prepared, presented, and tasted great.\nThe service was friendly and attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta3NMdVNREAE",
            "text": "We sat outside in the tent area. We were seated by the hostess that gave us a table surrounded by a multitude if heat sources to keep us warm. Dinner and drinks were excellent. We were left alone and not rushed, so fully enjoyed our time. Would easily return again and would again sit outside whether cold temperatures or not to enjoy the outdoor ambiance."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Z3ViM2RREAE",
            "text": "Very attentive staff. My cup was constantly being refilled with water. And they came around The establishment is clean. There is indoor and outdoor seating. We had the opportunity to listen to someone play the piano while we had our dinner, which was nice. They have a large selection of wine and many entree options. I had roasted chicken with sweet potatoes and peas, and it was amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ejZhZ2pBRRAB",
            "text": "We come here often - the ambiance both inside and outside is beautiful and I absolutely love the live piano player. Menu is great - I’ll call it American with French influence, but very accommodating. It gets crowded so normally you do need a res."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1N0l5NHpBRRAB",
            "text": "We had a great birthday dinner at Underhills Crossing. The service and the ambience was top notch. Danny, Alfredo, and Elena made the whole experience so special us. Mike was lovely on the piano as well.\n\nWe had the scallops and the cascatelli pasta and both were delicious.\n\nUnderhills Crossing is a culinary treasure for the town of Bronxville and I am so impressed by the consistently high standards of hospitality it holds. Compliments to the owner, the chef and the kitchen staff, and the rest of the management team!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaTllbm5nRRAB",
            "text": "Cute little spot with indoor and outdoor dining, even in the winter. We came here for brunch after passing by live music one night. The servers were all very attentive and kind. The food was well prepared and quickly served. Brunch came with a free cocktail which was a plus!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbzdMOHh3RRAB",
            "text": "My friend and I dined at Underhills Crossing in Bronxville yesterday and it was an incredible experience. The staff was warm and friendly, making us feel right at home. The food was a culinary masterpiece, with dishes like the gnocchi with mushrooms and truffles that were simply divine. And let's not forget about the drinks. The bloody Mary at Underhills Crossing is not your average cocktail. It was a true work of art, with a beautiful presentation that made it almost too pretty to drink. The location had an elegant and inviting ambiance that made the whole experience even more enjoyable. If you're in Bronxville, I highly recommend checking out Underhills Crossing for a memorable dining experience.Can’t wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMDZEcUxREAE",
            "text": "The place is very nice and so is the atmosphere. Very elegant decor. Food is not as good as I expected for the prices, but our waiter, Adam, he was superb! Wonderful, courteous, kind. Really made our lunch worthwhile."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncnB1SVNREAE",
            "text": "Salt and Butter heaven. 75 percentage of our main courses were salty. From Mashed Potatoes to simple Seared scallops. Our Panna cotta had too much gelatin so it feels super stiff.\n\nOur Waiter was very friendly and spent great amount of time with every tables. To requesting a check, took us at least 10 minutes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMelpTTE1BEAE",
            "text": "very cool place !yesterday my husband and I visited, the service was excellent, I ordered meat it was delicious , the dessert was like in the best houses in Paris. Now this is our favorite place!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Z3ViaF9RRRAB",
            "text": "It’s a nice clean restaurant with a lot of verity in the menu, food was ok but pricey. I liked the place and the fact that they have a piano :) and live music, but the music was so loud for a place that’s supposed to be formal classy atmosphere. They have a very nice seating area outside with portable heaters.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiblBtNXd3RRAB",
            "text": "Just spectacular food and service. Sometimes there’s live music! Beautiful any time of day or night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOWM3UjB3RRAB",
            "text": "Drinks were very tasty, ambiance is great, and food was good. Loved the outdoor seating. My only complaint is that I called and made a reservation and let them know it was a birthday. When I got there, I double checked that they had the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbHRDckVREAE",
            "text": "Have had wonderful meals here in the past and unfortunately this time it totally missed the mark.  I started with an Elderflower White Cosmopolitan and it was FANTASTIC. The carrot soup with garlic croutons was also FANTASTIC and fresh.  However, the riblets, while tender, were more fat than meat and the sauce was overpoweringly sweet and nothing more.  The organic quinoa salad was completely tasteless: it was texture only.  The service perfect as is the atmosphere.  It is a warm and inviting vibe."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmRxd2ZREAE",
            "text": "Went to this restaurant for the first time tonight and have to say how incredible the ambiance and service was! We sat outdoors and just loved the decoration and how cozy/warm it was.  Giovanni was our server and he was absolutely FaNtAsTiC!! He was attentive and really made us feel special! Would visit again for sure!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMXNMcUdREAE",
            "text": "Wonderful place\nExcellent service\nFantastic food\nWe wanted to go to this restaurant for months and we had to postpone\nMonday quiet night to be sitting outside for great food and drinks\n\nI think nothing we ordered disappoint"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOEkyOXBBRRAB",
            "text": "Went for brunch on a Saturday and had a wonderful experience. Our waiter Adam was very friendly and knowledgeable, drinks were amazing. Would definitely recommend and will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQta3Z6Ukx3EAE",
            "text": "Underhills crossing isn't cheap and it isn't meant to be. If you want cheap, go to McDonald's. There are many good restaurants in the area but it's the details that set the great ones apart. Underhills gets the details right. I highly recommend it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLazc3Mzl3RRAB",
            "text": "Do yourself a favor and visit this lovely restaurant in Bronxville. The service is unmatched. The staff truly cares about your experience. The food is absolutely amazing – a serious culinary tastebud explosion!!  (I literally wanted to cry…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aWRYeEtBEAE",
            "text": "Just wow!  Phenomenal service, exquisite food, an all around wonderful experience.  We’ve tried different items on the menu and every time we are pleasantly amazed by the quality, creativity and taste of the food. The specials do not disappoint! Elderflower white cosmopolitan is a must!! There’s been a pianist there that plays the times we have dined there which is an added plus!  Looking forward to trying the brunch next."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZ2MzTklnEAE",
            "text": "The food is amazing & EXTREMELY friendly and overly welcoming staff.  You dont need reservations and extremely accommodating. I highly recommend this place 💚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyck9mWjN3RRAB",
            "text": "The owner had extended an invitation to my coworker, so we took the opportunity to visit for her birthday, on Friday July 12th, 2024 and were pleasantly surprised.  We had a party of three and from the moment we entered the establishment, we were warmly welcomed.  Our hosts was friendly and he helped set the ambience for a wonder experience. The meals was excellent and service was superb.  You could see the joy on Deborah's face, making that birthday one she will never forget. Thanks to the management and staff for that experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZa0xlWXJBRRAB",
            "text": "Fine dining with a friendly atmosphere. Frequented for lunch, dinner and an occasional cocktail.  The Staff is exceptionally professional. Exquisite cuisine. Bronxville's finest and a must when you're in town."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbEtpRElBEAE",
            "text": "The place was just renovated and looks really beautiful inside. The food and service were great as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMDQ2YUdREAE",
            "text": "Call ahead for a reservation to sit outside if you can. If not, it’s still worth stopping by to see if a table is available. Once seated, great service, food, music, and ambiance."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeWN2bHh3RRAB",
            "text": "The Curried chicken salad was just too sweet, the chicken should also be chopped into smaller pieces. A friend recommended there so I was excited but I wasn't impressed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbzVDcHRRRRAB",
            "text": "I've had the pleasure of eating here many times and it gets better every time!\nThe workers there are top notch, menu is always getting upgraded as well as the drinks.\nIf you have not dined at this GREAT bistro you should do so immediately!!!\nLooking forward to the next time..."
        }
    ],
    "reviews_count": 78
}