{
    "name": "The Waterfront NYC",
    "place_id": "ChIJd8ioKx2LwokRE9roVbrzASU",
    "grid": "BX9",
    "address": "Parking lot, 500 Hutchinson Riv Pkwy, Bronx, NY 10465, USA",
    "rating": 4.1,
    "user_ratings_total": 188,
    "phone_number": "(718) 414-1577",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMVVHVTRaM1JEWkdKMFFtVkVRa0Z4TTJ4VFUwRRAB",
            "text": "Location is amazing.\nThe food and customer service is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQmVHOHpPV0p2Wm5KT01saGZPV1I2VVhKallXYxAB",
            "text": "Amazing staff and great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRGJYRnhURGRuZUhoZlFXdFFUM1V5UWxkd1kwRRAB",
            "text": "Cris and Tijera are a outstanding in the service, and the place is AMAZING, great ambience 10000000 percent to visit and come"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNWRpZTZ3RRAB",
            "text": "Love this restaurant!! The food is delicious, and the ambience is lovely. They usually hosts holiday events for the public & it’s always a good time!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJakx6dE9BEAE",
            "text": "The food is always great, and so are the mocktails! Perfect for brunch."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MnAyZzlnRRAB",
            "text": "Such a great time here. Will update with pictures"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzamVtYjFBRRAB",
            "text": "This place has a great atmosphere. Seating is spacious. Service is always on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN3J6TEt3EAE",
            "text": "When I was going through heartbreak, my friends took me here to hangout and take my mind off of it. Sitting out there and looking at the grass, the sky, the clouds, the water, it honestly healed something in me. Just sitting there with the wind in my hair and the quiet murmur of the other diners around me felt calming. The food was great too, the only reason I minused a star was the service was quite slow. Maybe it was just an off day for them like it was for me but I'll go back and confirm :) Really a gem, I'm surprised I've never heard of it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMy1DdFpnEAE",
            "text": "The ambiance was amazing both inside and outside we were escorted by a friendly beautiful host .Our server was Nick who went above and beyond he was attentive courteous and patient.  We will definitely be back.  Kudos to your staff!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidUl5aFR3EAE",
            "text": "I recently dined at The NYC Waterfront and was extremely disappointed with the customer service. From the moment we were seated our waitress Chastity C seemed uninterested and inattentive.\nThroughout the meal Chastity C was nowhere to be found. We had to flag down another staff member to locate Chastity. Our food arrived lukewarm and not as described on the menu and the coffee arrived cold. Getting anyone to address these issues was nearly impossible.\n\nTo top it off, the Chastity C was unapologetic and seemed annoyed when we politely mentioned our concerns. Overall, the poor customer service completely overshadowed our entire dining experience. I won’t be returning and cannot recommend this place to anyone looking for a pleasant dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicnZ6STRnRRAB",
            "text": "Had brunch on Saturday with my girls and we all were super disappointed i see now reading the most recent review we weren’t the only ones. We spend 3 hours there spend more than an hour and half waiting on the food. They blame having a party next door to the reason why they were backed up which we understood but they should have more staff if they know they have to tend to the party and regular customers.Food did come out hot the reason for my review is we could never find our server she disappeared for a long time and then when we did try to flag her down she was too busy talking to the bartender we basically spend over an hour waiting for her. We were going to order more drinks but we were worried it would take another 40 mins just to get them. Food is great service sucks they definitely need to work on it ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMXRPdnpBRRAB",
            "text": "Fish tacos great! View great! Beef sliders cold n hard"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXNPU093EAE",
            "text": "The restaurant itself is  very elegant, great view of the bridge, Long Island sound, the golf course.    I was pleased with the service, very attentive waitress, the prices. However, even though we went on Father's Day Sunday,  they seemed to have run out of some of the items on the menu, which is not so varied to begn with. I asked for a margarita rimmed with salt, I got sugar rim instead.  They ran out of all desserts, except coffee.  It's a beautiful place but it has the feel of a fancy concession stop for the golf afficionado."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb3FqbW5RRRAB",
            "text": "(Unprofessional table service) I came back because I enjoyed my last visit in 2023 but this time around the experience was terrible. Myself and another member of my group had to keep going back to the receptionist to find the server. It took approximately 30 minutes to place our order for drinks and appetizers. We received our plates and utensils at least 10 minutes after we were served the appetizer. It becomes very uncomfortable once you have to remind your waiter to service the table. It spoiled what was supposed to be a treat for father's day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bzU3SFZnEAE",
            "text": "Amazing service! Dee was a great bartender, made the night special!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaC1UVWNREAE",
            "text": "We have been long-standing patrons at Waterfront NYC.\nManager Cl-on* was disappointing to say the least. He was inflexible and obstinate in accommodating a large reservation on a rainy weekday afternoon/early evening despite the reservation having been made weeks in advance. He claimed that the restaurant could not sit two tables next to one another, required two separate servers (understandable), and demanded two separate checks. The latter was inconsequential but his repetition of these points, and overall treatment during our celebration, made us feel unwelcome in the community.\nThroughout our dining time, more than half of the huge dining room remained set up and vacant. The server at one table was friendly but inattentive. They seemed to have been coached to provide subpar service. The manager with whom we had email, phone, and Open Table communication with, never came by the tables to greet us despite being at the nearly empty restaurant at that time (see attached).\nOur saving grace was the protection offered by Open Table to its members and reservation policies. Thank you Open Table for helping a child's special event survive the tanking by this inhospitable restaurant manager.\nClub members and friends from the area are reconsidering their tees and reservations for the plentiful greens and clubhouses that value their guests. The gorgeous views and design of this site are spoiled on poor management.\nManagement should consider extensive training for this manager, and a review of best restaurant hospitality practices.\n\nUPDATE June 11, 2024\nThe course and restaurant are under new management by Bally’s. Manager Cl**n is no longer tending. The restaurant has invited us back for another try. We will post an update."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqM3RheWlnRRAB",
            "text": "Friday, 05.03, 11:45am\nThere was no table service at the time we arrived, which was fine. However, I would have left a -2 star for service if available. The barista had an unacceptable, very rude attitude. She threw the coffee cups to our table, and announced she had replaced almond milk with oat milk- she did not bother to ask. No spoons, no napkins. This type of service is one of the worse I have received and would not expect to see it in a Golf Club, but more on a street food stand. Such a shame.\nThe environment and view is nice, just hope future guests don’t have to encounter this woman barista. Side note: Restrooms were sparkling clean, so shoutout to the cleaning crew!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NDlMbXB3RRAB",
            "text": "Went here for a party 🎉 it was amazing in all aspects will recommend to anyone this is the place for a party 🎈"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWcWZUNFlREAE",
            "text": "Have visited The Waterfront many times. Attended the “Bally’s Christmas Bash”. Absolutely beautiful. The food was delicious and the staff were very friendly, polite and helpful. Bally’s has done an outstanding job."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsck95Z2hnRRAB",
            "text": "If you go with carnivorous friends and you are vegetarian or vegan they have no options.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjhxY21RRRAB",
            "text": "Very nice and the food is tasty. Costumer service is #1."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwel92RUdREAE",
            "text": "This is such a beautiful place! The food is so good and the staff is so friendly and accommodating. Went for my mom and my aunt's birthday, and we had such a wonderful time! Can't wait to go again for another memorable experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMGRtQXJBRRAB",
            "text": "Beautiful place to enjoy some wine!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMjVMYVpREAE",
            "text": "Was there for an event...management was not accommodating to either party that was there. Services seemed subpar for what they charge. Amazing views but that's where it ends..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweXB1RlpnEAE",
            "text": "It was a date from my girl friend who been at this location before...it a great 👍experiences to have a quite,relaxing elegant mood the food was great the drink never want to stop..sit outside and watch the golf⛳️and bridges🌉 for 5 great hour ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNlBYVkFREAE",
            "text": "I love this spot! I love the outside area!\nMy server Delilah is Phenomenal, she’s amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMXJhS3FRRRAB",
            "text": "The restaurant has a really classy setting/atmosphere. We  had good service. Unfortunately, out of our group orders, we only enjoyed the calamari and lamb chops. The fish were neither tasty nor fresh. Please work on the freshness of the fish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbHZHeVNBEAE",
            "text": "Beautiful place to have a luncheon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaEpHQnpBRRAB",
            "text": "The food was pretty good but not as good as it had been in the past. It also took a very long time to be brought to our table. We were there for over 3 hours from the time we arrived to the time we finished our desserts- and we did not take long to order or eat. However, the waitress was amazing! She was patient and answered all questions we had. She apologized for the wait which was appreciated. The atmosphere overall was very relaxed and beautiful. It was family friendly but not too chaotic or loud, perfect setting for a nice afternoon brunch!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OWZHVmVREAE",
            "text": "It’s so good 😊…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NXR1VnFBRRAB",
            "text": "The hostess was really welcoming, the restaurant is lovely with a breathtaking view, and the waitress is amazing—she is incredibly polite and attentive and always made sure we were having a good time. The cocktails were excellent, and I'll definitely visit again with more people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MnJfMTdRRRAB",
            "text": "When there yesterday for mother's day and it was absolutely beautiful, the food, the waiters/waitresses. The thing i loved the most was how this year they had a little play area for the kids!!! My family and I had a really good time there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Mm8tRWJ3EAE",
            "text": "Food is great with a creative menu. Service is excellent and the views are amazing! Would recommend for any event too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MnRlSm5RRRAB",
            "text": "Food was delicious and service was great! Will be coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aW9uUDN3RRAB",
            "text": "Mothers Day brunch. Terrible food terrible service slow as heck cheesecake looked like runny snot.  If this is the quality of food and service on a holiday I’d hate to see what they do on a regular day.  Steer clear and save your money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSXzkzT0J3EAE",
            "text": "I was sitting for one hour and left because no one came to serve me. We did not get even a cup of water on our table. We ask for a server and never got one"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSODk2MG9nRRAB",
            "text": "Place overall is beautiful and customer service is excellent but food is disgusting. Bad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSN3JHcDZRRRAB",
            "text": "The restaurant is inside a golf store and adjacent to a banquet hall. No atmosphere; there were only a few people dining and it felt bare. The menu was basic (sandwiches, burgers, pizza - which wasn't available) and overpriced. No gluten free options. The rib eye was low quality and the burger was just OK. I wouldn't suggest this place unless it's nice out and you want to sit outside...maybe (the patio wasn't open yet). The best thing was the waitress, who was super sweet and friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNElXTjl3RRAB",
            "text": "I've been to many golf courses in my life. The best are always the Trump golf courses"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodUo3ZXZnRRAB",
            "text": "Beautiful location between two bridges with water view from the banquet hall Attended a private event."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOGNlQ1JREAE",
            "text": "Ordered grilled chicken salad.  Chicken was very dry."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1d2JmakFREAE",
            "text": "Food is always great, hats off to the chef ! Food quality is always on point, portions are also great. Atmosphere is awesome , I recommend this place to anyone that wants to have a great brunch / lunch or dinner."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eDVldEdBEAE",
            "text": "Great brunch spot with stunning views. Creative drink menu, ample portions, and overall good food selections. Spacious and comfortable outdoor dining just off the golf course."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdDRHTjhBRRAB",
            "text": "Lousy leader but he sure knows how to build a golf course.  Trump Ferry Point, worth the drive!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOGVhWlZ3EAE",
            "text": "Great brunch spot with unique views."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNXFUWEN3EAE",
            "text": "Immediately upon arriving one can tell this is a high end place. The parking, the building, the dining area. High ceiling, water view, and of course the price of the food! Really nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX3Q3OGVBEAE",
            "text": "Food and service were excellent, will come again 1000%. Also had live music which was complimentary to the atmosphere and my delicious burger, if I could rate more than 5 I would !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyN3ZDZ3l3RRAB",
            "text": "Great food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyanBISkhREAE",
            "text": "Friendly staff, beautiful scenery and atmosphere, Great American Food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNVBIUlZREAE",
            "text": "Good food and drink but server was very inexperienced not not knowledgeable about the drinks or food. Also not attentive to the table. Had to get up to ask for water and ask the bartender a question that should have been asked by her not the guest."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhaXJxbXJnRRAB",
            "text": "Restaurant is part of Trump golf course under Whitestone Bridge. Very beautiful place.  Five stars for the view, four stars for food and service, three stars for drinks and price.  Will be back just for the view."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnZzdMQXdRRRAB",
            "text": "The Waterfront has good food with nice views overlooking the East River.\n\nThis restaurant is nestled between the Whitestone and Throgs Neck Bridges next to the Trump Golf Links golf course.\n\nI ordered the steak sandwich which was delicious and a nice red wine. Both the drink and food lists are not very extensive, the specialty is sandwiches and there are several seasonal food options. There are both gluten free and veg-! options, which are noted on the menu.\n\nThe waiter was very friendly and the service was very quick.\n\nThe dress code is casual and the crowd is mixed. It seems to be more of a place where the golfers eat and everyone else is either in groups of friends or families.\n\nBoth indoor and outdoor seating is available."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheXJHVnd3RRAB",
            "text": "Was brought to this restaurant for an anniversary brunch. The food was really great. Very nice presentation and very flavorful. The cocktails were also great. I would definitely come back for more."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd2JEMHNBRRAB",
            "text": "It may be a little pricey but well worth it.  The food was so good as were the drinks. We sat out on the outside deck on a hot day and it was beautiful and breezy.  Nice views to take pics too since its set aside the Whitestone bridge and along a beautiful golf course. The staff were all really nice and we had great service. There was even entertainment. The band of 2 who also included a 3rd person for a few songs was really good and even surprised us by coming over to our table to wish my sister a happy birthday with song. We all said we would return and would recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpcU9Pdi1RRRAB",
            "text": "It was calm and comfortable place to go out with friends. I really liked the atmosphere however I got there by lunch and there was not many choices to eat. Also it’s a great place for cute pictures."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNWQ3MmFREAE",
            "text": "We had a nice brunch and live music food was amazing, beautiful weather for Nov we sat outside. Indoor is available as well. The mimosas are a hit!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwb2V6OE93EAE",
            "text": "Absolutely stunning, This place is beautiful, John our server was so attentive and helpful he made our dinner experience perfect. I will definitely come back to this place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4OHBlQ0JREAE",
            "text": "I’ve been going to the Waterfront NYC for over a year now and my experience just gets better and better. Meghan (the manager) is so inviting and goes out of her way to talk to every customer seated at the restaurant. The waiters and staff…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMEplS0RnEAE",
            "text": "After an amazing experience on the golf course here I was disappointed at the service for a afternoon brunch.  It took us almost 30 minutes to get our drink and another 15 minutes to get the food, with most of the restaurant being empty.\n\nThe food was really good though and the prices were reasonable compared to what I would've expected.\n\nJust really would've like competent service at such a nice venue."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeWNTRWlnRRAB",
            "text": "Place has breathtaking views (reason why I wanted to pay it a visit). Was told that the only option available was buffet (On a Sunday) and then I saw people next to my table order à la carte. I asked the waiter about it and he mentioned…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaS1mbEZnEAE",
            "text": "The best view ever. Excellent service. Delicious food. 👌…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4cy1XM3lRRRAB",
            "text": "Been here multiple times, the food is fantastic.  Wether you’re looking for a quick bite after golf or for a fancy saturday night meal, its all amazing. Valentines day special was unreal! Drinks were spot on too. Such a cool area to eat and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxNmJXeDFRRRAB",
            "text": "I went to The WaterFront NYC with my husband and two boys on July 5th and saying it was awesome is an understatement. The view was gorgeous and very relaxing. But the food was fresh, full of flavor and the portions were great!! More than enough.  My husband had the burger and fries, I had the salmon, and the boys had pizza, chicken fingers and French fries. The adult beverages were on point as well. But I had to save the best for last, Sophia the hostess was polite and very helpful. She greeted us, made sure we were comfortable, satisfied and had everything we needed.  When we went to the bathroom to wash hands, there was a pleasant young lady there tending to the bathrooms by the name of Anna. Anna made sure the stalls were cleaned, we had towels to dry our hands and she greeted me and the boys as soon as we stepped into the bathroom to make us feel welcomed. Thank you so much for the experience. Me and hubby will be back for a date night, just the two of us."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRN3VLRU13EAE",
            "text": "Never will find another spot in the Bronx with the ambiance this place has. Beautiful views of the water & most welcoming staff.\nTheir drinks are so good too! - I had the \"Summertime Fine\" off their cocktail…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMW9HT3Z3RRAB",
            "text": "Despite that fact that our table of two was the ONLY table occupied in the dining room (from our arrival at 6 PM to departure at 9 PM on a Friday night), the service was horrible.  Our entrees were brought out to the table before we had eaten half our salads (5 minutes).    The salmon was over cooked and dry.  They forgot our second drink ordered.  It took them over 25 minutes after we finished our meal to remove the dirty dishes.  There were no apologies.  Imagine only one table occupied in a NY dining room on a Friday night?  What does that tell you about a restaurant?  Don't waste your time (or $), trying to get to this horrible restaurant.  One star for the view, although it was not worth it.  We won't be back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdkxYeUd3EAE",
            "text": "What a great place. The staff is always attentive and eager to whatever you need. Definitely a great culinary experience. All the food was exeptional. There was not one thing that was served that wasn't amazing."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4OHVmclpBEAE",
            "text": "What a great restaurant!! Amazing views and spectacular service. The staff was wonderful and very attentive. Food was delicious and cocktails were on point!! Definitely will be returning soon! Thanks Waterfront NYC for a great dinner!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbWQyN2ZREAE",
            "text": "Came here for Mother's Day brunch and it was a truly spectacular experience!  The food and staff were both excellent, and they even brought out flowers to the table for my Mother.  Even in the rainy weather, the views and ambiance of Trump Ferry Point and The Waterfront NYC restaurant are amazing, making it a true gem of New York City!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4Zzd1WHhnRRAB",
            "text": "This place is magnificent, very clean and neat. Have a beautiful view of two bridges. The truggsneck bridge and the berrasano bridge.\nAlso there's a big gulf club The Trump Link  and plenty of green areas and parking spaces. The food and services are excellent."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN3REeS1nRRAB",
            "text": "While the view is VERY nice the prices aren't. I stopped in over the weekend for brunch and sticker shock is a real thing. Maybe its meant to be that way, breakfast at the Loews Regency is 70$, In my most humble opinion 30$ \"PRE FIXE\" is a bit steep for a Wedge Salad or Breaded Chicken Sandwich or any of the relatively basic items on the Menu, of which there were only about 12. The price includes one item and one drink. I stopped in on a Saturday. I don't mind high prices, the service was fine I just dont think its worth it.  Apparently others shared my view considering it was empty. The event space on the other hand was beautiful and I'm sure well worth the cost. I guess my search continues......."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOV9TLTFRRRAB",
            "text": "Beautiful view of Throggs Neck and Whitestone bridges"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOWFPZXJBRRAB",
            "text": "OMG that burger was out of this world. Don't forget to order the fries. Listen, i know fries and they do not mess around when it comes to fries. The service - wow. If i could compare the service to anything it would the 4 seasons in Thailand. Don't walk, run to get a seat here at the Waterfront. SO SO YUMMY!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MTV1QnVnRRAB",
            "text": "Friendly and welcoming hosts. Our server Eileen was absolutely amazing. The food was delicious definitely worth the price. Friendly for kids as well. Will definitely return."
        }
    ],
    "reviews_count": 73
}