{
    "name": "Sea Shore Restaurant",
    "place_id": "ChIJEYbUenyMwokRwlydycwoZJw",
    "grid": "BX9",
    "address": "591 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.3,
    "user_ratings_total": 3702,
    "phone_number": "(718) 885-0300",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZmJWSnljSGRsZG5sRGNGZzJZWE5vYlUxWVpFRRAB",
            "text": "I have been celebrating my birthday since 11/1/25.  The Sea Shore was my first restaurant experience on City Island over 30 years ago.  It was amazing then and exceptional now.  Debbie greeted me at the door with a sunshine smile, effervescent personality and the evening took flight.  Gold Crown, floral necklace, starter hot bread and Italian relish spread.  Wonderful and charming waiter Keith.  Great Teriyaki Salmon, Broiled Winter lobster / Shrimp special ( $39.00) New England Clam Chowder loaded with clams, Fresh Salad, corn on the cob and linguine with Marinara.  ( So plentiful, lunch for tomorrow). Close of evening ice cream devils food cake swirl with fresh whipped cream, candle light and song! What a way to end the day!  Go! Go! Go!"
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdmRITkljR0ppTm01M05sbGxkRVpDZDFkT09XYxAB",
            "text": "Great food and atmosphere, get a table at sunset overlooking the water."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eGJEWnRTeTAyTUZGSWJGcFJZMUpZVDJkM2VWRRAB",
            "text": "Excellent food and service. Great experience. Will definitely be back again!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTlRVRnlkRWRMYm01V1NubDVVWGd0U1dSaWFGRRAB",
            "text": "The service was nice but I had the surf and turf and it was very mediocre and no flavor at all I would recommend the pasta instead especially being very overpriced"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkc05GcHdXV1ozZVZoWGEycDNiSEpQVDBjdFJrRRAB",
            "text": "Oct. 18,2025, visited Seashore Restaurant at City Island, a gem in the Bronx to celebrate my son’s birthday. As a foodie and someone who travels a lot and has my business, it truly did not disappoint me. I have been to  mostly all the restaurants at City Island, for over 50 years and been to this restaurant many times, but it has been a while I ate at this restaurant. To me this restaurant is on top of my seafood restaurant list for 2025. The waitress Alma, was exceptional. Alma, was very professional, kind and very attentive, and outstanding to many I have encountered. I truly will recommend Alma as your waitress, and trust me you will definitely be not disappointed. The food and drinks were as followed: 1: Drinks Pina Mojito, Corona Extra, DosEquis 2: Food Parlla for 2 , Fried Calamari & dessert Tartufo. I will also say the drinks were excellent too. I encourage many to go to this restaurant and ask for Alma, you will not be disappointed! I will definitely return back and will ask for Alma because I know she will be very attentive and appreciative. The ambiance was very nice too. In conclusion the Paella and the fried calamari were mediocre but passable. Though a little expensive for the food we had but nothing can take away from celebrating my son’s birthday and the bonding we had together."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WWVrNTJkV3B1TlVzMFNtNTFSRWQyUVd0aWJFRRAB",
            "text": "The food had no taste"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdC1TVDd3RRAB",
            "text": "My first time visiting and I must say I was impressed. The view of the water is amazing when you see it on the outdoor rooftop.\nThis place is huge and their seafoods are so fresh!! The customer service was quick and friendly. They start you off with garlic bread, baked bread and cornbread, and with a platter of different toppings to put on the bread or to eat freely. For appetizers, I had the grilled salmon with vegetables on the side and my man had the fried red snapper with vegetables. Both fish tasted amazing and FRESH! And as for the drinks, I had a sex in the city martini and my man had the piña colada. Both were delicious and very strong. I definitely recommend this place and would definitely come back!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S1FYTk5Ra3BPT1VodWFFWkpUbUpGZUVaQ05uYxAB",
            "text": "Wonderful dining experience at the Sea Shore Restsurant."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocE9FZFpiRkpvWWxaVVpWTkZiV2MwVlc0MmJuYxAB",
            "text": "Whenever I have something to celebrate or restaurant week, I come here and enjoy seafood. The price of the food is reasonable and tasty. This restaurant is spacious.\nIt was the second time to see Khan. He is very kind and his service is amazing. He celebrated my family event and made my day special. Because of him, I will definitely come back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMGJuQTNNREpuYjJZelJESmxRVFJ4T1ZsbFYzYxAB",
            "text": "Nice place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc00wOWZiRVZGTjBkeVkyVTJVVlYyZDFScVJIYxAB",
            "text": "The food was fresh, perfectly cooked, and full of flavor — especially the seafood, which tasted like it came straight from the ocean. The atmosphere was cozy and relaxing, perfect for a nice evening out.\n\nA special shoutout to our waiter, Keith, who made the whole experience even better. He was attentive, friendly, and genuinely cared that we were enjoying our meal. He checked in just the right amount, gave great menu recommendations, and made us feel completely at home.\n\nIf you’re looking for delicious food and top-notch service, I highly recommend Sea Shore Restaurant — and definitely ask for Keith!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSlpqQnJObEl4YkVoaFh6SjRhRUZMTFdKSmVtYxAB",
            "text": "My friend Michelle and I had the best time at the Sea Shore Restaurant yesterday !  It is so rare to find exceptional service these days , but with a waitor  like Manny , we hit the jackpot !!  He has worked there for the past 35 years and the best compliment I can give him is that we did not want to leave, lol ( and we both had a long drive home).   Everyone there is so friendly and the food was absolutely delicious from the bread with antipasti to the tiramiso gelato.   Thank you Sea Shore ! We will certainly be back !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc1IwZzFjVTlvT0ZoMFozVXlXVU5DYjA4dFkyYxAB",
            "text": "Sea Shore Restaurant, City Island: Where Bibs Become Battle Armor and Shellfish Dreams Come True 🦞🦐🦀\n\nForget the Michelin stars, velvet booths, and molecular foam nonsense. My all-time favorite restaurant in NYC is a Bronx legend that smells like the ocean and tastes like home: Sea Shore Restaurant in City Island. I’ve been coming here since I was 16, dragged in by my parents and now I drag them in. It’s tradition, it’s sacred, it’s shellfish warfare.\n\nThis place isn’t trying to impress you with chandeliers or foie gras. It’s got something better: the salty breeze of the Long Island Sound, the clatter of crab legs, and the kind of ambiance that says, “You’re about to eat like Poseidon on cheat day.”\n\nOur order? The Broiled Shellfish Feast for Two. We get two of them for three people. That’s right. My mom, dad, and I have been tag-teaming this monster meal for 20 years. It arrives like a seafood volcano: lobster, shrimp, clams, mussels, and scallops piled high like they’re trying to escape the plate. You don’t eat this meal, you survive it. Bibs on, hands in, dignity off.\n\nThe seafood? Always fresh. Always perfect. I’ve tried the fancy spots in Manhattan, the trendy joints in Brooklyn, even the hidden gems in Queens. But nothing beats Sea Shore. It’s the kind of place that makes you nostalgic while you’re still chewing.\n\nCelebrations, milestones, random Tuesdays it’s all better here. If you’re craving seafood and want to feel like a crustacean conqueror, Sea Shore is your spot. Just don’t wear white. And bring backup."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRlEwbzJNR2hOVkUwd1lraFlNMll6ZFhGZmJtYxAB",
            "text": "Good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMlZFZE5SRFo1UzBSNmVWSm1TRVZQVDFKYVJrRRAB",
            "text": "The customer service is A+'The portion size is abundant and the food is of highest quantity, I was very impressed and will return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeFprOUxiM1paUW1KVFZURnJTekF3VEZSVVZrRRAB",
            "text": "It's a good restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR2QwaHFXSFZFUXpKd2VpMU9UV05RZUZwWU1FRRAB",
            "text": "We visited The Seashore on City Island Ave, NYC, and it was one of the worst dining experiences we’ve had. Our server forgot our order three times. When the food finally came, the portions were good, but the quality did not match the cost.\n\nThe yellow rice looked and tasted like supermarket microwave food. We asked the manager to try it, and although he made a face after tasting it, he still refused to admit it was bad. He never introduced himself or apologized for the poor food or the server’s attitude.\n\nWe paid $275.75, and the only discount we received was for the spring water bottle. No effort was made to make things right. Overpriced, poor service, and disappointing food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVNISXhSakJPUmxWbFVYQk5NRXc1VEhBelRtYxAB",
            "text": "We had a mixed experience at this restaurant. Our waiter, Felix, was absolutely excellent — attentive, friendly, and made sure we were well taken care of throughout the meal. He really made the experience memorable in the best way. He even surprise us with a desert since we were celebrating our anniversary.\n\nHowever, I was disappointed to witness manager Debbie speaking rudely to staff during our visit. It created an uncomfortable atmosphere that detracted from the otherwise pleasant service. Great food and service from Felix, but the management’s treatment of employees needs improvement."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdVNWcHJUVk5xU2tOSE9UUm5ka3A1Y21WVVRsRRAB",
            "text": "The food was tasteless. I had linguine & mussels. My husband had seafood tower with yellow rice. My daughter had the fried sea food platter & the shrimp & calamari looked like frozen food heated. The bread & salad was delicious but nothing else. I would not recommend this restaurant to anyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa1J6bEpkbVI2V0VSNlJHY3hNSEk0T1ZWVVlWRRAB",
            "text": "Excellent place for special occasions. It will be pricey, though. The raw bar was very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TFEyZGFjbTQwVVZWUWVsRjZZWFpvYW05aVduYxAB",
            "text": "I’ve been coming here for years, and it’s always my top recommendation when someone asks where to find the best, freshest seafood. The staff are consistently friendly, and the food is absolutely delicious. A true staple I’ll keep coming back to!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeGRGbHNVVXh3VkRKNlgwVXhRM2RqYW5wVVVVRRAB",
            "text": "Great to be back after many years. A great place with great views."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMGVVazVhV3h2U1hadVprWkZNalpTTlVweFIzYxAB",
            "text": "One of the best seafood restaurants in New York. Athmosphere is amazing, everyone is nice, they have their own parking and are located on the water with some nice views.\n\nPrices are maybe 50% higher then similar Long Island restaurants but portions are probably 50% larger AND better too. So it's definitely worth it. In addition they bring generous apetisers, bread, salad for free.\nBranzino was huge and very tasty and lobster roll actually has a lot of fresh lobster in it. (compared to any other NY or Long Island restaurant with just a hint of lobster in their cheaply done expensive roll)\n\nI have to mention our amazing waiter Felix and their great and friendly manager John.\n\nWe will definiely be back and I will recommend this restaurant to all my friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUVZDMVNWamx5TkRJeVdYcHlUbkkxZG1wclJGRRAB",
            "text": "Great experience 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeWMyWnZlR1p6TjBSUVgxRjFSbWhwTUd0TlZHYxAB",
            "text": "Food is delicious!!! Waiter was wonderful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVmFESTBlRWRKUlZCcGFYSlJVVloxTUZjM2VXYxAB",
            "text": "The food is great and the view of the bay is fabulous."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cmVEaFNPVVpqUTB4MExWZEZTVk5sVlhSNWNIYxAB",
            "text": "had flavorless and horrible shrimp scampi from here, and when I tried to send it back, was met with derisive laughter and the opposite of hospitality. Would never return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SlJrRkxXalJLWHpCaVQwRmxSVWxSUWtNd2VVRRAB",
            "text": "I brought my family here to celebrate my mother’s birthday, and unfortunately it was one of the worst dining experiences we’ve ever had. Our server, Tellez, was not welcoming from the start and came across as very rude. Any time we asked him a question, he responded with an attitude and seemed bothered that we were even asking. When we ordered just one water bottle for the table, he made a sarcastic comment questioning why we’d only want one, which felt unnecessary and unprofessional. We also asked him privately for the dessert menu so we could surprise my mom and sing happy birthday, but instead of keeping it discreet, he brought the menu over in front of everyone and asked out loud what we wanted to order for the “birthday girl,” completely ruining the surprise. To top it all off, when the check came, it had an automatic 18% gratuity added—almost $100—without us being told beforehand, and he simply said it was “mandatory for parties over 4.” What should have been a special, happy evening for my mom turned into a very disappointing experience because of how poorly we were treated."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb1dqUkNXbVJxUmxKak4yMHlOMEZ1U1UxeVYxRRAB",
            "text": "I come here to celebrate family occasions.  It's really beautiful in the summer right on the water.  Always a good time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1IzbE1hVXA1VXpoZmVHSkdOMlY2Uld0eFYwRRAB",
            "text": "The best restaurant in City Island! You don't need to go farther. As soon as you cross the bridge turn right. They have free valet (please tip the helpful guys though). Hostess and owners are attentive. Best ambiance both indoor and outdoor, delicious and fresh seafood, generous portion. Lovely views of the water, marina and a little bit of Manhattan skyline. Until next time!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR2IzVmlVVGN5YzB4bE1XNWlkR3N6WjFSRGRuYxAB",
            "text": "Staff was friendly, service was great. Views of the marina from our table was nice and the filet mignon and coconut shrimp portions were large and delicious. Would definitely come here again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMmNUZE1iVXByVWtOQmJsWlVOa3BGU1hCTGMyYxAB",
            "text": "Outstanding customer service. Excellent variety of seafood dishes. Perfect outside dining for sipping frosted Pina Colada while eating baby clams with loads of cocktail sauce and lemons. Definitely the place to go for peace, serenity and good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xeE9GQTNUMHBGYVhRMFdIRlJUa3h6WWxOU1VHYxAB",
            "text": "We had take out for dinner, we purchased the salmon for my mom, and we got so much food, five persons ate from the dish, we got 2 types of breads with a heap load of butter, our sides were green salad and the pasta, and the salmon with vegetables....we were not disappointed,  the taste the quality was great...."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnc1BxZW1RRRAB",
            "text": "This is my second time at this restaurant. The food, atmosphere, and the waiter was nice. The owner was very friendly. No complaints about the food. The starter appetizer hit the stop."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMk4yd3haRWhoVjNkYVZtbHJUVTV0VmtKM1VXYxAB",
            "text": "Asked a friend from the neighborhood where they like to eat. They sent me here,  holy cow I am glad they did! Beautiful views   food was fantastic & that charcuterie board they bring out prior is amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1ZqWkNlVTVEZVc4MU5HMXFVM2hpWTFVMWNtYxAB",
            "text": "Friendly servers, good food and good cocktails!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMd3NDN0JBEAE",
            "text": "The service here was Fantastic, both the bussers, servers and greeters were great. Also have amazing and strong frozen margaritas. However their food was just okay… and their French fries tasted rather freezer-burned. They also charge $16…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc1RIUkROVlZEUTNWWU1EWkhUemRUUWtzd1JVRRAB",
            "text": "Food and atmosphere were excellent.  Had a great meal, and my waiter was great. My problem came from the man at the front desk. I don’t know if he was the owner, but he was really RUDE.   I asked him for a wet nap for my elderly father and he said “yeah we have a bathroom too…”. Annoyed that I asked him.   Really awful after spending a lot there and taking care of him and his people with a good tip, only to be disrespected for no reason.  We will not be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNFJ5MWhOSFptUWxGSVgwODJRVmxOYlRONWVHYxAB",
            "text": "THANK YOU DAVID!!!! I had such a wonderful experience at Seashore Restaurant in City Island, and I have to give a special shoutout to our waiter, David. From start to finish, David was attentive, kind, and incredibly well-spoken. His professionalism, knowledge of the menu, and genuine warmth made the entire dining experience one of the best I’ve had in a very long time. He is truly one of those rare waiters who elevate your visit and make you feel well taken care of.\n\nOn top of the excellent service, the food was absolutely amazing—fresh, flavorful, and beautifully prepared. My mom and I visit for every special occasion. We usually get the broiled king crab legs and shrimp, excellent everytime! Seashore has always been one of my favorite restaurants, and this visit reminded me why. I highly recommend asking for David when you come—you won’t be disappointed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeExXZGlSVFpIVWtNNU5VcFdNbmM0VTB4U1dXYxAB",
            "text": "A true classic of seafood restaurants. One of the best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sV1ZYcFBkbUY2UlVwUlozTXpNSE13VjNkRmVsRRAB",
            "text": "My sisters, brothers and I hosted our mother’s 75th birthday celebration here on August 9th and the attention to details and service offer including valet  service was top notch….first class. Thanks so much to our event coordinator (Debbie) and her amazing service team member for making this event memorable & successful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNVh6bExlVmd5V1VaSlJYcDFhV3BrU2xjeWJXYxAB",
            "text": "Sea Shore is an excellent spot on City Island if you are in search of a deliciously filling meal! Everyone in my party ordered the fried shrimp, and we all agreed that it was the best shrimp that we have had on City Island. The food came out fresh, and the shrimp were high-quality. While we were at the restaurant, there was an event occurring during our visit, so the waitstaff did forgot to bring out certain items a few times and would need a reminder. The food and atmosphere made up for the service 10x over. I strongly recommend Sea Shore."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdmNYbFNRVGh4Y0ZoVFpUQkhkak5CYTNGc2NuYxAB",
            "text": "Food is delicious.I love the area😍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRWRVRllaSFJsWjJZNWNIUjFjMHg1VlVaTVZHYxAB",
            "text": "I went to this restaurant with 6 of my friends, the parking lot was empty and the guy insisted to have a valet parking, I tried to explain that I have a Tesla and the car connected to my phone, he still insist, we end up leaving without any food and went to another better treatment restaurant, sad"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd2VXMXNOMjVJWldwQmEyMVZZbmx6TFRObU1sRRAB",
            "text": "Good service, good drinks and food. All around a cool place to eat with friends and family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd1pXSTBhV1E0VkY5Rk5rZDBaWEpmVEVwb1VIYxAB",
            "text": "⸻\n\n🎉✨ 20+ Years of Delicious Memories! ✨🎉\nCity Island Seashore Restaurant has been my go-to for over two decades, and they outdid themselves for my mother’s 75th birthday on August 9, 2025! 🥳💛 From the mouthwatering food to the warm, top-notch service, everything was absolutely magnificent. Thank you for making this milestone celebration unforgettable! 💐🍽️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcVpHSkNiMjVtVm5kSWJrVkJlV2h2WDFJMmRuYxAB",
            "text": "I was very satisfied with my visit. It’s rare to meet such a friendly server in New York, and both the food and the server’s kindness made it a memorable experience. My thanks to the lovely lady who served us by the window facing the parking lot. As for the food, the grilled fish was excellent, while the oysters were just okay. The portion of the risotto was enormous—it definitely felt worth the price. I would be happy to visit again."
        },
        {
            "date": "5달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMamduSWIxa3F2Sy13RRAB",
            "text": "한국에서 절친이 미국에 여행와서 가족들하고 식사하러간 식당"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdjluZ3dBRRAB",
            "text": "외곽에 있는 곳이고 버스로도 이동가능. 식전빵과 음식이 맛있었어요. 서비스도 나름 괜찮지만 랍스터는 직접 해체해서 먹어야해서 그게 싫으신 분들은 랍스터가 들어간 요리를 드시는 것을 추천드려요."
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2LWZ1OHBBRRAB",
            "text": "10월3일 점심때 이번엔 먹을수가 없었다 ,모시고간 손님때문에 조용히 나왔지만 과거 3-4번은 매우 좋았던 기억으로 다시 갔는데 dead lobster 의 맛이다 질기고. 빵은 맛있었다. 스노우크랩도 좋았지만 킹크랩은 별로였고..."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3cHRYeGhnRRAB",
            "text": "와아아아아아아아안전 최고! 해산물 싱싱하고 양도 엄청나요."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVOFBLSFBREAE",
            "text": "멋진 곳 베이사이드"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdDREcDJnRRAB",
            "text": "한적한곳의 여유를 느끼면서 신선한 본연의 랍스터를 먹을수 있는곳 가성비 대비 굿"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObUVxWUxkd2N6Y09BEAE",
            "text": "We had a great time at this seafood spot! Everything looked fresh and came out piping hot. I ordered the fried fish platter, which was crispy and flavorful without being greasy. The coleslaw and tartar sauce were a perfect pairing. The lobster tail was juicy and buttery-simple but done right. And the crab cake? Loaded with lump crab and barely any filler- a standout. The restaurant had a laid-back, clean vibe with a nice view if you're sitting by the window. Service was friendly and fast, and the portions were generous. Highly recommend it if you're craving classic, well-cooked seafood done right!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaE4yRy1RRRAB",
            "text": "This is a staple restaurant in city island! And the food is pretty decent but overall service was mediocre. The ambience is pretty nice especially if you come in the warmer months, they offer outdoor seating. We came here hoping for have lunch but they only serve dinner Friday- Sunday from 11:30 AM. Which to me is very strange. But we didn’t know and at that point, it is what it is. But if you looking for a nice dinner; def worth checking out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNmFITGR3EAE",
            "text": "Nice seafood spot on city island.  Great extensive selection, parking lot & valet parking available.  Been coming here for over 5 years.  Good & service has always been good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQbnl6SkdvdTgzMDh3RRAB",
            "text": "Had dinner here last night with my wife and we had stale mussels, the waiter was very nice and gave us dim sum."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBazZMNjZBRRAB",
            "text": "I traveled two hours to visit this restaurant, eager to experience what it had to offer. While the interior was beautifully decorated and perfectly set for Valentine’s Day, the service fell short of expectations. The food was decent but didn’t quite make up for the lackluster service. Overall, a nice ambiance, but the experience could have been better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNnYtTGd3RRAB",
            "text": "I spent the weekend in New York, and this was the highlight of my trip.. this place is absolutely amazing.. The portions were huge, and the food was delicious. I wish I could give more stars.  When you go ask for Mrs. Debbie, she is my favorite. She even gave me a tour of the place afterwords...."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdmJtMHBBRRAB",
            "text": "The food was amazing and staff phenomenal! This was my 3rd time there, but it was the first time for my wife and 2 friends. My Wife said this is now her #1 favorite and one of my girlfriend's want to go back for her birthday in October. Our server Khan and his assistant was exceptional! We were greeted by the manager John (I believe that was his name) which added that special touch. The AC was down in our section, but once they opened the windows it cooled down. Overall Satisfaction!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVFVtSlNhekJrUnpGNlZtTTJVSEV6ZUVGeE4wRRAB",
            "text": "Sea Shore Restaurant has a large variety of options on their menu. From raw to fried seafood and steak for those who don’t like sea food. The cocktail menu is extensive as well. I had the hazeltini - very sweet dessert martini.\nI had ordered the raw oysters, hot sea food app for two, and the fried calamari. You get your bang for your buck. Don’t be thrown off by the prices because you will leave very satisfied.\n!! They bring out complimentary bread (corn bread, garlic bread, and an entire roll) as well as some pickled snacks (roasted peppers, mushrooms, carrots, olives, eggplant, and some more.) !!\nI thought this touch was lovely to the experience.\nWe went on a Saturday at around 1pm. At this point there was no wait or rush so we were taken to our table immediately. Outdoor dining is splendid as you get to sit by the water."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NEwtelJnEAE",
            "text": "First let me start off by saying I called the restaurant SEVERAL times to make sure they had outdoor dining. The young lady was so nice and patient every time I called. When we arrived, they were so pleasant and greeted us with a smile. They took our temperature and info which was expected. Once we were seated they gave us complimentary bread, butter, olives, cheese, mushrooms and red pepper in a platter. So cute!\n\nThe portions that were given was amazing! Our waiter was super funny, attentive, and made sure we were comfortable. I could not ask for a better place to take my BFF out for dinner to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMdUstOUxPdlBDS2F3EAE",
            "text": "I came to this restaurant in May 2024 to celebrate a milestone in my career. My family announced this to the staff and they handed me a lei which when they do this, from what my family explained, the restaurant would sing and celebrate your special moment with you. Now this milestone was a pretty big deal for me and I worked really hard for it, but the waitress from her question indicated that the staff was busy (despite the restaurant being half empty at the time) and asked if it we could skip this? It was clear to me they could care less and couldn't be bothered. I was hurt by this and it left a bitter taste in my mouth.\n\nThe food itself was disappointing, the appetizers look like they came from a cheap pickled jar that were probably produced by some cheap factory in New Jersey.  The bread was decent but nothing to rave about and the food itself was not very flavorful or even that enjoyable. I ordered the plate of mussels, and to be honest, I make a better dish of cooked mussels at home. When anyone goes out it's to have a positive experience. It starts with the service, the food, and the overall experience of being in that restaurant. The food is highly overpriced for the quality, the service was abysmal, and considerably overpriced for a restaurant that did not deliver. I will never return.\n\nMaya Angelo said it best, \" I've learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.\""
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dDhTR0dBEAE",
            "text": "Parking easy\nService was friendly\n\nFood was great\nMain course takes time to prepare. But they time out the salads appetizers and bread accordingly\n\nGreat experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweDRXS25BRRAB",
            "text": "My recent dining experience at The Sea Shore Restaurant on City Island, Bronx, NY, left me thoroughly impressed!\n\nThe food was nothing short of fantastic, boasting flavors that delighted the palate.\n\nThe generous portions were a pleasant surprise, and we ended up taking some home to savor later.\n\nThe service was top-notch, with attentive staff ensuring our needs were met throughout the meal.\n\nWhat truly sets this restaurant apart is the captivating ocean view that accompanies your dining experience.\n\nIt's a serene backdrop that enhances the ambiance and makes for an unforgettable meal.\n\nIf you're looking for a spot that combines delectable cuisine, exceptional service, and stunning views, The Sea Shore Restaurant should be at the top of your list.\n\nA definite must-visit for locals and visitors alike!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMExpNm5RRRAB",
            "text": "City Island is a place you never heard of but will be happy when you do and stop by for a nice meal. Bordering Pelham Bay Park, it makes for a nice outing. The waterfront location is delightful and the food and service was good. An extra star for getting bread and a small plate of cheeses and olives and other treats and having our drink order taken very quickly!  Service was attentive, but either short staffed (so common these days) or busy with other areas of this very large and spacious restaurant. A bit on the pricey side without many lunch options (from a pricing perspective). Do I recommend…yes. Would I go again, maybe."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1b3J1Wm9RRRAB",
            "text": "I can say we are a regular costumer at the Sea Shore restaurant. My husband always take me here on my birthday,or any family occasion during the year…sometimes we just come here to have a lunch dinner together!\nMy favorite the New England clam chowder and the broiled lobster they made the best !\nI tried steamed, scallops fish everything well made.\nMy Mom and my daughter love the chicken parmigiana, my hubby a fried calamari lover each meal is huge, enough for 2 days we always have “to go box”.\nBe careful when they bring the hot bread cornbread with olives ,cheese mushrooms you can get full with that! More then delicious!! Staff very kind and funny make our stay always comfortable!\nThey check up on you if you need anything, and your cup never empty with the fresh ice of water.\nCocktails great too. This is a real seafood restaurant beautiful inside and outside, the dock sitting have a gorgeous view. Love the palm trees!Valet parking is a big extra!\nI recommended to everybody who loves seafood, or just wanna enjoy quality food with great service and atmosphere around! You never gonna leave hungry from this place..promise!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMVDkwTDI5MWRUaUxnEAE",
            "text": "We sat outside and had a great view of the bridges and NYC skyline. The meal started strong with a nice spread of bread (Italian, cornbread, garlic) served with pickled vegetables, mushrooms, and cheese—really enjoyed that. The oysters Rockefeller were excellent, though in hindsight we could’ve skipped appetizers given the generous portion sizes.\n\nFor mains, we had the whole snapper and shrimp scampi. The snapper was excellent—crispy light breading and great flavor. The shrimp, unfortunately, had an overly briny taste and wasn’t a favorite. It's also worth noting they charge for sharing any dishes\n\nFor two people, with one basic bottle of wine, oysters Rockefeller, the snapper, and the shrimp scampi, the bill came to around $210. A bit pricey, but overall a solid dinner with standout views. ."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseFl1RnRRRRAB",
            "text": "I recently went for my cousins birthday, and they have made such a change from the last time I was there a few months ago the food was better. The service is better. I highly recommend this place we loved it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbmVLN2pBRRAB",
            "text": "Sunday night crowd was light.\nFood was ok.\nSear on scallops could have been better, but they were not over cooked.\nShrimp Risotto had some consistency issues with risotto, but it  was flavorful.\nLobster roll the bread could have been buttered more, but the lobster was ok.\nCalamari could have been crisper, but they had okay flavor and weren't over cooked.\nOverall ok, just not as good as these dishes could have been."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyczZicnR3RRAB",
            "text": "As we arrived to the restaurant we were  first greeted by the friendly Valet personnel who directed our party inside the restaurant. The hostess guided us to the patio dining section that overlooked the marina.\nThe dining atmosphere had a relaxed calming feeling during dinner.\nThe food was tasty, the service of the staff was polite, friendly and efficient especially our server. You would not have known it was his first day of work. The waiting time for our food was somewhat long, but the food was prepared from scratch, which is understandable.\nWell done to the entire staff of Sea Shore Restaurant.\nThank You for a memorable graduation dinner for my father."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3elpDT3lRRRAB",
            "text": "Food always tastes delicious. My favorite is the crab cake, best crab cake hands down, my mouth waters everytime I think about it- if you go here you have to try it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdGFXZHNSWFJtTUdOcFIzSkNkRVpNTFU5TmVrRRAB",
            "text": "The staff clearly needs proper hospitality training. I truly hope no one else wastes their time and money here.\n\nWent to Sea Shore Restaurant with two friends. It was our first time there, and we just wanted a few things to share. The waitress was rude and uninterested — when we asked for recommendations, she brushed us off. It felt like she stopped caring once she realized we weren’t ordering much.\n\nThe food was badly presented and tasted terrible — especially the shrimp, which was nearly inedible. To make things worse, the busboy kept hovering and clearing dishes we were still eating, making us feel rushed even though the place was nearly empty.\n\nOne star is too generous. Overpriced, tasteless food and the worst service I’ve experienced. I wouldn’t go back even if the food were free. Avoid this place."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcmVyOTBBRRAB",
            "text": "Massive portions. Great views. Relaxing place. Great service. New England came chowder was great. Calamari was OK but a massive portion. Bread and cornbread were great appetizers as well. Seafood was great and portions were outrageous. A bit pricey but worth the experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4enFHTnlnRRAB",
            "text": "Food is outstanding.  Service was outstanding.  Prices are alittle above normal but you get what you pay for and I will definitely visit this place again.  Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OV8yYXVRRRAB",
            "text": "It's been many years since I have been here. Probably close to 30 years. So it was worth the hour and a half drive from Orange County to refresh the memories of the Sea Shore. Valet parking was pretty quick when we arrived. Being seated (al fresco) was just as quick. Our server showed up promptly, drinks were served. Shortly thereafter,  complimentary fresh corn bread & baked bread and marinated mushrooms  was served to enjoy before your meal. The fresh baked bread is off the charts. There's nothing like Italian bread from the Bronx. A really nice, decent size House salad consisting of lettuce, baby shrimp, mandarin oranges, tomatoes & croutons was next.  Entrees ordered were a whole Red Snapper served and cooked on a cedar plank (at my request) with added tropical fruit.  Additional entree was Sole Filet and shrimp. An order of New England clam chowder was also ordered. A very rich, hearty soup which did not disappoint. Side dishes include: sauted vegetables and your choice of baked potato, french fries, rice, potato pancakes, linguine or onion rings. If you are in the Bronx and feel like seafood, you must patronize Sea Shore on City Island Ave. Just over the CI bridge on the right.  Prices are typical of NYC, so plan on a hefty tab. But so worth it."
        }
    ],
    "reviews_count": 76
}