{
    "name": "Casa Mia",
    "place_id": "ChIJndVrtcTywokRiHzY9EGhQ34",
    "grid": "BX9",
    "address": "132 Bronx River Rd, Yonkers, NY 10704, USA",
    "rating": 4.2,
    "user_ratings_total": 332,
    "phone_number": "(914) 327-4155",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVZYWmxNMFJHYW5kdFdrdFZhMFl0UTI1alZFRRAB",
            "text": "Absolutely loved my dinner here. Great quality good for a great price. The hospitality from the workers made all the difference as well. Even close to closing time, we were never rushed, never pressured, and they took great care of us. Will come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVdHNUhhazkxV2padWVYZElWR2g0TTFoTlluYxAB",
            "text": "Sent me disgusting mushed up uncooked potato instead of gnocchi. This isn't edible and quite frankly is embarrassing that you can push this through to serve someone.\n\nGreat way to give someone food poisoning too. Never ordering from here ever again - there's an abundance of great Italian food elsewhere. Listen to the bad reviews I wish I had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodmFuWlNZVlZaTnkxMWJ5MVJialZ4WlRkdllrRRAB",
            "text": "Eggplant rollatini house slice was probably the best pizza we have had.  Incredibly well done.  Perfect dough… and on a rainy day👌🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0blVIcGhRMjVwY3pRd2VXcGlYMFkyUlhGT04yYxAB",
            "text": "This is a cute little gem! The drinks were delicious 😋\nThe bread was warm & fresh!\nBrownie points for that!! 🤘😁\nThe stuffed mushrooms were ok. Not my favorite. However, the shrimp fra diavolo with pasta was fantastic.\nAnd don't leave without trying the limoncello cake or take it to go. It's that good🤘\nThe service & staff were also great😉"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb2FsTmFUVGhKWm5rMVR6QTNhbGx0UjFsS1FXYxAB",
            "text": "My go to pizza spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSE5XVXdabUZNTWtaTU1VczRTSEZ3YzFaaGFIYxAB",
            "text": "First they add bacon too my Cobb salad, I clearly said no bacon sub grilled chicken. Than on the chicken parm roll the dough was undercooked. Than when I go back for a refund for the chicken parm roll the guy at the register said “oh you want too talk now before you didn’t” than he mocked my speech impediment that I have and I had for almost my whole life. It’s very hard living like this and for him too say that too me was very rude and uncalled for. Visiting this place was probably my biggest regret in my whole life will NOT recommend this place to ANYBODY!!!!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rek5XNDNXbk42VVVKRk5YWjZPWFpCVERrNFRWRRAB",
            "text": "To make it worse, the staff acted like they were doing me a favor by serving this overpriced pile of rabbit scraps. When I asked a simple question about the ingredients, I got a smug lecture about “cleansing” and “vibrations.” No thanks — I came here to eat, not be spiritually guilt-tripped. They laughing at my brother for his speech problem and making fun of him and served us bacon which we clearly said no bacon I don’t eat pork\nAnd there chicken parm roll are raw I repeat RAW DOUGH AND DIDNT EVEN GET MY MONEY BACK.\nDONT go there the staff is horrible the food no seasoning and the manager and boss don’t fix the situation he didn’t tell his staff to stop making fun of my brother speech problem he continued it and I’m going on bbb to complaint"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdTdwcVMydGV1QkN3EAE",
            "text": "Friendly faces and amazing results"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOX0g5dGJ6dklUajN3RRAB",
            "text": "If you have kids, DONT GO! I’ve been going to this restaurant for nearly four years, yet today when I walked in with my family and my two young boys for lunch we were told we could not sit in the dining room since we were ordering some slices. Even though I said we were also ordering a personal pie and a pasta dish. As if the terrible unwelcoming attitude from the front counter and waitress wasn’t enough. There was a man sitting at the bar and made a passive aggressive comment to another customer about kids running around by the bar. My son was at the front of the restaurant, where the waitesss told us to wait. And my son wouldn’t be moving around the restaurant if you allowed us a table, instead you made us wait in the front for our food. Never will I ever go back. The food is good, but I will never give them another cent for how they treated us just because we had small children. Spending nearly $80 on lunch, and not being allowed to sit in the EMPTY dinning room. Take your business elsewhere, they clearly don’t care about the customers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaVN5WjdQazlyQUNBEAE",
            "text": "New to the area within the last 6 months and Casa Mia has quickly become my go to! I have yet to have a bad meal from them, their tiramisu is my fave, their personal pies are the perfect serving for one, their chicken caesar wrap has a ton of chicken and it’s grilled with actual flavor to it & served with fries! Huge fan of this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT0Q2YlA3MkpLaU53EAE",
            "text": "Found this place on Open Table desperately searching for a place to eat for Mother's Day. Was nervous bc there was a pizza place in front, but it was blown away once we stepped in!!  Everyone was great from the guys in front to servers/waiter. The food was amazing, we each got something different and each dish delsih. We will definitely come back. This was the hidden spot we didn't know we needed 🫶🏻 the little photo opp in front was great too!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdm15WXVkaDlLWkJREAE",
            "text": "The food was delicious,Service impeccable, friendly staff.🤗"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLUpUMkVREAE",
            "text": "I had one of the best Chicken Francese dinners of my life from this restaurant. I STILL think about it. I just ordered for the first time in a while and I'm not sure what happened but it was inedible. It was eggy chicken in a super watery, oily sauce. The bread was stale. The potato croquets were ok, but for nearly $40, I'm going to go elsewhere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNUE5yYVBGcDR2N05nEAE",
            "text": "If you are hungry...don't waste your money or appetite. The wait for the food was over 30 minutes. The food was cold, super salty, dry, and tasted burnt. Please...do not waste your money. That was my first and last time ordering there."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvODZuRU53EAE",
            "text": "I can’t say enough good things about Casa Mia. It’s my favorite pizza spot. From the moment you walk in the staff greet you with genuine smiles and warm hellos that make you feel right at home. Their friendliness sets the perfect tone for what comes next.\n\nThe pizza itself is amazing. I always order a personal pie and every time it’s a masterpiece. The crust strikes the ideal balance of crisp edge and tender center, the sauce is bright and flavorful, and the cheese bubbles into gooey perfection. Each bite is pure joy. If you’re looking for great pizza and even better service do yourself a favor and stop by Casa Mia you won’t be disappointed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeTc3NHZnRRAB",
            "text": "Greats"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJLXZ5T21nRRAB",
            "text": "We went in for the Monday night dine in dinner special. Lovely little unassuming restaurant at the back of a pizzeria. Small bar with good cocktails. Servers were friendly and attentive. Really good food. Garlic bread and pastas were delicious. Will definitely be back again as it’s only down the street from where we live!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a3U2bVlnEAE",
            "text": "I was pleasantly surprised by their pizza. It was pretty good. Got the chicken parm and regular personal pie. Good in a pinch!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM01mRGxnRRAB",
            "text": "I love the food, but wow can they be slow. Just for one example, I ordered a pizza with a special request. They didn’t understand my order. So do they call or text me to fix it? No, of course not (and it wasn’t busy at all). I wish I could say this is the only time.  So I will go back, but only when I can spare lots of extra time to get the order."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNneXFNRxAB",
            "text": "Amazing pasta and seafood food highly recommend"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdHQ3aEVBEAE",
            "text": "Decent pizza spot with a restaurant in the back. It doesn't try to be something it isn't. Casual spot that leaves the opportunity for you to stay a little longer. I've dropped in for a slice or two- pretty good pizza. I've also sat in the back and done some paperwork, had a glass of wine and some chicken Parm, while checking out a boxing match. It's a decent little spot. Don't expect the world, you won't get it, but a spot with some decent food and a casual vibe- 👌 it's not bad."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2azVxOHFnRRAB",
            "text": "False advertising!! Restaurant has lunch special but you can’t do takeout. No where on the  menu does it say for, “ dine in only.”\nMenu reflects lower prices than what is charged at check out registrar. $12.95 on menu, $13.95 at register!!\nManager says it’s “understood, lunch specials are dine in only.”\nWould never order from this restaurant again!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdTd1S1ZnEAE",
            "text": "Have been going here for years. New servers at Pizza counter are just plain rude. Have you stand there and ignore you while that carry on conversation. Really disappointing."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzc182MnZnRRAB",
            "text": "Delicious specialty pizza 🍕"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMmI3Q2d3RRAB",
            "text": "My husband and I went to eat there. Mind you, we are African American. We ordered and the Entree came out.  Forgot the salad Or the rice that came.along with the entree did was.not served. Due to being ingross in conversation. We completely forgot. several times the waiter ask if everythong was ok and did not say the rest of our meal wasn't brought out.  They just continue to say is everything okay? Knowing that the whole meal was not brought out here.\nWe paid they bill and took our food\nWe always order online.What the poop the heads?So this time we thought we were go into the restaurant.I will never order on them again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMWNYTVhREAE",
            "text": "It is tucked away in a strip mall between a dry cleaner business and a CVS.  Don't bother to patronize this establishment.  The food is mediocre, at best.  The customer service is lacking, everyone seems to have a bad attitude,  there is nothing inviting about the dining room.  There are lots of options in the area.  Go elsewhere."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMkxUdzl3RRAB",
            "text": "10 de 10 Super recomendado!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuXzktX1F3EAE",
            "text": "I love the chicken bacon ranch pizza 🤤🍕 it's delicious!!! My go to place for it 😁"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX2NfSXpRRRAB",
            "text": "Me and my family have been to casa mia a few times and the food is phenomenal the service is phenomenal and the prices are great definitely coming back as much as I can"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cElfdm5BRRAB",
            "text": "I got a delivery of a chicken parmesan hero the bread wasn't toasted the sauce was ice cold the cheese wasn't melted and the chicken was all cut up as though it was their leftover scraps. All other times they got 5 star . What happened"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUak4tU2t3RRAB",
            "text": "This place has great food the only problem is it’s extremely over priced for tiny portions and they don’t really accommodate you if the order is messed up they charged me over 40$ for pizza and kids raviolis only 4 raviolis 15$ is insane I really do like the food here but you can go to other places that give you so much more food for the price they’re charging they’re cheap with what they give unfortunately the manager can careless the staff is super nice manager wasn’t helpful at all even for penne alla vodka with grilled chicken they charged me 36$ doesn’t even cost that to make it from scratch and feed an entirely family that family style restaurant should be giving more food for 50$ per plate"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdTczeWNBEAE",
            "text": "Excellent restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bWVPQnhBRRAB",
            "text": "Great service and amazing food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c3JqZWxnRRAB",
            "text": "We order pizza every Friday! I don't order from anyone else. We have had other things. Never disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREc2VISm5BRRAB",
            "text": "I love casa mia but don't know whats going on with take out orders. Today I ordered a chicken Cesar salad and lettuce dry cheese had crust and chicken burnt.. not to mention for 25 dollars you should get two dressing cups instead of one baby cup..second order an order of garlic knots..I can't eat them because it seems they were dipped in oil. When I bit them all I can taste is oil and oil dripping from my mouth... so disappointed I paid 25 dollars for not good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5enFiOTNnRRAB",
            "text": "Did not adhere to customers request d/t allergies! Requested no tomatoes. Burger delivered with tomatoes and they refused to refund, was told to just take tomatoes off."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeGZmS3dRRRAB",
            "text": "We mostly get pizza here, and it's consistently good. Service is great and staff are courteous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdGRPWVNREAE",
            "text": "The Buffalo Pizza is amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1by1hcktnEAE",
            "text": "I like this pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNjktUVV3EAE",
            "text": "Excellent service, 10/10 on appetizers and main coarse , love everyone hospitality"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabmRYTndRRRAB",
            "text": "A great and nice surprise was this restaurant we found in the Bronx. Italiano wrap was very good,  thin wrap so all the flavors were present. Our server was super nice. Pizza looked good too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaF9DMHBBRRAB",
            "text": "Great place to go to!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN1lEUGZBEAE",
            "text": "The next  pizza anywhere and my wife and I love to eat there as well WE LOVE YOU GUYS"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaLWVUMUtREAE",
            "text": "Nice Italian restaurant/pizzeria.  Great service, food is excellent 👌."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdC15RjJnRRAB",
            "text": "Excelllent place, delicious food, great service, super ambiance"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdWVYVWNBEAE",
            "text": "I have ordered from here a few times off the slice app. I recently visited here as well and was surprised they have a bar (lol).I had gotten a margarita it was very good. The service was excellent as well. One of my favorite pizza from here is the avocado salad pizza (so to all my salad pizza lovers you have to try it). I have gotten buffalo wings which were good (they were good size not the little ones) garlic knots, and pizzas with toppings. Never any complaints."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMl9uNllREAE",
            "text": "Who the hell charges for ranch with wings"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaGNLMVJnEAE",
            "text": "This restaurant is good location with plenty of parking, food is amazing.\nService is amazing and friendly. They have great food with a big selection from pizza to Italian dishes as well as seafood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXVqMXFnRRAB",
            "text": "Small place great food. Friendly people."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTay0yanpnRRAB",
            "text": "Casa Mia is a quiet cozy local Italian restaurant with very attentive service and tasty dishes. My favorite is the lasagne, however, during my last visit I tried a new dish with a creamy white sauce that was too salty for even me and I love salty! It's the second time I've experienced this here so I'll avoid the \"white cream\" selections.  But I do recommend this lovely restaurant with a nice bar and great pizza too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbS16dmNBEAE",
            "text": "Love the decor in this restaurant. You can go for a quick slice or walk towards the back and enjoy fine dining. Food was good soup was amazing and staff was friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eXRpRzRRRRAB",
            "text": "Bronx’s best kept secret. Or is it Yonkers? Who cares. It’s Italian. And it’s delicious. Don’t let the unassuming facade fool you. This is Arthur Ave quality cuisine in less fancy surroundings. And at less fancy prices."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaFBYY1h3EAE",
            "text": "Amazing food, great service and the best Sangria around. Chris, Jamie, Francisco and Richie are awesome.\n\nGo on Mondays for pasta night, you won’t be disappointed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MnJXX05nEAE",
            "text": "We had the most wonderful experience!  My kids are incredibly picky and they ate everything with a smile.   The pizza is fantastic. I had a veal and it was incredible. The service was amazing. Jaime was really nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaFl1enZ3RRAB",
            "text": "I stumbled upon this restaurant and what a nice surprise!! The food is excellent! It has become one of my favorites!! Love it ❤️"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbkxUSTl3RRAB",
            "text": "The food was amazing. The service was amazing and well. The management came over to the table and made sure everything was ok. Definitely will be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdk9IRDF3RRAB",
            "text": "We order take out from here frequently. We also had my daughters second birthday here last night. The amount of care and attention we got was outstanding. The pizza is always delicious. Their pastas, chicken scarp and marsala, wraps, and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcWZpMTlRRRAB",
            "text": "If I could give a 0 I would. Came to this place regular looking after work! Super hungry just needed something quick to eat! Me and my partner we were dressed down we was coming out from work. We sat down ordered and 3 ladies that where…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bXRxczBBRRAB",
            "text": "Fantastic!  We clebrated a wonderful Mother's day with our family.  From the minute we walked in the door the aroma of the cooking was heaven, and they were so kind to accomodate my father who is in a wheelchair.  Our waiter and the staff were lovely and the food was absolutely delicious.  Can't wait to go back with friends for them to try"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4cGIyNXZ3RRAB",
            "text": "I ordered the Chicken Cutlet Parmigiana with Fresh Penne Pasta and a side order Potato Croquettes. What an amazing experience. I was greeted by Jaime the new manager. He’s a professional leader. I’ve been there in the past and this place…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bThxLWlBRRAB",
            "text": "My partner and I Ordered a last minute pick up of margherita pizza from this place last nite since most restaurants had already been closed. This was our first time visiting the establishment and boy were we disappointed!\nThe menu photos of the pizza had not matched the pizza we were served. And the taste gave the very same level of disservice as well. Not quality at all.\nWe felt completely bamboozled and misled.\n\nNot long after our analysis of the unmatched pizzas, I then decided to go into the establishment to voice my concerns and unsatisfactory experience. After requesting a refund or even partial refund, the only take away offered from staff member, Chris, was a discount toward a next purchase — even after having expressed that we absolutely will not return. I initially thought to myself, what a lack of empathy and customer service on Chris’ part. No resolution whatsoever.  I therefore ended up going straight home to bed still hungry after not touching another bite of the pizza. Altogether, what a waste of time, energy, $$. Totally disappointing.\n\n*Just beware : aside from the unsatisfactory customer service, the pizza images advertised on the menu look nothing like the pizza we were served."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbDdlbm1BRRAB",
            "text": "They have a sign outside that says Happy Hour ($4 beers) from opening to 6pm. When you sit down the waiter says it's  an old sign that dies not apply. They have another sign that says Lunch Special $12.95 (3 course) from 11am-3pm weekdays…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLXBUc2FnEAE",
            "text": "Why this restaurant deserves 4 🌟:\n\nThe service is great.\nThe food portions on the lunch special are quite big.\nThe selection is big.\nThe lunch special menu is priced really nicely.\nThe pasta fagguili soup is really good.\n\nWhy it doesn't deserve 5 🌟:\n\nThe chicken parmigiano really wasn't that good.  The chicken was overcooked and tough."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMHFMUjR3RRAB",
            "text": "When you walk in it looks like a standard pizza place in the front but then opens into a seated restaurant area with plenty of tables. Good service and good food. Large portions, which meant some leftovers for later. A bit on the pricey side, but what isn't now? I'll go back again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxX3J1TzJnRRAB",
            "text": "Was there last night with a group and was very disappointed.  The waiter was a horror! Must have a new cook—the pasta was not cooked, there was no flavor n the cannoli was stale!!!! More concerned with outgoing orders than patrons in…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMGN2STBRRRAB",
            "text": "I just wrote a review but it did not post so will write it again!! Last night I ordered a chicken parm hero and chicken francese dinner. The chicken cutlets were hard, felt like days old and absolutely not edible!!! I called to complain and the manager said sorry want me to send another?? Absolutely not! I will never eat from casa Mia nor should anyone else!! Think before you eat there. Food not fresh"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaXFqc1h3EAE",
            "text": "Very classy place but not stuck up.\nOutstanding service.\nThe tortellini was amazing\nAnd they made heart shaped ravioli\nto go for my lady ❤\nMy server Gerardo was a complete gentleman I went in there looking like a mess but he treated me like a complete gentleman.\nI was very impressed.\nI will be coming here more often."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwck5IaDJ3RRAB",
            "text": "I stopped in on a whim and couldn't have been happier with Casa Mia. From the minute we walked in, the owner Chris made us feel at home. The place is new and tastefully decorated with a romantic vibe. Our server Vinny was fantastic and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjd0tiNHRRRRAB",
            "text": "I waited 3 hours for an order that never came. I called them and the delivery company numerous times, and was told my order was on the way. During my last call to the restaurant, I was told that my order was never processed. Upon a trip to the restaurant, I can see why. Nothing but utter incompetence, lack of organization, and mediocre at best management. The manager offered to give a 9 month pregnant woman a bottle of wine as compensation. After having to make him aware of the obvious pregnancy, he offered a can of soda. I gave him a face, and he offered 10% off my next order. Needless to say, I will not be coming back. Happy Mother’s Day to us!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMThyRXFBRRAB",
            "text": "Went in for a pie and saw the pizza man take a pie out of the oven and then proceed to take off the pepperoni that was on half of it with a set of tongs and throw the pepperoni in the garbage. He then put a ton of cheese on that half to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXJ1RVNBEAE",
            "text": "Ordered 4 entrees to go. Veal marsala was horrible. Tasted like they boiled soles from somebody's shoes and the marsala was like all flour. The chicken scarpiello Tasted old. Chicken parm was fair and shrimp fra diavalo was ok\nToo bad for us on Mother's Day!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeEw2eHRRRRAB",
            "text": "I ordered lunch from them and my soup had several bugs floating around in it. I’m very disappointed!! The soup does have fresh spinach, so I’m thinking maybe it wasn’t cleaned properly. That is a major NO for me. Will not be ordering from them again."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbGYyX2p3RRAB",
            "text": "We have eaten at Casa Mia numerous times and each time was better than the last. We never had a bad meal there yet. The staff is very friendly and courteous and the chef is amazing. I recommend this restaurant to all my friends and family for a nice Italian meal. 5 Stars."
        }
    ],
    "reviews_count": 73
}