{
    "name": "Burkes Restaurant and Bar",
    "place_id": "ChIJSV6TIrLywokRoUzzJdnD3bo",
    "grid": "BX9",
    "address": "645 Bronx River Rd, Yonkers, NY 10704, USA",
    "rating": 4.4,
    "user_ratings_total": 832,
    "phone_number": "(914) 237-5137",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM1UwSkpORll4VVZaMFFtVk5XRVJhVVhKdmJWRRAB",
            "text": "Attended a birthday party, party room.  The service was exceptional, very attentive, lovely and pleasant.\nThe food was delicious, I had a wonderful experience!\nThank you"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRGNXZElRMTlMTVhseVp6SllaWFpTUkVwVldHYxAB",
            "text": "This bar has a really great vibe. The drinks were great and the mozzarella sticks were the best I had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVWQyZDZWVm81ZVRoTk1FVm1TSEZIWDJnM1ZtYxAB",
            "text": "Great food and great staff, especially jake. Love to take the kids here for ballon night and great date night spot to watch the game."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdWJsSTBjek40Ym1wTlYzaFlabVZ6VFU5aU9VRRAB",
            "text": "Withdraw 15 minutes from our hotel and the place was closed at 11:20 M and Advertising is open until 2 AM"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlNUWkhNRGx2WjBjNWRHTlhXazVWY0RsblVIYxAB",
            "text": "Great place to watch your teams play."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFdqTmtVVlJOY2pBeGJEZDRhSGw1TmpoU00xRRAB",
            "text": "Great place to wash the game and have a beer."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVmVqaHhWMEoyU0dwck5VUkVUVTlyZVVWdmNsRRAB",
            "text": "Really homey bar, bartender is super cool. Grabbed drinks and a burger here with a couple old friends and unexpectedly caught a UFC match here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUFZsSjVkR05tV2toVVpFdDBRMFpzYjFRMVpYYxAB",
            "text": "Best steak sandwich I've ever had.   Amazing!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzN09TWjdRRRAB",
            "text": "Best place anywhere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWWFuZzJWemRtUm1wWk5FSXpSREJYU0c5RlNXYxAB",
            "text": "I come here all the time for the burgers.  They are delicious and better than any other fast food burger joint.  Reasonably priced.  My only complaint is that sometimes smokers stand right outside the door so you are bombarded with cigarette smoke as soon as you exit! Please do not do this… it literally makes non smokers nauseous"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLXEtNzJDbjhmcFhBEAE",
            "text": "Great service the staff super friendly during a Knicks game packed house was still getting great service and the food was on point get yourself a burger"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM1I5OEd5eHVfTkJBEAE",
            "text": "Everything from the appetizers to the dessert was flawless. Will be back soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKeTdwSlR3M29pODBBRRAB",
            "text": "Unreal. I hadn't had a bacon, egg burger this good in years. Presentation, taste, quality of the brioche bun. Gold!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeUxqcEh3EAE",
            "text": "I'm giving 3 stars cause I went here on a random hour during the day, service was great prices on point. I want to go on a Thursday ,Friday, Saturday night to really see the vibes. Anyone know what's the best day to meet friendly locals 🤔"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bHJpb1FBEAE",
            "text": "Very good experience. I came in with a friend and they accommodated us. They weren’t really busy but seemed to have a large group.\nI had some corned beef to go and it was pretty good the next day.\nVery affordable as well!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb0p1RXV3RRAB",
            "text": "Nice sport bar for a bite and a drink"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMjQyRHBnRRAB",
            "text": "Jake from Burkes is the only reason I come here. Great service from him. He is awesome!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOGRQb19nRRAB",
            "text": "I recently hosted my retirement party at Burke’s Restaurant and Bar, sharing the celebration with two fellow NYPD members, and I couldn’t have asked for a better experience. With well over 100 guests, the staff handled the increased volume with incredible efficiency, attentiveness, and friendliness. The food was fantastic, the drink service was excellent, and the entire evening was seamless thanks to their professionalism.\n\nA special shoutout to Roslyn, who went above and beyond in coordinating and planning the event. Her attention to detail and dedication made the night truly memorable for all of us. Thank you to the entire Burke’s team for making our celebration so special—highly recommend for any event or gathering"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcTdDZkN3EAE",
            "text": "Wings were decent, if I went back might try something else. But nice atmosphere and great service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfODdiTVhREAE",
            "text": "I love this  place..it's one of our favorites..I love the service from Jake, Rachel ,Ora and the Manager she is awesome as well"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfay1uWmlBRRAB",
            "text": "My husband and I love this place. Great staff! Love Orla, Roz and Nettie. Everytime we come here for brunch, drinks & watching a game, NYE or a random date night, we have a nice time. The potato skins and mac and cheese rock."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZzVhVnFnRRAB",
            "text": "A nice place to hang out, watch sports and listen to tunes. They have Angry Orchard."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbGFtdzNBRRAB",
            "text": "Great family-friendly spot. Two Rows is perfect for families. The menu offers a variety of choices for both kids and adults, and the service is always friendly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGZPdWdnRRAB",
            "text": "So, I had some free time and figured I'd check this place out.  I walked in, they told me to seat myself, so I grabbed a table.  After like 10 minutes of being ignored, a bar seat opened up, so I moved.  Service got way better then!  Two minutes later, I ordered garlic parmesan wings and a Merlot. The bartender was great, the wings came out hot and pretty quickly, they tasted alright.  It was a fun, lively place with tons of games on TV. Overall, it was decent."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN2ZzRKQxAB",
            "text": "My son took me there 3 years ago for my birthday and today December 13th we are back. Love the place. Welcoming atmosphere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aXVpUkNnEAE",
            "text": "Nice bar good food friendly bar staff Jade was very sweet."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYak1iY0ZBEAE",
            "text": "I felt compelled to write this review because I always used to like this place but...Yesterday I walked in there. There was no waitstaff, no hostess. We waited ten minutes, they ignored us, didn't seat us. There was only a bartender and a drunk at the bar gawking at me. What a shame. This used to be a good place. So we left."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN2FUQTZBRRAB",
            "text": "Excellent food, friendly staff, great atmosphere for sports or family.\n\nThe best burgers, wings, and the ceaser salad."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXZ3BfUzVnRRAB",
            "text": "Love the service and atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWZLUWlRRRAB",
            "text": "Waiter demanded a tip and made our party feel uncomfortable. Tip Was added to the card not in cash"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLUllUXZ3RRAB",
            "text": "Love this place! Always calm vibes, delicious food, and great staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOUpfRXN3RRAB",
            "text": "A great local spot. Good food, friendly staff and lots of TVs to watch sports."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM3BTVURREAE",
            "text": "Roz is the absolute best bartender in the world.\nShe handles happy hours tables fights nights and more sometimes solo.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ1lyZ3lnRRAB",
            "text": "BAD SERVICE RESERVED A ROOM THEY WANTED TO UP CHARGE AFTER ALREADY HITTING ME WITH A BOOKING FEE. THEY INSISTED WE BUY MORE FOOD THAN NEEDED."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa09meUpREAE",
            "text": "Great place, good food & drinks. Staff is great. Enjoyed coming here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bFBQbG5nRRAB",
            "text": "Love the service and the food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3b3BHeUpnEAE",
            "text": "I love it !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6czg2N0hREAE",
            "text": "Friendly,  clean. Good food .And I the decor  to different"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReTZ2TGVnEAE",
            "text": "Excellent neighborhood bar/restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOWVxajh3RRAB",
            "text": "Burke's is hands down one of the dopest bars I've been to! From the moment we walked in, the atmosphere was buzzing with energy, and the bartender from Ireland took our experience to the next level. Their hospitality was top-notch, and they made sure we had a great time, which we absolutely did.\n\nThe venue itself is super spacious, with plenty of room to move around and lots of TVs lining the walls, perfect for catching all the action of your favorite sports games. And let's talk about their happy hour – it's definitely a winner! With over 25 draft beers to choose from, including local brews and premium options, there's something for every beer lover here. Plus, their extensive selection of bottled beers and liquors ensures that you'll find exactly what you're looking for.\n\nAs an Irish-themed sports bar, Burke's is crazy about all sports, and it shows. With over 20 TVs, they screen a wide variety of games throughout the week, making it the ultimate spot to catch the game with friends or family. And if you're a UFC fan, you're in luck – Burke's has a massive following and shows all the UFC pay-per-view events, with no cover charge.\n\nWhether you're winding down after work, catching up with friends, or just looking for a bite and a cold beer, Burke's is the place to be. With its lively atmosphere, friendly staff, and unbeatable selection of drinks, it's no wonder this bar is a local favorite. I can't wait to come back and soak in the vibes at Burke's again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdXZhckx3EAE",
            "text": "Tasty food without compromising on the price. We ordered off the Sunday brunch menu (bottomless mimosas and bloody Mary's till 3pm!!) and have no complaints. The bartender, Marissa, was so attentive and kind. Will definitely come back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcElLQWpRRRAB",
            "text": "This place is highly recommended first time here had a great experience friendly staff Michael took care of me. Food was absolutely delicious, what I was really impressed about is that they make their own blue cheese and I must say it’s…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMXZDSkNBEAE",
            "text": "The best pub I have even been. They are so nice and food and drinks are so good. If you are living in this area or new here this is the right place. Bartender lucy is the best. I am new to this area, and went there for a drink alone. She made me feel so safe and comfortable in the bar. Also a lady from the bar walk with me to near my house to make sure I reach home safe. Again best place ever I have experienced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNVlDelRREAE",
            "text": "Great Irish sports bar. Not only a Yonkers mainstay but a Westchester mainstay for over 60 years. Great community public house."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnc3B2eHpBRRAB",
            "text": "Burke's is always the place to visit when you are hungry and want a guaranteed fresh and delicious meal. Burgers,  a salad, or steak; it's always yummy here."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvajhxLXNRRRAB",
            "text": "Great spot.  Staff is friendly,  Root beer BBQ wings were delicious.  Burgers are great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeEwtSjdnRRAB",
            "text": "Absolutely delicious food! We ordered from here yesterday for the first time and we did again tonight! Our burgers were really good— the size and price is definitely worth it. The lady at the front was also so friendly and welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaEpQY1p3EAE",
            "text": "Went to watch the basketball game while visiting the area.  Atmosphere was great with lots of Knicks fans.  Service was excellent but the food was just OK.   I ordered the fish and chips which were spongy and not flavorful.  Maybe I got a bad batch.   My partners food was OK."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ1phSmx3RRAB",
            "text": "Had a great time watching the playoffs here - Jake is the best server- he’s attentive, respectful, and an absolute hard worker. The food was good, there were multiple TV’s to watch, so no view was bad. The crowd was lovely and fun, and an overall good place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwanVtN19RRRAB",
            "text": "Burkes did a great job hosting me and my now wife for a rehearsal dinner. They had a private area set up. Rob, the owner, was super friendly and helpful and made sure we had everything we needed. The staff took care of us. Food was good. Highly recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ0pXR3dnRRAB",
            "text": "BUILD YOUR BURGER IS THE BEST PART OF THIS BAR"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMWZHa0pREAE",
            "text": "Stumbled upon this place for our first visit a couple weeks back and caught the happy hour. Lisa was super sweet and attentive. Pretty good happy hour deals, friendly folks, and good service. Wings and fried Oreos won’t disappoint."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOU0zRFBREAE",
            "text": "The burgers are far above the average! Very nice staff! Good place to be with friends and family!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBN2JuUzV3RRAB",
            "text": "Very nice, cozy place!! I had my Birthday Brunch there and everyone enjoyed themselves. The food was on point and the service was excellent. The owner is a very nice, outgoing guy. He made us feel so welcome that there's no doubt about your return!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOU92M19RRRAB",
            "text": "Cheap and delicious burgers, good drink specials, and good bar staff. What more could you want? Has an authentic Irish pub feel to it and there's a ton of parking in the area. Bathrooms are almost always clean and never had a bad experience. Great spot for the family as well during the earlier hours (before 7-8)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcDRqakt3EAE",
            "text": "Nice traditional Irish style bar. The food is really good here and the bartenders make good drinks. The brunch menu is phenomenal. They also have options to build your own burger and build your own salad for customized meals. Moderately…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOVpPSjZRRRAB",
            "text": "Not good but great vibes! Everyone is super nice.  Felt comfortable & cozy.  Went a few times & each time was fun & a great experience!  Some of the chairs & tables just need updating or tightening though, super wobbly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcy1fdDFnRRAB",
            "text": "Went to Burkes tonight with for first time in ages, food and service was fantastic. Roz was so welcoming and friendly we had a great time, large table on a very busy night we never felt rushed staff were very attentive . Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bU03RGt3RRAB",
            "text": "Went with a friend a week before all was good. Went back with a date cause they like sports and wasn't impressed. Atmosphere was good. I'm big on customer service waitress was ok busboy tried to clean up for her. Long island drinks.... idk something wasn't right. Not giving up gonna try again"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNkp5X1JnEAE",
            "text": "Typical pub food selection. I enjoy their shepherds pie and their burgers are always a solid choice with tons of customization options. Service is always good. Indoor and outdoor seating options available."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cUlLbEZBEAE",
            "text": "Amazing atmosphere! Asian wings were heaven sent. The Long Island ice tea had me wake up in my spare room. The bartender was amazing and so helpful. Can't wait to spend the next Saturday night there!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTa0l1cVd3EAE",
            "text": "Clean, adhering to CDC regulation. Great food, even better prices. Nice atmosphere. A must go to, outside seating.\nOnce again not disappointed. My husband's go to favorite at  Burke's, Shepard's Pie. Best He's ever had. My sliders were made to a t"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dlpMOENnEAE",
            "text": "I tell you what, I’ve lived in this area for months and months and had never visited this restaurant. I am so glad I did, it will be back very soon. The food is amazing, and the staff are so attentive to detail. I wish I remembered the name of our waiter, but he joked, he laughed, and he helped so much with setting the tone and atmosphere of the restaurant. The food was beyond delicious, and I felt at home. It’s a small Irish pub/restaurant, but you definitely want to visit."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbV9McG53RRAB",
            "text": "Great local place if you live close by. Food is good, better than average bar food. Scene is gloomy and the place is very big. Low lighting makes it's a weird vibe. Great beer selection and great bartenders. The manager and owner are great guys too"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBakx5M1JREAE",
            "text": "Great bar food with more menu options than usual. There are TV's everywhere so this is a good place to eat during a game.\nBurke's excels at burgers giving extensive choices of buns, cheese's and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMzRiU25nRRAB",
            "text": "This is a a place you can come and enjoy yourself, the place is clean the food is good and there wait staff are charming. When we arrived it was not to busy, we were seated quickly and given the option to choose. Food arrived as quickly as we ordered it and correct. There beer selection was good, had beers that I haven't seen in other locations."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5eE12TThnRRAB",
            "text": "Socially distanced Pub with great bar food and several screens for live sports.  Create your own burger with tons of choices.  Large adjacent dining room with roaring fireplace 🔥.  I recommend Buffalo wings, calamari and Nachos Grande.…"
        }
    ],
    "reviews_count": 67
}