{
    "name": "Rob's Kitchen",
    "place_id": "ChIJJ6McsK31wokRWjrps5a8Rho",
    "grid": "BX9",
    "address": "1752 Lafayette Ave, Bronx, NY 10473, USA",
    "rating": 4.6,
    "user_ratings_total": 34,
    "phone_number": "(718) 450-3339",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ab1ZHUkhiRE4xUTAxYWJEUnpSRzlzYUVaVUxWRRAB",
            "text": "The food was delicious!  This was my first visit to Rob’s Kitchen and I was pleasantly surprised. I had been wanting Ackee and salt fish for two weeks and did not feel like going far. I just searched the internet for Jamaican food in my area and Rob’s was the first on the list. I am so happy I took a chance. It’s Sunday morning and I was there before 9 am - the place was clean and bright!  I was greeted by the owner and chef!  My ackee and  salt fish and fried dumplings are amazing. I am satisfied and look forward to my next visit. This food was cooked with love!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zdFExbFpabmszV0VoWk4zUkRjMDB4TmxCbldsRRAB",
            "text": "Give my food a 8.5 outta 10!! Would be a 10/10 if I had more veggies but this food was absolutely delicious! Seasoned to perfection, fast service! I will be back"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVFpTMUVjMDlpV2pGYVdVWXRWbVo2UjIxR1JHYxAB",
            "text": "Today I had the pleasure of trying the local Carribbean Restaurant Rob's Kitchen located in the Bronx, NY and my Experience was Delightful! Through the \"Too Good to Go App\" I was able to score some Delicious Eats at a fraction of the price due to this establishment Joining the Zero Waste Sustainable Initiative to Prevent Food Waste by providing Excellent End of the Day Surplus Meals to the Community.\n\nMy meal consisted of Fried Chicken with Cabbage, White Rice & Gravy with a Delicious Veggie Patty. I also purchased a Beef Patty for the Road and I was glad I did so. The Fried Chicken was Seasoned to Perfection and cooked Well Done with the in house herb blend. The crispy skin of the chicken was my favorite part and the white rice and gravy with the onions was very tasty and rice not overcooked. The cabbage was lighty seasoned with an array of mixed vegetables and not overly oily. The plate was very well balanced. And as for the veggie patty and beef patty, Both patties had the most wonderful flaky and smooth buttery crust with very well cooked meat and vegetables upon the inside. I'm not usually a fan of  everyone's veggie patty, but Rob's Kitchen got the patties on lock. They were flavorful, fresh, seasoned well and not dry or undercooked. You could tell love was put into the food and for that I'm grateful.\n\nThe Ambiance of the Establishment was well maintained on the outside and within and it was great to see customers supporting this local business as well. And lastly, the customer service was exceptional. I met the most wonderful sever by the name of Ms. Marvette who was just a ray of sunshine and really added to my first time experience at Rob's Kitchen. I definitely will be back to try more food and I'm gonna tell my family, friends and neighbors about this local restaurant that's doing Big Tings Inna di Bronx. Overall, my experience was a 5/5 and I'll be back sooner than later. I want to wish Rob's Kitchen All the Best as it continues to share it's Unique Signature Flare of Authentic Carribbean Cusine right in the Heart of the Bronx and hopefully one day WORLDWIDE because the Flavors and Food are on Point. Jah Bless 🙏🏽😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTzVxdlh1eE9mZW5nRRAB",
            "text": "Absolutely amazing Jamaican food! The flavors were rich, authentic, and made with love. From the perfectly seasoned jerk chicken to the tender oxtail and flavorful rice and peas, everything was spot on. The portions were generous, and the service was super friendly. Rob’s Kitchen is a must-try if you’re craving real, delicious island comfort food. I’ll definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKWHR2cDN0dkx5UXNBRRAB",
            "text": "Food not salty. Meat not sugary .grest cooking i enjoyed everything there.vegetable patties wow.great restaurant to eat.customer service very good.juice perfect.not 2 sweet"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdXFtZlRSeE12RHpnRRAB",
            "text": "I’ve only ordered through delivery & Everything I have gotten from here thus far has been delicious & consistent. Plus they don’t skimp, even with delivery. My favorite is the Oxtail Rasta Pasta. Noodles are perfectly Al dente (not mushy like all the other places I’ve tried,yuck), and Oxtails are jumbo,tender and flavorful. Idk who the Chef is, but Big Up yaself!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcTc3X2F3EAE",
            "text": "10/10 I got a soup and vegetable pattie and seamoss fruit punch everything is fire !!!\nThe seamoss fruit punch fresh you can taste the actual fruits"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJazdLTnF3RRAB",
            "text": "Rob and his staff goes about and beyond to make sure you have a satisfying experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X1BhVG5BRRAB",
            "text": "Customer service was impeccable and the ackeee and Salish was just right"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncWVhRkRREAE",
            "text": "Let me tell youuuuu. Me and my boyfriend got the sweet chili salmon , rice & pea, plantain, and vegetables!!!!! The best Caribbean cuisine we had since moving to the Bronx 3 years ago. Put my salmon to shame lol  Anyways great customer service lovely hospitality."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa182b0xREAE",
            "text": "When I go in there, I feel like I’m home with a good food come from the kitchen 👍🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcXZ2UGxRRRAB",
            "text": "First time trying food here it's good like the mac and cheese bangin and the jerk chicken good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaWJ2X0Z3EAE",
            "text": "Thank you for the wonderful food 🙂,  I can tell it's made with love. I will definitely be back. I could sense the ladies hesitation, because people around here can be so rude. But she packed my food with patience and care(very appreciated), I wish I could have tipped more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuekstUTJ3RRAB",
            "text": "Went here for the first time , heard about it on Bro. Gary radio and the service and food was excellent! The owner and staff was very friendly as well.  I am a very picky eater and do not eat certain parts of the chicken, and it is very few restaurants that offer parts other than the leg and thigh, However I was truly impressed to see that Rob’s Kitchen offered chicken breast! Omg! It was Amazing!  I also had a Carrot juice and my Friend had a Passion Juice and both were phenomenal . Will definitely be going back. 10 out of 10 Hands Down! 🙌🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudkpiQ1N3EAE",
            "text": "Soup was only broth, no meat, no food yet charged same price as full soup. Jerk chicken was burnt and not very tasty. Have to say, fried chicken was of good flavor just a bit greasier than expected.  food in show case could be stirred as they appeared to be drying out and stale. Service was super slow then getting to me, I was informed I had to wait longer to know if they could give me what I wanted because they might not have enough to fulfill my order, giving priority to the Uber Eats orders. Very disappointed, especially coming from out of state yo the Bronx!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNXR6X2VREAE",
            "text": "Good Patti 😀"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMV9TYk5REAE",
            "text": "I'm a frequent at Rob's kitchen. Especially for their rasta pasta!! Best I've had in the Bronx. The portion is massive (don't mind the picture I had already devoured half). Today was my first time getting the sweet chili salmon, with garlic. Which I knew for a fact was going to be the truth! No lies told. It was chef's kiss good. The fact that it was none out, completely gone! Chef Bailey had to cook up a fresh order for me. Chef Bailey is the man! He was preparing for his fish fry barbecue event and still took the time to make these dishes for me. I love it here!! There are two tables about 4 seats in total. They play a mix of music. I love the gospel playlist! Clean spot and good customer service! I'll be back Chef for another garlic sweet chili salmon (pictured). $20+ for oxtail and seafood meals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb19TNDBRRRAB",
            "text": "My order never came even after the hostess called me to confirm my order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX1A2ZldnEAE",
            "text": "i ordered two times on food delivery apps and the food has been  great and delicious this is by far the best Jamaican food I’ve tried in the south Bronx area i put in special  instructions and they  fulfill 10/10 !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObnZpeWNBEAE",
            "text": "Absolutely amazing, people are super friendly, and the owner is really chill. I would 100% recommend for dining in, or even just grabbing a quick bite!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObnNpNG1nRRAB",
            "text": "Service is excellent and the food baddd!! Big up! Love this place, second time coming and I enjoy every bit of it. Not every Jamaican restaurant is authentic but this makes me feel like home. The sorrel is nice and strong😌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNkotTmNREAE",
            "text": "The oxtails were good and the price wasn’t bad.  Wish they had more items at the time I went but I will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0tidzhRRRAB",
            "text": "Everything is great, I mess with the porridge"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseGYyb3JBRRAB",
            "text": "Best food I've had in a long time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOWVQOF9BRRAB",
            "text": "Best shrimp pasta in NY"
        }
    ],
    "reviews_count": 25
}