{
    "name": "Misto Restaurant and Bar",
    "place_id": "ChIJ0xdhCGzzwokRJSNGHX1jJAs",
    "grid": "BX9",
    "address": "2314 Eastchester Rd, Bronx, NY 10469, USA",
    "rating": 4.7,
    "user_ratings_total": 308,
    "phone_number": "(718) 697-6400",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaVNHZzVWSEJyVkdWWlEwRm5hMHBvTnpSRmVHYxAB",
            "text": "We had dinner there for the first time and were tended to right away. The customer service was exceptional! Vibes in the restaurant were also nice and cozy. The food was superb!! We can’t recommend it enough and will definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU1ZDMUlkakp4UWxVd1VrOUVabEo0Y21Rd01GRRAB",
            "text": "Excellent food and service. The brussels sprouts appetizer was mind blowing. The salmon and mashed potatoes was delicious. Overall menu looked very enticing. They are very accommodating as we arrived early, but still was escorted to a table in a matter of minutes. Will definitely be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUlQxTlJRM1p4WWtOYVFXZzRlVVJuWVZSa1NFRRAB",
            "text": "🏆✨👌🏾 TOP OF THE LINE EVERYTHING ACROSS THE BOARD EXCELLENT SERVICE CLEAN TASTING FOOD HIGH QUALITY INGREDIENTS"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeWVUaFZlRmg2UTAxWGJYVkNiMVZpVkRSVGRrRRAB",
            "text": "The food and drinks are amazing. Brandon and Benny are the best. Hats off to the chef for the amazing food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSU0wTllXa3RMT1VaSWQzUmpiMVJVWldkeVRtYxAB",
            "text": "Really good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM1pITm5XbEJmTldaTVZ6STFTSFZ1YzBSdFEzYxAB",
            "text": "The atmosphere is great, music was good at a nice level. Joy was our server and it was busy her professionalism and hospitality was amazing. Benito the bartender helped joy because the place was packed but that didn’t hinder their service. Food was amazing and we even took some home because the portions were big.\nCan’t wait to go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdGJWaEJUV3hOVG1VM2ExUktOelZwWmtoblpWRRAB",
            "text": "I took my Husband here for lunch, and the Service was exceptional. The waitress was charming and her wit gave us laughter on this special day.\nThank you Joy 😉"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdWIyZGJJZ19INWVREAE",
            "text": "This was my 1st time\nI love it. The food was fabulous, very rare I eat the whole plate. LOVE IT.  the drinks was awesome, I AM DRUNK NOW LOLOLO. 99%  I complained  about the drinks too cheap with their liquor, Misto is NOT CHEAP WITH THEIR LIQUOR.  HIGHLY RECOMMEND.\nFYI: The place is also nice.\nI came again no disappointed.  There was a 3rd person today she loves it. She is planning to bring her co-workers. Just come you will love it!!!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMk5VYzFZUzFwUjFNeGRrRkRMVzluTW1kRFkwRRAB",
            "text": "Yesterday was my second time visiting the restaurant and I’m coming back for more … drinks, food and service are amazing …thank you to Benito he does the best cocktails and so attentive with his customers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRFZVTTNPRTVSVFhCWFNtRnpZazlLT0dWcmNFRRAB",
            "text": "Anazing"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aGYtdE53EAE",
            "text": "Staff is great, food is delicious, and ambiance is extremely chill and relaxed. I hosted our first game night a few weeks ago and everyone had a blast. We’ll be back August 14th for another game night"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNE0yOUplbTlzUjFsNFpXSnRUVlZPZFhob2JWRRAB",
            "text": "The menu is Perfect !!! Food served Hot as it should and quality it excellent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUk1HWjZlWEJCZFhKRlkxZExUV05VU2t4MVFsRRAB",
            "text": "Fresh ingredients and great flavors—highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT2NHUjVSMVpPYjJOaGJ6SjNWVjk0UzJKM1duYxAB",
            "text": "Nice place. Great Vibes!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMGJUaHpVek5aU2tGME56SkVkblJrUTFabVoxRRAB",
            "text": "Delicious. Prompt service because we had an early dinner on a Sunday, but the customer service was good. Apparently is under new owner and chef. Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJS2htZENhbVByVDN3RRAB",
            "text": "Staff was perfect and attentive, the food was very good. The wild boar Ragu was excellent. Very comfortable setting, will definitely come back ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQakZ1dWZtdWJhQTJRRRAB",
            "text": "Great place to go and relax and unwind after a stressful day Chris the manager what is very polite the food was great cannot complain I will get them I will get them 9 Stars but you can only give five 😂, a very relaxing place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN082X2VsczRHX2NnEAE",
            "text": "Excellent all-around service. I love this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZU5qOTZ6ajhfOUd3EAE",
            "text": "Misto is a wonderful, intimate, and top quality dining out here Pelham Gardens. I enjoy the atmosphere during the evening time here and have had excellent dishes and drinks. The staff and the owner Anthony are really friendly and truly care about the restaurant. They are making some changes and it really seems like efforts show in the service and food. I have come back couple times already with my partner and will continue to do so with friends and family. The place is one of my favorites in the neighborhood.\n\nTo me the items that are my most enjoyable are the POLLO ALLA SCARPARIELLO (love this), fried zucchini appetizer, wild boar bolognese, chocolate lava cake & ice cream, and the tiramisu. For drinks their smoked old fashioned is as good as any I've had in manhattan. 5/5 highly recommend this place.\nP.S. they are also dog friendly with outdoor seating"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbjVxVFVBEAE",
            "text": "A Hidden Gem That Feels Like Home – 10/10 Experience\n\nFrom the moment I walked into this restaurant, I knew I was in for something special. The atmosphere struck the perfect balance between cozy and elegant — warm lighting, tasteful decor, and an inviting energy that made me feel instantly at ease. It wasn’t just a place to eat — it felt like a place to belong.\n\nThe food? Absolutely phenomenal. Every bite was bursting with flavor, perfectly cooked, and clearly made with love. You can tell the kitchen here isn’t just focused on presentation — they’re focused on heart. The drinks were equally impressive — refreshing, well-balanced, and served with care.\n\nWhat truly set this place apart, though, was the people. The staff were attentive without being overbearing, friendly without being forced — just genuine, kind humans who clearly take pride in what they do. And then there’s the owner. One of the kindest, most sincere people I’ve ever met. His warmth radiated through every corner of the restaurant, and it’s clear that his presence shapes the soul of the place.\n\nHospitality like this is rare. It wasn’t just good service — it felt like being welcomed into someone’s home. I’ve never had a dining experience that felt this personal, this thoughtful, or this memorable.\n\nI’ll absolutely be back — not just for the food, but for the feeling. This restaurant is a treasure."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcl9pSGFREAE",
            "text": "The food was beyond tasty—every bite hit the spot. The drinks were seriously impressive, super well-made. The staff was welcoming and on point the whole night, which made the experience even more enjoyable. Can’t wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvajZYWjN3RRAB",
            "text": "Tonight my friends and I had an amazing experience at Misto in the Bronx.  The staff was amazing and the drinks were PHENOMENAL.  I highly recommend the food.  Everything was delicious.  Joy, Christian and Anthony did a great job at making us feel welcome!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMTZYUmZ3EAE",
            "text": "I notice the  food taste a bit better."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aE9tM3NBRRAB",
            "text": "Awesome, awesome, awesome."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMV9tclJREAE",
            "text": "Christian and joy was great food was delicious would definitely come back to this establishment and it’s local !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva2FHYnFRRRAB",
            "text": "Great food! Great place to have dinner and lunch!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvanN1cElBEAE",
            "text": "Food taste amazing and the dining room is beautiful!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdjZqYVNnEAE",
            "text": "Great service!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d19pb3l3RRAB",
            "text": "I absolutely love this place !!!!!! The service is incredibly!!!! The staff that work there are amazing welcoming I love love love this place !!!!!!!!! And the food and drinks !!!! Amazing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbklEdy1RRRAB",
            "text": "This place should be ashamed to call themselves an Italian restaurant. At first glance the location and the atmosphere seemed great but it was QUICKLY overshadowed by the lack of compassion and hospitality by both the server and the hostess. Me and my wife booked our anniversary dinner here one week prior and they had called us to cancel because their gas wasn't working. Although we had to delay our dinner we were still excited to give the place a try.\n\nFrom the moment we walked in, we were left awkwardly waiting in the front of the restaurant for the hostess. After giving us a table directly NEXT to the server's table we were repeatedly ignored and forgotten about. They took a really long time to even ask for our drinks and to take our appetizers. When it came time to serve us our appetizers, the person bringing out the food almost gave it away to another table. The food came to us COLD and the drinks never arrived.\n\nOnce they finally took our orders for our dinner, it was over 40 minutes before we were served. The server even came up to us to ask if we wanted the bill and she was dumbfounded when we told her we haven't even received our meal yet. My wife Ordered their Salmon and I had the Steak. It seemed like their gas was still out as parts of our meal were COLD. I also ordered the steak medium rare, and it came to me very rubbery and over salted. all in all it was a horrible experience.\n\nTo top it all off, the server brings us the bill and doesn't even bother to ask us if we would like some desert! Even with all of this I left them a decent tip.\n\nIf I could give ZERO stars I would. Shameful and disgraceful experience and I hope no one else would have to go through what we went through, especially for an anniversary dinner."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOF9uRFhnEAE",
            "text": "10 out of 10. Food was great. Service was wonderful. Def get the egg rolls and lemon caper chicken"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeE1MdVZnEAE",
            "text": "Fantastic place. Friendly, attentive staff and excellent food!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBb2ZiR2x3RRAB",
            "text": "Nice place!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMU1MQ0l3EAE",
            "text": "Cozy atmosphere.  Never felt rushed out the door.  Great food and service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfZzVMTndnRRAB",
            "text": "Nice Place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM3ViRS1nRRAB",
            "text": "Nice Place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdHJyNzR3RRAB",
            "text": "All around great experience for my group of 15. Superb food and service. Will definitely go back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdHB6UG1nRRAB",
            "text": "Food service excellent\nWill definitely go back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa0pqRHNRRRAB",
            "text": "Nice"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeDllWklREAE",
            "text": "Nice Place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcS1UaHJRRRAB",
            "text": "Cozy Italian spot in the Bronx, Service was excellent shout out to the waiter frequently check in on my party as well has excellent manners with his service makes you feel safe and at home.  The menu is small but packed with plenty of variety to choose from to get your little taste of Italy,  cocktail specials are aust try as the bartender is nothing but exceptional at her craft.  Definitely a spot to come back to another weekend when I'm in town."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfazlPUHpRRRAB",
            "text": "Cozy ambiance, great portions, and absolutely delicious meals."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNXIyMXlRRRAB",
            "text": "Nice Place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ3ZHV09REAE",
            "text": "Nice Place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNktPc1F3EAE",
            "text": "This place is absolutely amazing. I booked a lunch for my mother’s 50th birthday celebration , 3 hours for 30 people including kids with 3 courses. I was able to set up a birthday sign with the big LED numbers as decorations. The food was 1000/10 . So good , everything came out in a timely manner, food was hot and great portions. Servers was very nice and helpful throughout the event. The owner Elvis catered to all our needs and was very attentive to our party , making sure everybody got their right order and drinks. We thank this restaurant and their team for an amazing outcome and would be back to enjoy this restaurant again !!!! Would recommend this place in a heartbeat."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNE9HSDBRRRAB",
            "text": "Nice place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmN3FIV0JBEAE",
            "text": "What a great night with my husband , sis & brother-in-law . From the beautiful atmosphere, lovely warm greetings when you walk in , great drinks & bartender , great food & service , great menu options to choose from . Nice background music ! Definitely will be back ! Nice neighborhood spot 👍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmLW9HQ0xnEAE",
            "text": "I highly recommend this restaurant!  My family had a lovely experience at Misto just before Thanksgiving.  Violetta was the perfect host, and all staff were friendly and accommodating.  The food was great, and the atmosphere was warm.  We had a leisurely meal with drinks, appetizers, pastas, proteins and dessert.\n\nIn particular, the arancini (appetizer), the tartufo (dessert), the spaghetti carbonara and the pasta special were excellent.  The broccoli rabe (side dish) was perfectly cooked and seasoned.  They made up a salad for us and it was soooo good - the dressing was amazing.  Wish I had asked what it was.\n\nAdded bonus: free parking."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcXJxc0xBEAE",
            "text": "Amazing place, wonderful people working there, food is great as well! Would totally recommend. Don’t miss the best Italian restaurant in the Bronx!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NC1EOVN3EAE",
            "text": "I took all of my friends to this restaurant for my birthday dinner and it was perfect. The staff was great. There was italian music and the atmosphere was so nice. The food was also great. Overall wonderful experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIM2JmVjdRRRAB",
            "text": "I picked this establishment to celebrate my partner's birthday. Service was excellent. Alicia made delicious drinks and was a great server. We recommend the bruschetta. The entrées were delicious. We are very satisfied and would love to dine here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXBuRnBnRRAB",
            "text": "Hidden Gem in the Bx.  The place is nice.  Inside and outside seating.   Plus seats at the bar.  The service was great.  The food was really good.  The appetizers and main dishes were delicious.   We will definitely be stopping by again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeHRXYWdBRRAB",
            "text": "Very pretty and cute interior, felt cozy. However, when I was there there was only one worker and therefore service was pretty slow, but I guess the service was pretty friendly still. We didn’t get water until after we finished our appetizer. Also paid in cash at the end, but there was an auto-tip included in the final bill which I didn’t expect (was not sure if there was a disclosure on the menu).\n\nOn another note, the food was pretty delicious! I got the chicken mazzei with calamari. Very saucy. I was impressed by the calamari and dipping sauce selection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcGJDb3V3RRAB",
            "text": "I was looking for an Italian restaurant to celebrate my Sweet 60th birthday with family and friends.  I knew this was the place because it had that vibe and authenticity— the owner the chef and the crew !!!\nI must say I had the time of my life as well as my guests. They’re still talking about it🥰"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NHQyT2lRRRAB",
            "text": "I wish I could get a refund. Not pleased at all with this simple meal. I ordered the grilled salmon with mashed potatoes and zucchini. The salmon was dry (overcooked and hard), potatoes flavorless and lukewarm and zucchini was the same. I was looking forward to coming here because of the reviews and well, needless to say I was totally disappointed and unimpressed. And I wish there was an excuse like, it was really busy this night, or I had a large party, but no. It was a party of two and it was not busy at all. While the waiter was nice, I realized that they did not check on my table at all to see how our meal was or if there was anything more that we needed. I also asked for warm bread and butter with olive oil thinking this is a normal thing at an Italian restaurant, but the bread and butter were cold. Couldn’t even spread the butter. I didn’t order any appetizers ( thank goodness) because I definitely thought bread was soon coming out to the table. (It didn’t, I had to ask.) I even asked nicely if I could have “warm bread please” and it came back burnt. (I didn’t get the picture of that because I had them take it away.) It was hard but the server said they had toasted it. I just wanted warm soft bread and butter. With the price I paid for my meal, I would have never expected the quality I received. I worked my way through as much as I could because I didn’t want to be “that guest”, but I was truly let down. Night ruined.\n\nKitchen: There is no way that the same crew that cooked for other reviewers was the crew working during my visit. The evening crew did NOT give one care about the food they served.\n\nAtmosphere: The stereo was too loud and random commercials would blast from the speakers. Lighting and patrons were cool.\n\nWaiter: Very polite, but I was noticed he did not check on our table after the food arrived. It was hard to get anyone’s attention. I wondered if it was on purpose."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOThlUTZRRRAB",
            "text": "My husband and I went there for our anniversary dinner last night, and it was breathtaking. The atmosphere 👌 live jazz, the serve/bar tender Joseph was awesome.  He was able to recommend the food choices and drinks choices, and he was right on the money. Mt mouth is still watering 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5LXFiU2l3RRAB",
            "text": "From the minute we walked in to the minute we left, we had a great experience. The drinks were on point and I must say the wine list was very impressive. The waitstaff was very attentive and answered all our questions about different items on the menu. What’s nice about this menu… it’s different! We had Brussels sprouts and tripe! Two things we almost never order at any restaurant but this place knocked it out of the park! For dinner we had the chicken martini which was absolutely delicious. Compliments to the chef! Can’t wait to go back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdnBxUGFBEAE",
            "text": "I dined at Misto for Sunday brunch with my aunt and had a great experience. The staff was welcoming and very attentive. The ambiance of the place is beautiful and the doors open up to allow for an indoor/outdoor dining experience. The food was amazing. I had a grilled chicken BLT while my aunt decided on the frittata. We both enjoyed our food so much and agreed to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdU1UNVFBEAE",
            "text": "Really nice and fancy spot. Food was really great and upscale. Great spot for a date. We came in on Thursday evening and a jazz band kept the atmosphere nice. The bruschetta was awesome so was the vodka pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCa3NmSGRREAE",
            "text": "Where should I start????  Omg!! Omg!! Omg!! Honestly THIS IS A TRULY HIDDEN GEM IN THE BRONX! yes!! No doubt! I wouldn’t be surprised if this place gets a MICHELIN STAR SOON. The Venue is a fusion in between Europe and New York  style; when you walk in you will feel transported to midtown Manhattan which is wonderful. The food menu has variety in. Appetizer and entrees. I decide to eat the tuna tartare  it was delicious, fresh and tasty, the fig and goat cheese salad and it was the bomb!! Boom! The feeling of the salty and the sweets all together were a party in pale so yummy. AA an entrée I had the lamb martini and the flavors and texture were indescribable the chops were so tasty, thin and tender 100% recommended. Let’s talk about the attention, well the staff very attentive and nice. About the atmosphere  it felt like dining in Europe the live music made me feel so far away the singers were great! You can. Find live music every Thursday night. Reservation is STRONGLY RECOMMENDED so plan ahead your trip., if I could give 10 stars I will to\nThis place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M3REVEhBEAE",
            "text": "Excellent Italian food made from scratch.  Went here for Mother's Day.  Nice outdoor seating. It was so busy, service was slow but very nice. It's expensive but worth every penny."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcjdfbEdBEAE",
            "text": "We loved it and will be back. Great lighting. Super clean. Server was great. And the food soooo delicious. We had rack of lamb. Huge portions. First hot bread with garlic herb butter. Yes. I am in love with Misto."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREay1lUDBBRRAB",
            "text": "Amazing food and drinks! Sonia is on top with delicious drinks and friendly service. Had the pizza and purple potato gnocchi w/ vodka sauce 😋 Dont forget dessert!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ05mai1nRRAB",
            "text": "UPDATE: 12/28/22\nHad the 14oz New york Steak and it was mouth watering. I was also able to try the salmon Pesto which was delicious. The chicken martini was also delicious like always. Our sever Alfred( sorry if I got your name wrong. It was a bit loud lol) for him being the only server taking care of all the tables in the house and also getting drinks from the bar was the best server I've had in a very long time. Not once did he lack on service and professionalism for him being all alone and I tip my hat to you. The owner Anthony doing what a boss does in taking care of his business. Can't wait to go back soon to hopefully celebrate my birthday lol... happy holidays\n\nCan't wait to go back. The food was hands down the best food I've had in a long time when dinning out. The appetizer was incredible which was the boccocini, the drink which was a heaven martini ( which really was heaven thanks to Gabby's angelic hands who made the drink). The chikent martini which I forgot to take a picture of because it smelled so good when it arrived and was delicious to the last bite. Down to the desert which was a lavender creme Brule that made your taste buds sing. I will be going back bery soon, if if it's just for the apps n drinks lol\n\n***SATISFIED CUSTOMER ****"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodVpuT3lnRRAB",
            "text": "Nice Fusion of Italian and Mediterranean food. Very clean and convenient with parking lot behind the restaurant. Linguine with white clam sauce was very good and tiramisu was also yummy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMThEVmlBRRAB",
            "text": "I went with my wife on Sunday and we had a great time. It was very quiet inside with a nice vibe and the music playing that was not blasting, so we did not have to yell to speak with one another. We ordered two drinks, an appetizer (escargot), an entree (fig salad with chicken), and I wanted to try the tacos as well. Everything"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaUtpdmxBRRAB",
            "text": "Sonia was a great waitress. First time there. Appetizers: arancini and calamari both were delicious but the arancini was top tier. Entree: Chicken martini and stuff pork. Chicken is a must try. Dessert: lava cake with ice cream…YUM. On to the drinks. All were perfectly prepared. Lychee martini was good. Strawberry martini was delicious!!! The espresso martini was my favorite of the evening"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcGF5U3NRRRAB",
            "text": "Been here a few times for dinner. Enjoyed it so much I took some clients to dinner for the holidays.  Have enjoyed the food and friendly service each time. Menu has plenty of delicious options to choose from. Also a nice selection of specialty drinks and wine list. The Lychee Martini was superb. One of the best restaurants I have dined at the last couple of years. The food never disappoints. And the free parking in the back of the restaurant is a plus!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMmVlckh3EAE",
            "text": "Decided to try Misto for brunch and was not disappointed! The crab cakes were delicious, as were the homemade fresh burrata. The bottomless mimosas were perfect to taste as well. Will absolutely be back again soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtczVUUkFREAE",
            "text": "This place is super cute. The vibe is dope for a date or even happy hour with friends. The appetizers were great and the food was a great plus. Would definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtZ0t5STJRRRAB",
            "text": "Wow, just left.  They hosted the entire United States Navel Academy water polo team - 36 hungry guys, and then hosted the parents.   Food was fantastic for sure.  Best Italian meal I have had in a long time.  Definitely recommend to anyone in the area.  Cute corner Italian restaurant, awesome food, good entertainment, and fantastic owners!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacFBUNHBRRRAB",
            "text": "Small neighborhood establishment, cozy atmosphere, European feels, perfect for a night out, usual drinks, tasty food, good dishes to share, slightly overpriced."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cjVmMHRBRRAB",
            "text": "This place is simply awesome.  Drinks, appetizers, entrees, and even dessert blew my expectations away.  Gabby, our bartender and server, was just amazing. Food was so good only got a photo of the crème brûlée because you just want to eat the minute you smell everything.  Thanks guys.  Def will be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LWVpV1BnEAE",
            "text": "Gentlemen, if you want to take that special someone' for a romantic dinner and cocktails, no one beats this place. I’ve taken a couple dates here and they absolutely loved it. The food and cocktails are top-notch. Violetta, the  bartender and Elvis, the server are super accommodating..\nI highly recommend it, she will love it!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcmZQSUZnEAE",
            "text": "Amazing place for family Sunday dinner.  First time and great service and food is amazing. And the best coconut mojitos from Javier. Will be coming back Thursday for live bands for date night. Food was great as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbk43YXVnRRAB",
            "text": "Such a great restaurant! Staff are attentive and the owner is extremely welcoming. And the menu? Forget about it! Options for everyone. Cannot wait to come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM3JQaUx3EAE",
            "text": "I came here for my birthday and this experience truly helped make my day. The customer service was exceptional, the food was fantastic!! The portion sizes are definitely worth the price as I was stuffed from just the appetizer 😅\nBut it was truly a great experience. I’ll definitely visit again."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadU16dXlBRRAB",
            "text": "9.03.2023\nI was driving and looking for a different restaurant, and by chance, I found MISTO. If you want to eat in peace, with good taste, and you want to think that you are in Italy in a restaurant in a small town, with a family aroma, MISTO is the place.\n***********************************\nEstaba conduciendo y buscando un restaurante diferente. y de casualidad encontré a MISTO. Si quieres comer tranquilo, con buen gusto, y quieres pensar que estás en Italia, en un restaurante de un pueblo pequeño, con aroma familiar, MISTO es el lugar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmZTQmNREAE",
            "text": "We went on a Friday evening. There were not a lot of people, so it was perfect for a small dinner with lots of conversation. The atmosphere was quiet, the music low, and we could hear each other talk comfortably. Is it always like this? I don't know. It was our first time. The server host was very attentive. Food was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREazlmbmZBEAE",
            "text": "This place is so cute and nice!!! The staff is so kind and they genuinely care about your order and ensuring your experience at their restaurant is an amazing one. Speedy Service with a smile!! If you want an amazing drink no matter what it is my girl SONIA WILL HOOK IT UP 👏🏾👏🏾👏🏾👏🏾 The Peach Fairy is delicious. Definitely 10/10 would recommend and coming here next time I’m in the city ❤️😍😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaZ0xmX2d3RRAB",
            "text": "Very tranquil it was my first time I just came in because I was very hungry the salad was great the service was amazing I will be returning"
        }
    ],
    "reviews_count": 81
}