{
    "name": "Seafood Kingz 2 Inc",
    "place_id": "ChIJB3i5ONeNwokR4Y9os9_gEo4",
    "grid": "BX10",
    "address": "634 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4,
    "user_ratings_total": 344,
    "phone_number": "(718) 975-7447",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MWVrSkRhbVJ4VWtWUVpFaGZkbHByY1dSb1RGRRAB",
            "text": "Never again I’m better off going to Harlem"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM1ZYcEdXa3h3VDBSSGRreGxla3QzUjJGZlduYxAB",
            "text": "I liked the food, unfortunately it’s been closed down by the landlord . It’s no longer available in City island"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdGRFTjZMVmMyYUVoQldYbFJhMFV0VUhwalZuYxAB",
            "text": "This place is closed. Tried to go, and there is a Marshall notice on the window"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFVGcEJPVzFUTlU5TVpEUlpMWE5PVWkxRVJVRRAB",
            "text": "THIS PLACE IS PERMANENTLY CLOSED!  I WENT TO CITY ISLAND HOPING TO GIVE IT TRY.  SORRY THAT THINGS DID NOT WORK OUT FOR THEM."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aelRFbDZOVXRxWTJJeWNTMWxabFZaWms1bGQwRRAB",
            "text": "I couldn't tell you how it was because they're closed. Google shows them open but they are closed by the Marshall"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVEwOUxiM0Z5VFROWVlUTXhZamxKYURWTFVuYxAB",
            "text": "King Crabs, Salmon and the jumbo shrimp, oh my goodness so good. We swing back around for another plate."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOWZYRVFBEAE",
            "text": "As we say in Italian \"Tutto 'e delizioso!\"\nOn Thursday, April 17, 2025, at 6:30 PM the steamed salmon with broccoli was ENJOYED by me. It was mouth-watering & a culinary delight! This is a GREAT! meal if you enjoy salmon; the seasoning tempted my taste buds.\nWill definitely be venturing back to City Island's \"Seafood Kingz\".\nThank you, \"Seafood Kingz\" for a wonder culinary experience.\nTook my food to go to be able to sit in the park across the street in the beautiful evening sunshine; again, thank you \"Seafood Kingz\"!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOGIzbkxBEAE",
            "text": "Black owned business 👌🏿"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMUxLV3FBRRAB",
            "text": "Good customer service and friendly staff. Atmosphere was small but cozy. The food was sub-par, average, mediocre. We had fried fish & shrimp, fries, salmon cakes, mac and cheese, potatoe salad, wings. All of these choices were not satisfying to the taste. Good size portions. Unfortunately we were not swept away by the taste of the food and may not be returning back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMWZxMTNRRRAB",
            "text": "Shows open at 12 its about to be 2pm still closed"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncThTNjlnRRAB",
            "text": "Subject: Feedback on Catering from Seafood Kingz\n\nHello,\n\nWe recently had Seafood Kingz cater a work event, and unfortunately, the food did not meet expectations. The mac & cheese and rice & peas were both dry, the fish lacked seasoning, and the chicken tenders were dry and slightly overcooked. The only items that were well-received were the fried shrimp and collard greens.\n\nThis feedback reflects the opinion of the entire office. Additionally, the delivery was late, which further impacted the overall experience.\n\nI hope this feedback proves useful for future improvements."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N096SGdRRRAB",
            "text": "Food wasn't fresh. Fried Chicken wingettes were trash - couldn't eat it. There was a scent and twang to the chicken with the first bite. The greens weren't clean - the juice was dirty. Watery sweet potatoes. Another order of chicken and Fries were dark and clearly cooked in old oil.\n\nThe cornbread was good - tasted like cake!  However, the owner was pleasant and tried to accommodate us but we were completely turned off by the quality of the food.\n\nHighly recommend management check the kitchen before serving food. Spent $350 and left dissatisfied."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMDhMVmlBRRAB",
            "text": "My siblings and I really enjoyed our food and time there. Our table was ready at the time of our reservation, the service was amazing, and the food was delicious!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQb3FhcnV3RRAB",
            "text": "I came out to soul kings on City Island  on 11/12 /24 and again  today 11/22/24 and they were closed, both times I came was after 12 noon,their site shows  that they open at 12 pm, there's a sign in the window and on the door that says open…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzemZqZHp3RRAB",
            "text": "I love the booth is spacious more than enough time on the table for all yours plates.. my favorite is the cornbread I be tearing them up.. then my first favorite is them wings crunchy perfect seasoning..I always order extra to take home.. and my other first favorite is crablegs boil.. the flavors blend together make everything taste soo good  everything good down to my titos club soda and lime...im here once a month since it open..i love this place ..and there is always entertainment happening"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdUxqTV93RRAB",
            "text": "For the prices I just expected a Lil more flavor in the food i ordered the triple threat Mac and cheese was ok candied yams where great chicken and fish and shrimp was a Lil on the bland side but I will definitely try again to try different menu items but only because it's black owned!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMjlid3d3RRAB",
            "text": "A group of ten people vist your restaurant 9/28 we were VERY DISAPPOINTED to say least your food was TRASH.  One star was to good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcTgzLWtnRRAB",
            "text": "Our church family visited this restaurant on Sunday, we were met by the owner and everything from there was excellent, but most of all the food was delicious and the servings was plenty, I strongly recommend this restaurant and I'll take my family there soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaGZmQTBBRRAB",
            "text": "Delicious food, wonderfully prepared. Took home Mac and cheese for the next day. Really good drinks too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3c3BLX1BnEAE",
            "text": "I enjoyed my meal. The food was nicely seasoned. I'm looking forward to trying other things on the menu. The tartar sauce was tasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOXRlejhBRRAB",
            "text": "The food is mediocore, unseasoned and the serving sizes are ridiculously small. The containers that hold the ketchup are nasty and need to be cleaned.\n\nCurtis asked us how we liked our food and I was honest in telling him the collard greens are unseasoned. He said his senior customers don't complain about it and he has to accommodate their needs. That's fine but if he wants non senior customers, he has to do differently. He was also curt and has a chip on his shoulder. They also need to crank up the air conditioning. I will not return to this establishment.\n\nI've also noticed the owner replies to negative reviews with nasty comments, which says a lot about his character. It's unfortunate, he cannot take constructive criticism and use it to improve his restaurant. Skip this place and go elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNGVHSDhnRRAB",
            "text": "Wow the food and service was horrible. You would expect better from a black owned business. But when you see a place empty that means don’t go in. It is empty for a reason."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib2Rfa3FRRRAB",
            "text": "The food was terrible and so was the service, the waitress didn’t care to do anything besides play on her phone because she’s going to be getting a tip either way because it’s included in the meal on the receipt already the food was terrible my aunt was here a year ago and recommended it for us I honestly will never eat here again and do not recommend it to anyone ever. good luck"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdnMzbUlBEAE",
            "text": "Collard greens are tasty 😋 food is great 👍🏼 customer friendly place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMXzh5TGV3EAE",
            "text": "Great music food and service..Thursday night."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaM0p6SXlBRRAB",
            "text": "Always a great experience.  Perfectly seasoned seafood. And that cornbread is delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6anZlcTF3RRAB",
            "text": "The food is good, but! The service was horrible! The waitress was only interested in watching a hockey game on TV. If I wanted service, the most basic of services,  WATER! I had to get up and make it happen.\n\nMy table wasn't the only table that had to get out of their chair for her attention.\n\nI learned the reason why, the tip is already included!!!! SHE DOESN'T CARE!!!!!\n\nThe two men there Curtis and the other gentleman, GREAT!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbmRHR0Z3EAE",
            "text": "Excellent Food And Service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOHNPWTNnRRAB",
            "text": "Food is delicious  but a little salty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdE9PaTNBRRAB",
            "text": "I usually do not write reviews, but I did have to for this place.\nThe owner has really great customer service & is really warm hearted !\nYou can tell he is very passionate about his establishment!\nI wish you the best of luck with your business.\n& the cornbread was bomb !! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbnZhU1ZREAE",
            "text": "I know seafood is expensive. Everything on City Island is expensive, but if you want fresh and tasty food! This is the place to go. The people were pleasant, the food was packaged neatly, and the place was clean. No complaints here. It was my first time and it was a good experience. They also have some more affordable options. The food is worth it though. I was not disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeXRmUlh3EAE",
            "text": "I would never eat at Johnny's Reef again.  Seafood Kingz is BUSSIN."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ak5PWi1BRRAB",
            "text": "I visit soulful Kings on today, and I ordered shrimp along with two sides, mac & cheese and yams. The mac & cheese was very dry seem like it’s premade and prepackaged and warmed up in the microwave yams seem like they were sitting in syrup for the longest time the food seem premade and prepacked and warm up in the microwave. The only thing that was good was the shrimp, . Very disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5LU0tbjlRRRAB",
            "text": "Great food Darryl was very helpful!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbl9mSmd3RRAB",
            "text": "The best spot in the tri-state! I wish there were more locations but definitely worth the trip up to City Island."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoajdPSm93RRAB",
            "text": "Went to this place because I saw it on the news. I ordered take out; salmon and mac n cheese. It was $45!  I asked why so much for one order and the worker said \"well it IS city island\".  Guess that means they can over charge.  Food was OK.  Definitely not worth $45.  Place was empty too. Not sure if thats good or bad.  Dont think I would go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNGNDdjZRRRAB",
            "text": "TRASH! Avoid! The owner should be ashamed to tell anyone he is the owner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcm8yZHh3RRAB",
            "text": "If you know me you know I always have referrals for good businesses. My family decided to support a black owned business for my cousins Birthday,  so we went to Sea Food Kingz . What a terrible idea! What a waste of my hard working money! Let’s just say they made us say “this is why people don’t go to our own kind) smh. I don’t know what upset me the most….   the slow service or everyone at the table getting their food at different times or everyone not getting part of their order or the owner showing no type of empathy commenting “oh well if they didn’t get their full order, it’s still part of the combo and they have to pay it” along with him saying “we were bombarded by our party” (which they were aware we were coming 9 adults, 2 kids) or us having to wait till the food was done being made to get a drink from the bar or him giving my grandmothers food to my uncle and the owner saying “well he should of passed it to her once he opened it & realized  the restaurant gave the wrong person the wrong food 30 mins after! Or them reheating the food they gave my uncle to my grandma or just the OWNERS attitude as a whole! Never again will I go there and you shouldn’t either 😩 they do not deserve ANYONES  hard working money. ✌🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWa0xlSVJ3EAE",
            "text": "you know that happy dance? i did that when i got my food and tasted it. crispy but juicy. i can’t describe happiness but this was it. thank you for curing my sadness,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOFlhVERnEAE",
            "text": "Everything on point"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbDd1aWp3RRAB",
            "text": "Excellent place!! Our family loves this great spot on City Island. Great atmosphere and music, the seafood is so delicious and fresh! We are making it our regular  go-to spot. Just go!!! You will love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGaTRTYjR3RRAB",
            "text": "I drove by this restaurant the last time I came to City Island, and something made me want to try it, so I looked it up and saw the reviews. Once I saw it was black-owned, I had to give it a try. I took my good friend here one Saturday afternoon, and we were not disappointed one bit! We were treated very nicely from the time we walked in, seated, and tended to. We felt very welcome and safe; the atmosphere was one I was comfortable with. Everything was delicious. I still have my mind on my friend's fried shrimp, and next time, that's exactly what I will order. The salmon was cooked very well, the shrimp and vegetables were full of flavor, the cornbread was so moist and buttery, and the drinks were excellent! There is nothing we did not enjoy. not to mention there’s a parking lot in the back and I was blessed to get a spot. This is our spot from now on, and we will be returning pretty soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcGNTNU93EAE",
            "text": "Coconut butterfly shrimp was my favorite! The Mac and cheese was really good. The fish and chips were great too! I would recommend this restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NnVuZmN3EAE",
            "text": "There food was amazing…I ordered the Mac & Chz, shrimp & fish dinner combo. My man ordered the Triple Threat Combo & side of broccoli. It was nice & quiet and calm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NnZiNWt3RRAB",
            "text": "My family & l  Went to Seafood Kingz on Saturday after Univer Soul Circus the food was delicious, the catfish was superb & the cornbread delicious, the food was piping hot, the service was a little slow . The drinks was on point. The mac & cheese not so good.   I was very surprised that so many people of color go to city island and  this restaurant was empty.  Show some support!!! The food is seasoned better than a whole lot of restaurants on City Island..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a3FtM0tnEAE",
            "text": "Excellent food, cooked to a delicious perfection."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1bkl2a2dRRRAB",
            "text": "Great service great waitress she remembered the drinks I had 2 months prior"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1c2RUR093EAE",
            "text": "Omg every time I come here it’s amazing. Tonight we celebrated my aunts bday. From beginning to end the hospitality was super great. Ms Kim thank you for being our waiter, Mr Curtis thank you for attending to us. Thank you to the amazing chefs. On top of Mr Daryl what   a way to be a business owner. You greeted us coming in and made sure we were happy leaving. We will be back. It’s my third time coming so guess what won’t be my last. Thanks a bunch God bless Marshay H💜"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNy16d2VBEAE",
            "text": "Food and service was terrible. Not to mention we got food poisoning from the food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaZ091V2p3RRAB",
            "text": "Food is Slap yo 😋 mamma good. Lol"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeFphTElREAE",
            "text": "I'm elated to share my experience here. The food was traditionally fantastic. I ordered catfish and shrimp. The shrimps here are the hit! Not that the catfish was not enjoyable by any chance! I was pleasantly surprised by the delicious and perfectly cooked vegetables as well, equally as good as everything else. Took a piece of the kids whiting ... slamming!!  Prices are very reasonable for the amount of food. I had to take about half of my meal home it was that much food. Staff is comfortably friendly as well. Will definitely be back and I'm so happy that we have this option on City Island. Thank You!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NmVyV2d3RRAB",
            "text": "The seafood here is delicious and the staff are so nice! We had the crab cakes, all catfish basket, steamed red snapper, and collard greens. The corn bread was delicious too. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMC02MGZ3EAE",
            "text": "1st experience today with family. I'm going to give it 3stars to be fair . Because it's fairly new to City Island, they will need to do more to stay. The location is horrible. Awesome, because it's right over the bridge. Horrible because it reduces accessible parking. It advertised the hours of operations, and that was false. People stood outside in the cold. The service was super slow. After being seated, we ate 46mins later. The appetizers, came out with our meals. Then to top it off, nothing was hot. Every dish was luke warm. Your beverages are served in kiddie cups, and your bill is a guessing game. As the prices are not programed into the system yet. I would say I was disappointed. But that wouldn't be fair to them. But I have FAITH, It'll get better. We're going back in another month or two. And we'll review again.\n\nGood luck"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdF9ENFN3EAE",
            "text": "Update: they now serve liquor. 1/17/23\nWe went for lunch today and it was fantastic.  The chicken tenders and catfish with fries were fresh, delicious and really a good deal.  We got some corn bread on the house and it was amazing, so tender and tasty.  We will be back again soon.   The service was excellent as well!  Really nice owner!  Wish I had some pictures but we ate everything before I realized! Just added some pics from today 1/17\nOur first visit was when they first opened so it was a bit chaotic and they didn't have all the menu items but we did enjoy the shrimp and the mac and cheese on our first visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1akl5WGN3EAE",
            "text": "First time at Seafood Kingz 2 and can't wait to be back (hopefully with some friends) to try more of their menu! Got the steamed shrimp and broccoli, which I was worried might be bland bc \"steamed\" but it was delicious & coated in buttery goodness + came with a side of sweet & mildly spicy dipping sauce that added a nice kick. The shrimp were huge & tasted fresh, as were the veggies. Usually steamed veggies are overcooked & mushy, but these were bright and flavorful. The cornbread was also yummy. I rode my bike over from the West Bronx and there was a bike rack right out front I could lock it to and keep an eye on - convenient! I brought the food across the street to the little park and ate it on a picnic bench facing the harbor. Everyone I encountered on staff was really nice. They opened maybe 30 minutes later than their advertised time of noon, but their kitchen was clearly already ready, and food came out in a reasonable time and piping hot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyektyMEl3EAE",
            "text": "I visited to support but was disappointed with everything. Menu is not as colorful as the rest of the strip restaurants by limiting food choices to only fried,  fried, fried. Toilet paper is so cheap it rips after every ply you pull. Floor is very slippery as the place was extremely hot inside with no circulating air. Even as dining in you get all cheap small plastic wear. Mac&cheese very dry. Corn bread tastes like cinnamon and dry. When I went there was no liquor license yet.\nStaff needs lods more PR training. Btw, tab was hefty.\nAs they are new, I do hope they fix these issues as I do like to support the black-owned community and hope to be back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleGFTYThRRRAB",
            "text": "We had a great time traveling to City Island to grab a meal at the uniquely Black-owned Sea Food Kingz.  This was our premiere venture to this restaurant establishment and we weren't disappointed.  The atmosphere, food, and customer interactions with the owner Darryl were all A#1.\n\nWe highly recommend this restaurant for anyone seeking deliciously seasoned, freshly prepared seafood and more.\n\nThe dishes that Gordon Gordon and Heart Leake enjoyed had the perfect amount of seasonings to uniquely enhance the flavors without overwhelming the natural tastes.  We were informed by Sea Food Kingz manager that there is no cross-processing in the preparation of the food items, i.e. shellfish, seafood, potatoe fries, chicken, are all cooked in their own separate units.  That is so incredibly awesome.\n\nAnother piece of great news directly from the owner of Sea Food Kingz restaurant rear parking is available ☝🏿"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXX3BIVFB3EAE",
            "text": "Had coconut shrimp and fried wings with sweet chili sauce, both were ok. I came with other people and their chicken tenders were over cooked but catfish was good. The whiting fish was good and also the regularfried shrimp was good . I was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX1lhNU5REAE",
            "text": "Delissshhhhhh-cious! Don't forget to get a tater (potato) salad to go! You will not be disappointed. Hospitable, family establishment, great food, great people, sizeable food portions, clean and did I mention great tasting food?! 🙌🏽 Lol. Get here."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyXzRmbjJ3RRAB",
            "text": "I wish I could give more than 2stars, but the consensus at the table was mixed from the appetizers to the entree plus there was no full bar. For the price and the amount of food, I was expecting  better tasting food overall. The steamed…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdU5mV3NBRRAB",
            "text": "6 person family ,  the restaurant was very accommodating , wheelchair, walker, and possibly a small scooter accessible. The staff was on point and very helpful. I am a disabled person. They watch me all while I waited for my disable transportation.\nI went across the street to take pictures in front of the water. . The staff without me, asking them to came out of the restaurant to help me to get back across the street, so I can  wait for my disabled transportation. Disabled people are really welcome there. They have this family feel to them.  The food and drinks are Incredible. !!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOUxIeGxnRRAB",
            "text": "FINALLY!  I got to experience the only Black - Owned Restaurant On City Island.  Max, thank you so much for taking wonderful care of me even, before your Restaurant was scheduled to open.  The candied yams were EVERYTHING!  The Lemon - Infused Tartar Sauce So Divine -- I had to take an extra one to go along with a dessert slice of chocolate cake!  Max and Darryl Thanks So Much For Your Wonderful Service And Hospitality!\n🌟🦋💛🦋🌟 Adrianna🌟NYC🌟🦋💛🦋🌟"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMkxYa3d3RRAB",
            "text": "I'm still licking my chops over the fabulous coconut shrip in this restaurant. They serve a fabulous array of southern style seafood like his Mama used to make. The proprietor was friendly, open and generous. The food was to die for. No fancy, trendy, splashy venue. It's all about the food and about the people. Hope this little restaurant blossoms into a large venue where we can all enjoy the food for years to come."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaVBxc2d3RRAB",
            "text": "My Husband has been talking about this place and finally brought me some home and I was very disappointed. The whiting was definitely made from frozen fish and the batter it was fried in was not what is used for fish fry. (Seemed to be a cheap tempura batter). Hopefully this was a bad day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OXR2MllREAE",
            "text": "Food was delicious and plentiful.  I ate off it for 2 days with my to go bag. What makes it a soul food seafood restaurant were the sides. Collard greens,  baked macaroni, candied yams, potato salad.  The menu is limited but nice choices.  At least for me. Small establishment with tables and boothes. Take out available."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyLUtMQ3VRRRAB",
            "text": "Food was great for take out.  In door dining needs Improvement.   But the food is worth the trip to City Island."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeS1mQW1BRRAB",
            "text": "Food was great. The Tartar Sauce and Cornbread were amazing additions."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyLThUUTlnRRAB",
            "text": "I wrote a long review some where therefore I'm to lazy to write it  again lol .Our food was soo good .Our seafood tasted like it was fished out the ocean that day .everything was nice and Tasty  . Customer service was everything .We had a good time the energy was everything. we will be back.Thank.you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM28taXZRRRAB",
            "text": "I've visited a few times and I really enjoyed the food. Great flavor on the catfish; it was seasoned well without being salty. One of my fav's was the potato salad. I was skeptical to try it, as not all potato salad is created equal! I was pleasantly surprised at how good it was. The space is kind of small but it's very clean, the drinks were nice and strong, and the staff was friendly. A great combination for a restaurant to have. I'll definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNExTWDlRRRAB",
            "text": "Best seafood I’ve had in a long time. Plenty of food for your $$$ and flavorful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwZ2VfWHZRRRAB",
            "text": "I kept saying, I am going and today was finally the day!  I was so pleased.  It's not a fancy place, but it's a cozy place.  The people are friendly and engaging.  The drinks are delicious and not watered down.  The food was delicious.  It came quickly, it was hot and it was good.  We were there for the lunch menu.  You CANNOT get a better deal for lunch than Seafood Kingz 2!  Come out and support this amazing business!  My family and I will be back.  We ordered take out from the dinner menu for later.  I am sure we will enjoy the potato salad, collard greens, cabbage and yams!! Treat yourself!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaE9Uanp3RRAB",
            "text": "My family and I dined here for a graduation celebration.  We had a large group, we didn't call ahead, however, they accommodated us the best way they could and we were fine with that.  The service was great.  The young lady who took our order was quiet but attentive.  We were able to make requests after we placed our order to the other staff that was there and they kindly obliged.  My picky child loved the crab cakes.  The cook bought us our food and made sure everything was good.  We observed many customers coming for take out, including your friendly neighborhood beat police officers.  We loved that they served a basket of cornbread instead of bread.  The cornbread was very good.  The potato salad and greens tasted like down home.  The catfish and shrimp was NOT over cooked and most importantly, the breading wasn't hard.  The music played was a combination of 'Old School' R&B and Hip Hop - the good kind.  The music was loud enough to hear but low enough that you can speak at a regular tone without raising your voice.  We love the book recommendations that they had on the wall shelf near the bar.  My old school grandmother was very happy that they added cherries and cherry juice to her coke - without the extra charge like some other places.  We plan to visit this establishment a few times a year."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNnEyMlZnEAE",
            "text": "Easy going establishment; good for whole family. Good dining music (not too loud)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMTVqQllREAE",
            "text": "I would love to be writing a great review in order to support black business but I just can’t. Having worked in the restaurant/bar industry for some time I would not recommend anyone to eat in at this establishment, I even wanted to apply here to help out until I saw what it was like. At first it seemed to be nice but I was seated with my mother and was asked if I wanted a menu.. for a new establishment… After some time I had my drink order taken which was a simple 2 waters (which is bottled Poland spring) and a lemonade which I had to ask again after an hour to receive. The food took forever to come and my server was on her knees taking orders while not seeming to have good knowledge of the menu. While waiting 2 hours or so for my food a lady came out from the kitchen and was sitting in a booth next to us… TAKING OFF HER SOCKS and just letting her feet out in the middle area between the booths. That’s absolutely disgusting to see in a restaurant and I didn’t even want to eat here, one order was cancelled and we asked for the check as soon as the food came  because I couldn’t bear to sit in that place any longer. It takes about 30 minutes to be able to get the check pay and leave as well. The owner said he didn’t care about reviews and honestly I don’t think this place will succeed as a restaurant but good luck. Maybe it’ll survive off of take out orders. Shrimp is great though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdGYzS1dBEAE",
            "text": "Customer service was very good! The decor is very nice clean an relax vibe! Good for a date or group of friends! Fish (whiting)was very good! An so was the shrimp! Not salty at all! The cornbread was very good I had to get a second one! Loved the broccoli! Me an my guest didn't like the mac&cheese! The collard greens was ok!   The ice tea tasted like is came from the can! I will be back to support this business  an to try some other dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdXB5U2p3RRAB",
            "text": "I had a wonderful experience. They were kind and the establishment very clean. Darryl, the owner I believe, was very courteous and checked to see of my party was satisfied frequently. In comparison to the dine in restaurants on the island the pricing was appropriate. There is parking available in the rear. The food was delicious so much so that I ordered additional food to go. If you are really familiar with food establishments on city island you would know that the food here is of better quality than most. I totally support having a black owned business on the island in lieu of supporting white businesses that have sold inferior food to ppl of color for many years that is highly priced in comparison to the other food being presented at the other establishments. As a Bronx native and over 40 years of dining on the island I applaud the opening of a soul food restaurant there especially since I’ve never seen a black employee at any of the other restaurants. While this is a restaurant it brings more than just food. It brings a historic venture and I applaud the risks of entering into a historically racist place not only for businesses but the ability to even live there. I pray for the longevity of this business. My entire party loved the food in relation to the price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdGZhTlRREAE",
            "text": "The food was a good proportion and tasty, the service was great AND the drinks were bomb. My issues are the temperature inside of the restaurant was extremely hot, it was cooler outside on a summer day. The other is that the if the regular and large drinks are double in price they should at least be double in size, preferably more than double, and never less than double as they are at this restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXblB1SHdnRRAB",
            "text": "My dad and I went to Seafood Kingz today and had a wonderful time! It’s rainy outside so there wasn’t a huge crowd. The restaurant was moderately filled. We also ordered thirty minutes before coming in to sit down and eat so maybe that helped. We ordered the fried shrimp, fried catfish, Mac and cheese, collard greens, and rice & beans. It was all good but my favorite was the fried shrimp and collard greens! The people working were really accommodating and kind.\n\nI’m aware that there are some low reviews posted, but I urge people to consider the fact that this restaurant received a huge amount of publicity upon opening. Due to that, there was a huge demand that they might’ve not expected, and therefore were short staffed. It’s so important to uplift people, especially when they’re the first to do something this amazing! Extend a little bit of empathy and patience.\n\nAll in all I had a great time, enjoyed the food and service! I’ll be back:)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcFlhOER3EAE",
            "text": "Tried Seafood Kingz for the first time, and the entire experience was disappointing to say the least. We walked in at 12:48pm, and upon seating ourselves we noticed none of the 8 booths were served. The restaurant was understaffed and clearly overwhelmed, so we patiently waited to put our order in. First red flag was when the wait staff said he had to find out if they had water. We ordered everything at once (since we had more than enough time to figure it out). For an hour we watched as delivery after delivery left the restaurant.  As we waited the entire dining area collectively spoke about the lack of attention from staff. We all were there to support small and black owned businesses, but were all frustrated. Our four plates did not come out together. My order did not come w the fries I asked for, and brought it to the owners attention. He said IF I wanted them it would be out in 3 minutes.  I declined and respectfully said we had been waiting for over an hour and doubted the fries would be out that quickly. The owners response was that we needed to be patient and understanding, to which I took offense to because we all waited patiently and had not been rude in any way, but because I empathized, I let it go. THEN 20 minutes into eating, the wait staff brings out an order of dry chicken wings. The order was a basket of wings, catfish and shrimp and the wings came out 20 minutes after!? To make things worse, the owner never comes back out to speak with us, but instead sends out a different wait staff (this is the 3rd person we’re dealing with within a 2-hour window). The young man was apologetic and so sweet, but when we asked for the check he said he’d needed to take down our orders again and create the receipt. Very frustrating. About 30 minutes later and we’re still waiting for the check and our credit card. The wait staff verbally told us the amount and said he was charging the card. We never saw an itemized receipt or anything proper. They charged us $160 for food we waited 60+ minutes for. The side portions are small and everything in general is overpriced. When the owner finally took our card to be charged I explained that not once did he come out and ask us about our service, our food, or offer any gesture to his patient customers. Did I mention two tables walked out on them? They didn’t care at all. I give them a 1 star because the breading on their seafood was good. Everything else was mediocre soul food. Had the owner been more responsive, and catered to his diners as opposed to the delivery/ to-go, I’d give it a higher rating and even return. Good luck to them!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOE51dnZnRRAB",
            "text": "The place was inviting and very quite. I went to celebrate my aunts birthday. We all enjoyed our food. My aunt had the fish n chips. She said the fish was seasoned well and very good. Huge portions of food. My daughter had the shrimp she said it was very good. I had the steamed lobster w/ pota5and veggies. We had potatoe salad and yams which were very good. Everyone was attentive.  My only complaint I received wine in a plastic cup. Please get the proper glassware. My experience was very good and we will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbnFYSGFBEAE",
            "text": "My sister and I went for lunch. The restaurant was clean, the staff was professional, and the service was quick and courteous. The sweet chili chicken wings and tasty cornbread kept us busy until the wing-and-catfish combos with macaroni and cheese, collard greens, candied yams, and rice and beans arrived. Going forward, all other cornbread will be compared to that at Seafood Kingz. The sides were all hot and flavorful, tasting as though they were served directly from a warm oven or a pot still simmering on the stove. This meal was so good, it would have been a sin not to take some to my mother. I don't own a car, but it's definitely worth taking the Bx29 over to City Island."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybWNycVd3EAE",
            "text": "I tell you what, this place is it. I'm a little confused by some of the reviews because I had a great experience. First and foremost, the food was delicious. Secondly; my waitress, Woods, the best. It's a small place with big energy and…"
        }
    ],
    "reviews_count": 82
}