{
    "name": "Orrico's Italian Restaurant",
    "place_id": "ChIJsX6yEXiLwokRKUW404YWmw4",
    "grid": "BX10",
    "address": "3019 Westchester Ave, Bronx, NY 10461, USA",
    "rating": 4.6,
    "user_ratings_total": 273,
    "phone_number": "(718) 892-8282",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toT05FeE5SVXR6Tmw4d1NGcE1ibTR5V1RVekxVRRAB",
            "text": "I GIVE ZERO STARS TO ORRICCOS. SERVICE HORRIBLE\nPORTION FOOD EMBASSERING NOT WNOUGH TO FEED MY 7 yr. Old. PRICE OF FOOD OUT OF THERE MIND. LOOK LIKE AN OLD SERVING OF CHICKEN PARMESAN. THEY SHOULD BE EMBARRASSED TO CHARGE $28 FOR ENTREE WITH A HALF SERVING OF SIDE DISH."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNVZsQllRV3hTTUhkT2RTMTJTMkZQU1ZCR1RXYxAB",
            "text": "Ambiance was amazing! Also food was good and had good portions. Was a bit noisy, however not bad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONlp6RXlXakJyYjFSTlFUa3pSMmxGVTNCeWRuYxAB",
            "text": "Mostly well made Italian with large portions, they didn't know how to make broccoli rabe, it was bitter"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdGJVWnBWMEZ5V2pZdFpERjJXa1ZhTUd4RWJWRRAB",
            "text": "Absolutely delicious food, good wine, great people. I will go back if I visit this area again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV05tVmxValJyTjFCek5uWlJMVmhGYkdWS1UwRRAB",
            "text": "Absolutely the best Italian food in the Country Club / Throggs Neck Area... Owner and Chef Rob will do whatever he can to accommodate anything you need... The Short Rib Egg Rolls made in house are 1 of a kind. Staff is always polite and up to speed.   Truly a staple in the community...."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bVdXWTVNR3RKWjJwVlIzbHdkak4zWjFGUk5GRRAB",
            "text": "I recently tried Orricos after being referred by a friend.  I ordered a lunch hero and could barely pick it up it was so heavy, lol.  It was stuffed with succulent chicken, and broccoli rabe and everything was seasoned in and out.  I was upset with myself for not ordering more.  I can't wait to go back.  A must try."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeVVqZGtNakZJWTNSTWNXdGliMGhGVUY5d1psRRAB",
            "text": "My husband and I were looking for a place to go after attending a wake in the area, and chose Orricos based on the reviews. Not 4 or 5 stars by any means. I will say that the waitress was nice. It was kind of annoying that they wouldn't take our order until we decided on both our appetizer and main course. The sausage and broccoli rabe egg rolls were very good, though the food runner wanted to take everything away before we were even done, because the main course was ready. I ordered the shrimp scampi with spaghetti, on which I asked for scampi sauce (the pasta it comes with is usually served with marinara sauce...why???) Both the pasta and shrimp were swimming in a liquid that tasted like slightly salty water with lemon. No garlic or butter flavor in the 'sauce' nor the shrimp. I'm guessing that they didn't drain the pasta enough, and called it scampi sauce. Besides, it's usually served with linguine not spaghetti.  I did take the leftovers because I didn't want to deal with the conversation that typically takes place when you don't finish your meal, and don't want the leftovers. My husband had the pasta with sausage and broccoli rabe, which was swimming in liquid as well. Worst of all, it was a 95-degree day, and there was no air conditioning.  They had 2 tower fans running toward the middle and back of the place. We were seated in the front, where we sweltered. I wanted to leave before we ordered, but my husband wanted to stick it out. Big mistake."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeWRscFZNRzlHTWtKMGJHbE1XbDlDT0MwdFgzYxAB",
            "text": "The food is very good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdmFsSkVlVzB6V1VwM2RuVkthMWxUWTI4MGRWRRAB",
            "text": "Has quickly become my go to restaurant for italian food in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPR1VxTEdKek5MQU5REAE",
            "text": "What a wonderful treat...I was presented with a gift certificate for Orricos by my good friend George Havernick... I have been hooked since... We frequent this place at least five times a month...I have tried almost every dish and they are all my faves....The meal always ends with their homemade creamy cheesecake, to die for....Service A plus plus....Food A plus plus plus....Atmosphere and ambiance super A plus...Try it and you will be hooked."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbnI4SlBlb3B2ZUhnEAE",
            "text": "I definitely want to eat here, but we ordered delivery. The food came piping hot. And so damn good. The rigatoni with meatballs, so tasty. Loved the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUR3ajVsLRAB",
            "text": "1st time... great family-friendly atmosphere 👌 and food great for my date and myself..staff made us feel like regulars!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bF9MeGxBRRAB",
            "text": "Definitely worth the travel and price.  Great customer service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOWJyc1pnEAE",
            "text": "Waited an hour for a fried potato and paid an extra $5 for vegetables and got steamed broccoli….lol…don’t waste your money here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMTl6LVF3EAE",
            "text": "My Mom passed away and today  after the funeral services we went to Orrico’s with a group of 30 people. The service was great and the food was excellent.\nThank you for taking care of us!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNU1ERWpBRRAB",
            "text": "Food is excellent\nPrice is also very good\nEveryone is friendly\nHave had my family's cousins dinner there for the past two years and have had such a good time we stayed until closing"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaWMyTzhBRRAB",
            "text": "Went here for lunch yesterday with my mom and godmother.  Food was delicious and love that they don't skimp on the portions and we sat and talked and not rushed.\nEverything was excellent.\nAnd kudos to the 1 kid doing it all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHFURzJ3RRAB",
            "text": "Normally I am not a person to complain about restaurants, since I have worked as both a waitress and as a bartender in many establishments, and I know how stressful it can be.  However, for this particular Resturant, I needed to point out how this Resturant treated my friends and I as patrons. I CAN ONLY SUM UP THE EXPERIENCE AS RACIST. I think if you're of a certain color you should not eat here, if you want a pleasant dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOHNIRmtRRRAB",
            "text": "I went for a wedding/baby announcement and it was very nice. The food was delicious. I ordered a piña colada that was okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLWRyb1BnEAE",
            "text": "Highly recommend this restaurant,  food is good and wait service is extremely pleasant and accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbDR1eG13RRAB",
            "text": "Delicious authentic Italian food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbF9pR3FBRRAB",
            "text": "I recently dined at Orrico’s Italian Restaurant and was thoroughly impressed by the culinary offerings. The carbonara and vodka pasta were some of the best I've ever tasted, bursting with rich flavors that left me craving more. The calamari was perfectly cooked, tender, and delicious, making it a standout appetizer. Coupled with the friendly service and inviting ambience, Orrico's is a must-visit for anyone seeking an exceptional Italian dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdW83Y0dnEAE",
            "text": "Great,  genuine Italian restaraunt with great food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z0lLZkFnEAE",
            "text": "Orrico’s Restaurant has become my favorite spot for excellent Italian food.. i frequent this restaurant at least every other week the food is consistently good…the staff is friendly courteous and welcoming..overall it’s amazing and I highly recommend…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3amFiV1d3EAE",
            "text": "It was the most expensive disgusting meal I've ever had the food was expensive and disappointing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycV9fb0J3EAE",
            "text": "Exceptional, simple, homemade food that is just delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMFlTak5nEAE",
            "text": "The food was amazing, the service was great, it was very clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cC1HeVlnEAE",
            "text": "Best pasta I've had in years.  Had the rigatoni with red parm gravy.  It was all perfect.  Will come again and again and again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOWJfTUpREAE",
            "text": "The food was mediocre.  The Eggplant Rollitini appetizer was delicious.  The Shrimp Oreganata, Shrimp Parmigiano & Penne alla Vodka lacked flavor. The Chicken Marsala & Chicken Alfredo was super. Service, our waitress was great but when we walked in noone attended to us and we were standing for a while. So I walked up to what I believed was our reserved table and asked if it was our table, and were told yes. That was odd when some workers were around the bar area and could've walked over to ask us if we needed to be seated. It is a very nice family atmosphere and we will definitely come again.  I hope we  don't have to feel weird again waiting around to be seated next time when it wasn't even that busy when we arrived.  At least acknowledge your customers, and tell them your right with them. Don't just walk by them like they don't exist. That part was very uncomfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3NTd3FBRRAB",
            "text": "If you want authentic Italian, you must go to Orrico’s. We were a family of six that had appetizers, main course and dessert. EVERYTHING was incredible, food, service, atmosphere. We will surely be there again and highly recommend you go too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcnRmeUJBEAE",
            "text": "We had lunch at Orrico's today, following Wally's Instagram testimonial! It did not disappoint! Toni Ann and Robert are the most warm and friendly owners/host and chef! There were four of us, and we ordered a bunch of appetizers to start, one more delicious than the next! Baked clams oreganato were perfectly seasoned and fresh. If you can imagine a potato croquette getting any better, these were smothered in the most delicious marsala mushroom sauce. Dirty potato chips… Smothered in Gorgonzola sauce with chopped tomato and meatball! Delicious creamy arancini...the tomato sauce is amazing. For entrées, we were actually stuffed and decided to share a few entrées. We went with the highly recommended chicken parm and a custom dish that chef Robert was happy to oblige on! It was fried eggplant layered with a brown marsala mushroom sauce and melted mozzarella cheese. To die for!  We had the spinach salad with cranberries, pears, and candied walnuts, and a raspberry vinegar dressing.... Side of bleu cheese. Amazing. The portions are so generous, we actually took leftovers home! Not that we needed it, but the delicious fresh crusty bread brought to the table, hit the spot as well, especially when soaking up all of the delicious sauces from our dishes! Quick ride from Westchester for sure! We will most definitely be back! Thanks so much from Bobby, Pat, Laura and Lisa!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENmREWW5BRRAB",
            "text": "So the ask today was for a good Italian meal and what I got was great! We drove from Paramus, NJ - only a 45 minute ride and it was worth it! Cute interior and the ladies greeted us warmly. Once seated, they brought over fresh bread and olive oil ..yum. My first drink was a well prepared aperol spritz. You’d be surprised at how many places cannot make a decent one but this was not the case. Appetizer was mussels (a hearty helping with no empty shells) and the broccoli rabe eggrolls. WOW! We decided to take half home so we could enjoy our salad and dinner. The Caesar salad was delicious. I had the special veal chop valdostana which was cooked to perfection and my husband had the veal parmigiana which also was moist and delicious. Both portions were huge, we could have shared one dish but instead took the leftovers home for the family to try. Dessert was pistachio tartufo with a generous amount of whipped cream and chocolate sauce. The chef and  his wife were lovely and visited our table which to me always makes me feel like family. Looking around you could see that the customers were comprised with regulars which lets you know it is a favorite among other places in the area. Next time you are looking for a delicious Italian meal run - don’t walk - to Orrico’s!!  We will be back soon."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOFo3a1ZnEAE",
            "text": "Food is amazing.....service needs improvement stsff not so attentive theyvwere more worried about there talk time then there tables    my family and I take out from here on a few occasions and every thing we order is on point one thing better than the next food it next level in quality and taste. Hopefully we will go eat in restaurant again and Change our mind on service in the place . because we really love the food.......update  service has improved 👏 Fridays are the night for us we met a nice waitress Maria very friendly and good at her job we are regulars here and the rest of staff is great tooo so glad to say service has improved if you are in the mood for Italian food this place is a must go big portions great food 😀 prices are very fair..  top quality.   Update. 3-28-24  this place gets better as the time gose by. the staff is top notch 👌 very attentive an it's a must go if your in the Bronx stop in you will not be disappointed  maria top notch waitress very friendly and know how to make a good drink long Islands are my favorite  and Taylor is so sweet always has a smile on her face. Antonio  is a very pleasant young man.  Toni Ann is good too. Veey pleasant  person. She is the owner  the place really  is a staple in the Bronx it's a must go"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVdjV2UTZnRRAB",
            "text": "Great food and great service Maria and Toni Ann are the best!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5X0lDdmZ3EAE",
            "text": "A little pricey but the food is great 👍 some things can use just a tad bit more seasoning but the gnocchi pesto creamy pasta is amazing!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOGRpYzRnRRAB",
            "text": "Rob, Toniann, Maria and the staff went above and beyond for my mom's memorial service..all messages and questions were answered promptly, food was beyond delicious. we had family style and everyone loved all the choices..next time I want eggplant that comes close to moms, I'm going to orricos!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkd0tYbjhRRRAB",
            "text": "Great food, great price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeDdQQk13EAE",
            "text": "I just had to leave this review. We went there for my Uncles birthday and the service was incredible. They were so accommodating to our party and to my uncle who is in a wheel chair. Everyone was so nice, patient, professional, and respectful. The prices were great and they didn’t even charge a cake fee like a lot of these other restaurants do. Thank you for making my uncles birthday special. Well definitely be coming back ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0OGM3OHVnRRAB",
            "text": "Definitely worth going to we also got the fried meatballs & stuffed clams appetizers and everything was delicious"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dXZuNk1REAE",
            "text": "Robert is extremely talented. I love the eggplant parmigiana, antipasto and recently I had the baked ziti and everything was perfect! Of course I will be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWN2JEMFZnEAE",
            "text": "Great appetizers, and dinner as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc1pDVWlBRRAB",
            "text": "We started with Pasta Fagioli soup, they give a big bowl and it was delicious.  Chicken parm was the best I ever had, 2 huge cutlets.  Baked\nZiti, another huge bowl was also delicious but impossible to eat it all.  Great family restaurant, big portions, reasonably priced highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMGFQdjJBRRAB",
            "text": "I was in this place last night and what a bad decision I made. The first thing is that I ordered some meetball the appetizer and it was totally cold but my daughter and I were so hungry that we were able to eat a little. The Bolognese pasta was horrible and my daughter's ravioli was not He could have eaten a whole one with so much sauce and the bad thing was, I don't know how people go to this place with horrible food. The only thing they have good about is the service. I would never go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbXBmdjV3RRAB",
            "text": "Authentic Delicious Italian food  at reasonable prices in a friendly quaint atmosphere . One of the best in the Bronx."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X00zeW5BRRAB",
            "text": "Great experience! Thanks!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dF9uUkJ3EAE",
            "text": "Very very good food and service. Authentic Italian and very nice atmosphere. Recommended to go on a dinner date or just with family. 👌🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bnVTQ1JBEAE",
            "text": "I dare you to get the fetucini carbonara and try to tell me it's good. Glad we ordered mozzarella sticks because it was the only food I had. Watery sauce, no egg yolk or even a trace of pecorino Romano cheese. Topped with bacon bits. Took one bite and sent it back. Someone should tell the owner and cook to google the recipe. Youtube is also helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabTZpNTlnRRAB",
            "text": "Outstanding food and service.  Phenomenal Italian food and neighborhood restaurant in the Bronx. Worth a trip back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadXFLaElBEAE",
            "text": "Great service. Great food. Can’t go wrong with the Penne a la Vodka, Carbonara, or the Alfredo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad3EyX29BRRAB",
            "text": "My waiter, John, was totally remarkable.  He brought my drink, ice water, and bread right away, even though it was busy.  He then promptly took my order.\n\nThe veal parmigiana and penne were delicious.  The piece of veal was quite large, tender and topped with gooey mozzarella cheese.  It was scrumptious.  I was really very very happy with the taste, and have to say the tomato sauce was extra good, and while some places are skimpy with the sauce, that's not the case here. I devoured every bite.  I was especially pleased that the food was served piping hot.  I hate it when you go out to a restaurant and they serve you food that's just warm.  For me, it's very important that food should be served hot, and it surely was.  Oh,  just thinking of Orrico's is making me hungry!\n\nExcellent and polite service, exceptional food, and lovely decor.  Everything was perfect.\n\nI am planning to go back in the next few days, it was that good.  Finally a fantastic Italian restaurant in the neighborhood. I'd give ten stars if I could."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFc2FUaW5RRRAB",
            "text": "The food was very flavorful. I love that they kept the exposed brick from Lucas and updated it to a fresh look. Staff was very accommodating and friendly. Prompt and polite. Will make this a Father’s Day tradition."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSamYzYk5nEAE",
            "text": "Honestly, don’t know how this plays has 4.6 in ratings the food, literally lacked flavor in every shape way and form ! I ordered the penne alla vodka and let me tell you HORRIBLE! Probably the worst pasta I’ve ever had . The people who enjoy their food grew up with no salt at home . Just wow ! 38.00 on a pasta dish that my garbage ate ! Won’t be returning ! You know it’s bad when they asked how to accommodate me and the food is so bad I didnt even want anything else from the kitchen . Nor did I want my money back !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcEszUVJBEAE",
            "text": "Our waitress was amazing and the food so delicious! Nice portions as well, will come back for sure!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdjgzSVRnEAE",
            "text": "Great place clean will lit.\nI was not sure what I wanted so I gave the server 2 different dishes and left it up to her to decide for me.\nShe brought an order of chicken cutlet Parmigiano\nIt was a very nice portion size\nThe sauce had so much flavor well balanced no ingredient was overpowering the other.\nThe chicken cutlet had just the correct amount of breading. A very nice portion of cheese on the chicken and the dish it self was so tender I didn't even need the knife to cut it.\nHonestly very impressive the food and the pricing.\nMy server was awesome and the rest of the staff as well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbHRxZkJnEAE",
            "text": "Had little dinner get together after a special event at a local church. The food was delicious, but some plates were warm instead of hot and some of the other plates were forgotten to be served. It seems the staff were kind of overwhelmed…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcXJLRFZREAE",
            "text": "From the first moments to paying the bill,  the experience felt as authentic and convenient as one could ask for. It's like enjoying a slice of the Bronx Golden Age. Despite the general area not being as nice as a financial district, the cuisine is worth the visit.\n\nWhile surrounding the venue with Italian American pictures and perfect overall decor and lighting, the staff is attentive and fairly accurate with all orders and special requests. Even though the entrees were all good, especially the pork chops, I enjoyed the appetizers just as much, if not more. The dirty chips were excellent, as well as the meatballs and anti-pasta dishes.\n\nThis is becoming a preferred spot for me. I look forward to my next extended family dinner."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheExhMHdRRRAB",
            "text": "Just celebrated my husband’s retirement at Orrico’s. I can’t say enough about the dinner! From the planning where Toni Ann and Rob were extremely patient and helpful to the day of the party it was perfect. The staff were all very friendly and accommodating throughout the four hours. The family style meals were so abundant we left with many meals for a week or more. Our guests are still raving over each and every dish which were all fresh and unbelievably delicious. As regular Saturday night diners even we couldn’t have expected such an amazing experience. Thank you Toni Ann and Rob for making my husband’s retirement celebration even more wonderful than I could have ever expected!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dGFuS0hREAE",
            "text": "Orricos delivers very good quality food with amazing flavor.  I’ve tried pasta entrees to meat dishes. I’m Italian and this restaurant never disappoints. Not once. They give you hearty portions and the lunch specials are terrific.  They came up with Italian Eggrolls which are wonderful.  Everyone likes them.\nI wish them continued success. If you haven’t been by, then please go by for lunch or dinner.  Oh yes if you seen a negative review on this place,  Well that angry person made a mistake. He had to go to a different restaurant somewhere else. Maybe he went to the shoe store"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd2FuYTN3RRAB",
            "text": "We came in as a large group, we had a reservation on a Wednesday evening.  They were able to meet all of our special requests.  The food was outstanding.  The rice balls were a crowd favorite.  Also the penne ala vodka was a hit.  Great…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLWRpR053EAE",
            "text": "Food was amazing. Had penne vodka with added shrimp. Great portion size for the price and even brought some leftovers home. Friendly service and accommodating to every request."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLZ0pteVZBEAE",
            "text": "The food here is always fresh and delicious. I’ve tried most of their appetizers, pastas and chicken dishes and not once have I been disappointed. I was sad to see Luca’s close but Orrico’s has definitely filled the void! And be sure to…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aDZIYk5BEAE",
            "text": "Actually just went with a friend for a quiet drink. Kathy is a delight, the drinks are very reasonable, and I'll eagerly be back soon to sample a meal. The food looks and smells fabulous. A welcome addition to the neighborhood.\n\nCan't wait to try your Francese dishes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScG9QMVhREAE",
            "text": "Meatball appetizer was delicious.  we had   mussels and chicken parmigiana for dinner and highly recommend. Nice atmosphere great service and for dessert we had the cookie skillet with ice cream to die for. Yum yum"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeGNUcUZ3EAE",
            "text": "The food was delicious , the service was fast which was awesome because our appetizer and entrées were nice and hot . Our server was very nice and friendly. I would of given this restaurant five stars but  we was disappointed  because we…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeDZxU1dBEAE",
            "text": "We went there last night for dinner. We heard great things about the restaurant, so we even asked friends to come along. Well, what an embarrassment! It took about 20 min just to order drinks. The service was horrible. Other than to take our food and drink orders, she did not come back over once!! The food took FOREVER to come out. The appetizers were wrong. The runners came over a few times with the wrong entrees and were messing up which tables the plates actually went to. No Our poor kids were waiting 1.5 hours for simple pasta (and by simple I mean penne with butter). Not once, did the server have the common courtesy to come over and ask if we were ok or apologize for the delay in meal.\nWe watched the other tables. Couple in front of us their entrees took forever and when they came out on of theirs was wrong. Another table, waiting just as long.\nIt felt like we were on a hell's kitchen episode and the kitchen couldn't get their act together!!\n\nSadly, even though the food was pretty decent, we would never return given the horrible service and overall atmosphere we experienced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNHBqTWxnRRAB",
            "text": "First let me tell you! The service was absolutely impeccable!!!! Food!!! Mama Mia 🤌 best Italian food outside the homeland. You want cooking like your Nonna made it, this is the place. If I could add stars I would.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMzZuVmp3RRAB",
            "text": "Been coming here for years and last night it seem off. Ordered the arancini and it was just blah, flavors where off and the sauce overpowered every bite. Ordered the pork chops in green pepper sauce, it was dry but I was hungry. Then the others said similar things about their food..\n\nDrinks were on point..\n\nService as always is excellent"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNkpyaXdRRRAB",
            "text": "We had a 6pm reservation for my birthday. We were seated on time. The server took our drink order, explained the specials and after a few minutes we were ready to give the server our order. We both eat low carb so when the server offered pasta or potatoes we expressed that.\nThe entrees arrived fresh, hot and delicious! Yum. The wines paired well with our meals.\nThe server was attentive but did not interrupt our time together. Perfect.\nThen this happened: the server comes to our table after the meal with a dessert with a candle to sing Happy Birthday to me. The dessert is an expresso cup with whipped cream and an amaretto cookie.\nThe server then says to me, \"I heard that you're on a diet so I didn't bring you cake.\" WOW!\nTO SAY THAT I WAS SHOCKED AND APPALLED is an understatement! Who says that to a customer?!\nI responded that I just don't like cake.\nIt was a terrible ending to what began as a good new dining experience.\nBefore choosing your restaurant we read the reviews. There is a common theme: the issues are with SERVICE staff. It's not the food, the ambiance or pricing.\nSmelling like cigarettes, lost reservations, wait times-all staff challenges.\nSomething to think about, just saying."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMHRxSFp3EAE",
            "text": "Good portions for the $. The soups are filling enough and come in a deep wide dish. Ask for more bread, you're gonna need it for all the sauce they give you. Staff is very accommodating."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ1lTQlpREAE",
            "text": "Went for lunch. Sandwiches were perfect. Will be back for dinner"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURhX0pCWRAB",
            "text": "The best food and great staff  makes this a phenomenal place to eat in  or take out!!  Family run.  Food is definitely prepared with fresh ingredients and love.  They also make really good margaritas!! Try the place you will love it 😀…"
        }
    ],
    "reviews_count": 71
}