{
    "name": "City Island Pizza Company",
    "place_id": "ChIJg6fo4giNwokRpzVy1dSgTn8",
    "grid": "BX10",
    "address": "273 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.8,
    "user_ratings_total": 73,
    "phone_number": "(718) 210-1970",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeFNGcGpkemszYldsTWFrUk1URWRUWlVOSVFXYxAB",
            "text": "Not for a slice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTGJGaFBTRU5oUjNodllWVXpielJET1RKQlptYxAB",
            "text": "Rice balls were delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSFdXRmlkbUpXUlV4WlVrRkNNM05FTW1wNVMyYxAB",
            "text": "Ordered to “red hot” slices and ate them on the sidewalk.  Delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWmFERnFkSFl5Ym0xeVN6TnVOMWc0ZUMweE5XYxAB",
            "text": "This is a must go spot!!!! The owner is amazing and makes your experience wonderful. The food is great, and must have there rice balls. If you take a girl to a date, take her or him here. The prices are good and desert is amazing. You can eat outside or inside."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1duZDBaRXhWVlRkQ1dWZFljSGhWZERWR1puYxAB",
            "text": "Immediately upon entering City Island Pizza Company, we were whisked away to a comfortable and engaging environment.  The gracious greeting from Abby was heartwarming.  The attentive service, genuine care and recommendations offered by Emily, our server, were second to none.  The passion and expertise offered by the owner, Rene, enriched our dining experience.  It was such a delight to chat with him about the various dishes that we ordered.  What a powerful example of carrying forward family recipes and fusing together two cultures. Rene’s charismatic demeanor was shared with each of his restaurant guests.  I watched him have such meaningful conversations and smiled.  I know his conversation with me made me feel like I was the only person in the room. I am sure that others felt the same way!\n\nAhhhh and the food!  It was nothing less than exquisite!   We had two appetizers, the meatballs and fried pizza.  The meatballs immediately brought me back to an Italian specialty deli that we went to when we were kids. They had the most incredible meatball heroes. The recipe belonged to the store owner’s mom.  The quality of the meat, seasonings and most of all the taste was incredible. The meatballs brought back a fond memory. The fried pizza was something I could never have imagined to be so delicious. The Caesar salad was by far the best that I ever had. Not only were the ingredients in the salad and everything else we had fresh, the dressing was such a beautiful blend that it made eating that salad an utter delight. I had the pappardelle and short ribs. The short ribs melted in my mouth and the pasta was just perfectly prepared, al dente. The sauce made you feel like you were back in time at a family gathering. My friend had the linguini and clams. I don't think he uttered a word as he ate the entire dish. Scrumptious to say the least!  When you go to City Island Pizza Company, do not skip dessert! We had the zeppoles and the tiramisu. The zeppoles were perfection. The blend of the powdered sugar and cinnamon was incredible. Needless to say, the three accompanying dipping sauces made them that much more delicious. The tiramisu was a blend of Italian and Puerto Rican! It was a combination of an Italian dessert, tiramisu, and a Puerto Rican dessert tres leches. Unbelievably delicious!\n\nOur experience at City Island Pizza Company far surpassed the many other dining experiences that we have had over the years. Don’t miss out on this wonderful restaurant! EJ"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUVFpMDRUSFowVDNwSldYZE1SbXQ1V2t0bUxWRRAB",
            "text": "Ended up coming across this place by chance and I’m so glad I did! The first thing I noticed when I entered the restaurant was the delicious smell and the nice clean space. The food was delicious. It was probably the best pizza I’ve ever had and everything is made fresh. The owner is also very kind he made his way to each table to talk with the guests about the food. 10/10 definitely recommend coming here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZlpsSmlSRzlIVkRKVFYzQlFkMU5FUms1MWFFRRAB",
            "text": "I had an amazing time celebrating my cousin Sweet Sixteen Party at City Island Pizza Company.\nThe staff was excellent and attentive and the food was great with plenty of options to go around. But the manager exceptional service was the highlight of the evening. He was incredibly accommodating and went above and beyond to make sure everything was perfect.\nThe manager exceptional service was put to the test  that night, when a tragic accident shut down the Island and we were unable to get a ride off. Despite the chaos, he selflesly offered to drive us to the nearest train station himself. This act of kindness made us feel like family and he truly made our celebration unforgettable.\nI HIGHLY recommend City Island Pizza Company for any occasion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS21oY2U3anFYT3ZnRRAB",
            "text": "Friendly owner provided special attention and menu option details\nFood is well sourced high quality steak chicken pork options\nMeatballs terrific blend\nGravy/ sauce homemade awesome\nOyster mushroom and short rib entree terrific\nGreat vibe cozy setting\nPizza options terrific\n\nMake reservations and enjoy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJelRudWJlMFozeVRnEAE",
            "text": "This is by far the best place to eat on city island and beyond. The owner knows his stuff and everything on the menu is a hit. MUST GO!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbU42VkVnEAE",
            "text": "Amazing pizza but even better food menu.  The owner, Rene, is a really wonderful guy and has created an extension of his living room.  They serve slices on weekends too!  If the roasted half chicken is on the menu get that and the fried mini pizzas!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bWZuajFRRRAB",
            "text": "The place is amazing!!! The pizza is great!!! You need to try the rice balls."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRc19Dc3lRRRAB",
            "text": "The food and staff were exceptional!! The owner himself interacted with us. He even explained the menu being that it was our first time. I definitely recommend this place and I will definitely be returning!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcll6cFZnEAE",
            "text": "Customer service was top tier. I had the buffalo cauiliflower and the margherita pizza. The food was amazing definitely top quality and fresh ingredients.  Does not compare to the standard pizza establishments. Definitely a great experience all around. I will be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbXRqS0NREAE",
            "text": "Had the most wonderful Sunday afternoon dinner at this restaurant, from the moment we walked in the staff treated us like royalty, the owner Renee could not have been nicer, he explained everything on the menu and recommended the most delicious dishes,  can't wait to go back again, thanks Renee!!!\nDr's.\" John & Hilda"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc091NHJ3RRAB",
            "text": "Best food ive not only had in ny, but I've ever had in my life. Good price for what you get. The meetballs are perfect, they have the perfect texture not too firm and not too wet just perfect. From Russia with love🇷🇺"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMG9hTnBBRRAB",
            "text": "La mejor pizzeria y comida italiana combinada con un excelente servicio 👌"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZ2VmY0VREAE",
            "text": "Excellent!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNi11cF93RRAB",
            "text": "This is a truly amazing restaurant. The food is delicious. The chef takes the time and utmost care to deliver remarkable meals. The owner chats with the customers and lets them know about the “specials “ of the day . I recently had the braised beef with pasta which was terrific! I’ve also enjoyed the lobster roll meal and the exceptional pizza.\nTry this restaurant and I know you will agree.\nSimply the best!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMHZla0pBEAE",
            "text": "What an amazing experience at City Island Pizza Company! The food was INCREDIBLE. It was not food it was a work of art. The blend of tastes and how it just melted on my taste buds. And it was cozy and pleasant and tastefully decorated. The owner Rene was so wonderful and pleasant and welcoming! His knowledge and mixture of ingredients and how everything was crafted made for one of the best nights of culinary delight that my wife and I have had in a long time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cFpuYldREAE",
            "text": "My husband and I have been coming here for some time now and every time we visit they knock it out of the park. The new fall menu is to die for! We started off with the Stromboli of the day and buffalo cauliflower and both were hot, delicious, and very well made. They were perfect for starters. Our main meals were the pork chop and Brussel sprout salad and paired together were extremely good. The salad was extremely fresh and the pomegranate seeds were such lovely addition to it. The pork chop was out of this world; mild in spice to warm you up on these cold winter days with bright fresh red peppers it was phenomenal! My husband and I left no crumbs on our dishes and they even gave us bread to soak up the lovely left over sauces on the chop plate. 11/10 service; always pleasant and willing to go the extra mile to make you feel at home whether you are from city island or not. We are lucky to have such a wonderful restaurant right down the street."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LU1DUnlBRRAB",
            "text": "I ordered the Margherita pie and wings. The first thing I noticed when I got my delivery was the delicious smell. The cheese used was definitely not the cheap kind. And the tomato sauce 😋. I have had gourmet pizza that made me regret paying for it. But this gourmet pizza was worth it. The wings were also awesome. It had a nice touch of sweetness. If you want average pizza go somewhere else. But if you want amazing pizza with outstanding ingredients go to City Island Pizza Company. Next time, I'm coming to the restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcXR5N3pRRRAB",
            "text": "Just got back from our 5th visit here and didn’t disappoint, food and service is unbelievable. I only took pics of appetizers and dessert, wish I had taken pictures of our entrees put we ate them to fast. By the way the owner insisted we have dessert on the house !!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQODdpMTlBRRAB",
            "text": "I was having a bit of a reflux problem the night we visited- Rene bent over backwards to accommodate exacting modifications to the gnocchi dish so it wouldn't bother my condition. it turned out delicious and he couldn't have been a better host!\nAlso, my dining companions LOVED the zeppoles, which were cake-like, unique and not at all greasy!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXRLN0tREAE",
            "text": "We went to City Island with a friend last week to have a last meal of the season at Johnny's Reef.   It was a Wednesday and Johnny's was closed.   Recalling an excellent slice of pizza I had on City Island over the summer we found the place, City Island Pizza Company, a restaurant that has been around less than a year.\n\nOur friend is very persnickety about his pizza (he grew up near Arthur Avenue) and gave the owner,  Rene, a hard time about no anchovy pizza being on the menu.  Rene brought out a tube of anchovy paste from Italy, explained the advantages of this condensed anchovy, how he used only San Marzano tomatoes from Italy, described how he made the dough and our friend was satisfied.\n\nThe pizza is amazing.  Rene, who showed great hospitality, humor and patience as we stood at his front door, had described a unique process for cold fermenting the dough (I think it was fermenting..).  The dough was delicious.   The mushroom pie was just about perfect, I can't say I've ever had better pizza.  Our friend slathered his slices with the anchovy paste and enjoyed the pizza, giving it the highest marks and taking a slice to go (which he reported was great reheated the next day).\n\nThe rest of the meal was excellent.  The menu has changed slightly for the winter since our recent visit, and it took me a few days to write this first Google review, so I can't go dish by dish about what we had, but it was all excellent.  This charming restaurant is well worth visiting for a great meal."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzck9idW1RRRAB",
            "text": "Food is overpriced but okay. Not the best food. They are trying to be very sophisticated. The server was a sweet, young man, very friendly and always smiling."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNTdxNGV3EAE",
            "text": "The food was exceptional. Service was good. Atmosphere was classy. No complaints!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuenRYYWhRRRAB",
            "text": "Excellent food. We have been many times and the consistency in the quality is there. Everyone is friendly too. Keep it going."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3M3AzYjdBRRAB",
            "text": "No Lie! Best Lobster Roll of my life.\nI had just gotten back from Martha's Vineyard, spent time in Maine, and my boys go to school in Rhode Island. I'm no stranger to the warm butter sensation of knuckles on hot bread, but this roll blew me away.  I would have never tried a Lobster roll from a pizza joint, but a long time City Island resident said that of all the big sign fish places on City Island, this was the best fish on the strip.  I was skeptical, but I went, ordered, and the City Island Lobster roll is the Truth.  No lie.  Tell Renee I sent you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bXVqNE1nEAE",
            "text": "i came here w my bf and his (italian) family on sunday and everyone LOVED the food. the clams appetizer was the best we have ever had. and i dream about the burrata sandwich.  pesto was homemade and so much quality prosciutto i’ve only had a comparable sandwich in Florence. you can tell they really put effort into each dish, they were so flavorful and fresh and the server was so kind! gave us pineapple ice cream before we left. will 100 percent come back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaEtQdl93RRAB",
            "text": "In the middle of my cycling loop to City Island me and my friend got hungry and wanted some quick grub and just googled nearest pizza not thinking too much but I’m glad we did. In a rush I just ordered a margarita pie but noticed a unique Red Hot Chili Pepper pie, I’m glad I switched. Pizza got devoured before I can even take a picture but most definitely coming back with my friends, not only great pizza but great people. Hands down the best pie I’ve had in the Bronx, right amount of kick from peppers and perfect crust and thinness. While ordering takeout the cashier brought us out cold water while we were waiting for pie which was much appreciated."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid2FERUhREAE",
            "text": "wonderful meal! the bread goes so well with the carbonara sauce :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyd2ZQRW9BRRAB",
            "text": "The pesto pizza was the best pizza I've had in a long time. And this is coming from a lifelong New Yorker!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaktpSzBnRRAB",
            "text": "Service was great and so was the Pepperoni Pizza!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cHE3NzVBRRAB",
            "text": "Don't sleep on the vodka pie"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMjltZkJREAE",
            "text": "Love this place! Great food, relaxing ambiance, trendy decor and friendly staff providing wonderful service! It's the perfect place to unwind, have a drink and enjoy a meal. Interesting locally sourced offerings and they make their own bread and sausages! What more can you ask for?!?! Very happy to have such a cool brunch and evening spot on City Island. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqLXFDQ0tnEAE",
            "text": "Excelente lugar muy recomendado 👍"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbVlHSlhREAE",
            "text": "Warm, Friendly staff who make you feel welcome and at home. Great place to take the family! Great food, not the usual, very distinctive dishes. Best Pizza on City Island. The Sunday Sauce is worth traveling for, it was one of the most memorable meals I've had in years!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX2MtaG1RRRAB",
            "text": "Had the best brunch today at CI Pizza Co! Wow. Everything we ate was amazing - sausage gravy on focaccia, breakfast pizza, avo burrata toast. Plus the rosé spritz was the perfect touch for some bubbles… delicious. We were lucky enough to sit in the back garden on a gorgeous day, can’t wait to come back. It’s great to finally have a brunch spot this awesome on the island."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcWJiaDl3RRAB",
            "text": "Thank goodness you came to City Island! I could eat your red pizza every night! I hope too many people don’t find out about your exclusive “Supper Club!” I may not get a seat! What an experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENUtUakpnEAE",
            "text": "We came for opening day brunch and it was beyond expectations. Food was fresh, portions super generous, and the vibe was upbeat and energetic.\n\nThe avocado toast on focaccia was ridiculously delicious. It came with poached eggs and a whole burrata. Super filling. My daughter ordered the steak and eggs, which was also perfectly cooked. We topped it off with the French toast and some Rose Spritzers.\n\nWe will definitely be back for this. Excited to have a new brunch spot on City Island!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N0ltTmN3EAE",
            "text": "My family and I came here for dinner, we were seated by the waiter. We waited and gave in our order. Let me start by saying everyone was asked how their food was and our family ended up being the last ones they came to ask. Not to mention everyone who came after us ended up getting their food before us! While we sat and waited!! We felt so out of place!  Really wished we had received better service and attention as the others did! We will not be returning! WE ORDERED THE GRILLED WINGS AND THEY CAME OUT RAW! A BIG NO NO!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbF9qb0VnEAE",
            "text": "Love"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaElMUldnEAE",
            "text": "They are so amazing 🧿🧿"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbVBiRmx3RRAB",
            "text": "Atmosphere was phenomenal and the service was great. Super welcoming and open.\n\nPizza was a miss it was cooked well and the crust tasted great but unfortunately somewhat bland couldn't really identify the flavors within each bite\n\nChicken scarp was cooked really well and would order that again. Nice mix of flavor\n\nBrussel sprouts were my favorite.\n\nWould I come back.....Yes. But deff not my first choice.\n\nWill come back to try out the pastas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNEl5RmFnEAE",
            "text": "Definitely the best pizza on city island, full pies only, but very worth it. So far, I haven't had anything I didn't like"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NnB1bnFBRRAB",
            "text": "What a beautiful evening.  Took my wife out for date night here and it was perfect. From Tevin the waiter to Kerri the manger and rest of staff just attentive and welcoming.  Food was cook to perfection and was not rushed….  And to end the evening, their tiramisu ice cream was to die for.  Thank you city island team for a great experience .  All the best and much success to you guys.  I see nothing less. 🫡🫡"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaajRxZlJBEAE",
            "text": "We made spur of the moment dinner reservations for a Sunday evening. The chef/owner Rene and his team did a wonderful job in making us feeling at home, meeting our special requests and creating an overall memorable experience. What a great local spot that we look forward to returning to in the near future! Glad to have a convenient high quality restaurant join the City Island community!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOXZQUWNREAE",
            "text": "Environment was warm and inviting. Nice music and not too loud. The waiter was attentive and provided excellent service.\n\nThe margarita pizza was very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacHVmWEpREAE",
            "text": "City Island Pizza Co is another gem on the island. They definitely have a love for pizza and it shows. The crust is robust and at the same time very light and fluffy in the right places. Ingredients are top notch and the entire experience was great. I look forward to  all the great meals I will have there in the future!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2VUS3RRRRAB",
            "text": "If you ever want to visit ITALY but live in NYC, this is a MUST HAVE. The food is so fresh & delicious ..it simply reminds me of my visit to Italy a few months ago!\nFrom Naples - Rome - Parma to Bologna the food here is on point!\nI couldn't wait to grab something to eat so I had to go and order!\nThis is a MUST Visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMktlTTF3RRAB",
            "text": "Great new spot on the island! The staff was incredibly warm, professional & attentive.\n\nThe decor and music was lovely - really made for a great vibe.\n\nMost importantly, the food was top notch. We had a pizza, “pigs in a blanket”, salad, chicken scrap and pasta. All were very well done with generous portions.\n\nWill surely be coming back again (and again and again)!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweDlXZUd3EAE",
            "text": "Delicious food (the pizzas, but also the pigs in blankets) made with topnotch ingredients, caring and friendly service, cozy atmosphere. Happy to have it on City Island!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGFLQWZ3EAE",
            "text": "Italian food done right. Pizza w simple great ingredients and crispy crust. Looking forward to coming back to sample the entire menu. Keep up the great work."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbTduRmZnEAE",
            "text": "Margarita pizza is excellent. Crust is light and flavorful, ingredients and toppings are very fresh"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNXZ2Y1BREAE",
            "text": "Great meal— sausage bites, pizza, salad, wine. Excellent service and attentive hosts. Warm and inviting space."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcE5tZk9REAE",
            "text": "Excellent pizza!! We got the pesto pie and it’s delicious, the staff is great, and the price is on point!!!"
        }
    ],
    "reviews_count": 56
}