{
    "name": "Tipsy Bar & Lounge",
    "place_id": "ChIJsbW_Ga-NwokRAT4Pr8uaQyk",
    "grid": "BX10",
    "address": "414 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.8,
    "user_ratings_total": 49,
    "phone_number": "(347) 202-4605",
    "reviews": [
        {
            "date": "5시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNVdrVmlVemROTWsxb1NFbzJTa3RZTURCdE1uYxAB",
            "text": "The food is amazing , and the hookah is good it lasts long ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkblJtcGFhRFJ5ZWxOUlFVeFZhV2hhVTAxeFEzYxAB",
            "text": "The atmosphere there is phenomenal from the music, to the decor tipsy bar and lounge is a complete 10/10. Definitely coming back, the drinks were strong and the staff are thoughtful and accommodating (played afrobeats for us 🫶) see you on the island."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaFJURnpPSFZrUzFSQmQwUmhXVGhZVURkaU1rRRAB",
            "text": "Tipsy Lounge offered a fantastic experience. The vibrant and relaxed atmosphere was ideal for unwinding without the usual nightlife chaos. The DRINKS  were exceptional, flavorful, smooth, and perfectly balanced.\nThe hookah was clean and long-lasting, and the food was a standout. The tender lamb chops were perfectly seasoned, complemented by fresh sides.\nThe staff were attentive and friendly. They provided excellent service without being overbearing, ensuring that everything was great.\nCombining the great drinks, flavorful hookah, delectable food, and solid service, Tipsy Lounge is a place I’ll definitely be returning."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd09FOHhTbGhOTWkxMlIwTm5jRzFsZFU1SWNsRRAB",
            "text": "Buen sitio para tomar algo y picar, el sitio está bien se puede hablar con buena música y los precios están bien!!! La atención de david es perfecta gracias!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVFrMVZkMnhIYkVFMFltcFdjRWRSYmtWVWFGRRAB",
            "text": "Best lounge in the city I recommend to everyone service is excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UlFtOXdVakpKUTFGMGRscDVTRE4wZHpWRmJGRRAB",
            "text": "Really nice place food is awesome and the drinks are amazing David the bartender makes the best drinks hands down make sure you hit the bar 🍸"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRWNIbEpXVXBMTW5oUWNXNW1VRFoxWjA1S2QyYxAB",
            "text": "the best experience i almost forgot that i was in the bronx , amazing energy , great customer service , quality curated drinks, great music , amazing vibes i truly had an amazing experience right here on city island the back yard is so clean spacious and great art and decor !!!!! will be back soon!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odE56VkZkVWg2V1MwdFVHVnJhRU5pVHpkNlNVRRAB",
            "text": "The drinks were so good, the bartender David knows how to make the perfect drink. The music and atmosphere was dope, coming back next weekend. Check out tipsy if you looking for a good time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMFlUZFlhWFJIWHpOWWNXSkxhMlJWZFhwRldFRRAB",
            "text": "This lounge is so mush Nice the service also is great the food And drinks And the hookah everythings was amazing I want to thinks the staff for there good comportement And good attitude"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMVRrcGZhbTU2UVVNMU1HeFNXRXBNWkdscWIwRRAB",
            "text": "This lounge in City Island is an absolute gem! The food is a solid 10/10 – fresh, flavorful, and perfectly prepared. The atmosphere is unmatched, with the perfect balance of cozy and vibrant, making it a great spot whether you’re out with friends or on a date. The drinks are simply amazing – creative, well-balanced, and served beautifully. What truly sets this place apart, though, is the staff. Everyone is so friendly, attentive, and genuinely welcoming that you feel at home the moment you walk in. Easily one of the best spots in City Island – I can’t wait to go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWmJUaHpNMHBtYUdsaFRWQTFValp6T1V3NU1rRRAB",
            "text": "This place is absolutely amazing. The service is great. David, the bartender makes great coconut mojitos. You will not be disappointed!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVowRllkekZPV1Y5emVYbHNha3QwUzFwblgwRRAB",
            "text": "love it here, very chill vibes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psd01WOWxZVmRQZFdaYWVHVlhZbEJ4UTJwUFlYYxAB",
            "text": "Excellent Place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbU1raHNkamhhUkVKQmFEVnVWVTUxZWxreldXYxAB",
            "text": "Stopppp this place was so bad! Terrible service, never got the drink I ordered, movie theater nachos. It was pretty dead & servers still barely looked at us and everything took forever! The drinks we did get were so weak and sugary. Then they added gratuity on one app & 2 drinks which is crazy, probably because they know people won’t tip after that terrible service. Also hookah inside a restaurant with no designated / outdoor area is crazy. There was a weird smell in there the whole time too. Save your money don’t go here! I’m sure it will be gone in a few months anyway nothing lasts in this location it’s just like the places that were there before."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQlFtdHdSbHBmUWtwNlUwMWlPRFF3TVVkS2NrRRAB",
            "text": "One of the best drink I had . Nice place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVldrMXVRVkJGZEZaNmIyRnNZbkkyYldORVlWRRAB",
            "text": "They just opened up a few weeks ago, I came by on a Sunday to check out the inside, it's pretty nice. The inside is pretty nice and they have a out section."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdk5HMDBRMEpDUWpsb1pGbDBOeTF3UzNGeE4xRRAB",
            "text": "Had an awesome time. The vibe was super chill great music, cool crowd, and the staff were all really friendly. The food was actually so good way better than I expected. Drinks were great as well. Perfect place to hang out with friends or grab a bite and a drink after work. Definitely coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeFRGUlZiVXN0UmtwTFJrNXhhV0pVYmtsWGFGRRAB",
            "text": "THE BEST PLACE ON CITY ISLAND!!! So happy this opened! The hookah BUSSIN , the drinks BUSSIN, the food OMGGGGGG BUSSIN! The vibe was great. If you looking for a dope lounge to have fun, have a vibe , a lil drink and some good food, please come here. David was great! 10/10 experience in every way! I mean look at that photo 🔥deff recommend the burger or chicken sandwich !! -v & j 💕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYVgweHhkbmswWkdwVE5YcHlibXg0WTFCT1pXYxAB",
            "text": "Great service, bartender is very attentive, beautiful atmosphere, the food is delicious, hookah is a major plus"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUWRYbG9hVmxxZFZaTVN6UjVNbE5IYm1wS1VYYxAB",
            "text": "Celebrated my friend birthday here. The staff are great, accommodating and friendly. The food is fresh, drinks are the right balance and music is versatile. Definitely would recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVlgzWTVNRkl5VDE5S1ZqUTRTRnB1TWpOTlIwRRAB",
            "text": "I went there on a Saturday, they had live djay the bartender were doing they thing and the food was finger licking goooooooo, in the words of a great machine(ILL BE BACK😭😭). Seriously ya got to check this place out, they definitely stand out with there service, beverages and food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcVNUUkhaMmxDVm5JNVkxTkllVEpDZWs5M1ZtYxAB",
            "text": "Wow best lounge in the city service is excellent I recommend to everyone 100%"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFd2JVSlRkamxPTkZKM1QxaFpSVVoyTUhsSVRIYxAB",
            "text": "Best lounge on the city service is excellent check it out"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdGRtb3lWbXBrVlZOSVQwZEJTMjlLV0RoTU5YYxAB",
            "text": "I’ve been in a lots of bars but this one on the island is definitely my favorite.\nThe price, the service, the drinks and of course the musics. I can’t even mention everything but it’s a place to be whenever you’re around. So affordable …👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGa1ZrTnliVVZVUlVWcGRUWlFNa2RyTXkxVlFVRRAB",
            "text": "The best lounge in NY right now"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNWRHWjRPV0pJYVRoelRuaEVaa2gwYVZCNk9YYxAB",
            "text": "Beautiful lounge, i liked the modern, cozy atmosphere. Drinks were great, service also. Gave me a relaxing vibe. I’d say it’s perfect spot to unwind. Excited to see this place grow"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVGNEbGZZV3gzVjJGWVZtTnBhblJDYkhOd1RsRRAB",
            "text": "I Been there last night and that place is nice.i love the food and the music too. I recommend everyone to visit that place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNGFGcGtiMWx5ZHkxc1gxUlVhVWQ0ZWpCblJHYxAB",
            "text": "Love the place nice music good food and the price affordable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTWFqUTNNRlZGWmpnNFEyOU9hM04yWm1oVFNIYxAB",
            "text": "The food is horrible so is the service!  Way too loud in this place.  Not enjoyable at all!  Drinks are watered down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILWFEbmFBEAE",
            "text": "I’ve been eating and drinking on City Island for many many years. I’ve always had a great time down there now I have a brand new place where I can enjoy a new scene with good people host. I highly recommend this lounge."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ2V6c0d3EAE",
            "text": "Great environment, great vibe, food is good and staff are very welcoming to new customers. The bartender makes delicious drinks. The owner, Enri, is eager to welcome new customers and help you to have a pleasant experience at Ace. I will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIam9heGlRRRAB",
            "text": "Very chill spot to hang out at night. Great vibe overall whether it is to have some drinks with friends or to have hookah. They have a nice selection of food as well making it a great place to spend your Friday or Saturday night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIanVMWXVBRRAB",
            "text": "Ace Bar & Lounge is the perfect mix between restaurant and lounge! Great drinks and food and amazing ambiance!!! Definitely will be back soon!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOXJlbHhRRRAB",
            "text": "Awesome new spot. Went out with my gf to City Island and tried this place out. Super chill vibe. Drinks were reasonably priced, and the bartender was hooking it up, so I figured I'd leave a review.  I'll make sure to stop by again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOW8zOXBnRRAB",
            "text": "Great drinks! Great Food! Great people!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOXFISEl3EAE",
            "text": "Enri and Dusty are very hospitable.  The drinks are worth the price.  Nice atmosphere.  They even  stayed open one night for a group of us locals and everyone had a great time.  I hope this is the new spot.  Stop in and try it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa01QMTZBRRAB",
            "text": "Brilliant Atmosphere, A must Visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGYtVEhREAE",
            "text": "The best lounge on City Island…\nThe owners Created  a very positive and welcoming atmosphere that made our trip memorable!!!!\nClean throughout the whole facility and the finger food was amazing.\nThe staff treated us like family and the owners made it even more special.\nThanks. See you soon. Highly recommend the family and Friends 5 STARS."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWFxMWV3EAE",
            "text": "If you want to spent some quality time Ace Bar & Lounge is the place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OHI2Z0FREAE",
            "text": "I recently dined at Ace Bar and Lounge and was thoroughly impressed by both the exquisite cuisine and the impeccable service. The menu showcased a variety of innovative dishes, blending bold flavors and beautiful presentation. The attentive and knowledgeable staff ensured that our meal was a memorable one, providing excellent recommendations and ensuring our satisfaction. I can’t recommend Ace Bar and Lounge enough for a fantastic dining and Chill experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bU9TYkFREAE",
            "text": "Overall 5 stars! Great new spot on the island that offers really cool / unique drinks as well as some really good small bites. The pita and dips are amazing - not your typical pita chip - crunchy outside and fluffy inside. The place is looks great from the from the sleek floors to all the artwork on the walls. Must Try!"
        }
    ],
    "reviews_count": 41
}