{
    "name": "City Island Diner",
    "place_id": "ChIJW72Xf4eLwokRT5TCvFeOsK4",
    "grid": "BX10",
    "address": "304 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.4,
    "user_ratings_total": 474,
    "phone_number": "(718) 885-0362",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNGJqVklhRVpRYTFSclFuRnVlalYyWXpKcmJFRRAB",
            "text": "used to come here frequently until I had to wait for 1 hour and 15 min for my food. To add on to the wait, the table that got there 15 minutes after me got their food served first. I stood up and walked out because how was that ever okay,...? that's beyond me. I'm a good tipper & polite, but that pushed it. I got up and left. Haven't been since, I drive to another dinner in new rochelle."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelNtMVlabFUyU1RSR1dFTmxiM1p1T0V4TldrRRAB",
            "text": "Been here twice, very home style atmosphere and delicious food. Definitely worth the stop when in the area!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkU1YzVkJiM1ZOUkc0eWFqVm5SRUpSY1djeU9VRRAB",
            "text": "Excellent!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMVVXaERibmMxTFdGMVJXUnJWWGxJY0dGc1YzYxAB",
            "text": "Today was our first time here! We absolutely loved everything! The food, the service, everything!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wdk9UWndTazFSYXkweWRUQnhNbTU0UjBzdE1GRRAB",
            "text": "Love this place.  Fast and friendly service.  Great atmosphere.  Everyone who works there is really nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUlFWVkhhSG8xVWpaWGVIQTFOMnhVZUhac01uYxAB",
            "text": "The Staff at this Diner are Outstanding.  Donna, one of the owners is very attentive making sure the Customer is well taken care of. The servers esp . Vera are very friendly, and caring. Lorenzo, Joe, and the Chefs in the back serve well prepared, and tasty meals. Their soups esp. The clam\nchowders are delicious. City Island diner is very important to this community, and All who dine here for its traditional Diner experience which has been lost to the fast food chains."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbmNISm9WMkY1UjJkWk1XRlhOMnN0UzFGZlNsRRAB",
            "text": "Great staff! The food is amazing as always. Mimosas on a Sunday morning are always good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS2RVVjZhRTVxY3pCeE9GUmlSVjlTWWtaNFVFRRAB",
            "text": "I visited here on July 12th 2025 and was serviced by Meghan who is customer friendly professional willing and has great mannerism and an asset to city island diner🩶🩶🩶"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSU1R6QXhZWFkwVFRkcmJFcHZNbEl0TkU4emRHYxAB",
            "text": "Good food good prices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeGFVdDFUalk0YVVsTmRXMU1abTlLTUVOQlVXYxAB",
            "text": "Hometown vibe and really good omelets !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNlZtTjVUazlET0Y5QlN6ZzVlalptVERkTk5FRRAB",
            "text": "Wonderful customer service  🥛"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNFdsWnZhRkZRTjBSVFIyZFZlbVJNYjI1TVVsRRAB",
            "text": "Overpriced dry brownie and blah.  Not returning"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQlVHVmtNVTVuVEd0aWRqZGphSFpFTjFCWVdHYxAB",
            "text": "This diner needs to keep longer hours. Closing at 3PM for a diner is a joke and bad for business. Diners want a place they can go to that fits their needs, circumstances and schedules. The drink prices are absurdly high here. Two decaf cappuccinos should not cost $16! Worst yet, they weren't that large and tasted terribly flat.  They were also out of caffeinated cappuccinos which I wanted! The brownie my friend ordered was hard, old and dry tasting. When I wanted a regular caffeinated coffee after drinking the lousy decaf cappuccino I was refused service because they told me the restaurant was closing. How to ruin my afternoon out with my partner! After all this I then asked for the bill and then needed to contest the outrageous prices of the decaf cappuccinos. The waitress was not willing to compromise on the price at all. We will never be returning. This is no way to treat the public or run a business."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZnpnLXZscGU2X2VnEAE",
            "text": "Whatever is on the special board, order it! This is the neighborhood restaurant of your dreams. Beautiful people and great food. Kind and generous servers taking care of the regulars and newcomers alike. Excellent breakfast and lunch menus. Don’t skip out on the Bloody Mary with the best pickled green beans you’ve ever tasted."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZjU0WkcwLV9qRzBRRRAB",
            "text": "I love this diner, although I'm not a \"clam digger\", I've been coming to this diner for many years. My daily routine is oatmeal and a coffee, but there is nothing better than sitting and having a meal here. You feel as if you are home, their service is outstanding, their food is beautifully done with that very caring classic diner feel. The minute you walk in you are greeted with a hello and also that wonderful diner smell. I can honestly say that I have never once had a bad meal here. This place is one of those hidden gems that is a must try!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvblBHdVBnEAE",
            "text": "I love that it's local! I've already been here twice with my family. The services waa excellent, the food was flavorful, and the coffee was perfect. The waitresses and waiters are wholesome and kind.  Please try their homemade olive almond cake - it is outstanding! Look forward to going back next month! Supporting local business."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNXVmVTlnRRAB",
            "text": "Very nice cozy place for comfort food.  Staff is very nice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcDViM1JnEAE",
            "text": "A delicious breakfast on City Island. I love this place! Just amazing home cooking and a great staff. Feels like you're on a Cape Cod vacation . It's a wonderful environment. Friendly service .This is the place for an Amazing breakfast or lunch to start your day...Comfort food... I shall return. ... 5 stars here !!  & Thank you"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaUpXRGFREAE",
            "text": "Nice old fashioned diner with a nice menu and great staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLVlfbm13RRAB",
            "text": "Best pancakes in NYC!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnek5uVmd3RRAB",
            "text": "Best burgers/ meat loaf outstanding/shepherds pot amazing"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOWJUdUVREAE",
            "text": "Fast, friendly and reasonable prices. Their Chicken Caesar Salad is one of the best I've ever had."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaHAtdEtREAE",
            "text": "Sime but Excellent home style menue. Soup 🍲 Burger 🍔 and Sandwich 🥪 😋 Very tasty - Specials too. Staff attentive & courteous - Quaint spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ2VYMW5nRRAB",
            "text": "I'd been looking forward to visiting this place for literally years, since I saw the \"Comedians in Cars Getting Coffee\" episode, and I was not disappointed. Cozy community spot with lots of beautiful energy and good vibes. The staff know all the regulars, the conversations you overhear are always surprising, and the community connects beautifully here. The food is also exquisite, and (unusual for a diner) CREATIVE, and the coffee is a very smooth and solid medium roast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaS1UalNREAE",
            "text": "💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNC1fM0RREAE",
            "text": "Overall a nice, small diner. Food came out quick and the staff was friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMDVDczJ3RRAB",
            "text": "We went to celebrate a birthday with small dog in tow. The establishment sat us outside the patio looking over beautiful water view. Provided nice choice of appetizers and several different breads to nosh on. We ordered spaghetti with clams in marinated sauce; this special included soup or salad. The meal was very tasty. These were two huge plates -- could have shared and still feel full. Will happily try this place again. Our waiter has personality and  checked to see if food was to our liking--nice touch.  The bill for two people very reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ckxhM3RnRRAB",
            "text": "Classic diner with small town feel and better than most diner food. Nice people with good service. Atmosphere is what it should be.  I was happy with poor man's Quiche Lorraine (ham & cheese) and side Greek salad. They let you sit and relax."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMm9hQUt3EAE",
            "text": "Cozy little corner shop w/ tasty comfort food cooked the way we ordered. Great local vibes and incredible hospitalty. Staff could tell my girlfriend and i were not from the ‘hood, but showered us w/ kindness and offered us a handful of recommendations of things to do on the island while there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia3FmMFpnEAE",
            "text": "Excellent food, great service.   I had a cheeseburger deluxe, awesome.  Family owned for 28 years."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaFpmTkx3EAE",
            "text": "The food is fresh and delicious.\nThe staff is friendly and makes sure yr happy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeWY2RnRBRRAB",
            "text": "Its City Island. Whats not to love? Great diner however, I ordered some green peas with my breakfast and they came partially hard and uncooked. Food was okay."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eHIzUVp3EAE",
            "text": "언포게터블"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdFB5V2tRRRAB",
            "text": "Love ❤️ Miss You! City Island 🏝"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdktYbVFREAE",
            "text": "The best breakfast on City Island, It's like eating in a country diner in New England. Very friendly, great service. It's where all the townies eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOHZ1bGRREAE",
            "text": "Always go to CID when in town. They have the best cook in the world named Joe. Can't say enough about him..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX0tpd2h3RRAB",
            "text": "The best diner in town truthfully"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEODhiUmdBRRAB",
            "text": "Super chill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5LXJ2NU5nEAE",
            "text": "Cycled 40 miles from south shore Long Island. Got here 9 am and not much options in the area.\n\nSpoke to a local jogger and he recommended City Island Diner for its food & comfort. I’m glad I took his advice.\n\nWalked in and was politely greeted to an old school diner with counter top seats. I got the front row bar stool facing the cook.\n\nWatching the orders come in and the cook dishing out his magic. It’s akin to watching a conductor at a symphony.\n\nClose your eyes and listen closely to the eggs cracking and being scrambled. You can smell the home fries with peppers & onions. Hear the sizzling of the bacon.\n\nMy pastrami omelette arrived in a big way. Fantastic flavor & portion. 👍👍\n\nReally enjoyed the meal and especially the hospitality. Loved the venue 🙏🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkM2ZXSjBRRRAB",
            "text": "what a nice time have not been to a diner in 20 years plus had breakfast yesterday with friends and family excellent service and food will be back thank you for a great experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkak9hNm9nRRAB",
            "text": "A down home neighborhood diner serving a variety of tasty, well prepared food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMGRDTi1RRRAB",
            "text": "Great local diner experience. I went for breakfast and enjoyed eggs and sausages with hash browns. I also enjoyed an ice coffee. The diner is in a great location to walk the island, window shop and enjoy the mystic vibe of the island. It is a small spot with a nice \"Mom and Pop\" vibe. During weekdays they offer breakfast specials for $6.95. One of my favorite aspects about the diner was the experience of being able to watch the chefs cook my breakfast in front of me on a grill visible from the stool seating. If you're not up for a whole meal they also have a small coffee bar available. Great service and staff."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldHR1dXF3RRAB",
            "text": "I had breakfast here today. The servers Jennifer and James are very nice and go out of their way to help you.\n\nFood was good. Prices a little high for a neighborhood diner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbkpDc0ZBEAE",
            "text": "It was great, service was good and the food was cheap and delicious, I’ll be definitely back 🫶🏻"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweThYaWNBEAE",
            "text": "Simple yet amazing. Ordered the cheese burger deluxe and a coffee. It was a simple cheese burger made juicy, delicious, perfectly cooked and reasonably priced at $10."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z0xucC13RRAB",
            "text": "We loved it and will be back. Friendly atmosphere. Super clean."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN2I3N25nRRAB",
            "text": "Low key spot in the heart of City Island.  No frills but the food is delicious and fresh.  Great selection and lots of specials.  Very family friendly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdV8tQml3RRAB",
            "text": "Has the first time patron I was pleasantly surprised by the speedy attention and delicious food served in this little diner on City island. The pancakes I ordered with sausage were fluffy and tasty. Depression of his quest hiding that many times and had ordered a full breakfast with an omelette  juice and coffee. The service was quick, the staff friendly in this little Diner hidden away. If you are ever on the island drop in, you'll be glad you did."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbU5xTjNRRRAB",
            "text": "City Island diner is a very well established, traditional diner. The atmosphere is warm and friendly. The staff reflect this ambiance too. A great variety of food, prepared in the open kitchen; fresh and delicious. Be prepared, the prices are a little high too."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTaU0tMmFREAE",
            "text": "I really enjoyed my breakfast at City Island diner. The food was tasty and fresh and the service nice. They were very friendly and attentive.  They seemed to follow the safety procedures and a sign is posted about maximum capacity. There…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNU55MkFREAE",
            "text": "Came here on a sunday for breakfast. I absolutely appreciate and love the Mom & Pop vibe of this cozy establishment. The place is clean. The staff are warm & friendly. The food was delicious. Prices are fair. My friend ordered blueberry pancakes and I ordered the spinach tomato feta omelette. It's definitely worth the trip. Wonderful experience. My new favourite place. Can't wait to come again and again. Enjoy :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoN3N2dU93EAE",
            "text": "Very cute little diner! The owner is so very attentive and the food was presented well. My friend and I had breakfast omelets and were very pleased. Would have given it 5 stars but the fruit side that I asked for wasn't exactly what had in mind. I would have been ok without it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaF9IdW9BRRAB",
            "text": "Great service & food. I try to go there everytime I work on City Island."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLV91by1nRRAB",
            "text": "In 2011 I was here in our sailboat docked for ten days before moving up the Hudson - hurricane Irene was on her way.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhZ1puZVBnEAE",
            "text": "WE LOVE IT HERE!!! My girlfriend and I come every time she’s in town for breakfast. We like to watch them cook.  The food is delicious and priced very well. They have everything here. Staff is very friendly and work so efficiently it’s impressive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbEktcVh3EAE",
            "text": "Great little diner on city Island. Big salad selection, all served in a stainless steel mixing bowl. My chicken Cesar wrap was served in a crispy wrap, full of fresh ingredients and tasty grilled chicken."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdi1tUkVBEAE",
            "text": "It's like walking into a time capsule.  Not much has changed here and that's the beauty of it. City Island Diner has a long and narrow dining area, with the classic diner counter dominating a good part of the space. While the surroundings are clean, it's plain and unpretentious. That's not to suggest it's drab; more like it's so outdated that's it back in style again. The place has character and it's got a homey feel with really nice, friendly staff.\n\nThere's a ton of expensive restaurants in City Island, so it's nice to know that when you're in the mood for no frills and cheap, you can come here for a solid cup of coffee and usual diner grub.  Meeting a friend for lunch, I ordered the Mayflower, a turkey sandwich with cranberry sauce and stuffing on rye bread. Although a bit dry, it hit the spot.\n\nA great go-to when you want cheap, quick and adequate. And true to its time capsule feel, they still don't take credit cards."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OC1tZXVRRRAB",
            "text": "In an age where everything is moving away from cash, they charge you extra for using a card. Not to mention they practically charge Manhattan prices for their dishes. Gave them 2 stars (instead of 1) because the food and service was okay."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJMDZLY2RREAE",
            "text": "Small cute little place. Service was very slow for a Monday evening. Only 2 other tables were there, and it took 40 minutes to finally get our food. Prices are not good, $10 for a wrap that didn't come with an sides. Food was average at best, but I guess that's good for the locals."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMjVyTjhRRRAB",
            "text": "City Island Diner's kitchen also serves the tavern next door and that is where we ate. My husband ordered the Wexford grilled cheese and it was disappointing. The ham is just diced deli meat and the onions were not cooked enough. It just felt like a rushed job. Macaroni salad was fine. Waitress was charming."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvci1Iei13RRAB",
            "text": "I only go for breakfast but I've never been disappointed. They have a large selection of egg dishes, of which I've eaten most of them, and they're always prepared to perfection. It's a small venue (only holds maybe 35 people at capacity) so try to go on a weekday or for a late morning brunch."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVZ3JpNkNBEAE",
            "text": "Had the clam chowder, great 👍🏿. The coffee is good too. 😎…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwa3FxazF3RRAB",
            "text": "It’s a rainy day in Oct and I found myself in city island at 11:30am. I searched for a diner and found a great little place on the main drag. It’s as though time stood still . Friendly staff and customers. I needed a bowl of soup and it was…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLUlpTzF3RRAB",
            "text": "Great place to meet locals. Simple delicious American fare. Great takeout dinner options. Staff warm & welcoming. Worth a visit if your touring the island. Attached Snugg restaurant has great beer choices & good  for group dinners."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxd2RuQXJBRRAB",
            "text": "Called in for breakfast and eggs properly cooked and still moist. Staff very helpful and nice atmosphere. Banana bread to die for. Would recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXJmb2dBRRAB",
            "text": "Our first time there, food was delicious, portions are perfectly sized, they kept our coffee cup full.  Wait Staff was very polite and patient.  Will definitely return"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwX2NMajdnRRAB",
            "text": "A throw back to a different time! Fresh food, homey atmosphere- feels like being on vacation. Makes me remember my best family beach vacation breakfasts from my childhood."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ODdqMEtREAE",
            "text": "Visited here today to get a cup of coffee ☕️ and Kim waited on me. She is customer friendly professional and an asset to this establishment 😊🥰 was serviced today June by Naomi very friendly diner💌 visited here July 14th 2023 was served by Meghan who was customer friendly professional and an asset to this Diner😊💜so pleasant"
        }
    ],
    "reviews_count": 68
}