{
    "name": "Corazon Latino",
    "place_id": "ChIJ8ZAxFVeLwokRYsCp2_G0hk4",
    "grid": "BX10",
    "address": "1841 Hobart Ave, Bronx, NY 10461, USA",
    "rating": 4.2,
    "user_ratings_total": 433,
    "phone_number": "(718) 684-1860",
    "reviews": [
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbWFqRmtRMkozTUdvM05scDJVMHhzTXkxMVIxRRAB",
            "text": "Used to be a great spot for delicious latin dishes with great brunch prices.\n\nNow has become a “members only” club and you will be turned away as soon as you enter."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdl95dUVBEAE",
            "text": "A relaxing place to dine where I can either have lunch or dinner. It’s rarely crowded and the staff is consistently attentive."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MjRydWJREAE",
            "text": "Lo mejor del Bronx y de todo Nueva York\n❤️❤️❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeXVXYVN3EAE",
            "text": "Food Was 👌🏼👌🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbFBlZkZBEAE",
            "text": "What an amazing place!! A must visit spot! Great music, delicious food, great night life spot as well! Great for a party! Order catering and your party will be so happy!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYa0wzUl9BRRAB",
            "text": "Food was not good, only the black beans and white rice was good.  The music was so loud I could not speak to my friends across from me the drinks were not strong and the food was overpriced.  Will not be back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejZHSkh3EAE",
            "text": "Very nice overall experience. Laid-back, nice music and food was delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOUtQMXRBRRAB",
            "text": "Service was terrible, waiter took really long to order. We had to go and ask for our waiter. Then they took really long to get the drinks and food. I was surprised because the place was empty. Owner or manager wasn’t welcoming, entertaining one table.\n\nDrinks and food was bad, didn’t enjoy it. Ended up leaving early. Save your money!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia3BTQVJBEAE",
            "text": "Me encanta ir a comer con mi hija aquí. El dueño es súper chévere y la comida es buena."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM1BERWdRRRAB",
            "text": "Cute, quaint place to go! Music was good. Went for dinner and drinks with my sister. I had the monfongo with steak and she had the red snapper. Both tasty and both a good choice! Dessert was pretty tasty as well. We chose the lava cake. Drinks were ok,but dinner was better ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeWFPXzZRRRAB",
            "text": "Worst food i have ever ate, shrimps were old and spoiled, 7 dollar lemonades, calamari had a weird taste, spent 75 dollars for food that I didn’t even eat, it was literally a robbery, so not go in there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdG9qMXFBRRAB",
            "text": "The place is small but beautifully decorated. Cozy and warm. Invites you to come back. I really liked this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENUxTRWh3RRAB",
            "text": "I used to love this restaurant. They had the best mofongo I ever ate and I kept ordering it over and over again. Today I placed an order on Uber eats that cause me $30 just for a bistec mofongo and this is what I got. I’m so upset they changed the recipe and gave me burned onions. Will not order from here anymore."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMXFyVFVREAE",
            "text": "Very nice and clean. We had avocado relleno with shrimp.  We had rice and beans with churrasco and pernil with Maduros.  Meats and Maduros were delicious.  The rice and beans were ok but not the best.  I also wished they added some flavor to the salad or left some salt at the table so we can add.  Would I return absolutely! Parking is difficult in that area."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMUp5WmhnRRAB",
            "text": "La nueva comida que tienen es muy buena  gracias por la atención  la presentación y el sancocho son muy buenos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxd1lHdVZ3EAE",
            "text": "We had such an amazing time! Went out with a large group for a friend birthday. The staff was incredibly sweet and friendly. My boyfriend said that their Sancocho tasteed like home and reminded him of his grandmother made it. Can't wait to go back there for a small intimate date !!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdTlHdUhBEAE",
            "text": "Muy buen ambiente, me gustaría volver."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaXR1Tkx3EAE",
            "text": "Great service,food and vibe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1OWVYWnhRRRAB",
            "text": "The wine is spectacular. The owner is very accommodating. Staff is on point.. haven’t tried the food yet, however I fell like it won’t disappoint. Coming back for brunch👌🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1X3FEZXRBRRAB",
            "text": "Quaint, great ambiance  with high quality home meals and drink menu. This is our go to stop for after work. The staff/ hostesses are always attentive.  Great home meals and drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacl9xMzZnRRAB",
            "text": "For 20 years i order for thankgiving in Rincon criollo til bad news they had 2 close this year but i am so ready 2 make my order food en escape latino is expetacular best food ever see you thankgiving"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadVAzRGtBRRAB",
            "text": "Me encanto la comida y el lugar muy lindo delicado y todo perfecto lo recomiendo la comida solo como la picadera de verdad se pasaron de lo corriente a lo mejor calamar y sus salsas minis empanadas y una salsa con pescado muy delicioso solo ck. Eso se que ese chef es un cosinero con. Amor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN3IteUVBEAE",
            "text": "I was welcomed and made quite comfortable as a party of 1. I selected a chicken soup, which was served with a side of rice. Hearty and delicious. A perfect light dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab05qWkl3EAE",
            "text": "Celebrated my daughters baby shower! Excellent service staff were amazing and Anthony as well. Place is cozy and beautiful for any activity! Food was excellent! Drinks incredible! I personally recommend this restaurant!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmJTNzdnRRAB",
            "text": "The service was slow but the food was 👍🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeGJfMXdRRRAB",
            "text": "There is not one latin  restaurant in the tristate area that cooks better food than Corazon Latino. Try it and thank me after because it is a fact."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMThENFdREAE",
            "text": "Food is awesome 6 months ago\n\nI am here to say again 06/22/23 every dish on the menu is delicious! Omg like it tastes insanely good. My favorite is the chicken stuffed with platano maduro in mushroom sauce ♥️♥️♥️♥️!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N1pQM3pnRRAB",
            "text": "I'm not sure if there are new chefs each time, and the consistency of the flavors varies for each of my visits. Sometimes, the flavor is more muted. Other times, it is very robust.   I enjoy the mofongo de cerdo y de camarones. It is the best mofongo in the area.  The sauce they make and flavors that come through the dishes are delicious.  And I've tried the mofongos up and down East Tremont Avenue and still prefer it from Corazon Latino (Escape Latino).  I had the aguacate relleno, and I hoped it was better.  It was underwhelming in the criolla flavor department for me.\n\nI will say, like most Latin restaurants in the area, the music is louder than the conversation, and places should really consider lowering the music. That way, patrons can enjoy great food and conversations"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZy15NWhRRRAB",
            "text": "Incredible food, nice quiet atmosphere. Excellent lunch specials.\n\nUpdate: new decor and a really wonderful staff. Feels much more modern 👌🏾"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dE1iVDJBRRAB",
            "text": "Music was pretty loud but the food was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bUpERmlRRRAB",
            "text": "Enjoyed a cozy date, ordering mezcal cocktails and comfort food appetizers. Our two waitresses were polite and very friendly. We loved the flavors in both the Smoked Margarita and the Mezcal Mule. Ordered the fresh avocado and shrimp appetizer; the buttery sauce is great! And we really enjoyed the fry on the chicken bites."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dkpLbG5RRRAB",
            "text": "Nice"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyakpHNDJBRRAB",
            "text": "A little far away from me but freaking Awesome"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdmQ3T21nRRAB",
            "text": "Good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNzRLMzRnRRAB",
            "text": "Is nice and peaceful but the rice with pork was not good it tasted like vinegar and the rice was horrible you could literally stick it on a wall also what restaurant serves soda without a cup with ice the pork to much salt and saggy I felt like I was eating snales"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNXR5WWF3EAE",
            "text": "Great staff and food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMmNIeWR3EAE",
            "text": "Would talk about how the food tasted if it actually got here. Had to wait 1 hour more than i should before grub canceled it. Going to sleep hungry lol"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM0lQbDN3RRAB",
            "text": "OK"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOWVDY2RREAE",
            "text": "Food and  place is amazing the prices are great and the happy hour specials are great and also if you want entertainment Thursday and Saturday they have karaoke love love this place"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Mk5pV1dnEAE",
            "text": "Drinks reasonably priced, but interior needs updating. Reminds me of going into my friends basement for a party.. food was good to. The interior is horrendous"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMllqRmdBRRAB",
            "text": "La comida es exquisita y un sabor único. El mejor mofongo con pernil que he probado en mi vida. Sumamente recomendado"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeFBmTWFBEAE",
            "text": "When you walk into a restaurant and no one is there that's the 1st sign.  Owner sloppily dressed, not motivated,  no other customer service other than are you ready to order? Ordered grilled pork chops.   Can't honestly say they were freshly made.  Beans micro waved. Hot inside the ramekin cold on the lining. Tostones reheated. Charged 18% service fee on one person party.  What service? You kidding me?  Brought container for take out did not even pack my food.  Don't go.  Don't waste your time.  Brisas on Castle Hill always on point,  fresh,  good service,  good customer relationship and filtered water south ice no less.  Received non filtered hot water that taste like pipe.  Paid $30, would have got it for $20 at Brisas.  Extremely disappointed."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyd3FlejNBRRAB",
            "text": "En exelente lugar para pasar un rato lindo verdaderamente bello ❤️❤️❤️❤️❤️ exelente de verdad ♥️♥️♥️♥️♥️♥️❤️💘💖…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyN0pEbWFBEAE",
            "text": "Great customer service and A+ food. I am I would definitely come back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyXzV5Zmp3RRAB",
            "text": "The drinks excellent and we enjoyed the music"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydXVfYTN3RRAB",
            "text": "Food is good. They don't know how to deliver without spilling sauce all inside the bag. They need to do better with deliveries."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpNGRfa3h3RRAB",
            "text": "Escape Latino is a great neighborhood gem 💎 , especially during COVID-19. Cuisine is what I consider to be  latin fusion and includes favorite latin dishes such as sancocho, paella and churrasco. They have beautiful decorations, weekday/happy hour specials, trendy yet cozy indoor, outdoor seating, private parties,, great service and delicious drinks. Follow IG @fotiniamanda for insight on local adventures and support resources in The Bronx.\n\nUpdate:Some changes were made post COVID 19. More of a low key environment and I enjoy that they no longer have hookah."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXa0ptSkRREAE",
            "text": "This is a cute cozy little place for fun.i go here for karaoke nights."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtX2N5Mk1BEAE",
            "text": "Drinks are expensive and weak. Bartender needs to be retrained!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbFBHU2hBRRAB",
            "text": "ERIC THE SO CALLED MANAGER, WAS EXTREMELY UNPROFESSIONAL!!! HE LACKED CUSTOMER SERVICE SKILLS, ACCOUNTABILITY AND BASIC HUMAN BEING SYMPATHY! I AM A LOYAL CUSTOMER AND 5 TIMES A MISTAKE WAS MADE ON MY ORDER WHEN I HAVE CALLED TO ASK FOR EXTRA AND EVERY TIME I WAS REASSURED BY ERIC THAT IT WOULD BE IN MY ORDER. I EVEN OFFERED TO HAVE THEM CHARGE ME EXTRA. THIS TIME I GOT FED UP AND CALLED ERIC TO ADDRESS MY FRUSTRATION AND POLITELY ASKED FOR AN EXPLANATION AS TO WHY HE REASSURED ME IT WOULD BE THERE AND WASN'T. WELL HE WAS EXTREMELY RUDE HE STATED HE HAD NO EXPLANATION THAT HE DOES NOT PACK IT, NO APOLOGY THROUGHOUT THE CONVERSATION LACKED CARING ENTIRELY AND AFTER A WHILE HE ACTED LIKE HE COULD NOT HEAR ME ON THE PHONE AND WHEN I CALLED BACK HE STATED NO I COULD NOT HEAR YOU ANYMORE WE ARE BUSY HERE. HE DOES NOT DESERVE TO WORK THERE. I EVEN ASKED FOR ANOTHER MANAGER OR THE OWNER OR EVEN SOMEONE ELSE HIGHER THEN HIM AND HE SAID I AM THE ONLY MANAGER RIGHT NOW I DO NOT KNOW WHEN THE NEXT MANAGER COMES IN AND THE OWNER IS HARDLY EVER HERE. I AM IN DISBELIEF AND EXTREMELY UPSET BECAUSE THIS IS MY FAVORITE RESTAURANT. I WILL MAKE OR MY BUSINESS TO GO IN PERSON TO DEMAND TO SPEAK TO AN EXECUTIVE ABOUT ERIC BECAUSE I AM DISTURBED BY HIS LACK OF CARING AND DISRESPECT."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbE9qU3RnRRAB",
            "text": "Nice quiet spot, the food was great. The service was a little slow so that’s why I gave it 4/5. But I’d definitely go back again for the food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLd2JqN0dBEAE",
            "text": "The mofongo de pernil, a much recent addition to the menu is a warm welcome addition to the already stable and balanced menu of the establishment. Their take on a softer plantain (you can hear the chef at the back pounding al the goodie ingredients at the back) texture pairs well with the crispy bits of fried pork on the side. Although the meat is on the leaner end of the bite, it’s a fair decision for the more health conscious city folks. I only wish there can be a little more generous with the very mild sauce to compliment the whole meal to bring to together at the end (totally personal opinion, as some may find the balance is just right with their mofongo texture!). However I am very sure you can just let the kitchen know prior as a preference.\n\nDon’t forget to try to coconut mojito, it’s too fun to miss it out for a nice time. Enjoy"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bGF6c1hnEAE",
            "text": "The food here is on another level, couldn't decide what to pick! It was insane how delicious it was, changed my ranking system for food.\n\nThe drinks are also delicious and STRONG.\n\nGreat place for a date, family, or even friends."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMlBmdnh3RRAB",
            "text": "My friend and I were looking for a nice Spanish place to have a glass of champagne and some appetizers and came across this spot on google. We had no idea they just underwent some renovations and opened up 4 weeks ago! We had a blast. Good…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhenZ5QUNBEAE",
            "text": "We went super early so there was no one but us. the margarita was really good and so was the food. They forgot our beans though ☹️ but overall food and drinks were good"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MHZ5RTFRRRAB",
            "text": "Cool ambience and nice casual place to hang with friends. They have drinks and hookah, and good music too. The stuffed avocado and chicken chunks are really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtakkzTzVnRRAB",
            "text": "I had a great time at Escape! The food is delicious good atmosphere, karaoke night, and that night the place was lit! Definitely, in my opinion, the place to go.\n\nI wish, I could tell you more, but being that's my fiirst time at Escape, all I could said is, that night it was lit!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNTVhdTB3RRAB",
            "text": "Nice Romantic local spot. The food was super good and tasted fresh. I will be returning again   if you in the area a must try."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxb3MzQXlnRRAB",
            "text": "So goood!! Definitely a hidden gem. Been living in this neighborhood for 3 years and just now decided to stop by. Food came out quick and delicious margaritas."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMzV6NldBEAE",
            "text": "Food was yummy. Service was good. Location was easily accessible. Cost was moderately affordable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMGNXbGRREAE",
            "text": "Great food.\nTypical NYC pricing $16 chicken dishes, $31 skirt steak -- for example).\nThe restaurant itself is smaller than I anticipated, but still comfortable enough to accommodate for a larger party (of 15).\n\nService was a little slow, but they did what they could with only 2 servers (one of which was also doubling as the bartender).\n\nNot too bad of an experience here, I suppose."
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneWMtdHR3RRAB",
            "text": "Nothing special about the food, a bit over priced. Atmosphere is pretty laid back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDODVmSC13RRAB",
            "text": "The service is friendly and welcoming.   The food was very good.  The only tacky part is that You can pay with the debit or credit however the tip has to be made in cash which we found to be so ridiculous!!   Folks don't carry much cash nowadays so if $2 is all someone has in their pocket guess what That's her tip! Oh well"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMDQ3TXNRRRAB",
            "text": "Our group of girls have gathered here often. We love the place, the food creative and delicious, the atmosphere comfortable, good music. The Wait Staff very personable. But again, I must complain about slow table service.  The place is…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMGRtU1VnEAE",
            "text": "Great atmosphere. The owner greets you when he is there which is most of the time. Makes u feel like family. Food is delicious and priced very reasonable. Staff is great . Been back 4 times and it never gets old."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhaU1PRE5nEAE",
            "text": "Welcoming environment. Polite staff. The food was delicious and the prices are reasonable. I went there for karaoke on a Tuesday. The space is suitable for small group gathering to maintain social distance. I plan to visit again."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndmZEMkFREAE",
            "text": "I've been at this restaurant three times and my husband and I had an amazing time. The staff is very friendly and attentive. The mojitos are great. We enjoyed the lounge type atmosphere. The food is very delicious. I had a Mofongo with fried pork chunks and my husband had seafood Paella. Will definitely come back for more."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbGVlQzJnRRAB",
            "text": "Pros:  - Food is pretty good.  The cook is the best thing about them.\n- Prices are decent\n- Great music\nCons; - They play too many games here, man.\n1.  I can't figure out why hookah is necessary at a restaurant.  It cheapens the place and, for them, having hookah seems to be a high priority,\n2.  It is poorly managed.  No one seems to know their function once they have to serve more than 1-2 tables.\n3.  The schedule is very random.  I once walked in for lunch on a Wednesday and was told that it was closed.\n4.  They cancel and mess orders up on Grubhub all the time.\n\nThey really get 2 stars instead of 1 because of the cook."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteUlIRDNnRRAB",
            "text": "Don’t waste your time coming here!!!! I made reservations for Sunday at 7pm, for my daughters 18th birthday celebration dinner. I received a call from a worker named Isabella on the same day of my reservation telling me that her manager had booked a large section of the restaurant to a large party, and I was asked if I can move up my reservation for 5 pm. I informed Isabella 5pm was too early for dinner and she informed me that she will speak to her manager on how they can accommodate my party of 4,  she then proceeded to inform me that she will have her manager call me if anything. I didn’t receive a call so I assumed everything was fine and our reservation was good to go. My family and I drove to the restaurant located in Yonkers that by the way looks trashy from the outside in person and we  saw a notice on the restaurant door that stated “ Sorry we are closed due to a private party from 7pm-closing”. At that very moment of our arrival two men were on there way into the restaurant (I assumed one of them was the manager), he asked me if I was part of the party because he saw me and my family standing outside with ballon’s and dressed up; I answered no we have a reservation for 7 pm. He immediately starting saying “ oh no no no this place has been rented out to a party of 50 people”.  I explained we had made reservations ahead of time and I also informed him of the call I had received earlier by a worker name Isabella where I was informed a manager would call me if any changes occurs, but I never was informed not to come in etc…. This man had the audacity to tell me that “ it was not his problem and there was nothing he could do”, he didn’t even apologize for the inconvenience!!!.. Guys Please Stay Away from this establishment!!! They have no care and respect for their customers!! Disgusting!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNnAzNjJ3RRAB",
            "text": "We enjoy the food and ambiance every time we dine here. However, there seems to be a problem with the service. They do not know that they should not serve dinner with the appetizers.  This has happened every time we've dined there. If they can work on this issue, the experience would be so much better."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLLWF1NVJREAE",
            "text": "Just left this location for brunch.. Super disappointed with the service I received.. They over charged me a party of 2.. With a 20% group charge.. They said it stated it on the menu.. But even the menu says 18% service charge.. OK fine.. Why not charge me the 18%? And then added a $3.00 mixer charge? We ordered a simple mojito that had to be exchanged because it was literally sugar water.. No way I'm paying $12 for that. So we opted for the sangria.. It was a bit better.. The food is hit or miss.. I ordered chicken with challa toast and it was a few very few pieces of overcooked chicken chunks and some wilted sliced bread with a few strawberries cut up.. Not impressed silverware was dirty I had to request hot water to clean it myself. It sucks.. I'll be reaching out to a Manager soon..  Please be aware of overcharging."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNMmVIQVVREAE",
            "text": "This place is terrific.  They have a large variety of food to order.  The food is delicious.  The servers are courteous and attentive to the customers.  The music is onpoint and at a level that people can have a conversation without having to yell at each other to be heard."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRa3RxNXRnRRAB",
            "text": "The atmosphere of this place was excellent, along w great people. The food was amazingly delicious. Shout out to the bartender😘😘😘👌👌👌🍹🍹🍹 the drinks were on point. The deejay was poppin🕺🏻🕺🏻🕺🏻😎😎 thank you. Can't wait to be back w more friends :-)…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMkxlZEp3EAE",
            "text": "Excellent experience! Loved the atmosphere and the food was good. They have a great wine and champagne selection and it’s very reasonably priced. Would definitely come back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBN1lfcjVnRRAB",
            "text": "Get out your comfort zone and travel to the BRONX!!! We stumbled upon this place and I'm glad we did. The drinks we had were strong and the food was delicious. We had the traditional arroz con pollo and the escape delight with a side order…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvb29yY0pBEAE",
            "text": "Atmosphere was very nice, food was good and the prices were on point. I had the seafood paella, and though the seafood wasnt exactly what I expected it was still good. Drinks were nice. I had a coconut mojito (well a few really) and those were really good. Nice restaurant overall."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZaU8zNmp3RRAB",
            "text": "Very deceiving. This place has so much potential, looks really nice from the outside and the inside makes you want to come in but the service in this place is terrible, waiters have no manners what so ever and are careless of their…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbk92RmRBEAE",
            "text": "One of the best places I've been. Staff was A1. Food was great and music. We had a party of 8 people everyone enjoyed the service and food. Will definitely recommend and also revisit soon."
        }
    ],
    "reviews_count": 78
}