{
    "name": "The Alley Pizza Lounge",
    "place_id": "ChIJ-ShwTIKNwokRkbDJUOFtUEI",
    "grid": "BX10",
    "address": "3209 Westchester Ave, Bronx, NY 10461, USA",
    "rating": 4.9,
    "user_ratings_total": 81,
    "phone_number": "(718) 239-2000",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvemJrOXFjMWhsVGs5VmNYUkJZV0pPYUVOWU9GRRAB",
            "text": "The restaurant was adequate. The hostess/cashier was nice. The atmosphere was ok. Parking is not really a thing on Sunday afternoon. The pizza was a bit salty."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSmJqZDJWbGRWUmxGYVMwODBjSGhzT1ZKb1ZrRRAB",
            "text": "I love the place!!! Greta food and drinks. It was my first time there, the karaoke was awesome. Too bad you don't do it every week, I would of popped up more."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sYWEyMDVTamhNUm01U1p6VjBSRnBXVkZacFpWRRAB",
            "text": "Wonderful atmosphere, great people and amazing pizza & drinks!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1psVmxWR1ZvYVZSUmRWWTVRV3hsYUd3MVdtYxAB",
            "text": "The staff were so extremely accommodating.  They made sure we had everything we wanted and needed.  The food was delicious.  The drinks were flowing.  They were on top of their game.  My party was impressed and delighted with the atmosphere , service and food.  We will be sure to return and recommend them to everyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeWJ6aE9ZbXBaWlRGaVZHdzFiMWh4TjBJM2VIYxAB",
            "text": "Old school pizza. Remember how pizza used to taste when you were younger? This place will bring you back. Restaurant is cozy and the staff is friendly and on point. I've been to places with young immature employees and these ladies were far from that. Friendly and courteous. Mozzarella sticks are lightly coated and very cheesy. Great spot for family or date night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1lXeGlPWEZyTjNZek1ISTJhRlYwU0VGNWNWRRAB",
            "text": "I don’t even know where to start… I guess the food would be a good start, it’s fantastic. I’ve ordered probably every item on the menu by now. Ever since the menu changed up I can’t stop enjoying the variety. Pizza, chicken, desserts, and drinks. You can’t deny the owners put love and care into the restaurant and you can’t deny the waitresses busy their behinds to run it so smoothly even when they’re jam packed with customers. I hope the Alley is open forever! I’m finally ready to stop by for brunch this morning. I’m on my way now! Chicken and waffles sliders here I come!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSlpsSmxabGR2U0U5WVZWaEJUR1ZyVVMxaFNuYxAB",
            "text": "I loved this place. All the food was amaizing, great place to go hang out,the friendly service was also great!! I highly recommend it, Sammy and Leslie were very helpful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdFVYcG9SMjFmVkdjdExXSmFjVjkxTURsdFNrRRAB",
            "text": "I highly recommend this place one of the best pizzerias in the Bronx, I guarantee you won’t regret coming to this place. Many blessings to the owner and his family 🙏❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTWJFWnJkM2syVUdWdGJITkRRVGRvUWpCdWRWRRAB",
            "text": "Great food 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMN1cwWmVWXzdTb2J3EAE",
            "text": "To slow 40 min wait for a personal pizza"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdjB1NHJhOHV6UXdRRRAB",
            "text": "Cool restaurant with a speaker easy type back room for private events.  Great pizza and drinks.  Awesome bartender Sam is very personable, friendly and attentive; and Jack, the owner, makes you feel at right at home."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvamJxbjFRRRAB",
            "text": "Great food and better management!!! Anything other than 5 stars is for sure an understatement!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWJHeDZ3RRAB",
            "text": "From the moment I walked into Alleys , I was captivated by the warm and inviting atmosphere! The staff greeted me with genuine smiles, making me feel right at home. The menu boasts an impressive selection of pizzas, each crafted with fresh, high-quality ingredients. I ordered the Margherita pizza, and it was a slice of heaven! The crust was perfectly crispy, the sauce was flavorful, and the mozzarella was delightfully gooey.\nWhat really stood out was the attention to detail. The toppings were generous and thoughtfully paired, creating a harmonious blend of flavors that danced in my mouth. The owner even stopped by to check on my experience, which added a personal touch that you rarely find in restaurants these days.\nIf you’re looking for a standout pizzeria that combines excellent food, outstanding service, and a cozy ambiance, Alleys is the place to be! I can’t wait to return!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaXQ2SzJRRRAB",
            "text": "Really good service! And the zeppoles  are the best tasting that I have ever had!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdExybThnRRAB",
            "text": "The Alley Pizza Lounge has become our go to spot.  The Food is awesome and the Customer service is A-1!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OFk3YkdnEAE",
            "text": "Delicious food and great staff!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUp6Szl3RRAB",
            "text": "was looking around the neighborhood for a quick grub with the wife and checked it out.\nservice amazing, food awesome!\nPizza: Margherita, Black & White\nDrinks: Old Fashioned (strong!👍 to get a good buzz!) local spot where neighborhood people hang out! highly recommend this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MjZ5VWVnEAE",
            "text": "I have been to Alley Pizza at least 10 times since they opened, an excellent experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDVLT0hREAE",
            "text": "Absolutely the best top 3 best places to eat pizza! You must try their zeppoles (be prepared for the amount). They have a secret room for small gatherings and would definitely come back with the family."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LU9LdHJ3RRAB",
            "text": "Excellent food and service. Highly recommend!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMGV6bTdBRRAB",
            "text": "Eggplant Parm & meatballs are not supposed to taste this good\n\nThey catered my school Swedish Institute and I was blown away"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnakx6RFRBEAE",
            "text": "Stopped in here today for lunch, everything was delicious. Definitely will be returning for the pan pizza soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNWFfVml3RRAB",
            "text": "We had a birthday celebration during the superbowl and the service was top notch! The prices were reasonable and the food was amazing. This place is a hidden gem. New fave."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMGFuQ213RRAB",
            "text": "This was my first time here and I will be coming back next time I’m in the Bronx. The pizza was extremely fresh the dough was perfect for my hot honey pizza.\n\nI also took a Cesar salad and cheese garlic knots to go which both were AMAZING!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeXBTdWRnEAE",
            "text": "Yesterday I stopped by The Alley Pizza Lounge off the recommendation of a colleague from the neighborhood. When I initially walked in I was impressed by the decor and atmosphere that I quickly walked out thinking that I was at the wrong place. I thought that I wound walking into a pizza shop which this place is far from it.\n\nI was approached by the lovely waitress and asked if we would be dining in. I told her that I was and quickly stated that we could sit where we liked. I ordered the Alley signature Margherita personal pan and my friend ordered the Seafood medley pasta but opted to only have shrimp. The pizza was excellent from the first bite to the crust. The seafood linguine was also delicious, and the sauce was super tasty.\n\nThe service was excellent and we were not pushed to leave even after sitting there for two hours chatting away. My only regret is that I left my leftovers which I was looking forward to having for lunch. I called back today to ask if my left overs were discarded and I was told that they were. However the gently on the phone whose name I didn’t get told me not to worry because at my next visit I would be taken care of. I told him that I would hold him to it…\n\nOh and they have happy hour, we had wine!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfc3N1bk53EAE",
            "text": "What a gem!  This is a new restaurant that just keeps getting better every time we dine here.  We enjoyed the Pepperoni Spicy Honey Pizza.  The crust is perfectly made and the ingredients are fresh.  This is definitely a keeper!  Started off with two appetizers - Fried Calamari and Deep Fried Mini Calzones which were also perfectly prepared and  delicious.\n\nWe ended the evening with a Cappuccino and I have to say this is probably one of the best I have ever had.  The picture speaks for itself.  Also have to comment on how reasonable their prices are for the quality of the food.\n\nThanks Leslie for being so attentive and waiting on us and Jack, owner, for taking the time to personally greet us!\n\nCongratulations on the unique and modern New York Vibe for the restaurant and yet maintaining an intimate dining experience."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM0x1VmlRRRAB",
            "text": "The service is beyond excellent!  Not only is the venue beautiful but the staff is attentive and pleasant!  Loved the pepperoni spicy honey pizza with the perfect crust and fried calamari as an appetizer.   Treated myself to end the evening with a delicious  Cappuccino!  Definitely coming back again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdkxqY3VRRRAB",
            "text": "Review of The Alley Pizza Lounge\n\nI recently stopped by The Alley Pizza Lounge, and it was a fantastic experience. The pizza was absolutely amazing—perfectly cooked with dough that was fresh and flavorful. The atmosphere was warm and inviting, and the owners truly added to the charm of the place. I had the pleasure of speaking with Jack, and he was an incredible host—friendly, attentive, and passionate about his craft. Highly recommend this spot for great food and even better company!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaE15R1J3EAE",
            "text": "Just ate here last night for date night and it’s perfect. The food was amazing the service was also amazing. Will be back again soon. Very chill lounge vide. 😁"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdnBXZldnEAE",
            "text": "The Alley Pizza Lounge is one of the best restaurants to go to in Pelham Bay. The owners are fantastic, the service is outstanding and friendly and the food, madoneeeeee it’s out of this world. The Alley never disappoints and will have your taste buds rocking."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dGNUWHFRRRAB",
            "text": "Went the other night and it was lovely. Great ambience along with great service and amazing food.  I had the prosciutto, shaved Parmesan and arugula pizza with the balsamic glaze and it was absolutely delicious. Highly recommend the food!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dVlmWEZBEAE",
            "text": "Delicious fresh pizza, super friendly staff, and great vibes. There was live music during our meal too for their Christmas party which was a nice addition."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anRDMTJRRRAB",
            "text": "The food is delicious, the fee times I've been there I have enjoyed everything I've ordered. I was so tempted to go while writing this post, but I had some errands to do, so it wasn't possible, but I might just stop before the week is over."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQamY3eVh3EAE",
            "text": "A worthy successor to \"Giovanni's\" Top notch food and perfect friendly service. For the first time in many years my family had Sunday Dinner here...very impressive. We shall return!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaXVhbElREAE",
            "text": "I love this place. I wanted soup and they made me a pasta fagioli soup and it was delicious. I was going to save half but it was too good to save lol definitely visit this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc3RteEtREAE",
            "text": "The food is so delicious. The service and staff  are exceptional will definitely  come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdFAtblFnEAE",
            "text": "Fancy pizza, beautiful venue, very quick ,professional and courteous."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaVBxckRREAE",
            "text": "Amazing environment, amazing people! I filmed a movie in this location and Steven’s hospitality was awesome! Try the honey bacon pizza I think that’s the name haha"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM1lDV3lnRRAB",
            "text": "Just went there with my friend and kids and we love the food pizza was amazing good so fresh I love the eggplant caprise the salad so good  we needed a place like this in our neighborhood service was great ❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbmEySW5RRRAB",
            "text": "Amazing food and the staff is very friendly and encourages feedback. 5/5 would come back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMFlhQ2NBEAE",
            "text": "Tried Alley pizza lounge with friends today and the food, atmosphere, staff and prices exceeded my exprctations! I will definitely be back to try more of their delicious selections & drinks!! A great addition to the neighborhood!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMWNIUW1BRRAB",
            "text": "Edit: This evening I revisited The Alley to have a nice relaxed dinner with my mother in the neighborhood. Unfortunately the ambiance and quality have declined since my last visit. I don’t know if today was just an off day but I ordered a black and white pie, meatball skewers and two cappuccinos. The cappuccinos were way off-the owner(?) outright said that he’s still learning to make them from his dad (which is understandable) but tbh mine tasted more like a plain coffee than a cappuccino. In the end I had to ask for it to be taken off the bill since I didn’t enjoy it at all.\n\nThe black and white pie is supposed to feature black and white garlic and the first time I had it the garlic flavor was very bold, this time I tasted no garlic and saw no garlic visibly. The meatballs were still delicious at least. The service was spotty with my server coming to my table while on the phone ordering take out from a different restaurant for himself. I get it its The Bronx and part of our charm is the informality but I really value consistency in my restaurant experiences and I was disappointed to say the least. Sadly I probably won’t be coming back.\n\nSo glad to have this in the neighborhood!\nWe had the meatball skewers, the black and white pizza and a bottle of their house wine. The ambiance was great, the owners and staff were very welcoming/knowledgeable and kind and the food/drink were exceptional.\n\nI grew up in Pelham Bay and tbh in terms of food and restaurants it’s really hit or miss (with mostly a lot of misses these days) this place really stands out. They also have a full espresso machine and coffee menu that I’m super excited to try out next time with their desserts. Congratulations to the owners and to us in the neighborhood who will get to enjoy this new staple!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzM3F2RWtBRRAB",
            "text": "My friend and i celebrated our birthday at the Alley Lounge this afternoon. We had the mozzarella sticks with tomato sauce,a  cheese personal pizza and the white personsl pizza pies. . The mozzarella sticks were large and delicious and the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMU15R19RRRAB",
            "text": "Welcome to Pelham Bay! Great food, drinks and the owners are great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbVBDX2tBRRAB",
            "text": "Absolutely amazing!!!!! The food was so fresh and tasted out of this world. I was greeted and serviced by the owner himself, 10/10 best service and interaction I’ve ever had so far. He was so kind and informative, the atmosphere of the entire restaurant was very vibey and chill, and it made me feel very open & comfortable. This place will definitely be my #1 spot to go for amazing pizza and great drinks too!! 😁🍻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWNDblNnEAE",
            "text": "Shout out to The Alley pizza lounge ,Had an amazing 1st experience with the family, Everyone was very welcoming, highly recommended ,10 out of 10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudjZQeV9BRRAB",
            "text": "I recently tried The Alley Pizza Lounge, it was absolutely amazing. From the calzones, to the true Italian style pizza and the delicious desserts. I will definitely be back in, the service was attentive and friendly, making the experience even more enjoyable. I will definitely be back for more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud3NfVkpBEAE",
            "text": "The alley is amazing, if you haven’t been you gotta go. The food, the staff, and the atmosphere are all 5 stars. I have had great experiences with everybody in there and I can’t wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudWViNW9nRRAB",
            "text": "Stopped by last night with my brother and the food was amazing!! I had the spicy honey pepperoni personal pizza and my brother had the pesto chicken pizza and it's a good size personal pizza for the price. We also had the appetizer calzone and those were very flavorful. Met the staff and they were very friendly. They also have a bar and I had the margarita which was made really well. The lounge setting looks very nice, comfortable and the perfect place to kick back and enjoy some good eats. Definitely recommend this spot and will be coming by often."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM0oydTB3RRAB",
            "text": "Had a surprise proposal dinner and the family at the alley fulfilled my vision 1000% they could have not made it more special. Top tier menu from taste, portions & presentation. If you have not already dined here or had take out you are really missing out. I will be supporter for life."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb2ZfT3VRRRAB",
            "text": "Definitely one of my favorite new pizza places in the Bronx.\n\nThe decor has a modern setting with hints of old Italian classic makes it unique compared to the other pizza places in the neighborhood. I also love that they kept the old Giovanni's sign up. It gives a sentimental longing for what it used to be, but an appreciation for what's there now.\n\nThe service was top-tier, all the staff was incredibly friendly, and Jack himself was a fantastic host, making us and every other guest feel welcome.\n\nThe food was amazing, with everything being delicious and fresh. I definitely recommend trying their cappuccinos to finish off the meal. I look forward to dining /ordering from them in the future and can't wait to see what comes next."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIenB5MHlRRRAB",
            "text": "Today I visited the Alley  Pizza lounge located near the Pelham Bay subway station. The food was just incredible. My wife and I got the mini calzones with chicken. They were absolutely incredible, nice and crispy and cheesy. We each got a personal pizza. The pizza had the perfect sauce to cheese ratio and the crust was crispy. Definitely will be going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicU1HdFRnEAE",
            "text": "I recently hosted my baby shower at Jack's Italian Restaurant, and it was an absolutely perfect experience! With 55 guests, I was initially concerned about managing such a large event, but Jack and his team exceeded all my expectations.\n\nThe atmosphere was warm and inviting, setting the perfect tone for the celebration. The decor was beautiful, and every detail was meticulously attended to. Jack was incredibly accommodating, ensuring that every guest felt welcome and comfortable.\n\nThe food was simply outstanding. From the appetizers to the desserts, every dish was delicious and authentically Italian. The pasta, in particular, was a hit with everyone. The variety and quality of the food left us all impressed and satisfied.\n\nThe service was impeccable. The staff was attentive, friendly, and professional, making sure that everything ran smoothly. Jack himself checked in multiple times to make sure we had everything we needed.\n\nI couldn't have asked for a better venue or host for such a special occasion. Jack's Italian Restaurant made my baby shower an unforgettable event. I highly recommend this place for any gathering or special event. Thank you, Jack, for making our day so memorable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINGJyNHJRRRAB",
            "text": "The Alley Pizza lounge. Five stars!!!  Ordered a few times for delivery. I went there the first time today. Owners were great people very passionate about the quality. Food was delicious and consistent."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIem9MZEJBEAE",
            "text": "A Bronx GEM!!!💎 Steve, Patricia and Jack were very helpful from start to finish with meeting all of my needs just the way I wanted it for my mother. The Alley did not disappoint. The menu was a masterpiece, with every dish bursting with amazing flavors. From appetizers to dish after dish, everything was exceptional, and the drinks perfectly complemented the meal. The team’s dedication to ensuring my mother had the best surprise party was truly heartwarming. Not only is the food outstanding, but the staff also made us feel like part of their family. Their kindness and attentiveness created an atmosphere that felt like home, which is rare to find. If you’re looking for a place that offers a personal touch, incredible food, and top-tier service, The Alley is the spot. This restaurant is truly a blessing to the Bronx, and I highly recommend it for any special occasion—or even just a fantastic meal with friends and family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIemJfb0JREAE",
            "text": "So much flavor and quality in their pizzas! Nice crust, my pepperoni pizza wasn't dripping grease, and the sausage pizza was also amazing. The mozzarella sticks were also excellent. Friendly service. That's all I ordered for my first time. Will definitely order again. A very welcomed addition to the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcElfZ2tnRRAB",
            "text": "The best Pizza I have ever had!! The appetizers were great, drinks were made to perfection, pasta was phenomenal, and the staff was very welcoming! Felt like I was at home! We’ve been needing a restaurant like this for a long time!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dTcyUXN3RRAB",
            "text": "Amazing experience. They realized they accidently gave me the wrong bag and made it up to me by delivering my missing item to my apartment. Food was really good too. Spinach artichoke pizza will definitely be a regular in my rotation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIekltV01REAE",
            "text": "Really nice new pizza lounge. The food was great and so were their espresso’s. Great hospitality. It has a modern vibe to it. Will definitely be back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdU9hTzVBRRAB",
            "text": "First of all, even before the food- the manager is SO nice! Secondly, and most importantly, the pizza is DELICIOUS! We totally needed a place like this in the neighborhood. Can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aS1qT0hnEAE",
            "text": "Great food, great service, and should hopefully be a restaurant we see in Pelham Bay for a long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURId29DWEtREAE",
            "text": "Wow!!! Truly delicious pizza! The dough is amazing! Arugula salad was so good. The service was terrific! Must try this new place!!!"
        }
    ],
    "reviews_count": 62
}