{
    "name": "Little Greece",
    "place_id": "ChIJe5fbIDeNwokRrgnxCsfM0Nw",
    "grid": "BX10",
    "address": "327 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.9,
    "user_ratings_total": 115,
    "phone_number": "(718) 310-6030",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT1psSXdWWEY1TFVoSVdpMXFhMDgzYzFSQ2RVRRAB",
            "text": "Excellent food, Friendly staff, affordable prices. This place has become a regular lunch spot of mine."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVk5GUTVkWFF6Y0dNMVJWQnVPV3g1UjNob1FXYxAB",
            "text": "Absolutely fantastic experience! From the moment we walked in, we were welcomed with the warmest hospitality. Honestly, the owner might be the nicest person on the planet! She went out of her way to make sure we were comfortable and had everything we needed. It's rare to see such genuine, friendly service these days.\n\nAs for the food—wow, just wow!  Beyond authentic! It tastes just like the food in Greece. The flavors were out of this world. Each dish was packed with so much taste, you could tell they used high-quality ingredients, and everything was perfectly seasoned. We ordered for four people, and everything came out fast—no waiting around here!\n\nWe dined in and the place is perfect in size just enough room to feed several parties!!\n\nAnd let’s talk about prices under $90 for a hearty meal for four? Unreal. Great food, amazing vibes, and wallet-friendly prices? You really can’t go wrong here. I can’t recommend this place enough. Definitely going to be a regular!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTk9WTjZjbEV5WnpWS05GbFpVbXgxYVRkQmRtYxAB",
            "text": "Great food and great people!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OclVrcG9lVWRpWDFkWlZuUjRjRWREVTNWblFsRRAB",
            "text": "Great food. Very fresh❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bk5tTk5UMk5DWTFSYVZqWnRkWGRLTFdKa2RrRRAB",
            "text": "Food is always fresh and tasty.  The owners are wonderful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSclNFcHBXR0U0VmxJMFlWWkNSRUZyYlRab1pVRRAB",
            "text": "Waiter was lovely,  food was delicious.  Just a few tables inside, not a true restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUmEzVlFVVGROY1dWUE9Xa3dXRTR6UW5KS1dGRRAB",
            "text": "Little Greece on City Island is amazing! My favorite is the pork souvlaki platter. I always get the lemon potatoes because they’re so good. We also love the gyro flight, which lets you mix and match three proteins for a great price, and the gyros are huge! The food is authentic and delicious, and Steve and Charlie always give the best service. Highly recommend! So good even my dog loves this place and refuses to leave."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVGlpYTdjME5iZE13EAE",
            "text": "The food is amazing and fresh. The staff is superlative."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM1VtTlpabUpmU0VaNFVuZFlVMHQ2TWt0TFlWRRAB",
            "text": "Ordered take out. Ready on time. Excellent food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWlltVTNXR05QZEhreU1WSmxaRzVVZG1oUFVtYxAB",
            "text": "Nice and crispy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wamNVTnBOVXBUZEVkbk9WTmFibEl0YmxOaU5XYxAB",
            "text": "Food was tasty and fresh, would definitely order again. Just wish the skewers had a chunk or two more of chicken for the price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVFpYQk9kbTFqUlRWSFVuWkJkemhzVWpKZlFrRRAB",
            "text": "The food is exceptional and the people running the spot are very friendly. Ola Kala!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WlZWQnBka1ZHVm05SGJtY3pOMlpMTVRWMU4xRRAB",
            "text": "Always a pleasant experience whether I eat in or take out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUlgxSnZaR1JaTWkxWU0xTkhiMVJ5VWtkRFJXYxAB",
            "text": "Thank you for offering delivery and making my son a delicious meal that he throughly enjoyed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRU5FMXhPSFp6YkU5cU9HUXRUMjVsYVRoVFYyYxAB",
            "text": "Great Greek food at a reasonable price.  Added bonus the great atmosphere of city island."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ck5HUmtNMmxpWWpKM09HeHBlazlPUnpOcGVtYxAB",
            "text": "We found this place after seeing a video online and we really wanted some gyros.The owner was very kind and accommodating. He smelled the ingredients to make sure the herbs were fresh and we even got to leave with some treats. Efcharistó!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONlVWUXRNbWRNWnpoR1dGcEJhMk5LWTFwZlpFRRAB",
            "text": "Their pork souvlaki, Greek Salad and their complimentary Vissino Glyko Koutaliou is really like a taste of Greek food and makes me reminisce my time in Greece. Staff/ cashier is courteous and friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNlJrbHdVVEpsTUVWa2FIVXlkMlpmUWpKUVRGRRAB",
            "text": "Tried the 3 mini-gyro platter for the first time-- excellent!  I have one left over for lunch tomorrow.  Hubby loves tje lemon potatoesra e"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1pFUkhWSGhuYVVrNFdtVkxTblpEZDBWSFZWRRAB",
            "text": "I ordered take out from Little Greece and received what might be the freshest looking take out I've ever had. I ordered the Greek salad, the spanakopita (spinach pie appetizer), and the chicken souvlaki platter. Everything was delicious. The salad was dressed perfectly and the lettuce was crisp. The chicken was tender and well seasoned, and the rice side was scrumptious. They were also very generous with their pita and their tzatziki is some of the best I've had. An excellent addition to City Island and the greater Bronx area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMVdYQk1NRFZZTVRCcFdFRkxXRFJWYW5OUGFrRRAB",
            "text": "They catered  an event  for my hospital at the last minute the food was awesome"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbFFrZFpZMDlRVmt0NlFVMXBjVXRTT0U5a1dVRRAB",
            "text": "The falafels, gyros, souvlaki platters are awesome! The people that run this little island gem are top notch. Will swing by again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTmVIcFZhMFoxYW5ab1YxZElTVEU1U1dkSFkwRRAB",
            "text": "Great food and great customer service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUlVrbFdPRzVxT1ZKR2FHOUljbUUxTUU1bWNXYxAB",
            "text": "The owner and staff were excellent. Very pleasant and warm. Food was very good. More for takeout, but there are a few tables for dining in. For a strip that is mostly seafood and large-scale dining in, this is a nice compliment and choice. You won't be disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWVdtVndaVGxGTlZSaVFTMXdNVFZsYW1oaWRsRRAB",
            "text": "This is a family restaurant. The owners are very welcoming, made me feel comforted and gave generous portions. My big issue is their menu is quite limited. I ordered their spanakopita and Greek salad. It was okay, wholesome but nothing memorable to me. My girlfriend liked their spanakopita. They gave us free tzatziki dip, warm pita bread and a delicious Greek yogurt (yaourti) with dark sweet cherries. Their deserts looked wonderful, especially their orange cake, which I will try when I return next. The highlight of the meal was the yogurt dessert."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObm0tYlROcWFPNE93EAE",
            "text": "Wow!!!! This is the sweetest gem in City Island for sure. What a cute little spot with DELICIOUS food!! The nicest owner and genuine staff. Freindly, sweet such nice people."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVmVVUklUV0poWkc1M05uZGlWSGhvTkc5V2QxRRAB",
            "text": "Had the lamb gyro and my daughter had the chicken gyro and they were excellent.  The ingredients were fresh and tasty. The staff was extremely helpful and nice.  Can’t wait to go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUHRrWUMtM19YTGR3EAE",
            "text": "Amazing restaurant- owner is kind, generous, and a talented chef. This family is passionate about the food they serve. They have a fabulous lunch special during the week, affordable pricing, quality ingredients, and general dedication to the community. Happy to have Little Greece on City Island! Been going all year since they opened and have always been happy with the food and service. Thank you for opening and becoming a part of our small community! Five stars!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMT2d6OXZKeThxWDhRRRAB",
            "text": "First time at this restaurant, the food was fabulous, can’t wait to eat here again. I would’ve posted a picture but I ate it too fast! Please keep up the good work guys!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeVY1YS04ZzVpOVF3EAE",
            "text": "Very happy to have this restaurant on the island. The food is delicious, with large portions for cost.  The menu is impressive for a small place. The atmosphere is fresh, welcoming and clean. We ordered lamb and beef gyros with their special spicy Greek feta dip on the side. Amazing flavors with perfect seasoning. The gyro meat was cooked to perfection. The young woman at the front was helpful and efficient and very polite when taking our order. BYOB since they do not have beer or wine. We were so full we had leftovers in to go boxes. We will be back to try the Greek desserts!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbkI2TWJkdVpPV3Z3RRAB",
            "text": "Never had Greek food before until my husband begged me to try this place (I’m a super picky eater) and MANNNNNNN !!!!!!! 10/10 recommend to all your friends. Amazing Greek food. Ive gone back already. The experience whether you are dining in or out is both amazing! Definitely going to start coming here a lot! The hype is real ! Definitely try it!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN2I3OFhzNlB2RHB3RRAB",
            "text": "Dined here tonight and I have to say this is the BEST Greek food I've had thus far. The reviews and hype are real! Steve is absolutely amazing! Will absolutely be coming back. You've got to give this place a try! You won't regret it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdXFwYlBnak1pNHJRRRAB",
            "text": "Loved this spot!  Hopped in for a quick bite when I was in the neighborhood and was blown away.  The food was delicious and they even gave me a free dessert and appetizer!   I would highly recommend this spot!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3ZIQWl3RRAB",
            "text": "Good food and service. A local business that should be supported 👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvczh6alpBEAE",
            "text": "I had the pleasure of dining at Little Greece on City Island, and it was an amazing experience from start to finish. The service was outstanding — attentive, friendly, and made us feel right at home. The food was absolutely delicious, with every dish full of authentic Greek flavor.\n\nWe also tried the desserts, and they were incredibly fresh and tasty — the perfect sweet ending to a great meal. The owners were very welcoming and clearly take pride in what they do, which made the atmosphere even more enjoyable.\n\nLittle Greece has only been open for about a year, and it’s wonderful to see them thriving on the City Island strip. I highly recommend this spot to anyone looking for great food and warm hospitality. I’ll definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2MzTm93RRAB",
            "text": "Amazing food, great portions, and service is great very attentive. I came from Far Rockaway it was definitely worth it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvenFpVnJ3RRAB",
            "text": "You feel like you home nice place l recommend to everyone ❤️🙏👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaWRiRHpnRRAB",
            "text": "Although this is more of a take out place, it has great food and service. I really recommend this restaurant for anybody who wants signature Greek food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaWFqdWV3EAE",
            "text": "Great food ,service and atmosphere. A Gem!  Highly recommended."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6ODZLblpREAE",
            "text": "Very yummy, very friendly, fair price.\nA welcome addition to the island offerings.\nThanks goodness for Little Greece!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeTc3RkJnEAE",
            "text": "amazingly delicious food ! fresh and flavorful!  Authentic Greek food ! always enjoyable ! Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeU1qUmVnEAE",
            "text": "Great Greek 🇬🇷 quick classics 😋👍🏽Service is always courteous, efficient & above all consistent. BUT...The guy has The Best Greek 🇬🇷 Desserts i have ever had, hands down! One of my favorite spots on the island, may it last Mille Anni 🇮🇹!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ajd6Vnl3RRAB",
            "text": "The food is delicious. The staff are so helpful and kind."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Nm9UcHdnRRAB",
            "text": "This is the best Greek food I’ve had in the States - by far. And Steve and his staff (Aidan) are so nice. The moussaka, in particular, is fabulous with the right ingredient mix (zucchini is in there for sure!). I’ve also ordered the pastitsio once (again, the best I’ve had and hearty unlike the pasta-filled ones you find elsewhere) and tried a dessert (rice pudding), the Greek salad (I’ve never seen such generous portions!) and the dolmadakia (which I’m normally not a fan of but wanted more). My girlfriend lives on City Island and loves the food there, too, especially the lemon potatoes!\nThe owner, Steve, went out of his way when we went in just before closing time this winter and kept the kitchen open. He loves what he does and his food and it shows. Ask him about his hometown and a Greek wonder of the world!  The atmosphere isn't 5 star Manhattan style, but you feel welcome and appreciate being able to get something fast and at a good price so it all evens out.\nI’m tempted to order several moussaka portions and freeze them - the last time I made moussaka it took me hours and required 5 pots and 2 baking pans so buying from Little Greece just makes sense! Plus I don't have to go to Manhattan or a Greek diner in the middle of nowhere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OHVySXlRRRAB",
            "text": "The food is so delicious. I started eating before i even remembered to take the picture.The drink was so good they recommend the lemonade one to try next time. The walnut cake i got to go and let me tell you when I took that first bite😍😍😍 I fell in love it was the perfect amount of sweetness"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbDRiZ1ZBEAE",
            "text": "Best Greek salad with chicken in the Bronx!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReE8zTC1nRRAB",
            "text": "The food at Little Greece was excellent! Very tasty and freshly serve. I will definitely be going again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc29tNUp3EAE",
            "text": "Food was absolutely delicious! I got the lunch special and the pita was so soft they even called back to ask how was the food. Excellent customer service and great quality food. The greek lemonade soda was delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN2Q2a3NRRRAB",
            "text": "On an island full of fried seafood restaurants, this Greek restaurant stands out. The food is delicious, plentiful, and authentic. The owner is very friendly and genuine. Go ahead and try it. Support a local small business that's great and truly deserves it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBenVTLXlRRRAB",
            "text": "This was my first time coming to this restaurant. Thankfully the food I ordered was made fresh and tasted great! I will be back and highly recommend this place to everyone."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNW9HN2JBEAE",
            "text": "Great food and an owner who is AWESOME!!!  Always accommodating and is so humble in allowing you to try new things he puts on the menu.   The food never has never missed with flavor and freshness.  Wishing this place an abundance of success and longevity. Keep it up,  you are a great edition to the island.🫶🏻🫶🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3M3ZDRGtnRRAB",
            "text": "One of the best restaurants on the island. The food is outstanding, the portions are great, and the menu is the perfect size. The restaurant itself is welcoming and clean - don't let the size fool you. My wife and I have gone twice now and had a great experience both times. It's always pleasant to go there, and I find myself thinking of the food even when I'm not there - the Greek vinaigrette on their salad haunts my dreams in a good way. Everything is seasoned properly and always cooked to perfection. What really makes it are the staff - the young man at the front is quick and efficient, always polite, and keeps excellent track of our orders. The owner/chef is friendly and signed us off after out first visit with \"Eat more Greek!\" Thanks to him, we will be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueE11QTVnRRAB",
            "text": "Owner Steve is incredibly kind and generous! The portions are huge, and he even offers generous complimentary dishes. The food is delicious—highly recommend the fries and the platter! The watermelon with yogurt dessert is so refreshing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3b29tQzdnRRAB",
            "text": "we came in as a party of 5, we ordered a bunch of food and everything was amazing! the owner even gave us watermelon with yogurt after our meal on the house! truly a great experience here :) so glad there’s  good greek place close by. prices are extremely reasonable as well, thank you again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczVEX1BnEAE",
            "text": "Small space but big flavors! Pleasantly surprised with the quality of food and friendliness of service. A welcome new addition to the Island community. Best of luck!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb0luZ1F3EAE",
            "text": "We just got back from Greece and we were hankering for Greek food. Little Greece is 100% authentic... The food is phenomenal and the desserts are to die for. A welcome addition to City Island."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNTRTeWRnEAE",
            "text": "It is delicious. The owner is very nice, friendly, and pleasant. The food is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeU9ITTRnRRAB",
            "text": "We recently bought a house a city island and is having construction done.  I have come here more times than I have fingers.     Once we move in we are gonna be regulars as well.   The food is delicious, the desserts are amazing.  The owner is so nice.    This place is super clean."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaG9ULXp3RRAB",
            "text": "Love this place! I go there often for lunch, dinner or a quick snack and I have been super happy with the food and the kindness of the staff. I brought my children and they absolutely loved it. One of the very few places on the island that I love. A Must if you live here ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ2ZMRmN3EAE",
            "text": "If I could give this establishment more than 5 stars I would. The food was fresh and authentic. The young gentleman working the counter was very kind and polite as well. I purchased a lamb gyro and the lamb was tender and the tzatziki sauce was creamy and delicious. The dessert was so AMAZING that I had to walk back and get seconds. Do not hesitate, take a walk in or a drive and enjoy a lunch, dinner, or DESSERT. You will not regret it. I will definitely return very soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudUlybFBnEAE",
            "text": "Had food here 4-5 times and has been very good and consistent. Ordered gyros, platers, skewers and salad. Fries are my favorite! Try to resist their dessert but they are delicious. Will go back and recommended."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X3NQN2NREAE",
            "text": "We catered a small order for our daughter's birthday and the food was delicious! Steve really went above and beyond. I highly recommend ordering the yanni boy as well as the potatoes and all the different dips."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc3RTWkhREAE",
            "text": "I was able to grab a bite and chat with the owner Steve. Amazingly kind, I felt corftable just sitting and doing some studying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYanFQTEtnEAE",
            "text": "A true hidden gem in the island. Steve, the owner, very attentive and kind. Food was amazing, we had the moussaka (home made), salad and loukoumades(greek donuts) it was delicious, . Portions are generous. Perfect place for an authentic Greek cuisine experience."
        }
    ],
    "reviews_count": 63
}