{
    "name": "Caridad & Louie's Restaurant",
    "place_id": "ChIJYcaIt7OMwokRQk57RsOw5ys",
    "grid": "BX10",
    "address": "1660 E Gun Hill Rd, Bronx, NY 10469, USA",
    "rating": 4.2,
    "user_ratings_total": 2930,
    "phone_number": "(718) 862-3939",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMGJ5MUpNVGRNWkMxeFYwaHdZVjlLWW10aVkwRRAB",
            "text": "No me gustó la actitud de el dueño o encargado"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KS01EWXlVMWt0WWt0NlVWZFRkVjl1TlMxUlJsRRAB",
            "text": "was really  good service and  food was excellent my family enjoy 😉"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNlRrZDZPR3MxUmtGeVUwRkVNVTUxTVRGd1VVRRAB",
            "text": "Muy buenos 👍"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eGNDMXhXV3hwUmpWbVkxcFBhM2xXZUhwQlIxRRAB",
            "text": "The food is amazing every time! We came in on an employees birthday song from their peers! I couldn't help but join in! Staff is always friendly and helpful! Highly recommend 👌🏿"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VmQxTjFUVkUyUVU1cVVuY3hWblJVZW1FM2VsRRAB",
            "text": "It's a busy location. So you know food is fresh everyday!. I usually do take out. Service from the staff is great. Food is juicy and delicious. Never disappoints. Fried sweet banana on point. Pernil tender and flavorous. Carne mechada soft. Arroz con gandules well done. Moro negro OMG sabroso. Visit them !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTWJtVkNRa3B1U1ZobFlVVk5WelpLU0U5S1ZFRRAB",
            "text": "Food was okay but they have false advertisement from years ago. The combo doesn’t come with Maduros anymore and they are still advertising it. They made me pay for it separate. Very frustrating when someone is on a limited budget."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdlprUlBZakJ1Tm5aV2VFdFpkMEZHWm5WamFIYxAB",
            "text": "I drive from CT to the Bronx just to get food from here"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVJ6ZDJka0poZEhSS1RrRjJabm8wVEd0aFNHYxAB",
            "text": "The customer service was great the teamwork is awesome everybody chipped in and did something for our table I give it 5 stars"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSVFuUlRXR0ZTYUdaUFVsQTNYMEpHVDBoaU9VRRAB",
            "text": "The food was delicious. The price is reasonable. The service was good."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcWRqVlNTUzFDVVVKUlRUTnNPVlZQV1dsNlNFRRAB",
            "text": "Great Latin cuisine"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc1YxOVZPVmN3VjNReWRtSjJUa3REZWtGTmJFRRAB",
            "text": "walked in and walked right back out couldn't even order. Was given a dirty look and because I didn't know where the menu was the lady brushed me off saying \"the menu order there with a stink attitude.\" these women need better customer service lessons!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa1EwcENabGhhYzIxV1NIVlpMVFl5YVhjMVowRRAB",
            "text": "Delicious food, I had the ribs and rice and it was perfect. The meat was tender and the rice was soft and the passion fruit juice was rich in flavor and not to sweet. I definitely will be making this a regular 😌"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNGNsbFpaVFJaVldrd1YyWkhXRTR4TFhWSmJrRRAB",
            "text": "Muy buena excelente trato y amabilidad en el servicio me gustaría regresar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc1duRTBaRFUxZW5Kc01teHFabWxuYUhGR1dYYxAB",
            "text": "Lately this location the food has been wack . Don’t get me started on the service. Sometimes the rice is dry. You get beans with only bean juice no beans at all .  The chicken is odeeeeeee dry. The food is  sitting out all damn day just like chipotle. How is that sanitary.?  I would rather eat my own home cooked meals then spend over $40 for a meal that that’s been sitting out in a hot temperature storage for hours."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWVFVcERNM2szWlVnMFluSTBVMUo2VmtSeVUyYxAB",
            "text": "The food is just okay. Service is not bad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM1dtaHJlRlp3ZGxWWFNFeDROekEwTlZCb1pIYxAB",
            "text": "I ordered the Chicken parmigiana sandwich and received dry grilled chicken between flattened bread. There was no sauce, cheese, or additional seasoning as a usual sandwich like this would have. It is not worth the $13."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSVFqQnNTMGRSYUhrNE5YUXdObDg1WmxkeVRIYxAB",
            "text": "Love, this place, the staff is always friendly and love my coconut mojito."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdDd2SWl3RRAB",
            "text": "Some works are rude some are nice , all they care about is the mighty dollar . I have dine in , taken 0ut & had it delivered .  Everything is about a 35-50 mins wait time , this place is a joke terrible service\nGo to EL VALLE is better then this circus . DOH SHOULD GO investigate the rodents. Omg almost forgot they sold a chicken soup that was sour at one point . Never coming here again to  gun hill location ."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSlVrMUhkSFphVFdGNVkxUldjblpIWjNkSVZXYxAB",
            "text": "uno de los mejores"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQmJqZFlOVU5VZVRGbE4xWk5TelYwVFUxVWFXYxAB",
            "text": "Great place to buy Domincan food in the bronx very clean restaurants"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUE9GcHBWVWxZTWpSWlQwaDRZVTFvWWxWdGVuYxAB",
            "text": "The food is good, portions are decent for the price. The service could be a little chaotic since they are so busy and you have to wait for the person that serves you to give you a ticket then you have to go pay some where else and then go back with the pay proof so you can get your food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQk0zUnZhWFpaYURFMlJYaEhSM2hxTVZSek4yYxAB",
            "text": "I frequent this restaurant for breakfast and dinner with family or on my own. Very good fresh variety of food dishes...love the staff..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MVozTTNWa1p5UzNveWFIRk5VakE0WHpsS1gwRRAB",
            "text": "I appreciate the workers they are always ready to serve.  Sometimes the food is a little salty."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVmMyVkpNbWxyVWtReE1WUjFVREpsVmsxa2IzYxAB",
            "text": "La comida es horrible , parece que la recalientan , y a parte es muy cara"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFVHbDRZM0ZOTFVSaVEwbDBXblJTYUMxQmExRRAB",
            "text": "Our to go to always"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wU2RUUkdNSHBLYzFoWlltaDRiMjlPU2kxc2NGRRAB",
            "text": "Restaurant manager is unaware of NYS laws regarding service animals"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQ1p6TXRRMGRVTFdaS1lrNVFVekJLV1U1YVkxRRAB",
            "text": "Good food good service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SWEzQTBhbTlKVFd4Wk9HeFdSamxhWkhaYVRXYxAB",
            "text": "I.usually have no.problem when I pick up my order in the restaurant. Lasr night (4/29), I decided to order through Uber Eats because it was late evening. The Family.Meal wiith fried pork and order of tostones were not good at all. Tostones were hard as a rock and cold. Pork was way over fried  and dry. Only the rice and beans were good. Very disappointing.\nI automatically rated Caridad and Louies a \"good\" on Uber Eats before I received my order because I anticipated the great service I usually get there.\nDo better Caridad!  I have been a customer for many years of this location. Caridad, do your best whether day requests or takeout late at night. If you can not fulfill the order with quality, please cancel the order. Customers do not have money to waste. Please be more mindful that the quality of the food should be consistently good at all times.That is how you generate your revenue and happy, satisfied, return customers"
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb29QRzJRRRAB",
            "text": "Roasted chicken es muy deliciouso. Caldo de pollo en arroz muy muy delicioso."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX0lpX3VBRRAB",
            "text": "Good food! Waitresses have improved service!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eWVWWkhNV0Z5ZDFZd1VsY3daVWxrUm1wZk5HYxAB",
            "text": "Food was very good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYVZqSlpUbTVvYldSMFRrWk5Sa1YyYTJaNVkxRRAB",
            "text": "I had the lobster ravioli was amazing!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ2FuSEFREAE",
            "text": "We have been here, so many time can't believe I didn't rate it a while ago. Price, food, and service is great. This was our place to go to during the summer nights. Took my mom for the first she actually enjoyed it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214b2MxY3dVM0JzTVhWRWRIUmtZMDVqYkRGck5HYxAB",
            "text": "Great pick up service. Called and the staff were extremely easy to order with. Pricing was great and the food was great.\n\nRecommended place and the Pollo de Asopao was up there for me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb29DZWpnRRAB",
            "text": "Great place for a wonderful hearty meal. The food is delicious and they have a wide variety of meals. Some of the meat needs a bit more flavor. Freshly made food with tasty drinks. The restaurant is spacious and clean."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aU5XQmpBRRAB",
            "text": "Delish food, great atmosphere and service. My family and I went to have dinner with a friend at this location (Gun Hill). Great service (both English and Spanish), delicious mofongo and Steak as well as flan with coffee with milk and black. Excellent experience! Parking was a bit hairy during dinner hours (Saturday night around 6 / 7 ish). There is a small lot but it stayed full. Aside from that comfortable seating. Chill atmosphere. We will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOZXpxWjZBc3BmRk5nEAE",
            "text": "I was really looking forward to my meal, but unfortunately it missed the mark. I ordered the steak and steak nachos, and both were underwhelming.\n\nThe steak was dry, tough, and lacked flavor, definitely not what I expected from a restaurant meal. The nachos didn’t fare much better; the toppings were sparse, and the meat had no real flavor. I’d love to see more attention to seasoning, freshness, and preparation."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eVpfN2RnEAE",
            "text": "Good place to eat & have drinks with friends. Be prepared to be full. The restaurant is open till 12AM which is great. I like their music but they also play different types of music if you ask them nicely which was a plus 👍🏻. Try out the \"Morir Soñando\" when you go it's it's a Dominican juice (think like Piña colada but without liquor). Cocktails are also pretty good, you can also make your own requests just ask ahead."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMZUZqSW1vd3ZtYXd3RRAB",
            "text": "Just got my order delivered and the chicken chunks without bone have mold on it 🤮.  When I called the lady said not my problem call grub hub smh"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRamJmTzR3RRAB",
            "text": "I usually eat at caridad & louies restaurant food is always awesome great food. But today I went to buy sancocho to go and the girl that served me was looking to see what she would put in the bowl she kept putting eveything back in the pot so when I got home she had put 1 giant potato ,1 piece of green plantain and 1 piece of meat. Wow they were swimming in there. 8 bucks for a small sancocho. I was just there on Friday and spent 384.00 dollars party of 10 and everything was delicious and everybody was happy ...no more to go for me. Eat in dinning only"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdjdLUTlRRRAB",
            "text": "The food was AMAZING!!!! I was expecting diner- type food at first glance, but BOY was I wrong!!! EVERYTHING was amazing! The garlic chicken, the pork chops, the skirt steak, EVEN the sangria (and I don't even like sangria!)! And our waiter was friendly as hell"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURscWV1QVFREAE",
            "text": "My order was wrong, but I didn't say anything since what I received looked good. My child ordered a milkshake but wasn't a fan. So I ordered her a juice and the milkshake was taken away before I could say just leave it. My partner ordered chicken with his side order being spaghetti. The chicken came with a garlic sauce and the spaghetti came with  red sauce which didn't balance out. When asked the waiter said there was didn't topping for the spaghetti but didn't tell us that when ordering. When the bill came we gave a credit card and there a 4% charge for using credit card which we weren't informed. Didn't leave there satisfied."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNeVNuSlcteHZYbEVBEAE",
            "text": "The service was great and so was the food. However the managed needs to address his customers better. His customer service and care for customers is very poor . The manager that was working on June 2,2025 at around 3:30 pm needs to be shown how to address customers better. Before the food came out this was crawling on the wall . I was able to kill it however the guy says oh it came from outside no apology no remorse nothing at all. Might not eat here again but that was not something flying in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcE1YdUp3EAE",
            "text": "The best Dominican food I’ve had. Place is kept very clean and it’s a big place. Little expensive. They have a free big parking lot across the street"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLcmhpcVNiZ2JQNUN3EAE",
            "text": "The employees on the serving line are extremely disrespectful and cold. Their customer service is terrible. It’s already frustrating enough that you can’t tell who’s next in line, but to make matters worse, you have to practically beg for their attention.\n\nThey addressed and took everyone else’s order without them having to wave them down, but for some reason, I had to ask if they were ready for my order after they just stared right through me like I was invisible. No ‘Hi, how can I help you?’ No ‘I’ll be right with you.’ Just cold indifference that kills your appetite.\n\nOne woman even responded with a cold “Yes,” as if I was an inconvenience. Most likely a race thing—and if so, that’s disgusting. 1 star review should actually be a 0. Do better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMGN1aTZ3RRAB",
            "text": "The wife and I went here late night. They have a dine in part and takeout. we got the half roast chicken with rice and beans. The food was seasoned well. I've always heard good things from this restaurant from neighbors but never been. The was street parking but they also had a free parking lot across the street. Definitely going to have to go back and try some more of their food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeE9qbm9BRRAB",
            "text": "The combination of white rice, beans, and Pernil creates a delightful symphony of flavors, with the tender Pernil complementing the simplicity of the rice and beans. The sancocho soup offers a rich and hearty experience, with a medley of ingredients creating a comforting bowl of warmth. The Mexican tacos showcase a burst of authentic flavors, with each bite delivering a satisfying blend of spices and textures. Lastly, the chicharrones de pollo are a savory delight, providing a crispy exterior that gives way to succulent and flavorful chicken. Overall, a diverse and satisfying culinary experience. Alongside the exceptional food, the service was outstanding, enhancing the overall dining experience with attentiveness and warmth. A culinary journey that satisfies both the palate and the soul."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxODd1cnNRRRAB",
            "text": "The food and service was absolutely amazing.  After my aunt's internment, we headed to Caridad.  It was a large group of family members, about 25 of us.  From the wonderful, aromatic foods to the friendly and helpful service, we were MORE than satisfied.  I even ordered mofongo to go, to take to work, the next day. I ordered the suggested bistec ensebollado con camarones y papitas, others ordered rabitos guisados con guineos verdes, of course there was the typical arroz,  habichuelas, maduros, tostones y ensalada.  My husband also had mondongo.  Mm-mm, ¡sabrozo! EVERYTHING that was ordered was Rre-que-te-rrrrico!!!!   Trust me, you will not be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cHZtNnhnRRAB",
            "text": "Compare the food I see on here and what was delivered was totally different!! Spend $40. This ain’t Dominican at all. The salad turn color and the chicken wasn’t fresh. Plus the rice was hard. Just be careful how you order delivery. Go pick up in person."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdEpEbHZRRRAB",
            "text": "Very disappointed ☹️. Ordered boneless chicken chunks (more like fatty battered chucks). Had to throw out! Rice was great 👍.Plantains for five dollars we're black as tar! I order black beans instead I  got red beans and was charged for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUczhPYVlREAE",
            "text": "Went today for breakfast, asked for Mangu with longaniza. The mango was so dry I couldn't get it down and when I say the longaniza was a joke. They should be ashamed for serving a dish like the one they served me. Who serves longaniza like this, never again, this meal was awful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeVB6R253RRAB",
            "text": "As nice as the waiter staff is, WARNING TO ALL CUSTOMERS: They are charging credit card fees of 4% that are added to your ticket, which does not comply with the legal requirements.  Charging credit card fees is against the law.  (New York State General Business Law 518 chapter 723, No seller in any sales transaction may impose a surcharge on a holder who elects to use a credit card in lieu of payment by cash)  We spoke to the manager, who was rude and disrespectful . He said we had to pay cash from the ATM to avoid the Credit Card fee."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN2VTNTBBRRAB",
            "text": "It was a quiet night staff is great 👍\nFood was delicious 😋\nCarlis is so 😁 funny . Only disappointed by the \"ham and cheese sandwich 🥪 \"\nOne thin slice of ham!??"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYX2NIT2lnRRAB",
            "text": "Best Cubano Sandwich I've had in a very long time. Pair it with a Morir Soñando."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHM2RIQm13RRAB",
            "text": "This is my first time and omg the food is delicious the place is beautiful the music was awesome and the staff was wonderful. Five stars DEFINITELY going back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dDdEMnVBRRAB",
            "text": "I've been going there for a long time.i never look at my check but today I ordered a Spanish Steak with onions and a salad with avocado  extra 3.50 for the avocado. The problem is had the menu said 17.45 for the steak..when the bill came it said 20.50 they say it says it on the menu they can change their price at anytime without any notice..I've never heard of that ever!! So people check what u order they over charging people on their food and drinks... They definitely lost me as a customer."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3eXUzdE53EAE",
            "text": "The food was ok  some of my seafood in the dish was over cooked. We only saw our waiter 2 times and that was for him to take our order, And to bring me my drink. Which was not good. After that 2 other waiters actually started to help us after they noticed how we was looking at other people who came in after us getting there food. Wondering where was our food. So they basically became our waiters. So my boyfriend who was now upset because of the disregard for us asks to speak to the manager and told him what happened. The waiter told the manager that it was busy that why he didn't get back to us. Which was a lie. When we came only about 1 party of about 6 finishes up and 3 other small party of 3 or less was in there.  And yes other party came after us but way after we order. My boyfriend didn't want a free meal. He just want the tip to go to the waiters that actually help us."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBby1idlhREAE",
            "text": "Whenever I am home, I always have to stop at some of my favorite spots for my favorite dishes. For well over a decade, my go to splurge meal has always and will always be the grilled shrimp and chicken platter in the butter sauce over vegetables and mashed potatoes as well as the shrimp tri-color salad. It's a warm & decadent hug to my belly and soul."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNDVuU2ZnEAE",
            "text": "The workers don’t treat you right if you’re black. Blatantly ignored when taking orders, people were able to be helped that just arrived and I was ignored while I was patiently waiting. Food is good racism isn’t."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhN3M2MTJRRRAB",
            "text": "Quick and easy, tasty food, excellent price awesome 👌 service I'll come back 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLTFY0dnYyZzVyZjlRRRAB",
            "text": "It's not what it used to be. The price for a large container of chicken noodle soup is ten dollars.  You get some broth a piece of chicken and one potato"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOFlpSHdnRRAB",
            "text": "I usually pickup or order via the apps, and the food IS decent. I think it's definitely waaayyy better than Bohio. The lunch specials and pastelillos are good anytime of the day. One negative thing is that I guess they opted out of whatever network gave the 5% back on Rakuten, so I guess I'll go there less. I might go there more if they stopped charging the 4% convenience fee on electronic pmts."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeWN6MVVBEAE",
            "text": "Usually my go to dinner take out but tonight was disappointing. We got all bones and no chicken, 1 small potatoes and 1 slice of carrot in our $16 soup. I felt cheated and my family was left eating rice with broth."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bEpPRVBnEAE",
            "text": "Good was great. The only thing I was not happy about was having to choose between rice and bean or plantains. Most Spanish restaurants will give you both as part of the meal."
        }
    ],
    "reviews_count": 64
}