{
    "name": "Sea Breeze Deli Corp",
    "place_id": "ChIJOza-aM6NwokRf-hgSa1G7sY",
    "grid": "BX10",
    "address": "325 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.6,
    "user_ratings_total": 51,
    "phone_number": "(718) 885-1263",
    "reviews": [
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcnhvdm50c0p2dWtRRRAB",
            "text": "What a perfect find at the start of our McLaughlin Eastshore state park hike. So friendly! Great service, food and drinks. Do make a stop here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOMkZ3X0gtLS1mU0p3EAE",
            "text": "Loud, unruly Children keep me from being a regular Customer.\nThe Owners kids are always here, running around and making noise. Not fun!\nHowever, the food is really good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VORzd6ZC0xMk42TzdBRRAB",
            "text": "Wonderful small latin and American deli on City Island Ave with full breakfast and tasty tacos, burritos, sandwiches, burgers, panini, tortas and cemitas and wraps, all cooked fresh to order. The staff is very friendly and the prices are reasonable. There are a few tables for dining in. Interesting selections in the cold drink case. Recommended if you want a quick meal day or night."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNF9IODlRRRAB",
            "text": "Sea Breeze is my go to place. They have a wide variety of food to choose from and are very welcoming.  My weekends are not complete without relaxing and enjoying a meal at seabreeze."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMU5IRUpREAE",
            "text": "Don’t expect fancy but do expect delish!!! My favorite are the shrimp tacos. Which you have the option to order American or Mexican style.   I had the chorizo tacos Mexican style and the shrimp tacos american style."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMlplUlN3EAE",
            "text": "Adam knows how to run a deli."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OXFXNDNBRRAB",
            "text": "Been a customer for about 4 months now. I am yet to be disappointed by their food. Delicious Mexican food as well with their excellent seasoning. Customer service is extremely friendly and you feel right at home and with a great family vibe going on. Their prices could be a little bit better I guess; specially if you pay with credit/debit, but overall I’d rather keep coming here for breakfast and lunch than any other place on City Island. Try a breakfast sandwich with chorizo or their Mexican Tortas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDhTTVRnEAE",
            "text": "Got a bacon, egg and pepper jack cheese on a roll with a black coffee for breakfast and both were good. The price was reasonable and the gentleman at the counter was very polite and welcoming. Definitely recommend this place for a good breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURia3BPRmtnRRAB",
            "text": "very nice and friendly family owned business with very good mexican food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeU9iSm1BRRAB",
            "text": "I mostly order delivery.  They are so friendly, affordable and timely.  Always a smile and correction if there is a problem.  I love them, they are my breakfast family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcXQtSEtnEAE",
            "text": "A nice little deli and nice people yummy food!😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUc002cERnEAE",
            "text": "Super sweet couple that owns this place. Always clean and very friendly. Good food, good prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMW9hd2N3EAE",
            "text": "Owner is an awesome dude and my friend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNk55b0dREAE",
            "text": "Purchased both breakfast and lunch at the same time before a full day meeting in the area.\n\nThe breakfast was really good: egg, cheese, and bacon sandwich.\n\nLunch on the other hand was not. I had turkey with cheese, lettuce and tomato. The turkey tasted a few days old and not like fresh cold cuts I would expect from a deli."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWajlLSjZBRRAB",
            "text": "Great family run deli with breakfast all day long. Had a delicious Burito that was tremendous. Been coming for breakfast everyday delicious and fair priced. Adam his family and Staff are always happy and obliging."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbDlibTBRRRAB",
            "text": "I'm a steady customer. Highly recommended by me.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSejVPUHl3RRAB",
            "text": "Everytime I'm in the area they're so customer friendly. Encountered Jessica today very helpful and customer friendly she is an asset to this 😊 deli🥰💜…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM291a01nEAE",
            "text": "A nice little deli on the main avenue with tasty sandwiches, burgers, and wraps made fresh to order. The owner is very friendly and the prices are very reasonable. There are a few tables for eating on site. Recommended if you want a quick bite in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSam9UeUhREAE",
            "text": "It’s delicius food and best service friendy persons. I like me and I recommend it♥️😋…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbnMtaUJBEAE",
            "text": "Always quick, affordable, good quality and good customer service. Very convenient and a nice place to pop by for a quick bite. Give it a try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMG96Tzl3RRAB",
            "text": "Great food, great prices and great staff at this family-owned deli!! Jessica at the register has an eye for details when taking orders and wonderful people skills. The whole staff is very friendly and welcoming. Definitely my go-to spot on City Island."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlekp1SERBEAE",
            "text": "great customer service!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aWR1SU5nEAE",
            "text": "Old school deli, joint's similar to bodegas in Guanica, PR, sweet customer service, will return"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1LWRPZzhnRRAB",
            "text": "Took an hour and a half to deliver food was very cold and they got my order wrong I don't think the lady taking my order was paying attention"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2NjhydEFnEAE",
            "text": "Nice environment.  It's clean all da times ⏲!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNUo3ZnBRRRAB",
            "text": "Nice deli, good service, quality food for one's money. I like that you can create your own salad by just following some simple steps on a menu. The team at the shop are also very friendly and professional, gives a very welcomeing feeling…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHb01yTEVBEAE",
            "text": "This is one of the only 3 delis on the island. The prices are reasonable and the food is ok. If you're there ask for the menu coz you won't see or tell what they have. This place needs some upgrades and organization to put things in order."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N2RMR1pREAE",
            "text": "My son bought a taco from here. Freaking delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhLVBYTzJnRRAB",
            "text": "Thanks, it was great"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcVlXNTl3RRAB",
            "text": "super sweet staff, and the best tacos!!! lengua is my go to :) absolutely love this place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpenB6NTdRRRAB",
            "text": "I regularly order lunch from Seabreeze. Nice people and good food!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpOXNtcWVREAE",
            "text": "I have been going to Sea Breeze Deli ever since they opened up here on City Island.  From burgers to tacos including breakfast, you will always get great service and great smiles from Adan and Vanessa who are the owners and everyone else in between!              I am a hooked customer for life!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbmZXdDBBRRAB",
            "text": "Too slow!🐢🐢🐢…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzX3BINlVnEAE",
            "text": "I'm 37 and I've lived on City Island my entire life and this is my new favorite place. I find myself coming in more and more. It's the perfect place for when you're hungry. I know...iSnT eVeRy DeLi pUrFeCt fOr wHeN yOuRe hUnGrY?...not…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzby1HMGVnEAE",
            "text": "Not wheelchair accesable"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwektpcTJnRRAB",
            "text": "Very Friendly Owners, Now Open Late, the tomatillo green sauce is awesome."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbUsySldnEAE",
            "text": "El servicio de primer nivel"
        }
    ],
    "reviews_count": 37
}