{
    "name": "Sangria Cafe",
    "place_id": "ChIJyQ2iW7iMwokRnvvOyuCywv8",
    "grid": "BX10",
    "address": "2085 Bartow Ave, Bronx, NY 10475, USA",
    "rating": 4.1,
    "user_ratings_total": 1662,
    "phone_number": "(347) 843-6486",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM2JYVkpWM2x0Y0dGVGJHMWtWM0o0Uld4V1NXYxAB",
            "text": "I went there for the first time last week... I will be back 💯"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wV09HdG1kbGRVVTFNdFltZERUVnBsWVMxcVEwRRAB",
            "text": "Nice place . Good DJ's"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbFV5MU5hSG8wZDIxMVNrZFVRbnA0TlhwRldYYxAB",
            "text": "The DJ was on his game that’s for sure. Nobody couldn’t sit still in their seats if they wanted to. That music had us dancing in our seats. The food and drinks outstanding. The music was great. Security was a plus 👏🏽 not mad at it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM1p6SlBaMXA2UzBOWmNuUmFVVmhoYWw5RVRuYxAB",
            "text": "I had brunch and dinner here many times. The Latin dishes are amazing! Well seasoned generous portions.\nMy favorites are the Picadera platter, the rib eye and the fried rice. The drink menu is extensive! Top shelf liqour and a good selection of beers. The cocktails are so good! The also have frozen ones.\nIn 2022, I had my retirement party at Sangria. The planning process was smooth and everything was better than I expected.\nSangria's service is  excellent. From the host to the servers, everyone is friendly and attentive.\nCome through any day and you will get great food, drinks and music!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25remNscHRhRlJDV201VldESlZWbVEwYVRCWExVRRAB",
            "text": "Visited Sangria on a Sunday to celebrate a friend’s birthday and we had a time. DJ was amazing, food was really good and drinks were drinking 🤣🤣. I just really wish the AC was on, the air was WARM, to say the least. Other than that a great time was had!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQlgxVlZkMmd6VlRreFgybHNYM0JRVGt0SmMxRRAB",
            "text": "Food decent.. DRINKS ARE EXTREMELY OVERPRICED..BARTENDERS ARE NOT SKILLED ENOUGH FOR THE AUTOMATIC GRATUITY….  $16 ($20 after automatic gratuity) for bottom shelf in a 4oz plastic cup… $18 ($23 after automatic gratuity) in a 4oz plastic cup…. Best time to come here is only happy hour to get you money worth.. but they have a DJ Thrus-Sun so the vibe is good .. I recommend pregaming  before coming here after 8"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQk4yTndRblF4ZG1aVE9FUkdla3BaU0c5bU9YYxAB",
            "text": "Fun."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT2FVTjJNRGxrZURWUVdIZGtVVGxTV20weE1FRRAB",
            "text": "Food great, Amazing and serve 10 out of 10 Liliana. Thursday night vibes. Recommend 100%"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMU5WaDVXamRYWWtGeFIyaE1RMmgwWDJWNk1tYxAB",
            "text": "The experience was so terrible all the staff was rude they closed early , there was a roach in my food and they didn’t heat up my chocolate cake after I asked so kindly. And the hookah guy was picking fights with everybody and giving everyone an attitude and made me uncomfortable. Super bad experience. Represents the Bronx poorly"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZmRIWk1TMDFOZFVSSFpFRlBNVkEyZURkNVltYxAB",
            "text": "Nice place lil over priced , they add gratuity on everything. 2 rum and cokes 47.00  crazy !"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWlZUZzVNRnBsWWtVNFpXSTNSek5pV2paR1FsRRAB",
            "text": "We didn't stay for food, but the waitress was kind and they made accommodations for our large group to sit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dFZtOXRla2xLU0VGak0xTjVXWEJ6TTBKVU4xRRAB",
            "text": "Great music and food...I would rerurn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeGNsZE9YMjFUV1c0eVVrUjNXa2hsUkhGTlduYxAB",
            "text": "Always good vibes.\nThe food is good.\nI have visited for brunch dinner and just drinks and music.\nStick to early hours for younger guests"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVN0xYTDVRRRAB",
            "text": "Food was excellent Ribs were great DJ was in full control great vibe"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZlFpMVBabXRYYTJvMGNEWTVNM0ZxYmtWcFVWRRAB",
            "text": "Food great, crowd age is mixed, gets crowded on fri and sat, hookah and music if thats what your looking for"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swek5ESk5OMUYzZWxGb1puUmhOekJRVjJoaVVFRRAB",
            "text": "Great vibe for a Sunday brunch, especially if you’re celebrating a birthday. The music is loud with a great DJ, definitely not the spot if you’re trying to catch up and have a long conversation, but perfect if you want to enjoy the music, dance, eat, and drink. The servers were good about keeping the unlimited brunch drinks flowing. I really enjoyed the appetizer empanadas, but I wasn’t happy with my burger. I ordered it medium, but it came out well-done with a “well” tag on it. I even reconfirmed with the server, but unfortunately, it was overcooked and lacked flavor, so I didn’t finish it. Overall, I’d recommend this place for the vibes, drinks, and appetizers, but not so much for the main course."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NFpVWlZVM1JxZG14M0xWWlVlVmhoVlhWRFlrRRAB",
            "text": "#whereisweekes....We had a great time celebrating GiGi's Pre Birthday Brunch. The food was ok. My shrimp & grits were runny, the birthday gurl change her food twice, the chicken & waffles looked very dry. The drinks kept coming and the atmosphere was on point.  We were dancing  drinking and having fun"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWlIweE1URVZmUm1VNVlWcHNYemM1T0V4R2FVRRAB",
            "text": "Horrible food, no variety on the menu"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdGRuSjBhV2hGVVZKNk1YQXROMUF5VVRSc2JrRRAB",
            "text": "This place used to be good..... I don't know who runs it now but it is TERRIBLE. The food and drinks are waaaay too expensive especially being in the Bronx. The atmosphere is a little below ok but the dj and music is good. As for a recommendation, I wouldn't recommend anyone to go there. This place used to be happening now I don't know what happened to it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbVRIQnpTaTFpUTBKWFNGWm9aRUZMVkRGbFgzYxAB",
            "text": "Excellent customer service our server Iliana went beyond my expectations. It was me and my husband first time eating here. Food was delicious. Fresh food. My only negative is soda was flat. But Sangria was delicious. We ordered shrimp fettuccine garlic in wine sauce and shrimp fettuccine Alfredo. So delicious. I will recommend this restaurant. For delicious food and Sangria. Plus we arrived to live Dj playing music."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MVREZ3RiRWRCU1ZWeFVWQkdTV0pQY2sxWlVWRRAB",
            "text": "Mediocre food, long wait times even when it’s not busy, and a manager who is shockingly rude. After paying our bill and tipping in cash, we were chased down the street over a missing signature. We walked back to fix it, only to be treated with complete disrespect.\n\nThe manager (Javier or Hector) was aggressive, grabbing for ID and card, even after being told not to touch her. The name clearly matched, confirmed by the security guard, but he continued escalating for no reason. After signing, he snatched the receipt book from her hand so hard he nearly fell.\n\nCompletely uncalled for. If this is how management acts, I won’t be returning—and neither should you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkT1drVkdjelZKVDJWdlNHUlFZM05uWmtac1dXYxAB",
            "text": "The food and service was good but the loud music was terrible.  I was there with my family but we could not have a normal conversation, we couldn’t hear each other with the music being so loud.  I asked one of the staff if they can lower the music and she said no but can move us to a more distant sitting area but that didn’t work.  So go on a Sunday morning brunch or lunch since they blast the music all day there, especially if there is a party - bring a whiteboard and some markers or motorcycle helmets with blue tooth head sets to talk to each other."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVRVSlJaRmxvUlRSNll6aDZUaTFhTVVnMVVHYxAB",
            "text": "I celebrated my Cousin Birthday 🎂. Food and music was great 👍🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSWNrUTNjalIxVG05cmVWVkNYMEpSUjJ0V1UxRRAB",
            "text": "Had brunch and my wife and mother-in-law loved the rose? sangria and they were pretty much happy with that. We also had the chicken and waffles which were good, a breakfast that I can't remember the name with fried cheese that was really good and the burger which had some great fries, egg and bacon, however the burger was a little over and even though it was an Angus patty, it wasn't anything interesting itself. Overall a great place at a decent price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keldHWlJkVkJKZG14VExUSkxia0UxYmtkM1JrRRAB",
            "text": "The security is okay, they can be a little over the top. The hostess was  friendly. The server, the per that took our order. He was russian us and unintentive he might have came back twice, and we was there over an hour. We ordered premium liquor, i think it was well liquor. It gave me the worst headache."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa2NXRlVUV05VVGtJd0xVdGpRamwzWTIxVWJYYxAB",
            "text": "I dont live in NEW YORK CITY any more but I will be going back here the next time I'm in town. The food and service was great. They have a live dj as well. Would recommend going during the afternoon though, the volume of the music doesn't allow you to have any conversations without having to yell across the table. The volume of the music was more suited for a club or a party. Aside from that I ate here twice in the week I was there. The food and service is good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFkwVTJaVzVmTlRoZk1Xb3dZbEpDZUY5M2JIYxAB",
            "text": "Kind of small quaint Latino atmosphere food subpar great party vibe but it's just too small"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbVZFSndYemgwVkRFMFFXMUplV2xaVkd4RVZVRRAB",
            "text": "My girls and I were there yesterday. We had a good time, it was a vibe the DJ played some nostalgic songs 😄 the food and drinks were good. The crowd super chill, definitely recommend and I will be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMk0xVnhMVmhPV1hSTlJYSkVjSE51V2xwcWNVRRAB",
            "text": "Came here after work. The vibes and the dj were great and so was the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR2NuWkNTVVZDVjI5cGRrMXhSa1ZZTFRZM2FXYxAB",
            "text": "Night life was super litt. Bottle service wasnt bad and the food was on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSFNqVXdjVXBmVUc5U1VGbG1OR0p6WkRJMWEwRRAB",
            "text": "Food was delicious, the tostones were crispy and served with the perfect sauce. They offered hookah and they have a good happy hour deal. The calamari tasted fresh and was a big portion."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSlVVcE5kMXBKTjFwMVRYcFhPSGRQYlVSQk5HYxAB",
            "text": "Small and cute ideal for a private gathering"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVGRXeHFZekowU0haV2N6aGtWMkp6WTJsNldGRRAB",
            "text": "It had good music and drinks..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVoyOXRjMDB6V1RKVk1EazJPVVJ3VFZoclFXYxAB",
            "text": "My friend had her 55th birthday here. She paid $350 in advance. Reserved tables and the section she wanted for 20 people at 9pm. She got there at 8:30 the tables and the section wasn't ready. They seated our people after 9pm. They gave other people her area that she Reserved. They said they asked the people to get up and the people said no. So through us in the corner. The promoter kept walking through our small area. My friend said excuse me can you stop squeezing through here. He got upset and pushed her and said I am the promoter. This was a terrible ordeal. Don't have your events, birthday parties, or any special occasion  there. They're unprofessional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORVptdzVSMlEyUlMxVlRVSmtSazVXU0RoMk5rRRAB",
            "text": "Great food and a very nice atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTlNpMUlMVU0wTjNFdFFrcFBaRUYzUkZkbFpYYxAB",
            "text": "Very Lively and welcoming"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odU5ubEVZa2w2V0VoMk5HNVRjRmt0TUdwWlduYxAB",
            "text": "I’ve lived in the area for quite some time but had never been to Sangria Cafe until recently—mainly to catch my favorite saxophonist performing live (and he did not disappoint! 🎷).\n\nThe atmosphere was lively, and the music truly made the evening special. However, the food was a bit underwhelming. My meal arrived cold at first, but the staff did kindly take it back to reheat. Unfortunately, once the steak came back, it was no longer cooked medium as requested.\n\nThat said, the chicken empanadas and dessert were a hit—definitely recommend those! Overall, it was a nice night thanks to the music and the vibes, but the food and execution could be improved."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT2VsWkthMkZIVDJGRlRuVnplbUozTlhkRVpHYxAB",
            "text": "Went for brunch and had dinner great time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVlZYaDRjVE5VWkV0cVduSkZOVTFmTjBSeGFIYxAB",
            "text": "A Wonderful time amongst strangers that weren't strange. A rare adventure in the Bronx that was fun and safe ... a real lit vibe."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFJ6TXRORmhOZVdReFVFOTBVaTB6ZW01MlZFRRAB",
            "text": "Perfectly cooked steaks and rich, flavorful sauces."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbU1HMVdUbGQyVFU1M2FFaDNWekkzVWxOMFUwRRAB",
            "text": "Great food strong drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dFJDMXhUMG8wUVZZNVYzRmxZbm96VjNNM1IwRRAB",
            "text": "To be honest, I'm giving this a blah ratings only because they claim to have wheelchair accessible bathroom. However, there were lots of items blocking the entrance to the bathroom. In attempting to leave the bathroom, I ended up breaking a lever off the side of my wheelchair. I reported the incident to the host, and all she did was look at me. I told my server about it, and she notified the manager who came over to see me.\nWhen I told him what happened and that that area needed to be clutter free, he mentioned that they usually move said items when a wheelchair patron needs to use the bathroom. My thing is, why not just keep the area free?!\nAnyway, the food was good and the music was great! Nice after work vibe, and they have a great  HAPPY HOUR menu. Great for able-bodied individuals, not so much for wheelchair users, especially if you have to use the restroom."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bGNuaHRNbUpNWnpSUVUyUnhZamhxWjFGUkxWRRAB",
            "text": "It was nice but hot inside. They had the doors open which was nice but  the A/C was not on high or something wrong. The sangria was not as strong as it usually is but overall everything was ok."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSlRFTnBNV2hPWkhCWGVWSkZWM1ZEUjFadFVFRRAB",
            "text": "Love it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM0xVb3pUSE13TXpoVlNFRllRVE5zYTNoc2NFRRAB",
            "text": "Awesome music and vibes. Waitress was distracted. Food options are limited in my opinion. Drinks are good. Great for a vibe."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKak0zY0xXeFlhTHBBRRAB",
            "text": "Wasn't my cup of tea"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX1B5cEgxajlTa3VRRRAB",
            "text": "My favorite spot to go to"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLci1ILW5BRRAB",
            "text": "Great  food and nice enviroment. there is parking 100 feet away"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQR19tZHlXcTVPSEpBEAE",
            "text": "Definitely a vibe for Uptown, only thing drink prices are too high, $20 for regular Henny no bueno!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOamdqcW1uMnZIR1pBEAE",
            "text": "My neighborhood spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbk1QX0NBEAE",
            "text": "Very clean restaurant. For the kids, they give huge portions, which is great when feeding multiple children. They can actually share a plate. Out of everything I tried I really enjoyed the mac & cheese that came with the kids meal. I actually wished I ordered that myself. It was so delicious. I also like the fact that with lunch, you get a free glass of beer. The atmosphere was nice and the staff was very nice and they helped us out with our toddler accommodations without us having to ask. I would definitely come back for the mac & cheese!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd01xUlZREAE",
            "text": "My family and I came here on a Saturday during brunch time and it wasn’t the greatest experience.\n\nUpon arrival, I heard the loud music and realized this might not be the spot for us. It’s a party brunch. There was a big speaker, some few large groups of people celebrating and dancing with not a quiet place in sight.\n\nOn the good note, we were greeted and seated right away. They also have a lot of food options on the menu and our server was attentive and helpful.\n\nHowever, we were given dirty cups.\n\nSo for a quick recap:\n\nStrike 1 the loud music.\n\nStrike 2 the dirty glasses. There was a lipstick stain on one and floating dirt in another glass.\n\nWe ordered alot of food. The tostones were great. The fries were very soft. The calamari was tasteless. All of the sides weren’t very appetizing; the asparagus, the broccoli, the mash potatoes was very salty and the rice and beans were just okay.\n\nMy aunt ordered the lobster paella and she was the only pleased person at the table. She did say the sangria tasted like juice tho.\n\nSo by now we’re at strike three. Four. And five. Unfortunately we all left with that feeling of, “we should’ve gone somewhere else” but we tried it. So I will not be back here and I can’t really recommend.\n\nI think if you’re looking for a party brunch, this is your place. And if you do come, you may want to order from the brunch menu, avoid ordering the sides and expect the sangria to taste like juice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOWIyUTFRRRAB",
            "text": "First time at the venue, although I passed it a hundred times. I'm glad I finally decided to pop in. We dined outside, although the restaurant was completely open. The food was good and atmosphere refreshing.  Music played was old skool but still  goodies. There was a bday party going on, but everyone else was dressed casually. Place is spacious, so plenty of seating is available.  I will be visiting again while the weather is still nice to eat outside."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeEpHRjRRRRAB",
            "text": "DJ was excellent, if you want an after work spot with food and drinks…. This is it. It’s loud and drinks are strong. Service was great, set up is nice in the private room.tiramisu was fabulous."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzZIQjNRRRAB",
            "text": "Some of the best places are found by accident! We stopped at this restaurant on our way back home to Connecticut and I am glad we did.\nI’ll start with my favorite part of this experience… the atmosphere.\n\nThe vibe in this place is amazing. In full disclosure the music is very loud. This did not disturb us because the selection of music had me dancing in my seat the entire time. The DJ did an exceptional job. He played everything from old school to New school and the transition between the two was flawless.\n\nPrior to visiting this place we worried about some of the negative reviews regarding the food. Despite this we decided to give it a try and we are so glad we did. The food was tasty. This is why it is so important to formulate your own opinions about a place before you reject them. Otherwise You may miss some amazing experiences.\n\nFor dinner, I ordered the pork chop and my fiancé ordered the fried fish. My meal included two sides. I selected garlic mashed potatoes and asparagus. The food was really tasty. We devoured everything.\n\nThey are very generous with their drinks. I ordered an apple martini with kettle one and it did not disappoint.\n\nNow for the bad…the service was slow. There were times I wondered where the server was and if he was coming back. There’s definitely room for improvement there.\n\nThe vibe in this place was exceptional. Which made missing the server a lot easier. I spent most of the time singing along to the music,  at most times we did not notice how slow it actually was until the DJ played a song we did not like.\n\nIf you visit this restaurant come with the exception that you’ll have a great time with delicious food but be prepared to wait. As far as food and drinks are concerned I highly recommend the pork chops and apple martini"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOHZtSnV3RRAB",
            "text": "The food was so-so, at least they have a good atmosphere and space to have a good time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMElDaGtBRRAB",
            "text": "My husband and I arrived today just when they had open. The atmosphere in this place is great and the food was amazing. I absolutely loved the sauce used on the mofonguitos it was memorable. My husband's salmon was also amazing and I was very impressed with the presentation of the food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bks2UjlBRRAB",
            "text": "Place was popping, music on blast playing the latest and greatest plus the classics.\nFood was on point with the tres Golpes, and the lomo saltado, but best of all was the drinks. The passion sangria and the tamarindo sangrias were amazing! Place has gota an amazing vibe and beautiful people all over! Def a place to come by when in the Bronx needing some food, good drinks, and a vibe!\n\nHector our server was amazing, bringing drinks back to back always ready for our next drink order and making recommendations on any food item/drink we were unsure of. Even made sure to bring out a cake and a bday shout out for my wife when her bday cake was brought out!  A1 service! 👌🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicUptaVNREAE",
            "text": "I went to this restaurant 3 times ordered takeout twice and Sat in for me and my oldest sisters birthday. The first time I ordered take out the food was amazing (Thursday at 2pm) the quesadilla was warm, neat and onion rings were in separate container and I received all the sauce for the quesadilla the cook did well. 2nd time I went for my birthday for lunch service was good, rice was a bit mushy but it wasn't bad. 3rd time I ordered takeout the cook had to be lazy as hell he put the onion rings in the same container as the quesadilla which\nresulted to them getting soggy  it looked sloppy there was big chunks of chicken in the quesadilla and I didn't get pico de gallo or guacamole the lady that handed me my food and tried to convince me that it was because I ordered from the lunch menu that I didn't get everything which was a lie she was also lazy and didn't want to go and get it . I then asked to speak to the manager and was told he or she was not present I was offered another order of onion rings which also looked horrible and threw it away. The costumer service was horrible the 3rd time that's not how customers should be treated especially if we are supporting your establishment I will not be going back, very disappointed. Monday cook 2pm horrible!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdExPSWR3EAE",
            "text": "Great smash and dine experience (appetizers and cocktails); for a beautiful Saturday afternoon mid pandemic. Took a walk in the neighborhood with a friend ended up here. Super enjoyable, plenty of space despite it being fairly busy. Waiter…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d1lEWnd3RRAB",
            "text": "Had a blast! Food was good had the fried snapper and coconut pineapple rice can't wait to go back. Great entertainment with the live band. The highlight of the night was the service you guys have great servers!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteEs3TE13EAE",
            "text": "Randomly stopped in with some friends on a Sunday afternoon. As I perused the menu, I went to Yelp/Google for an assist of what I previously ordered since I was so indecisive.\n\nQuickly I realized that I never did a review and remembered why. There is often too much going at once depending on the day and time you stop in. Case in point when we arrived, the music was blaring so loud I couldn't hear the hostess ask me where we would like to sit. Even the staff said the volume is often ridiculous.\n\nThankfully, they decided to tone down the \"club vibe\" and we were able to hear our thoughts as we dined. Since I've been here before and have had varied experiences this review is about our wonderful waitress Iliana. She was great, she matched the vibe of our group. Her honesty and humor was appreciated. She was attentive and made very descriptive and definitive suggestions that helps a few of us undecided folks make choices that we were happy with. From drinks to dishes she didn't miss.\n\nSangria Cafe is one of those places where you just have go at the right time depending on what your vibe is and of course we all know staff can make or break an experience in many situations and Ililana was appreciated.\n\nJust A Note:\n\nIliana should get a raise!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyM01DMUNnEAE",
            "text": "This place is Bomb! Like seriously you must take your mom, children, significant other. The Food is beyond delicious. You truly will enjoy it. The drinks are on point and let me say the music will have you getting out your chair and dancing. I love the variety of music they put together for all races. It just flows and you see everyone laughing, smiling, saluting, Cheering. Even the waiters and waitress dance and just the whole vibe there will have you definitely to come back. This is a very popular restaurant so the wait can extend from an hour to an hour in a half. BUT don't you go nowhere because when I tell you this place is so worth it, you'll understand why. Loved it. My older sis recommended this place and I absolutely loved it. ✨"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJeGFTS2xnRRAB",
            "text": "Came for lunch one day. The food is good. I had the pernil which was flavorful and moist; although the portions were smaller than I would have expected for the price. The bathrooms are large and maintained very well. The wait staff were really friendly and accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidEpUcUhnEAE",
            "text": "First time visiting this restaurant,The food was great and so was the service.  The staff was friendly and the music was entertaining."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjZuQUd3EAE",
            "text": "I recently visited Sangria Cafe in Co-op City with my husband for a nice evening out. The ambiance was really pleasant, and the music added a great vibe to the night — they usually have a good DJ that keeps the energy going, especially later in the evening.\n\nUnfortunately, my dining experience fell a little short this time. I ordered the fish with tomato sauce and rice, and while the presentation of the dish was creative and artistic, the tomato sauce had a very raw, overpowering taste — almost as if it hadn’t been properly cooked down or seasoned. It was surprising for a place like Sangria Cafe, as I’ve been here before and didn’t have this issue.\n\nI didn’t send the dish back because I personally prefer not to — you never know what can happen when food goes back to the kitchen. My husband enjoyed his meal — he ordered grilled chicken which looked and tasted great.\n\nOverall, Sangria Cafe still has a nice atmosphere and is a good spot for music and drinks, but I hope this was just an off night in the kitchen. I would definitely return but would probably order something different next time."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdllia2ZREAE",
            "text": "Love it here! The food was just heavenly. Well seasoned and tasty. The drinks are also on point! It’s a must try. Great spot for any event. They also have private rooms and outdoor seating."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbGZuMTVnRRAB",
            "text": "This was my first time at this Restaurant, saw it on News12 and started following them on Instagram, I thought I'd give them a try. My experience here was ok or pretty average. I arrived early so the place was not busy or packed, pretty quiet actually. Like any other Restaurant you'll be greeted by a host/hostess upon entry, the place is pretty decent in size with plenty of Tables, chairs, and stools with a bar at the center of the Restaurant. Theres also a party/private room for booking. The place was clean, organize, and very nice. Televisions over the bar and on walls, music playing through out the restaurant.👍 The staff was friendly and straight forward, some where preoccupied handling their jobs, we didn't think anything of it since the Restautant wasn't busy and I'm sure they needed to look busy. Our waitress had a pleasant attitude, the Meñu is straight foward and easy to understand, the Restrooms where clean, and the prices are fair, with happy hour at the bar. You can't miss this place, especially with that well lit sign and that metal bull out front. Food and Drinks where good, no complaints. I would definitely come back again. I recommend this place. Thank you and Enjoy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMFpHODVnRRAB",
            "text": "Very nice place, great vibes, music was great. My only complaint is that the food took long to come out but it was delicious. I would definitely come back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMElILUh3EAE",
            "text": "I cannot begin to say just how good the food and drinks are. SC delivers exactly what it describes, Latin fusion food that is fresh, delicious, and medium to large portions (depending what you order). Highly recommend the Arepitas as an appetizer and the Bistec Chino for a main dish. Everything we ordered was delicious though, so you can't go wrong exploring the menu. The cheesecake SLAPS, worth every penny. The drinks, especially the Sangrias, are INSANE. Hold on to your table and make sure you get plenty of food with your order because these DELIVER the fun times (they're STRONG). The staff was attentive, careful, and safe.\n\nTL;DR - Go with friends. Order Arepitas and Bistec Chino. Get plenty of sangria. Highly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXZtQUlnEAE",
            "text": "The Dj is & always on point. My friends & I always enjoy our time here. Service is on point.  The drinks are excellent, food excellent...Just go, you will see.  They turn all the way up.  Music is def my speed. Great mix...old School hip hop & R&B, Salsa, Merengue, Reggeaton."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUek5QZlhnEAE",
            "text": "1st time there. The servicers were  on point. The food very good. We all had something different and sampled the food. Very good atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJeVc1TkhCMnNtQ3BBRRAB",
            "text": "The appetizers were good. My sister ordered a grits and shrimp. It tasted like it had dish soap in it so we sent it back. She wanted the same thing but the server told us it would probably taste the same since it’s prepared in the morning and only the shrimp is added. She then ordered a fettuccine with chicken. It was ok. Not the best we’ve ever eaten but no complaints. I ordered steak and eggs. No seasoning. We just took it to go. The red sangria was great. If I ever go again, which I doubt, that’s what I’ll get with the appetizers. The server was horrendous. However, when we arrived we met a nice young lady whose name I can’t remember but she was very kind to my son. Our servers names was Mohammed. He could never be found. I had to go to the bar and get my own ice and ask other servers to please help us out. My biggest problem was that we ordered the specials where we choose from a select menu, get an appetizer, entree and unlimited sangria, and we pay a set price. As I said before, the items we originally ordered were on that menu, when he said if we get another of the same it would taste the same we switched to something else. The fettuccine wasn’t on the menu and I knew that so I told him I would pay the difference. He charged me for two specials and an additional fettuccine. I told my sister to call the manager but she said the music was too loud and she just wanted to leave. And of course, an 18% gratuity is automatically included so he can do whatever he wants. Not pleased and more than likely won’t be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkc2RXUjBBRRAB",
            "text": "Great atmosphere and service.  The food was very good although the calami was a little over cooked, the ropa vieja was excellent but the Spanish fried rice was a little too mushy for my taste,  portion were hefty and filling. We ordered sodas with our food but it was flat.  Overall a good experience and would come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXd3N2ckNREAE",
            "text": "Amazing place my second time going this time was with the girls and we had so much fun. The service was beyond excellent and fast. We was there for brunch and stay tour dinner.the music was on point that dj did his thing .the food was so good as always. Planing on going again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNGV6akZnEAE",
            "text": "This place is VERY VERY LOUD. I’m concerned for people who worked there. They may have hearing problems one day. I hope the owner will take heart to protect its employees. Plus it’s just very difficult to hear your dining companions’ voice…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad19lb1FBEAE",
            "text": "Hector was our server. He was personable, accommodating and patient.  The food was great.  The atmosphere was great!  Parking in front.  In door and outdoor eating."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhdXRDTE5BEAE",
            "text": "The Arroz con Pollo wasn't the greatest as the Chicken tasted as fish!  The Maduros were burned.  But the portions were good.  Were asked to move to another table per the Manager as they need it for a big Birthday party celebration.  That was not nice.  But the Manager gave us 1 free dessert and soft drinks!  Great music played to smile and have a good time.  Weekends are crowded!  The music and the dessert would be the only reason I would considered returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOGFxdnJnRRAB",
            "text": "Appetizers were chicken and beef empenadas.  I tried the Cuban spring rolls as well.. Main course came with steak, chicken, shrimp, half a lobster, and ribs.  We went during happy hour for the $5 drinks and everything was delicious!! My 2nd time here and will be one of stops just about every time I visit my hometown!\n\nAlso saw the chef and we called him over just to rant and rave about his food to him."
        }
    ],
    "reviews_count": 79
}