{
    "name": "Seafood City",
    "place_id": "ChIJl0Bg93uMwokRaYD9gXNnzGs",
    "grid": "BX10",
    "address": "459 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.2,
    "user_ratings_total": 7700,
    "phone_number": "(718) 885-3600",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR2RtUk9TRGRqV25WV1gyaGpWMEZ6YW5GaWNGRRAB",
            "text": "Great food and service!\nThe Kiddie rides outside are so sad. Charging $2.00 (1 token =$1.00) for an outdated and battered ride is not cool.\nPlease update your rides outside - it’s disappointing as well that the machines also don’t always work and instead just take your money.\nIt’s not an excuse to simply have a sign that says”at your own risk” (still on your property) which appears to service mainly families. I believe you can do better for the children."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4a1pWQkhOa3BTVkZsTVlraE1kblpFWkVnd1NHYxAB",
            "text": "The atmosphere was fine with me but too much rukus going on for my kiddo.\nWomen and men outside smoking weed, kids running around. I could come back alone but probably not with my kids."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcFJHb3RRV05vWjBKVU9URjVORmN5WXpWWGRVRRAB",
            "text": "That was my first time there on a saturday and it wasn't too bad. I mean, there was a random person who tried to start some trouble with my friend. The drink that I got was okay and good for a slushie. I got the shrimp and I think eighteen dollars for shrimp, and some french fries is a little too much. Other than that, if I didn't have any other place to go to. I would go there again. It wasn't bad, i just wouldn't go out of my way to go there again unless i'm in town because I live too far."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVE4xOTRhMXBRVEhGV056VldabmhFUlU5a1ZrRRAB",
            "text": "The food is overpriced and bland and they don't accept electronic payments. However, they do have three expensive mini-ATMs right at the front door.\n\nAtleast the drinks are good and the parking is free.\n\nI'm still trippin' over the fact they allow dogs inside, that's wild."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMWRFaHRaR3R1TmpJeU1EVmxWbXBJV0dWS1dtYxAB",
            "text": "When I come to new york we always have to stop at this place. The atmosphere is awesome.The drinks are incredible.The food is amazing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMU16VTNlbGx6V25salUxSnVOSGxzUVROUVpHYxAB",
            "text": "The Sea food platter. It was so small compared to 2 years ago I was able to take sum home  before now it was like I wanted more."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM2RrdEpka2MxWjNOR1F6SlBXa2N3VG5WQ1FrRRAB",
            "text": "Muy buena la comida 👌"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TE9GbFBhVmRvYUdWNmFYVnlXbmQxYmxBeGRYYxAB",
            "text": "They stock nice jams and spreads."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWGQzaEtOV1ZuUkhBeU1sOVNkVE5rUW5kMlZrRRAB",
            "text": "My boyfriend put me on to this spot! He wanted a drink and i wanted crab legs! Crab legs was a lil over cooked but satisfied my craving, corn was buttery and potato was dry! Drink was good and generous! Service was ok! Took my order and waited about 10/15 mins for food! Atmosphere depends on the time you go can be really full and packed with people or a few people"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MWN6VlliMUptYkZoVlZETmxjVEpyTldOa1VuYxAB",
            "text": "Great summer hangout spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNVNEbDZaMVpWZUdsbFNrUmtla05NVFVnMk9IYxAB",
            "text": "Good is great but the females behind the counter have no respect and are rude. They give you attitude with just about any request you make, asking for a fork, extra napkins is a Sin, and God forbid you mention that your soda is flat. Too much attitude for a place that only accepts cash!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRlRqTnBXSE5NTW5OaFJVSkNkbEpvU0VGWVRHYxAB",
            "text": "I've been here several times with friends. Food is good and alcoholic drinks be on point. I wish they started taking credit and/or debit cards. It cam be hassle at times getting cash first"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c29LTG5BRRAB",
            "text": "They need to do some upgrades to this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TmEwUnJNVXBYY2w5TlEwNXFNM1p6WjJrNGMwRRAB",
            "text": "Clean and colorful place, good seafood too. Small detail: smelled like marijuana the entire entrance and shady characters all around tonight."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka1RUZzNjWFpoVmxaR1lsWTNTV2d4YzJaSVVYYxAB",
            "text": "Its an open space set up like a dining facility.... but the food is excellent... not pricey at all... the drinks were on point ... not weak at all... all very worth it for a quick gathering of friends with great food n drinks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUlMzWnRSbFJxVW5ZMGQwcENWMkl4U1hSWk9FRRAB",
            "text": "Good food, Henny coolatas are the wave!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVGRtcEVOV0ZzU0dKdlYxQjVZMEZ2YkRGMGJXYxAB",
            "text": "Great place to socialize and enjoy a strong drink."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRGFFRmZPVXRqWnpRelpsWlZTVkZ5WDNsTVQwRRAB",
            "text": "Great view and atmosphere for people watching."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreFNYUlFRVEpYZERjeFgyaDFjbXhoTmtObWFGRRAB",
            "text": "I can always find eggs here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRmVETjJSbGxUVUZaT1NHZENVRTVTZEdGbGVIYxAB",
            "text": "I can usually find everything on my list."
        },
        {
            "date": "1달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS1lXcHRNVGhJVnpaR2REUXRNR05YUTNvNE1sRRAB",
            "text": "아이들과 함께가서 즐기기에 좋은곳.음식도 맛있고 양도 많고 아이들이 게임도 할수 있어서 좋았음"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSGMyaFpMVzlHY1VveFNWRmZWR1JMYUMwdGNXYxAB",
            "text": "Staff smile and say thank you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRGVGRXlTa3N3UzNVNWRFZHliRlkyYUY5YVNrRRAB",
            "text": "Best place to eat sea food ever. Has other foods to eat. Has arcade games."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNnNQeU53EAE",
            "text": "ONLY WENT FOR DRINKS"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFpGaFRSRll6VkZad1EyZHBhazFsTVUwMlIyYxAB",
            "text": "If you come from somewhere that known for seafood do not go here. The seafood over all  did not have any real flavor. The fried shrimp I had was good but the lobster had a fishy smell and fresh seafood is not supposed to smell. I opted to get a burger and that was good also."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocEszclF3EAE",
            "text": "I love love love City Island! Seafood city is the place to be! The food was great as always, however, the lady that took care of us when we ordered our food, was nasty!"
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV1RXSTJaMEpxWTB0bVdYaDVhVTVvT1hNM1FuYxAB",
            "text": "平价海鲜餐厅，墨西哥风味，大都是油炸的食物。用餐的人很多，每次去都要等好久才能领到食物。"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTVIySjVSMVZ2WDBwVGR6RnJjSGhtYmxwMFRVRRAB",
            "text": "BEST SEA FOOD IN THE BRONX NYC BABY.WE DO IT BETTER HERE"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeFIyOHRNQzAxU0U5RVQyeEVValoyU0hScFdVRRAB",
            "text": "Is a great place for you to go eat and spend time with friends and family. Prices are typical for New York area. The place it’s loud and very crowded. It’s very organized and for fast food is very clean. The menu is really extensive for mostly finger food. Indoor and outdoor seating available. It has a beautiful view."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQ2FYQmxOVUZuUVVkcE1FZDNiVWhhVG14b1QxRRAB",
            "text": "I went to seafood city and Johnny's. The fried lobster tails are 7 dollars cheaper at Johnny's. 38 dollars compared to seafood city at 45 dollars. I also was able to get my soft shell crab this time and Johnny's for 30 dollars. I don't mind spending 75 dollars for 2 meals because it only happens once or twice a summer."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWFgyTjBOMGRwT0RsSGJUZGhaMjVQT0dWTGNYYxAB",
            "text": "Henny Colada 😍😍😍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214V05XOHphMmRmVnpKcllVcENjRWh4V1hsTllVRRAB",
            "text": "Not the same since the pandemic. The food is good but the melted garlic butter is some kind of oil yuk! The Henny Colada had watered down Hennessey in it, if that was Hennessey at all smh. But overall its a decent family friendly seafood restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVMyZHNNa3BaUlVoSmQwbGFaUzFCWm1wdFNVRRAB",
            "text": "Food was fresh but no flavor very bland.\nToo hot inside to eat as well and they want to charge you for to go tray to take your food home. Well food box. A dollar for one! I had 10 people with me and we spent like 300 dollars and you need to take food home they charge you smh. That should be free. The drinks are good. But will not go back because it's not flavor to there fish or others seafood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TVYxOVFaVEJoT0dOVldtTnZRbE4yWlVwSWRWRRAB",
            "text": "Always chill and family friendly. Food is great and the games for the kids are cool!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOWNYVnBRRRAB",
            "text": "Always good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWGJtcG1XWGM0ZWxNelVWOHhPWEY1YUVOQlozYxAB",
            "text": "It has an amazing view with fun arcade games. The food however was not it. The grab legs we ordered were overcooked and was way too hard to crack open because of that. It was almost as if they were baked as well. The fries were not hot on the verge of being cold. So the atmosphere was good but food was mid."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWmMwOVZOVTVuVTFsRlkwVTNNMXBDUVhneU4wRRAB",
            "text": "Food was Mid but the drinks are great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVVdHeGZOM3BhYTJSVVF6VktPRnB6WlZCb1RYYxAB",
            "text": "Good shrimp if fried hard"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OME9VRnVkVEpZYVdWZlkxTkhTVzh5WkhoVVJsRRAB",
            "text": "Great place.  I honestly underestimated it because of the things that happened in the past.  They have truly redeemed themselves.  It’s more of a family place now.  I got the Clams Casino and I always get the broiled Scallops. Delish!  I got a virgin Pina Colado.  Fresh food. Great environment and quick lines."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbVJqQnplVzlYYUdKc2MyVlhlblJ0TjNSMFZIYxAB",
            "text": "Food was good not hot, if you sit outside there are way too many birds. Not relaxing outside. Prices are good. The number calling for food gotta get better, you can’t understand her. Line was long but they move"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MU43ZUJREAE",
            "text": "Everything tasted fresh and wasn't overly seasoned! Great atmosphere with area for children (and adults) to play at, nice spacious indoor and outdoor seating as well.\n\nThere are ATMs available if you need to withdraw some cash."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaME1uTlZORW8xWTFCcGExRklNekJMTTJjNVlXYxAB",
            "text": "Very fun place to go, very family orientated with video games, drinks can be pricey but they r nice & strong 💪 👍🏾\n****CASH ONLY**** there r ATM 's in the restaurant tho"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUmRqQXhOWEIxYkVsS1pFTXdPVmhvTW14dldXYxAB",
            "text": "Highly recommend. Quick service, decent prices and good tasting seafood right on the bay."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGYVpVRmhZalZOY0V0SFpFeFVRMnhLVVRKNWVsRRAB",
            "text": "I was told by my colleagues that this was a teacher's place, meaning a restaurant where teachers go to celebrate the last day of school, a momentous occasion, etc. This place had everybody there...teachers, families,  younger generation hanging out near the mini arcade. There's music, drinks,  seafood, burgers, hot dogs, fries. You can opt to sit inside or outside. Casual wear."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdjl1WlJ3EAE",
            "text": "Seafood City – City Island, New York\n\nDuring a recent trip to New York, I had the pleasure of visiting Seafood City in City Island to celebrate my daughter's birthday, and it was a fantastic experience. The restaurant is spacious, with plenty of parking and seating available. The service was quick and efficient, and the prices were very reasonable, adding to the overall value of the meal.\n\nWe tried a variety of dishes, including raw oysters, fried lobster tails, broiled lobster tails with garlic pasta, Manhattan clam chowder, a cheeseburger with fries, chicken tenders, and fried shrimp. Everything was flavorful and cooked to perfection, except for the garlic pasta, which was a bit bland. Despite that, the quality of the other dishes made up for it.\n\nOne of the standout features of Seafood City is its family-friendly atmosphere, which includes a small arcade for children to enjoy. It’s a great touch that keeps kids entertained while waiting.\n\nOne thing to note is that Seafood City is cash-only, which can be inconvenient, though they do provide an on-site ATM (with a fee).\n\nOverall, I highly recommend Seafood City for its excellent seafood, reasonable prices, and family-friendly environment. I’ll definitely stop by again when I’m back in town!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMjNnNGJndFptZS1BRRAB",
            "text": "Went to sea food city , the food was awesome.  I ordered the filet broiled and the fried clams and calamari and fried  which was okay .  A game area is also inside.  First time in this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUl6NlhREAE",
            "text": "I haven’t been here in many years. I’m glad to see. They have stepped up their game with safety and food was excellent. Glad I came back and gave it another chance. It was empty today because of Labor Day weekend which was great. There were no lines normally it’s super crowded. They are cash only but have three ATMs inside. I will be going back. I love seafood, City, honey coladas, and fried shrimp and scallops."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ2c0dWZYejRUUHhnRRAB",
            "text": "Great food and better drinks highly recommend the Henny colada and try the lobster tail with stuff crab meat"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNGJIQkNkRTA1VjJwdE9EVmZOMUJZYVVJd05YYxAB",
            "text": "The food is delicious as long as you eat it as soon as you get it. The fish got hard very fast because It was fried to crispy.  I  took home the portion I didn't eat and when I reheat it.  It was tough to eat\nI tried both microwave and regular oven heating at a low temperature.  Great portion size ."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMLWIyV2R3EAE",
            "text": "Good food.. prices are good.. they just messed up our order. Never gave us our side and the man that took our order wasn't good.He didnt listen when we were ordering.. went back again months later.. found out m-w is happy hour. Henny coladas for 12dollars  1-6"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeFJFNXBiRUl6UTJSbFZ6WnhaMWh2TkdOMlZYYxAB",
            "text": "What more can you say about this place?\nIf ratchet had a home, it would be seafood city.\nThe food has fallen off big time for one\nThe drinks are on point.\nImma keep it positive but trust me when I say, there are better choices in City Island.\nThe service, all things considered, is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibDZDZFN3EAE",
            "text": "The foods have no seasoning and there is no salt. No lime or lemon. You have few sauces like ketchup, tartar sauce and cocktail sauce. You need to wait for your number after you order."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaU1tRlhnEAE",
            "text": "This place is a family favorite. We have been coming to this location for several years. The food is usually very good. We went on Father’s Day. Despite the large crowd at the time, the food came out hot and tasty. The view of the beach at dusk was the cherry on top. Employees are kind and quick. Top recommended location."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd2FteDNUMkZUYTBFNFJVZFlaMGQyT1VsdlRGRRAB",
            "text": "It was pretty easy to order. There is indoor and outdoor seating (overlooking the water).  The food was good, some items take longer to prepare than others (fried is faster than broiled). Restrooms were clean. No complaints!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdk9mYWlRRRAB",
            "text": "I absently love this restaurant. everything they cook is well done. However, my favorite by far is the broil lobster tails. The seasoning on the lobster tails is perfect. Not salty and with enough garlic and butter. The pasta is okay and the french fryers are okay too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqb3Jhc29nRRAB",
            "text": "Very clean and fun atmosphere. Wonderful food choices of all kinds!! Excellent and great tasting drinks. Experienced and kind staff. Will return always!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOGQ2dk9nEAE",
            "text": "I was actually surprised of the quality of food made here. I expected chain food quality, but I was wrong. I ordered the New England Clam Chowder and Fried Shrimp, with Fries, Cole Slaw, and a Pickle. First, the restaurant quality Clam Chowder, Creamy, Clammy (in a good way), potatoes , I rated this a (5), its a must have. The shrimp were also restaurant quality along with crispy fries (4). The facility is made to hold plenty of people and set for a quick counter order type atmosphere.  There is an outdoor area for nice days and plenty of parking. I would recommend this place as a fast-paced eatery for a good quality lunch or dinner with a group."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMVFrVmFOamRtTWs5d1FXMHRZMlJYVkRWNlMyYxAB",
            "text": "The food is bland. Needs seasoning. Although expensive, drinks are tasty and hit the spot. Bartenders are great. Outdoor music is a vibe, a mixture of everything. But I could have done without the rodents running around."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaajlLWUdnEAE",
            "text": "The food is not bad at all just need a little more shrimp when ordering a shrimp dish. Ordered Stuffed Lobsters- crab stuffing mostly stuffing, the fried shrimp dinner- not many shrimp for $18, Oysters- hubby liked them but said they’re small, the shrimp and chicken Cajun Alfredo- not enough shrimp but chicken very tender… THE DRINKS ARE BOMB! All together (without drinks) $103. Family style cafeteria/ picnic like atmosphere- patio view of water… finally a mini arcade…I will come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cXFmOWtBRRAB",
            "text": "This place was great! Food portions where huge and the options for alcoholic drinks were endless and creative. Make sure you are ready to eat when you come here because you will definitely get your money's worth!!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNy1yb21aX05xV05REAE",
            "text": "The fried shrimp & fried lobster tails was superb. 8 thin sliced tostones for $6 come on . Not even a half of plantain used. The shoe string French fries could be changed. The pickle is good. The corn on the cob is good. Going here  today again. I promised to bring someone here for their birthday.  Enjoy your day."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbVZrWkpSalJtWW5GellXeHhaMU5UWmpKNU1WRRAB",
            "text": "Great Food, drinks and chill vibes by the water"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnemJrbDBRMlJGYVROaVkyNTRla0ZOU0VSeWFtYxAB",
            "text": "This is like outdoor take out food. The food could be seasoned more, but it's good. The drinks are fantastic at a reasonable price. It's a good place for friends to gather."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaHFXalVnEAE",
            "text": "We didn't have to wait long. The food was seasoned to perfection.. The drinks were hitting strong."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdlBlX1BBEAE",
            "text": "It’s an awesome place to enjoy with family and friends… but I have ordered the snow legs with shrimps since after covid and it’s been oily and salty. We need the old chef back!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1ejhHU0FnEAE",
            "text": "I recently went back home for some family matters. It was suggested we dine at Seafood City in City Island. I haven’t been to City Island in decades. This restaurant is family oriented, however, it’s a busy place. There is a kids area, arcade area, and dining area. The process to order food seems appropriately controlled and works. The decor is true to its name and location. Also, the menu is part of the decor. This is a fast paced environment so the staff members may not be able to wipe your area (including floors) down prior to you taking a seat. Grabbing a table is a must! Food was decent. My niece and her dad order the seafood combo. I had the wings and fries and they were decent. Self serve condiments though lacking of various condiments. No hot sauce, only ketchup and some other sauce. Decent service. Available parking in front of the restaurant. Cheap prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNDZIUjZRRRAB",
            "text": "EVERYTHING IS OK. BUT THE MEXICAN CASHIER HAVE A ATTITUDE. BECAUSE I'M ORDER SOME BBQ RIBS. AND THE RIBS IS SO SPICY. I ASK HER FOR CHANGE N SHE DON'T GAVE ME A BREAK FOR EXPLAIN N GAVE ME MY MONEY BACK."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa09XWU1nEAE",
            "text": "A staple for my family and loved ones for as long as I can remember. The fried food always hits the spot in the way only city island can pull off. The Henny colada is a fave for my fiancé and for me the strawberry daiquiri is my go to.\n\nThis is a place my family and I will continue to visit for many years to come"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bmNMcjRBRRAB",
            "text": "A decent experience was had as this was our first time at this restaurant on City Island. My only drawback is they do not accept credit cards and they do have 3 🏧 machines near the front so you can get the cash to purchase your items. The…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNk9iNVVREAE",
            "text": "Absolutely one of my favorite places in City Island! Look forward to coming here every summer with family and friends. This is a very casual, very local spot and with food that rivals any high end seafood restaurant. The broiled king crab legs are some of the best you’ll find anywhere. The scallops and calamari are also great. The Henny-Colada’s are strong. Lovely views of the city.\nBring cash!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4b1psb3pWRGhOTVRreGNuVjVjM1J0UlRaRGEzYxAB",
            "text": "Nice atmosphere outside by the water, well air conditioned inside, and the food prices are reasonable.    The seafood is decent but not seasoned; you will have to use the free condiments to flavor your food.   The lines are long when ordering your food,  and it's crowded after midday on a weekend; I have never been at this seafood place on a weekday, so I'm not familiar wirh the type of crowd they service on those days.  Major down side, for me,  is this is a cash only establishment. However, ATMs are available but why pay twice, to access cash then pay for your food in cash.   Besides that, a descent place to catch up with friends and family for a nice little outing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRGRISktjVFpUYUVablpGVmZORVZmTjNWU1JXYxAB",
            "text": "Great food and prices!"
        }
    ],
    "reviews_count": 72
}