{
    "name": "Sammy's Shrimp Box",
    "place_id": "ChIJp7Ea-IWLwokRgd6s0WeMg9I",
    "grid": "BX10",
    "address": "64 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.2,
    "user_ratings_total": 3326,
    "phone_number": "(718) 885-3200",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNGVWcHdjMlpWYWxSUWVtRjZlVGxQUVRsRlkxRRAB",
            "text": "Been a few years since I've been to Sammy's so I was excited and it was well worth it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVJrWnhhRm8xWDBSS1YySnBkMkZNYzFkblRHYxAB",
            "text": "One of the best seafood restaurants in Newyork City, a wide variety of seafood, nice caterers, good parking and outdoor dining, what more could you ask for, make it a date, you will not regret!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcFdVVjRNbHB4T1RaU1JYQldSRkkwY2pkNlMyYxAB",
            "text": "The best of everything from the time I seat down till the time I left I highly recommended. You won't regret it. Great place to take your family,friend, or a lover..wink 😉 thank me later:)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNmFUbFJaV2xKZEhSdWMySm1hM2cyZDBkYVVYYxAB",
            "text": "If I could give my overall experience a negative number I would. My bill total was $86. I left 4 $20, a $5 and a $1. Waiter takes the money, comes back seconds later and informs me I only put 3 $20 bills. I informed him I counted the money twice and put the correct amount on the table. With inflation going on, I wasn’t willing to put another $20 bill down (it’s the principle). So I ask for the manager. I ask her if she can check the cameras and the first thing she says is “that’s not necessary.” (Then later on states that she doesn’t have access to the cameras). Then proceeds to tell me how long the waiter has been working there and how she has never had no issues with him. Let’s keep in mind, the word “steal” or “stolen” hasn’t come out of my mouth. He could’ve possibly misplaced it or it could’ve fell on the floor on his way to the cash register. I love this establishment and the food as I have been going there since I was a little girl. I will no longer return this establishment as I am completely and utterly embarrassed and not satisfied with the way the issue was dealt with."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SME1GOUtPRFF6UVZwNFluTndVRXhJV1d4RmVVRRAB",
            "text": "Amazing place delicious food great service"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFd1lqVkVRMkpqWTBSQ1RrTkJYM1pxVldwS1EzYxAB",
            "text": "Awesome place to have a great meal especially if you like seafood"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1ZrVnhjV1IzVGsxVlNuTkZNazVpY1hwWWJtYxAB",
            "text": "“We had a wonderful experience dining here! The food was delicious with huge serving, the atmosphere was warm and inviting, and the service was excellent. The owner’s wife was especially friendly and welcoming — she truly made us feel at home. Highly recommend this place!”"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX2VUdVRBEAE",
            "text": "A great idea on their part to have something a little different than just seafood on a menu in City Island...... The BBQ is spot on. Plenty of food to go home with you, it's like getting 2 meals for the price of one. Definitely will be going back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWGRYaEZWMmRqV1daUWREYzRZbWw1VGt0RFpWRRAB",
            "text": "I came to Sammy’s Fish Box with my family, including my 3-year-old daughter. At first, my toddler was upset and crying—as toddlers often are—but what shocked me was how the hostess handled it. She didn’t greet us warmly or even acknowledge us at first. After much encouragement, she finally made a very dismissive remark: “Do you even think you should sit down?” That comment alone was unprofessional and insensitive. Once we were seated, things didn’t improve. The hostess (late 30’s-40, female, black hair) continued to be inattentive and showed no concern for our table. I even decided to step outside and take my daughter to the park, leaving my husband and mother at the restaurant, but even then the hostess never bothered to check on them or make sure they were being taken care of.\n\nFor a restaurant that caters to families and large groups, I expected kindness, patience, and at least basic attentiveness. Instead, the service we received—especially from the hostess—was cold, dismissive, and frankly terrible. It left such a bad impression that I would not return, and I cannot recommend this restaurant to other families."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocldHWkVSM0I0ZUV4TmVXNTJhMlJUUjNWRVkwRRAB",
            "text": "No longer the Shrimp Box. This location is now serving barbecue. Large portion sizes in the Sammy's tradition. Take out or dine in is optional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TFZEVkhabDlJUVU1M2VFbE1NbEIxV0ZaSlEyYxAB",
            "text": "Enjoyed the night out, food was good, staff accommodating, and pleasant, it was worth my 54 miles  round trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlJrWjRXbkprWXpocWFUbHdTV3QxZUhkVlEyYxAB",
            "text": "The food and drinks were amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMVdWQkJSMVY1TWxkV1oyeEpkRE54VFRaeGJFRRAB",
            "text": "I'm writing this review to whoever bought this place and manages it now. Real long time Sammy customers will agree with me. I have been coming here for close to 18 years and to see the short cuts, changed menu and slow service is really sad. I'm sure the original owner would've been sad to see this. The menu is completely different now. Your not served the pickled appetizers or the big bread with cheese anymore. Everything that used to come with meals is charged as a side order salad, corn so on so on. Your not served pasta anymore and the pilaf rice is much smaller on the platter even the butter, sour cream are skimped... Very disappointed and unfortunately I won't be returning here. I'm not going to pay over 100$ for a experience that once was when we used to have plentiful. Bye Sammy's"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTWQwMVJTbWgwUldzMGNGWndiamxYTlUxc2JHYxAB",
            "text": "This is Sammy's smokehouse now. It tasted like everything was boiled, not smoked. The sausage was good, all else was very bland. The sides were tasteless. The beer was cold! The funny thing was, when we walked up to the place, we didn't smell any smoke from the smoker. Until they improve the food, don't waste your money."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Rk1YbHBibFZoVXpsdE5GcGpTamRrTVVsbVptYxAB",
            "text": "Buen servicio buena comida"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTloyNDJlVFkxZEhWME5IQmtWR3d0VFhwUlVXYxAB",
            "text": "Food over priced 6 hard wings to expensive"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFYzcHhXa3hoVm5Rek9FNXBkVlY2Vm5jelMxRRAB",
            "text": "Absolutely floored how this is advertised as a meal for 2. Husband doesn't like sea food (I'll eat the ocean if you let me) so we agreed to the BBQ platter.  We ate our fill and took home leftovers and easily ate again for lunch AND dinner the next day. Brisket was tender enough to cut eith a spoon. The hot wings had real flavor. The corn bread was moist WITH crunchy edges. Matter of fact, stop reading this review. Go over there and try it for yourself. We had to walk it off for 2 hours just to be able to breathe without a full belly!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padFZHSnhjbkZCY2t0Q1dsQm9SbkpIUlZCa2RFRRAB",
            "text": "Awesome experience!!!! It's always a great time when you can get to City Island 🏝 💯. The food was fresh and prepared perfectly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dmRsWllhVXcxVlVWUlQwRkxRVWRWYVZreE5tYxAB",
            "text": "Great food and enormous portions. Couldn’t believe this lobster roll with two tails !"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNE1UcE5nEAE",
            "text": "Love the renovation they did. The food is always great and now they have added more to the menu"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadFJFazRWVVZVTWtrelJuZFNSVzVFUVRWWlYwRRAB",
            "text": "Un servicio excelente y comida excelente precios cómodos"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFJpMUpOR05SYVdaQllraFNlRk5WYjJoblJWRRAB",
            "text": "Good food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1JYZFlVMDVzYlV4bGNrMW9hM0JEV1VoeVJsRRAB",
            "text": "Awesome place, great food, drinks are good too"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJYk5qc09peW9IZUZBEAE",
            "text": "Surprised it changed to a brisket house"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYkJydVhXMUxUMWlRRRAB",
            "text": "Excellent service!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOam53TnZKamF2LVZ3EAE",
            "text": "Didn't eat there. The name says Sammy's shrip Box. However the server BBQ and seafood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNM1J1WUtHdmJUVUpREAE",
            "text": "This was not what my family and me came for! Sammy’s Shrimp Box is now Sammy’s Smokehouse. We drove an hour from the city to get delicious twin lobsters that my mother loves so much to find a completely different menu! Menu changed. Service change went from the best service you could ask in a restaurant to awful service. Food menu changed completely. Website should be removed completely and changed to Sammy’s Smokehouse.\n\nService: My family ordered white wine and it came out hot. Had to ask the server to change it and then server proceeded to take the ice bucket with her afterwards. Pina colada I ordered was watery in less than 2 minutes. Server basically left and never came back to check on us until the bill.\n\nFood: Hot White wine served. Piña Colada was more watery after 2 minutes. Complimentary Bread changed, Cornbread was the best. My mother came with the mind of twin whole lobster they use to have. No longer serve that so she had to order. Seafood Broil Combo. It had the same flavor, but not the same quantity. Quantity is smaller now. I ordered Baby Back Ribs with Fried Shrimp. It was good, but over priced for the quantity served. My father ordered Broiled Red Snapper. It was good taste and quantity. Sides were not good they came out at Room temperature . NO to the Brussel Sprouts cause they are not Roasted they are steamed. Option of soup or salad before entree's No longer a thing. MAJOR CHANGE!\n\nAtmosphere: Super Quite. Very few people there, which is weird considering this place used to be one of the most packed.\n\nOverall: 1/5. Highly disappointed that such an amazing place has become another mediocre BBQ joint. No longer the Sammy’s I once loved."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLTNzTXVvbzUyZWF3EAE",
            "text": "Old time favorite"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKRHJ5cm5LM2QzTC1BRRAB",
            "text": "The menu has changed alot, so I got stuffed shrimp they was got,but not what I really wanted, they turned it into more of a BBQ restaurant instead of seafood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOZXEzZmIyc2Y3WlFBEAE",
            "text": "Not impressed. The BBQ portion was quite disappointing. They're a seafood restaurant.  Stick to that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOampvdWZnaG9TMmV3EAE",
            "text": "Booked for Sammy’s Shrimp Box for Mother’s Day to find out upon arrival that it’s a bbq joint now. They changed their name this week. The food was mediocre at best. Such a shame and a big let down as we couldn’t go anywhere else bc it was all crowded. I used to love this place. Not anymore."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNZkEyUEtzbi02MUxREAE",
            "text": "Booked for 4 thinking it’s Sammy’s shrimp box never told its a bbq smoke house joint now, we try and will never go back the meats were not smoked and a ton of sauce covering the whole plater terrible no smoke flavor from the meats"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLZXpqZVAtNTRTM2NREAE",
            "text": "Very disappointed that they turned Sammy’s shrimp box into another smokehouse bbq grill place which is a dime an dozen. All the things we loved about coming to city island for signature dishes is no longer at this establishment. I can get bbq anywhere , it’s too bad I drive a long way to come here and see this."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla0xXM3B3RRAB",
            "text": "Point blank they have the best Alaskan king crab legs in the area. Portion and quality are always. Right. We always beat the traffic as it can get busy. The staff are all just pleasant and hard working. Fun place seashore vibe bartender has the best laugh ever.just following up went by for dinner Carlos our waiter is the best!  He is always spot on hard working! Made the experience that much better! The owner is lucky to have such a good employee."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbnJxVVd3EAE",
            "text": "They usually serve live lobster, but mine tasted a bit off. The coconut shrimp, however, was on point. If you're going with family or friends, I’d recommend sticking to the shrimp. I could’ve made a scene, but since I was with family, I decided to skip the Karen drama."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbW9LbURnEAE",
            "text": "Buena comida"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNC1EdlhnEAE",
            "text": "They fried shrimp special to go is the bomb!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMklEZXJ3RRAB",
            "text": "First of all the  food  is  frozen  then  cooked no taste  don't  get the  famous  steak  burger it's  a pattie that's  frozen dried  looking  leafs  onions bun is not toasted just  don't  go and eat fish  frozen then  fried  everything is  frozen  that's  what it  tastes like they try  they best  before it  used to  be  nice  not  anymore it's a  race  track  let's  not  talk about the appetizer  it's a  joke  it's a  joke ha,ha,ha"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWE3RWh3RRAB",
            "text": "Es una porquería la última vez el mesero puso la propina y dijo que es politica del restaurante y le dije que es voluntario pero él puso lo más alto pedí hablar con el Manajer pero dijo que es el valor de la propina y eso no está bien es un robo pero qué pena son acostumbrados"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOHFhQVh3EAE",
            "text": "Went here to have bite to eat with my two friends I know for years and one them was just visiting the state . What a disgrace the short Mexican lady at the front might be a host maybe in her early 30s or late 30s with long maybe black hair Kind of heavy set.. so as we walk in I remember saying hi my friend said hi and she looked at my black friend squinted her eyes for sec. And In Spanish no sit them outside outside she said that twice with an attitude to her colleague . not knowing two of three of us speak Spanish beacuse we are Puerto Rican . Remind you this is around 7 o clock maybe later it was cold outside already . We told them no and It was weird awkward pause and she said follow her … I know it bothered my friend which I know most of my life and he was just visiting me it’s very sad . We just wanted to get some good food and talk about the past and good times and it was almost ruined by this racist lady at your venue . But it’s all good .the food was not good at all it lacked a lot flavor.i brought some shrimp scampi which is fairly a easy dish to make it lacked flavor and was slightly over cooked 1 out of 10 for sure . The chicken parm tasted like the chicken came out the freezer and hade tons of veins and fat on it . It wasn’t enjoyable I just ate the spaghetti with the cheese from the Parm. So that’s 1 out of 10 as well plus the waiter was no where to be found woah . Even other people sitting down you see them trying wave at them while they sit in the front talking at work . I come from hospitality industry from a restaurant and night club background so I know . How you get peoples money and support even in bad situations. This place is in a great location . Don’t let your workers run this establishment to the mud . All three of us hade our drinks empty for most of the time there not hint of salesmanship, I could have easily spent more money here if they gave more attention to there customers but then agin why would I ."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaE91clJnEAE",
            "text": "Buen ambiente Vista preciosa y servicios exelentes"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcElYNVVBEAE",
            "text": "All ways a good place to go, good food, excellent and friendly service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcHMtMjFnRRAB",
            "text": "Great place to eat and drink 🍷🍻 the surf and turf is amazing"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5bUtyWmNnEAE",
            "text": "코로나 19가 아니면 더 좋을것 같습니다"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcmM3b3RBRRAB",
            "text": "We went on a Saturday around 9pm, all the Sammy’s serve the same menu we chose the one with valet parking. I’m going to make this quick, the food was amazing they start you off with bread and salads by the time you get to the entree you’re pretty full lol. They give corn and rice on the side for free with every dinner. The only issue was our waitress could’ve made it more joyful being that it was a birthday dinner for my bf mom. The photographer that was on schedule that night captured a stunning photo memory thank you her energy was definitely welcoming. Great service either way food came out really fast and to end the night our waitress was more joyful towards the end *side eye*. Thank you Sammy’s next time we will try the other location across the street :)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuemViOWlBRRAB",
            "text": "This restaurant was really nice. Maybe because the season was shifting it was as crowded as imagine it would have been. It’s very nice and welcoming. The staff was kind. Our waitress was extremely nice. Very attentive and helpful. The food was great. I had the crab stuffed shrimp and let me tell you…. It was bomb!!! So it wasn’t stuffed per se but it had crumbles of thick rich meaty crab sprinkled on top with some type of Brad crumb in a garlic sauce. It was amazing I enjoyed it very much. Even more so the next day when all those flavor had a chance to marinate together. This is definitely a must try. I will go back and maybe try something else cause that shrimp was too good not to have again. It’s all the way at the end of the island so you have a nice view of the water. Pricey but worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OUtmNEt3EAE",
            "text": "Loved this place, looking from the outside, one would not think this place was as big as it is.\nAlot of seating, tables are spacious, plenty of elbow room to dig in.\nThe garlic bread, corn bread, Italian bread, cheese, and pickled vegetables they first bring out are off the charts, fresh and tasty.\nCalamari we got for appetizer was very good, and the serving size was significant.\nMain course dinner was very tasty, cooked perfectly, and presented very well, the drinks were very good, with the appropriate amount of alcohol,\nOur waitress was very, very attentive, very friendly.\nParking is valet,\nDefinitely recommend this place to everyone, we will definitely be back, the prices are VERY FAIR and the portions are fairly big.\nThey do serve dessert, but we didn't have room to taste any 😂😂😂🤣"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNXFpaHVBRRAB",
            "text": "The service was excellent. Clean restaurant. Not very noisy. The food was amazing. I ordered the fried shrimp and French fries and my friend ordered a fried seafood platter with calamari fish and scallops. The presentation was on point and so was the service.  I also had a virgin pina colada.  Which was also very tasty. My first time dining in here.  I will come back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcktiQlV3EAE",
            "text": "It’s a great experience. The food portions are humongous! The food quality is also good but I’ve had better chicken parm and the fish was a little dried out. We sat outside and it was lovely, fun, and fresh. The server was pleasant you can get your picture taken and pay for the print out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaWNUemxRRRAB",
            "text": "09/01/2024 - First time visiting Sammy’s Shrimp Box in City Island, NY with family and friends. Semi-whimsical decor yet true to its brand. Comfortable seating either indoors or in their outdoor patio. Depending where you sit you may get a glimpse of the Bronx River. I ordered from their Sammy’s Latino Favorites menu and ordered their Pernil which was amazingly delicious and plentiful. Generous portions. I also ordered a Margarita which was ok, and a Coca ColaZ Our server Santos was comical. Thank you for your service. Their complimentary offering is a meal itself consisting of various flavored breads, vegetables, and a thick slice of cheddar cheese. Cool crowd and cool spot for various occasions. They have a valet /parking lot across the street from the restaurant. Decent prices."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpLXNMeGlBRRAB",
            "text": "Where do I begin?!!  This is hands down the best seafood restaurant in city island!!  If you want to dine in at Sammy’s then you have to get your temperature taken and then a waiter will lead you to a table. You also have to order your food before you sit down.  Once you’re seated, they bring you delicious bread and the most amazing cornbread with a piece of cheddar cheese!! The calamari was delicious, along with the Sam trio. The fried shrimp and the onion rings (which came with the steak and shrimp combo) were also very good! The waiter also brought over rice and corn on the cob with our meals (which we didn’t order, nor do I think our meals came with it). The only downfall is it’s very expensive here. One beer was over $8.00 and the seafood platter was about $75.00. However, the food was honestly so delicious and the service was AMAZING! It was definitely worth it. There is no need to try any other seafood restaurant because this is the best in City Island!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeDRUOHdRRRAB",
            "text": "A pretty solid City Island seafood joint. Nothing mind blowing but just good, fresh flavors. On this visit, we tried the Fried Bronzino which unfortunately was super dry. The Sammy’s Seafood Combo is always reliable. Drinks can be strong depending on who is pouring. Free parking is a plus."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwa3JfUkdREAE",
            "text": "My favorite place in City Island hands down! Staff was super attentive, food was delicious and portions were ginormous. Such a great hidden gem in the Bronx, loved this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMGJpU0l3EAE",
            "text": "Went here for my birthday. The staff was great. The food was superb. The only bad part was we couldn't take out our wine we hadn't finished. You can buy liquor to go at restaurants but we couldn't take a half a pitcher of wine. What a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MGYyTTZRRRAB",
            "text": "Birthday dinner for 4 and the table was packed with food.  They begin with a veggie platter,  bread, and cheese. We ordered 3 entrees  which came with salad, coleslaw, and a side. We ordered 3 appetizers, two of which were a meal. They also provided complimentary yellow rice and corn on the cob. We left with 3 take-home bags. The service was great and we enjoyed our meals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUem9LSWFBEAE",
            "text": "Sammy's is both overrated and expensive. I ordered a banana colada which did not taste a hint of banana (plus it cost 19.95). The bang bang shrimp was good but for the price not worth it (4.79 a shrimp). I also asked for a calamari salad (cold) and the waiter claimed I asked him for a calamari basket...nonetheless, the salad was both late and bland and not pleasant to chew (it is just shredded lettuce and diced peppers and onions, with no dressing). Overall. I spent 210 dollars total (gratuity is manadatory; smh) and did not even enjoy the meal; for their pricing they need to step their culinary skills (and the waiter needs to step his hospitlity/listening skills)...for I have had better for much less..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwczVxVlV3EAE",
            "text": "Went here because of the reviews. The staff was amazing!  Had the Bang'Bang Shrimp 🍤 it was out of this world! However,  the rest of the food was nothing to brag about. Also they charged a $5 plate fee because we shared the entrée which I thought was kind of silly being that we ordered 2 starters as well.\n\nBang-Bang Shrimp ⭐️⭐️⭐️⭐️⭐️\nOysters Rockefeller ⭐️⭐️ (Nothing but salty spinach with cheese)\nBroiled Sea Combo ⭐️⭐️⭐️ (Hardly any taste)\n\nPerhaps we didn't get the best dishes on the menu and therefore it didn't meet our expectations, but overall, it was a solid 3 star based on my experience with the food.\n\nBy the way, the drinks were also amazing!\nOh let's not forget the delicious breads and pickled veggies they give while we wait for our food. That was indeed impressive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX0xQc0ZnEAE",
            "text": "The food is good and the plates are giant. Price is fair especially if you are ordering lobsters. Waiter and waitress very polite and careful.\nThe place was a little messy the day I was there, very crowded, tables not that organized.\nTheir menu has so many options I felt a little bit confused, maybe it’s the menu layout though.\nThe restaurant offers free parking (just make sure you ask the waiter for the stamp hehe).\nAs usual traffic is crazy to get there, after all this is NYC."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHclkzZWh3RRAB",
            "text": "The staff was most attentive. Everything hit its mark, my friend loved the cornbread. I enjoyed the calamari shrimp and the lobster. the IPA's were great aswell. Can't stress how well the staff was, amazing service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5enM3WVd3EAE",
            "text": "Holy moly, the food portions are huge and the food is so tasty. Had the shrimp scampi with the baked potato and they give you a salad yellow rice corn on the car. Spread all about cornbread Italian bread garlic bread slice cheese and a nice pickling of vegetables a must do again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhN19qVFJREAE",
            "text": "Stopped by Sammy's Fish Box a few weeks back; close to closing. If you let people in, and take people's good money, then good service should be given regardless. The service was very poor. I guess they just wanted to go home, and didn't care. As far as the food, it's a bit overpriced. The food is good overall, however, I don't recommend the Tilapia. It's very bland, and tasted like it wasn't seasoned at all. I would give a better grading, but that night, the service was very inadequate."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHJtbFBBEAE",
            "text": "Today was my first time visiting Sammy's Shrimp Box, and I had a great experience. There was plenty of parking, and the restaurant was relatively quiet. I was seated immediately and was attended to in a couple of minutes. The staff were friendly and attentive.\nWe had the sangria pitcher, enough for the three people at my table. Every entrée was a generous amount, so we had so much that we packed most of it to go. The shrimps were colossal! We referred to them as mini lobsters because of how big they were. We had the Amaretto Nut ice cream truffle with coffee for dessert, and I highly recommend it. It was a firm ice cream ball rolled in almond and chocolate chip bits with chocolate drizzle. It was a perfect ending to our meal.\nI'm looking forward to dining at Sammy's Shrimp Box again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzN0xyQXFRRRAB",
            "text": "Sammy's was my original dinner date spot when I first ventured this way and almost a decade plus later they remain consistently Legendary from the Valet to paying the check. Beware , you will eat mass quantities of food here and likely have more than enough to take home. Ask for Julian for the ideal waiter. Sammy's waiters are great but Jukisn is Iconic.  He has been my special request for years,  sometimes hes not on schedule when I'm there but when he is the dining experience is greatly magnified. Julian is friendly polite and will make any accommodation to a food order to please you, he checks on you frequently and will keep you coming back . Now the food is hot delicious fresh and well seasoned. Broiled Red Snapper stuffed with crabmeat , Bang Bang Shrimp Appetizer and strawberry shortcake for dessert with have you feeling like upur in Heaven. Fried Calamar is Sinfully Delicious . They have excellent surf and turf combos and Paella . Fresh housemade bread and cornbread served within 1 minute of being seated. Salad served before dinner. Valets will take good care of your vehicle they will not abuse your sports car. They work for tips so take care of them , they are good kids . If you are looking for a warm welcoming environment with delicious food and comfy seating , give Sammy's Shrimp Box a go you will not be disappointed."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRenNMcVRREAE",
            "text": "LOVE THIS PLACE!!! The food was GREAT!! SOOOOOOO much to eat😁😋 We LOVED everything we had!! The Baked Clams were DELICIOUS. I had the Broiled Shrimp & Scallops, my Hubby had the Shrimp Florentine, which was really good, but too much cheese! He's getting the Broiled Shrimp & Scallops next time,, lol😊 We ordered a Crab Cake as an appetizer,, that was very tasty as well! PLUS, they bring bread, cheese, corn bread, relish tray, Spanish Rice, a vegetable, salad,, WOW!! Very GOOD SERVICE AND STAFF,, DEFINITELY GOING BACK!! CAN'T WAIT,,, and we live in Brooklyn, so it's not close, but we don't care!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdnFhU3V3RRAB",
            "text": "Personally it was overpriced in my opinion, however the food and service was pretty good. A unique but weird thing is how you order your food first, then find a table yourself. It is mainly seafood (why wouldn't it be, its city island) but…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMmNHdHdRRRAB",
            "text": "This has been my fourth time here.\nI decided to treat my best friend out for her birthday!\nSammy’s remains to be one of the best choices for good quality seafood portions worth a drive, the money and your time!  Nothing that came out can be complained about. All our food was prepared fresh and served hot and quickly. I warned everyone that the cost may seem a bit steep… it is, but when you get your food and can enjoy it, share it and bring some home for later you realize the expense and experience is well worth it! We drove from New Haven CT and I will do it again!!\nThe staff was amazing, kind, patient and willing to go the extra mile!!!\nI wish I could remember names but hopefully the photos will give them the recognition they deserve\nThe Manager was helpful, attentive and very hospitable also.\nThe environment is clean and cozy and no one rushed us\nTheir bread and cornbread is also delicious the shrimp were huge and the lobster was a great size!!\nI am so happy we went!!! Thanks Again for having us!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaUpYUjdRRRAB",
            "text": "Dame owner of Sammy’s Fish Box, delicious food and good drinks! This place does not disappoint. If you are a sea food person come try this place out, the portions are huge and the prices are just. I’ll come here any time!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdXFEZ0ZBEAE",
            "text": "Service is excellent! The food taste awesome! Can’t go wrong about this restaurant. This is one of my favorite restaurants. I recommend it to everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNXFqWEFREAE",
            "text": "Usually a very good spot to get a meal but today was a total disaster. I dined in but ordered a Catfish dinner to go. The fish tasted freezer burnt, cornbread was moldy and my take out order was incomplete. I ended up tossing the entire takeout meal in the garbage."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoazQzSUZREAE",
            "text": "Great portions and fair prices. The staff are very pleasant and sweet. The seafood was excellent and the Filet Mignon was perfectly seasoned."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbl9lTGVREAE",
            "text": "Hi guys! Actually, today I was City Island for the first time. It is a very small island, but very nice and nice to walk from one extreme to the other, it is 30 to 40 minutes you walk everything. This island is very famous for its two main…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ODliSlZREAE",
            "text": "Delicious, fresh seafood with great flavor. I hadn't been to Sammy's in over 20 years, so glad I was able to stop by. 👍 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN2VPZDNBRRAB",
            "text": "Wow with the four stars on Google Map I didn’t expect how amazing the service and delectable seafood is here, we initially tried it because a friend highly recommended this place. Our server Mohammed was very knowledgeable of the dishes here and so glad he helped us get the sesame bread/amazing cornbread/side salad/pickled veggies. Delicious thick NE clam chowder and Maine Lobster Newburg and Maryland Lump Crabcake were to DIE for, especially when combined with the side of white linguini and diced tomatoes. Definitely a place to go back to, love the ambience of the neighborhood here!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdFotUnFRRRAB",
            "text": "Went to Sammy's Shrimp Box for my Godfather's 80th Birthday. Food was excellent not packed very clean and attentive to their customers. Will be going back. Thanks You for being Great Essential Workers"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcmI3Ul9BRRAB",
            "text": "This place was better than the one across atmosphere was fantastic and service outdoors was great, and the food too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMFktenpBRRAB",
            "text": "Food was great but server came to our table to bring the food and did not come thru again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhXzRmUmNnEAE",
            "text": "This was a great location for seafood but it seems like the pandemic has sadly got the best of this spot. The location is now run like a fast-food dining experience and it seems the quality of the food has gone down as well. The fish and…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBemNXSTdRRRAB",
            "text": "Worst food ever! Horrible service. Cold. Crowded and just an overall a unpleasant dining experience!!! Garlic crabs tasted horrible like a disgusting soup like nasty mix of bay leaves and piss served in a Dutch steel pot. 4 lobster tails…"
        }
    ],
    "reviews_count": 78
}