{
    "name": "Hudson Garden Grill",
    "place_id": "ChIJPWq5XnzzwokRAO4-vaQKngg",
    "grid": "BX10",
    "address": "2900 Southern Blvd, Bronx, NY 10458, USA",
    "rating": 4.2,
    "user_ratings_total": 675,
    "phone_number": "(347) 919-5241",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1REUkhORTkwTFdoTk5UUnVNemQ1ZWpCeFdHYxAB",
            "text": "Truly great energy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MFMxOUdTMWh5UlVKRmVXaEVTVlV5WmxCdWJrRRAB",
            "text": "Always great!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcVlXaFpTRXA1ZDJKTWR6QnNkelJFY2s5U1MyYxAB",
            "text": "The main course chicken on October 11, 2025 was so salty I could barely eat half of it. The only seasoning I tasted was salt. The caulilini was mostly burnt and the potatoes gratin were rubbery and too salty. This place used to be good. No more meals for me at the botanical gardens. Too  expensive for mostly bad food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNFpHVk5WRlJ1VkVwWGQxb3hjRGx4TUdWeFlYYxAB",
            "text": "A winning product!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcU5IbG9UalJNVjBSTVNFRlRZMFJMVmxOQ2MyYxAB",
            "text": "I visited 7 years ago with my mom and had the best experience. We even still cook a recipe from then, it was a thyme and honey goat cheese with grilled bread. Went back with my husband in August and it was a nice break before the Van Gogh show...but the food was gritty and unimpressive. The limeade was tasty. My husband enjoyed his burger. But the service was rushed and he seemed annoyed to be working, ha."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFVuRmtiVjg1YmxwR1FYZzJORVF6ZFVaVllYYxAB",
            "text": "Mind-blowing ambiance!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSldWaGFObkZMVnpGblREZ3daRVpKVjJ4d1RXYxAB",
            "text": "Absolutely delicious, great for friends to dine out."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeGRYTnZkakU0V1Y5S1dtZHRTM0p6TjJORFdrRRAB",
            "text": "This place is great for having a meal at the botanical gardens. It is a bit expensive. They do have items that match the exhibit that is going on."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUWFFUlhVVWcwTXpJelJ6ZGtaR1V3VmtWbk4zYxAB",
            "text": "Quick and efficient service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV1EzRTNlVUZ5TWpGM2VUWkZiR05TVG1WMU9WRRAB",
            "text": "Overall this place is a waste of money. After visiting this restaurant two times, both times I had the same issues with the service.  The second time, the service was none existent. The only person from the service staff that was doing their job was the hostess. We were seated promptly without waiting. Honestly she should be getting all of the tip.\n\nThe wait staff seems not to care. The waiter that was \"serving\" us came to take the order and we never saw him after that. He never checked in with us, which resulted in us sitting with 4 empty drinks through most of the meal. The appetizers came out fast and when it was time for the main entries, one of the staff came and took our silverware, saying she will replace it with new one.  She never returned to the table, the person who served our main course, just dropped it off and left.  We were sitting there for 10 minutes without any silverware, while the food was getting cold.  Finally, we were able to get the attention of one of the busboys that was putting glasses on the table next to us.\n\nThe food is mediocre at best, especially at the prices they charge.\n\nI would not recommend this place."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc3I2X2ZBEAE",
            "text": "Super nice restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d1oyTjVWekkwVXpCT1kzQjJVa05WVVV4d1kyYxAB",
            "text": "For sure the coolest spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeFIweElheTAxWWw5eWNsUnNPVnBtWkdwNVdrRRAB",
            "text": "Service is bad! And food is under average! Only thing that’s good is the atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbGVuQlJNRFJ2UkZoSGVrRmhVMDlHYlhsSVFXYxAB",
            "text": "Amazing food cocktail and serves"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocVowZ3plazF4UlV4TVZGSlJlbmxKUlVoTWFHYxAB",
            "text": "Update the menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMlNrUmxRbU5FUlhkMFpYaGxXVFI0UW5JMlZYYxAB",
            "text": "Would give 2.5 stars if possible but rounding down instead.\n\nThe pro is that the food was decent, we had the burger and chicken sandwich. However, the service was extremely lackluster and slow. It looks 40 minutes for us to get our entrees and that's after we had follow up with the waiter.\n\nAdditionally, the waiter we had was not very professional in his demure and was also just chatting with others the majority of the time. The most disappointing part is how they handled my partner's cucumber allergy. When ordering, we advised the waiter of the allergy and he reassured that it was noted. The salad unfortunately came with cucumbers and, when sent back, we saw the kitchen just remove the cucumbers even though it touched the sandwich. This restaurant has potential but the staff needs more training in order to justify how Hudson Grill wants to protray themself."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RM1FXSm1ka0ZZWVd4NllWbHNOMmRQTTI5aWNsRRAB",
            "text": "I always love it here. Great eclectic menu. Kind service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcmNEQm1ZV0ZMWDBsTVJIaHlSa3d6TTBob1UyYxAB",
            "text": "Hudson grill was great. The service was very slow but the food made up for it. I would definitely recommend going there in the middle of your tour to take a break and cool off."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSWRteFBUams0VG5oS01IZzVRMUUyUTFoblZFRRAB",
            "text": "We celebrated our wedding anniversary here today and had a lovely experience. We reserved a table for two and took the train after work—about 20 minutes from Manhattan ($7+$7 ).\nThe setting is quiet, the atmosphere is charming, and service was generally attentive. As vegetarians, we were happy to find plenty of options, and everything we ordered was delicious.\nWe’re NYBG members and visit often, so we’d been wanting to try this spot. The only downside: they were out of sparkling rosé. 😢😢😢\nWe asked for an Italian sparkling brut but received Cava instead (which is Spanish), so I’d rate service a 4/5 for that mix-up. Otherwise, everything was great, and we’ll definitely be back. Beautiful place and a relaxing escape in the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRllVOTROVFJRWm1wc2F6QmZhRWxKZFdwa1VIYxAB",
            "text": "They have gf, vegan and vegetarian options. You need to make a reservation in advance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1VVbGFaMWxtWVRnMFQwMUVUelpKZDA5UVZGRRAB",
            "text": "Excellent restaurant on the grounds of NYBG - wonderful entree selection, peaceful and elevated surroundings, wait staff Miguel providing the best service.  Enjoyed early dinner during member’s week 8-25 Thursday"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMmNWWTVVVXB1YzJ4SWFraFNZakJxYmxKM1owRRAB",
            "text": "Some server named Jackson had an unprofessional attitude and couldn’t even perform a basic task without making it clear he had an issue with me and was extremely nice to everyone else …. I’m not looking for a chit chat absolutely not with…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSFVUQXpiWGQwYmxwQ1dqVkxlVUpFWnpGa1MwRRAB",
            "text": "Really enjoyed our meal. Staff was attentive and nice atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTk5uVm1TMnR0V2kxaFowaGZRa2s1TFVwd1JtYxAB",
            "text": "Gave me food poisoning"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204ME1sUjZYMlZ0VldOcFNuWmhNbWs0ZEdaelFuYxAB",
            "text": "Everything on the menu looked great ! It was a hard decision 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM2JITjVkbnBVVUhGMlNIaGFNR0pRYW1wcFZIYxAB",
            "text": "Do not come here for food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keFZWazRZVUo1VFhKeFQyRlBSV1l4ZEVKRlFYYxAB",
            "text": "Definitely! Worth the trip."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSk5tbFNVbmhpTkhSRFRFMVdhVU5rVG1SS09XYxAB",
            "text": "Highly overrated and overpriced restaurant.\nBe prepared for generally small servings and watered down drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsblpVcHhiV1pNU0ZWMWMxaDVZWEpxTTBGc00xRRAB",
            "text": "More salad, less quinoa 🥗"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVEyRlZTMkZOUVhOcVJrWldYMU5tVjJsbGEzYxAB",
            "text": "Beautiful! What a wonderful place to have a lovely lunch. The food was delicious and a great variety of beverages. The staff was so pleasant especially the hostess. I recommend you make reservations to make sure you get indoor seating."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taYVVsSkVaRGhrUlhsSFZ6aG5hbTV0TTI1TmJFRRAB",
            "text": "The cauliflower crudo salad is amazing! I trusted the Google reviewers! The staff is the best, very attentive and caring. The weekend bartender is on point, she made me the absolutely the best mixed drink I have had in NYC all week! I would definitely come back when visiting the city again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GME1HbDZhakJzT1hWcWNsWnJaVUp2ZUZWcFRGRRAB",
            "text": "Wonderful lunch at the Hudson Garden Grill.  Enjoyed a drink and a salad.   Service was great and atmosphere was fabulous."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMldobzJYdkplV1NnEAE",
            "text": "It was a large and beautiful venue with a wonderful staff."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbTZqWFRnEAE",
            "text": "An excellent place to eat after spending an afternoon walking around and enjoying the. beauty of the NYBG. The restaurant is very well lit and spotless. Whether you eat indoors or outdoors the service is friendly and welcoming. There are a few items that are a must such as the zucchini chips and the ratatouille. Not too far behind are the vegetable burger and the chicken over polenta. For dessert the raspberry parfait was light and creamy. To finish the meal with a smile on your face order the Van Gogh Matcha Latte."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNWDcxUFBGM091dUJREAE",
            "text": "Really pretty dining option at the Botanical Gardens. Gr8 service and good quality food. The chicken sandwich was ginormous!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKLXF5X0NRNHJDa1dREAE",
            "text": "¿Qué comí?\n\n- MURRAY'S CHICKEN BREAST CHASSEUR. Sí me gustó. Me parece un sabor no muy común.\n\n- ROASTED SUSTAINABLE SHRIMP CASSOULET. Sí me gustó. Me parece un sabor no muy común.\n\n- PROVENÇAL BURRATA. Sí me gustó. Lo encuentras fácilmente en otros lugares.\n\n- Violet twilight kir. No me gustó, fue como si bebiera un vino muy fuerte. Para eso mejor pido vino.\n\n- Lavander fields Spritz. Sí me gustó.\n\n- Yuzu verraine. Sí me gustó. Un poco más de acidez y no me hubiera gustado. Curiosamente costó más del doble dentro del restaurante que en la food truck por el evento de Starry Nights.\n\nÁreas de mejora:\n\n- Tal vez un menú más extenso.\n\n- El horario de servicio se muestra hasta las 6 pm, pero aceptan comensales después de esa hora. De haber sabido eso no hubiera cortado mi paseo por el jardín. Algo muy molesto la verdad.\n\nVolvería? Sí si volviera al NYBG, la ensalada de pollo frito se ve interesante.\n\nCosas random positivas:\n\nSanitarios alejados de las mesas y con las puertas abiertas de forma que no tienes que tocar nada para entrar y salir.\n\nLa propia empresa publicó en Maps sus menús actualizados de forma que no tienes que entrar la página web y buscar los menús."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLXk0cmVfamRqbXZnRRAB",
            "text": "The cauliflower crudo salad with grilled salmon was delicious. I'll be craving that and trying to recreate it at home! Our service was tops, too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLX0UtcTZ3NXJYUndnRRAB",
            "text": "Have a nice Hudson Burger.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cloySnFhV3RFZVhCRmNEY3dTMkowYUdKa04xRRAB",
            "text": "My fried chicken sandwich was mediocre and very over priced for the quality. The fried chicken had a thick coating of over cooked batter (breading) with an extremely small portion of chicken. My partner had a beet salad which was very good. The service was good.  My suggestion is to avoid the crispy fried chicken and perhaps find another restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTFhvOERTMFoyVEZREAE",
            "text": "Very friendly staff, burger was very good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYnJ5SUhRdzlhaWNREAE",
            "text": "All three of our entrées were delicious and the staff was excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU21pSldFcXZDb2ZnEAE",
            "text": "This was my first time visiting this restaurant, and I’m so glad we chose it for lunch! I came with my husband and was a bit nervous at first—it looked quite packed and I did not have a reservation.\n\nThe hostess was incredibly accommodating and managed to seat us at a large table right away. She even apologized for the size of the table, but we actually love to sit side by side, so it worked out perfectly!\n\nWe had initially asked to sit at the bar because it looked so cozy and had these beautiful orchids—definitely planning to sit there next time (and yes, this experience has already given me a reason to return!).\n\nI wish I remembered everyone’s names, because every staff member we interacted with—or even observed—was so warm, friendly, and welcoming. The hospitality here is truly unmatched.\n\nThe menu had so many tempting options that I had a hard time deciding. I ended up ordering a vegan dish that sounded light and refreshing—but I have to admit, I ended up eating my husband’s cheeseburger and fries instead! It was absolutely delicious—100/10!\n\nOur waiter noticed that I was enjoying my husband’s meal more than mine and kindly offered to bring me another dish, but I was already so happy and content that I didn’t feel the need. To top it off, he offered us cocktails from the bar, which was such a thoughtful gesture.\n\nThere also seemed to be a manager walking around constantly to check on guests and staff which I appreciated as going above and beyond. This gem provided a resort-like feel experience. Everything—from the service to the atmosphere—was simply amazing.\n\nI can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdmc5OEtTaTlPbndBRRAB",
            "text": "Ate outside. There were some bees."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNHJfcDhRRRAB",
            "text": "Ate lunch here/ food very bad\nOne small slice of chicken breast on greens for $29 terrible"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUlxRmN3EAE",
            "text": "Service was pretty bad, took 20 minutes to get acknowledged and finally order food and drinks. Took 10+ minutes to finally flag someone down to pay. Perpetually no wait to get the food though and it tasted pretty good. I really wanted to enjoy my time, but the service was just too distracting."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeVBhelR3EAE",
            "text": "Delicious lunch in a beautiful, spotlessly clean setting ! Loved it !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM1lhSVFnEAE",
            "text": "I'm giving this place two stars instead of one star for one reason only:\n\nTheir menu provides allergen info and my wife has food allergies so it was very helpful.\n\nUnfortunately, we did not get a chance to try the food. We opted to get seated at the bar since no tables were available. After being seated at the bar, we sat there for about 15 minutes and nobody acknowledged our presence. Nobody brought water to the table. Nobody asked if we wanted drinks. Nobody asked if we were ready to order. We were completely ignored. It felt like we were invisible.\n\nAfter sitting there for 15 minutes with nobody acknowledging that we were even there, we got up and left.\n\n(For reference, the \"bar\" here is not like a bar at a restaurant where you seat yourself and order from a bartender. The \"bar\" is just a counter that faces into the kitchen. There is no bartender, we still needed to go through the hostess to get seated, and servers are still supposed to come by to take our order. When we first arrived, the hostess got staff to clean off the area from the previous guest and then she walked us to the area of the bar that was open and placed the menus on the countertop. So they very much knew we were there. It isn't like we snuck in unnoticed. But they decided to ignore our presence. So we left.)\n\nThe food looked very good. But I can't vouch for it as we didn't eat it. Can't comment on the drinks either. We didn't get any. All I can say was the service was abysmal. Non existent in fact. And the prices are quite high. Perhaps the price of the food is worth it, but again, can't say because we were ignored."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNbmNHaFRBEAE",
            "text": "Amazing vegetable forward food, clean flavors. Cocktails share that vibe. Have been coming for years and never disappoints."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcU5fTmVREAE",
            "text": "Beautiful restaurant. Came on a Monday holiday. Restaurant was full. Service is slow. The soup came out 20 seconds after we ordered it. Sandwiches came 15 mins later. Our drinks came last, about 30 mins. And this was after we reminded them twice.\n\nOur fries were cold and not worth $10. The chicken sandwich was mostly dark fried batter. The little meat was fried to a crisp.\n\nIt’s the only option in this side of the park. But if I could help it I wouldn’t be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdEpfbXJRRRAB",
            "text": "First time at the Hudson garden grill and it was really nice great service delicious food and right inside the NYBG with great views However it is a little expensive but it's a nice experience."
        },
        {
            "date": "10달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOHVpOUJREAE",
            "text": "분위기 좋은 고급 레스토랑"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN0xhUVl3EAE",
            "text": "It was okay. They close at 3, I was seated at 2:30, and food was out by 2:40 it was insanely fast. Everything I got was pretty good, my friend got the chicken salad and she loved it. The local sautéed greens were great. Menu was clearly labeled for dietary restrictions, multiple drink options that were non-alcoholic. I would come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM1lQZmhBRRAB",
            "text": "I made reservations and my husband and I were warmly greeted and seated. The food was delicious and they had pretty good portions for the meals. I would recommend the cod fish dish. The ambiance was my favorite- to dine surrounded by greenery. I think service can be improved. We waited a while before asking one of the servers for water and to place our orders and there wasn't much check in."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMDVldGl3RRAB",
            "text": "Fantastic food, atmosphere and service. Beautiful restaurant in the magical NY Botanical Gardens. You can’t beat it for a unique NY experience. Great for a date, group of friends or family outing. You feel like you’re on a different planet far from the city. In December they have live music and holiday themed nights. Well worth the trip!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINE8yZl9nRRAB",
            "text": "I was visiting the gardens and thought the restaurant looked good. Besides the crispy chicken sandwich, it was overall disappointing. We also got the grilled watermelon salad, tea and scone service. The salad was fine, nothing special about it and didn't look grilled. The chicken sandwich was very good.\n\nI was most disappointed by the tea service - I was expecting better than a generic teapot and a mug with a tea bag hanging out. I was also not expecting the scones to be 3 TINY pieces of a scone. The color effect for the pea flower blossom tea was cute and the tea flavor was pretty generic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHQyMUpnEAE",
            "text": "We were visiting the Botanical Garden on Mothers’ Day and got hungry so decided to try this place for lunch! We didn’t have a reservation but were able to make one for about an hour & 15 minutes later for outside dining on their patio. The outdoor dining vibe is more casual that indoors, but it actually suited us better since we had little kids dining with us and they were free to go and chase some squirrels or run around while we waited for our food! The food was great, the burrata was our favorite, even the kids loved it! I could have licked the plate to be honest, loved the cheese and all the sauces and veggies! The kids meals were good enough, they’re about $15-19 each and include a beverage. One my kids had the pasta with butter sauce which they liked and the other had the chicken tenders with French fries. I had the salmon dish, the salmon was amazing but I did not love the accompaniments, the grains were fine but the carrots were basically raw, I would have preferred them more cooked. The service was great, the food came out quickly and overall this was a great dining experience for us! It’s def on the pricey side (almost $200 for lunch with tip included) but in my opinion def worth it!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeHVmLVNnEAE",
            "text": "Our party of 7 (including 2 children/1 toddler) had an excellent meal yesterday. Every dish ordered was cooked perfectly and as requested, served at the proper temperature, utilizing the highest quality of ingredients, was visually appealing, and tasted great!  All of the team worked in unison and made for a stellar dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMWNYLUZBEAE",
            "text": "The Alice in Wonderland tea is a winner! We went early and walked around the gardens and then went to the tea. When we entered the restaurant, we were greeted with a glass of prosecco (see pics). Everything was decked out (including the wait staff) in Alice attire, adding to the fun, lively atmosphere. The food was delicious. My husband and I both loved the chicken salad,  scones, and red velvet cakes. The tea service was all different, with various teapots, cups, and saucers. Overall, highly recommend. Oh and you get cookies as you leave with Alice on them. What could be better!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMlB2bC13RRAB",
            "text": "Having been a longtime NYBG member, I've seen the changes at this restaurant and despite other snobbish reviews that this place went downhill, I totally disagree. I love the inclusiveness of diversity in the staff now which adds another flavor to the food that wasn't there before. I saw that the staff was managed effectively to serve in a very seamless way. In fact, the manager, JC came in to check on me and I also witnessed him eager to serve the customers and asking how their experience is - nice added touch to the dining experience. I had a variety of food because I was entertaining an important guest from out of town and he found the food and experience absolutely exquisite. He probably also felt right at home since he was from Madrid, Spain and conversed with JC. It felt very welcoming. I believe those previous reviews that mentioned the food or staff wasn't up to par had too much starch up their shirts. Nowadays it is difficult to find how \"the old days\" had been and time to adapt to the new modern embrace of the beauty of diversity. Food was just delicious!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMDdYTFF3EAE",
            "text": "Hudson Garden Grill has long been a favorite of mine, offering a perfect blend of ambiance, service, and food quality. Unfortunately, during my recent visit, it felt like the magic had faded.\n\nThe experience started with a forgotten drink order, which wasn’t the best first impression. While the staff were friendly and accommodating when I pointed it out, the lack of attention to detail was surprising.\n\nThe food, sadly, didn’t redeem… My French fries arrived lukewarm, and though the staff agreed to reheat them, they came back warm but disappointingly soggy. The chicken sandwich I ordered was lackluster — not terrible, but far from the flavorful and satisfying dishes I’ve come to expect here.\n\nThe one redeeming factor was the staff’s politeness and effort, but good service can only do so much when the quality of the food falls short. Hudson Garden Grill used to be a standout, but based on this visit, it seems like standards have slipped."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIanU2cFNBEAE",
            "text": "After having had a beautiful afternoon enjoying NYBG, my family and I ended up delighting ourselves with the delicacies of this restaurant. Quick service. If you want to be seated inside the restaurant I recommend make a reservation in advance."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMDgtYnV3RRAB",
            "text": "La nostra esperienza in questo ristorante è stata più che soddisfacente. Il ristorante è ben arredato (peccato per le sovra tovaglie in carta) e l’accoglienza è stato molto cordiale. Gli addetti alla sala sono stati con noi molto gentili e premurosi. I piatti assaggiati hanno tutti soddisfatto i commensali. Il prezzo è leggermente più alto della media ma è ovviamente giustificato dalla location in cui si trova."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbDRTbzZnRRAB",
            "text": "We were visiting the nybg from out of town and decided to grab a late lunch here. Despite not having had a reservation, the service was friendly and fast. The menu had interesting options; different from the typical stuff. We thoroughly enjoyed our time and would recommend the visit to anyone looking to go."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLemUzSHh3RRAB",
            "text": "I just want to say outright that the service here is 0/10. I’m giving 1 stars only because the food was somewhat good. When we first walked to the hostess we were interrupted by a manager trying to get his friends a table. Granted, I understand but he at least could’ve said excuse me. We were absolutely starving so of course we sat here outside to dine. We waited about an hour for our table, & then about another 30 minutes to just place our order. Our waiter looked extremely overwhelmed. We felt bad, whoever is the manager of this restaurant should’ve been walking around to ensure his or her staff doesn’t need any help. Thankfully, the food came out pretty quickly. Started with the shrimp cocktail which is okay, I personally wouldn’t order this again. The shrimp wasn’t cleaned properly, & the guac mixed in the sauce was bland. The chicken was also just alright, but again I was starving so I finished the whole thing. My boyfriend got the burger & again, was just okay & he only finished it because he was practically dying of hunger. The only amazing thing was the French fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcHJhLWlBRRAB",
            "text": "Quick summary: Horrible service, cold bread, tasteless salads, mediocre food, not worth the price, do not recommend. Please visit the garden but don’t come to Hudson Garden Grill to eat.\n\nMy partner and I are big fans of NYBG so we were very excited and eager to try the Hudson Garden Grill. Unfortunately, our experience was pretty disappointing and put a damper on our night. We thought it was a nice restaurant, but we were proved wrong. The dining experience was way below our expectations, and frankly quite frustrating and upsetting. NYBG is so amazing and incredible that having such dismal quality food and service at Hudson Garden Grill is almost embarrassing. I’m just grateful we didn’t come here for a special occasion like we planned to because the dinner would’ve ruined our night.\n\nThe service was absolutely abysmal, and it was so difficult to get a hold of our waiter. It took some time for us to get some water after we sat down and when we asked what the vegetable of the day was, our waiter left to check and didn’t return for another 15 minutes. When we finally got our appetizers, I cut into the focaccia and the center was cold. I would’ve asked if we could have the bread heated up, but we couldn’t get ahold of our waiter. We gave up trying to ask our waiter for help and when he finally came to check on us, we had long finished our entrees and the plates were cleared. Also, quick note on the focaccia, it was dense, not airy and bubbly at all like focaccia should be, but maybe I would’ve enjoyed it more if it weren’t so cold.\n\nThe kabocha squash appetizer was mediocre and somehow very dry and not flavourful. I love kabocha squash and this was the first time I’ve had it prepared in a way that I didn’t like.\n\nThe beet salad was fine. Since it was a salad, we expected there to be more greens. We also added the tofu for an extra $8 and it was not worth it because the tofu is seared on two sides and then cubed, so some tofu cubes looked cooked and others were just a plain cube of tofu. Regardless, it lacked flavour and didn’t taste as fresh as we thought it would. The salad also just looked a little sad.\n\nThe lamb tagliatelle pasta was good, but over salted. Pasta was cooked well but the lamb was too salty.\n\nThe flourless chocolate cake was fine, the ginger and fig on top didn’t really pair well with the chocolate cake in my opinion, but the presentation was nice.\n\nI didn’t like eating on the piece of paper covering the cloth table cloth, but I guess it’s easier to clean so I understand.\n\nI also tried the blueberry smash. I wish they gave me a straw or a stir stick or something to stir my drink so that the blueberry syrup/flavouring wasn’t all at the bottom and the soda all at the top. It made the drink tasteless in the beginning and too sweet at the end. But again, I couldn’t get ahold of the waiter to ask.\n\nI really cannot recommend any of the dishes I’ve tried and I do not recommend coming to the Hudson Garden Grill. I really wish I had better things to say but this was such a disappointing dinner experience that we will never come back nor will we recommend it to our friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMWVDT2pRRRAB",
            "text": "The ambience is great--- such a beautiful space!  The service was a little slow but what place isn't these days.  They were at least nice!  Took a while for our food to come out but we weren't in a rush so it was okay.  The burrata was amazing--- definitely order it!  The veggie burger was disappointing --- thought it would be more than just a frozen patty.  The salad we got was just okay.  We had a great lunch experience overall ($100 for two with two drinks).  We'd recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MDdmSjh3RRAB",
            "text": "This place is a hidden gem! Honestly everything from the starters to the dessert is amazing and the cocktails are fantastic. We had the crudité and the beet salad to start. I had the Lamb Tagliatelle pasta and my partner had the Carrot Schnitzel, wow 🤩 both were so good! Gorgeous building as well and the interior is so beautiful it really adds to the ambiance. Great service as well. They have both indoor and outdoor seating. This is so much more than just a spot to eat while visiting the gardens. It’s so nice and I have enjoyed it so much that it honestly merits it’s own visit even if you’re not visiting the gardens, we did just that on our last visit! Reservations are recommended. A little pricey but oh so worth it! Just 10 stars all across the board."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeTRhR1VBEAE",
            "text": "I recently visited this restaurant with high expectations, but unfortunately, I left feeling a bit underwhelmed. While the atmosphere and staff were pleasant, the quality of the food didn't quite meet my expectations.\n\nThe dishes, though presented nicely, lacked the depth of flavor I was hoping for. It seemed as if some of the ingredients were not as fresh as they could have been, which impacted the overall taste. Additionally, the portion sizes were smaller than anticipated, leaving me still feeling somewhat hungry after the meal.\n\nIn summary, while the experience wasn't terrible, I believe there's room for improvement in terms of food quality and portion sizes. I hope the restaurant takes these comments into consideration and makes the necessary adjustments to enhance future dining experiences."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeU1tbWNBEAE",
            "text": "Decent comfort American food for a decent price. to be honest if you’re visiting the botanical gardens this is just a really nice added experience. The building itself is so gorgeous and you see out to the garden and just the vibe itself was so right. I mean you wouldn’t come here for amazing food it’s pretty much just your basics with some seafood thrown in. Highly recommend making a reservation. But nothing special just a cute lunch place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eWNuUHZnRRAB",
            "text": "Very pretty inside and out. Fast service, and extremely pleasant staff. The burger and the chicken sandwich were so fresh. Hand pressed burgers and fresh cut potatoes.\nThe salad mix was perfect! Nice to get mixed greens, instead of just romaine lettuce. They had a light lemon vinagrette on the salad.\nWe really enjoyed our lunch.\nThe food is pricey, but it was worth it. 30 for burgers and fries. The total bill was 59.00 with tax, and we would go back again.\nWe enjoyed eating lunch at gardens for convenience and ambiance."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ai1hOGtRRRAB",
            "text": "Lovely restaurant in the NY Botanical gardens.  Reservations are recommended.  Indoor and outdoor seating available.\n\nExquisite menu.  The Hudson burger is quite good as is the crispy chicken sandwich. Very generous portions. There was a butternut squash soup with coconut foam, truffle oil and roasted pine nuts which was exquisite.\n\nFine cocktail selection including mimosa and bloody Mary.  Good selection of bottled beer.\n\nNice ambiance complete with artwork of the gardens and vaulted ceilings.\n\nService was a bit slow, and the menu a bit pricey.  This restaurant is an asset to the NYBG. It's a great lunch spot after a long day of walking at the gardens.  I'll be back on my next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMEkzTUpBEAE",
            "text": "Wow wish I had gotten pictures of the food, we ordered the cauliflower wings, the eggplant carpaccio, the burger with a salad and the Alice tea and deserts and absolutely everything was top tier. The food was fresh and ready quickly, the flavors were amazing we were so satisfied by the end that it was difficult to finish the desert but the red velvet and the un birthday cake were great! Over all and amazing experience definetly will be coming back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aWN1VlpREAE",
            "text": "What a surprise.  The cocktails were very refreshing. The food was fantastic.  Tasted great and nicely plated.  I had the chicken sandwich and my wife had the fish of the day.  Both were seasoned perfectly.  It was pricey, but I did mind since the quality was so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcklTcTNRRRAB",
            "text": "Beautiful setting, lovely staff, meh food.\n\nGot the grilled watermelon salad with goat cheese, pepitas, micro greens, pickled red onions, and olive oil. The watermelon tasted like it was about to start going bad but since I haven't had grilled watermelon before I'll assume that's what it's supposed to be like until I taste it again. I was more surprised by the lack of goat cheese, unless the base which tasted like plain yogurt was supposed to be it? I was hungry, it was a small plate, and I don't like to make a fuss so I ate it and that was that but won't be going back and can't recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXVuSk1BEAE",
            "text": "It is a nice place to go for food if you want to sit down in a restaurant setting. Just keep in mind that it is not fine dining.\n\nThe food wasn’t as good as we had remembered. We ordered the roast squash with eggplant “caviar” and it was served room temperature. Was not expecting it to be room temperature. The salmon nicoise salad is served with cured salmon. The description did not mention it is cured salmon. The cocktails and non-alcoholic drinks were bland, lacked character. We ordered the smashed ginger and it tasted more pineapple than ginger if any."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdWZDbXZnRRAB",
            "text": "Located inside the NY Botanical garden, this is an excellent choice for having a meal while visiting the garden. The restaurant is small, so reservation is highly recommended. They do have a beautiful interior.\n\nThe menu is small and precious. Items are on pricier side, but they do make em well. We liked the ricotta a lot for appetizers. The pulpo (octopus) was the best entree. Octopus was cooked to perfect tender, didn't taste like rubber. Chicken breast was also well made. The burger was decent. The lamb pasta dish was okay for me, but I felt adding some shredded cheese could have enhanced the dish.\n\nOverall we had a really good lunch. The service was top notch. We would not mind dining here again when we visit NYBG next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeW9IeXlnRRAB",
            "text": "NYBG Hudson garden grill visit on Saturday, April 6\n\nthe New York botanical gardens is my go to place to relax and enjoy the outdoors in this majestic environment of beauty and nature. One of my to dos, is to dine at the Hudson Grill.  I have enjoyed the food but sometimes i think the chef is plating for me a smaller portion of chicken or maybe I love to eat great tasting dishes and want more. I constantly order the roasted chicken with string beans and potatoes. the string beans is cooked in tomato sauce, the potatoes has a lemon flavor while the chicken has herbs. I wasn’t sure about the combination with the tomato and lemon flavors but this dish works. I can’t wait to try the new spring/summer menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzRtM0xBEAE",
            "text": "Excellent service and very attentive staff. The presentation and preparation of the food is excellent. The food and drinks themselves are deliciously toothsome with flavor combinations that are unique to this venue. The food is farm to table adding to the freshness and delicacy of its flavors. The specials are truly spectacular and always with a try. Can easily spend $40 to $60 per person but it’s worth every cent."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReWFEMnBnRRAB",
            "text": "After walking a great deal viewing the gardens, we were delighted to have lunch here. The terrace is just gorgeous overlooking the gardens.The hostess and server were very pleasant and attentive. The food was absolutely delicious and…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaktpQlJ3EAE",
            "text": "If you are looking for a healthy meal this is not the place. Their fish is not wild caught quality so we ended up ordering a chicken entrée thinking we order on the safe side.\n\nHow could they go wrong with chicken?  The only thing that was edible in this dish were the beautifully prepared toppings.\n\nFor appetizers we ordered an outstading salad.\n\nThe ambiance is very cool and the decor quaint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOWRHRktBEAE",
            "text": "Usually the restaurant that is inside an attraction is an afterthought and only so so.  Hudsons is an actual real restaurant with good food and nice people.  Food was fresh and service quick.  I will stop in again next time at the New York Botanical Gardens"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdzRmNUN3EAE",
            "text": "The place, the food, the atmosphere, everything you could have in the city, but in your own private setting.  I had lunch here with my friend, and the food was delicious, the service was amazing, the place looked beautiful as if out of a movie. We felt like princesses here. Gotta come back! 🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ3ZhUldBEAE",
            "text": "We love going to this restaurant on visits to the NYBG. I don’t know if the staff had been prepped to go fast because it was Father’s Day but everything arrived too quickly. Our apps arrived before our drinks. Our entrees arrived whilst we were eating apps. Then when we wanted mayonnaise and a glass of wine there was no one to be seen. It’s a shame because the food is excellent. Let people enjoy it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMWVEZnF3RRAB",
            "text": "A garden is a special place, where one can refresh and enjoy nature’s finest. Place a restaurant inside the garden and pure joy!  The Hudson Garden Grill is light and airy, not too large, but big enough and an enjoyable menu of different…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydDZQT1FBEAE",
            "text": "Honestly didn’t have very high expectations since cafes in museums/gardens are usually average at best. Hudson Garden Grill is a pleasant surprise. Food is more serious than I thought it would be. Some ingredients seem to be farm-to-table? Interior includes elements from the botanic garden. Visited many times and never disappointed so far. Usually crowded on weekends so reservation is recommended."
        }
    ],
    "reviews_count": 85
}