{
    "name": "Tony's Pier",
    "place_id": "ChIJBdUigIWLwokRJvFIxrTgr8s",
    "grid": "BX10",
    "address": "1 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.3,
    "user_ratings_total": 5959,
    "phone_number": "(718) 885-1424",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScGR6Qk9PSE5RUTB4eFgzWlVTVEpGVFVGM05rRRAB",
            "text": "The prices are really high for the quality and quantity of food, and $16 for a Pina Colda in an 8oz plastic cup is robbery.  That's South beach prices without the South beach view."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWelRGaGhTRU0yY3pSclowODBUbTFLUmxoR1ZGRRAB",
            "text": "The place across Johnny's reef was closed and instead went to Tony's.  Johnny's has them beat hands down!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdE1taFZNMjlhUzNVNWVVZHZZVGhJV1daVGQwRRAB",
            "text": "Language barrier"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5enI3LXpBRRAB",
            "text": "Great food. The bathrooms on the other hand need a deep cleaning. And they need to update the interior already."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZk9XbHlOV1pJZVdSak4xZzBjalZ4U0hOb1YxRRAB",
            "text": "I came to this place several times with my partner.\nPlace is always booming with customers.\nI don't eat seafood, he does, but the virgin pina colada is always a hit and their cheesy garlic bread.\nStaff is always friendly and try serving you as soon as possible.\nI would like to point out and nothing against the establishment, some people who tend to be inappropriate and with other customers.\nThough the vibe is usually chill, some people just don't have respect for couples and flaunt their bodies.\nSome people just lack attention."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WS1pVZDZWelV3YzFSc09YSjBRVXd4Y1VweVJXYxAB",
            "text": "This used to be my stepdad's favorite spot (may he rest in peace). So, now me and my kids come all the time to eat here in his honor. My daughter loves to get the fried calamari. I get the tostones and the fried shrimp. My son loves the yuca fries and fried chicken. I get them the virgin pina coladas while I drink the alcoholic one. It's so much fun coming here with the kids and we always sit outside under the umbrellas. Sometimes the seagulls sit by and people watch, lmao. They only accept cash, but they have a couple of ATM's which is so helpful. It's not fancy but it's cozy and we have never had an issue. Plus, the view by the water is always fun."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcEtYN1RREAE",
            "text": "Great lobster"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1JGQXpaMVJWTWtST05GaE9abWQ0TFVWR1VsRRAB",
            "text": "Relaxed family atmosphere 😌"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sS1RFeFRiR1Y2Um5SbWJWaHVhVmxtV25Vd1QzYxAB",
            "text": "Delicious seafood, cocktails, the piña coladas are very delicious, the excellent atmosphere, the natural breeze when eating outside inside is cozy, I had a nice experience, the staff was very friendly Good price, parking, bathrooms, everything very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQk5ubHJlRmxUVVVWQ1EyNW9iVWxEVVhwTFExRRAB",
            "text": "The food at seafood city is better. Maybe i am spoiled, but Tony is not as good as it used to be."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taM2JsVlVSREZrVVhKV1lVMXpMVWxpYzA1Zk5YYxAB",
            "text": "Nostalgia for Bronx residents especially GenXers🙌…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM2IxSjVSaTFrYWpkbFYwNU9iMjFvT1VvMmIwRRAB",
            "text": "If you google Tony's, the first result is a Reddit thread where someone is asking for recommendations for a restaurant that is kinda expensive and awful to recommend to someone they don't like. That about sums it up. Food is pricey and terrible in a makes-you-feel-ill way."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eE1XWTVSR1ZPTkhKWU9UUjNTRkZmUW1SQlVIYxAB",
            "text": "Eating seafood at Tony's by the water is always a fun time. The seafood is always fresh and well prepared.  The Henny Pina Coladas was a nice topping to the meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVmVISkJUbEZaVVVwMmJXMU1ibDk1VDIxWVMxRRAB",
            "text": "Disgusting and not fresh food awful I will never go back in there workers are nasty too I saw mice inside probably goes to the food and then people they don’t know they eat ewwwww I will buy shrimp 🍤 from now from Costco and have my wife cooked professionally and fries 🍟 don’t go in here and Johnny’s restaurant it’s same stay away expensive and not fresh at all"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKT1JuUkZOek52ZUVWb1JYVkRkMkZWWmtSMk1WRRAB",
            "text": "The restaurant was crowded"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweWRuUlhZVFp2YkdGbVZWSnJVRTlsV0U5UWEyYxAB",
            "text": "The food was fried and full\nOf grease\nJust the way I like it I ordered the fried fish platter with fish of course calamari shrimp clams and scallops it was so much food .  I enjoyed every last bite.  First time there didn’t know what to expect.  Fast quick service inside and outside dining picnic table style seating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdlRrNXpUMFI0WDFkNVIyeE5hVGxOZGt3MExYYxAB",
            "text": "Been coming for YEARS!!!!!! My fav❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTU0wMVlVbEJXZGpSbE5HdGZYMVk0ZVdsNlFrRRAB",
            "text": "It's an ok place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SmQweEphRWxrZGxaRFV6TmthekZQVWtob1FrRRAB",
            "text": "I was so disappointed to see rotten cherries in my drink after spending about 20$ on just one. Will not be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTFJEQkZjbWhzY21OMFNrVlpORnA1UzJ0TWJrRRAB",
            "text": "Combo #3 - Lobster, shrimp, scallops & caramales with fries & coleslaw. Also the New England clamshowder which was delicious."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZlh6T25HLXA3LXh3RRAB",
            "text": "Todo muy rico....siempre venimos a comer el pescado frito"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcGVYUlhUekJZYjNkS2RtVlFWV3MwY1hoUVFtYxAB",
            "text": "No flavor in the fried fish"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd2F6RnFjMVZMVDBSclRXcHRZazloUkY5dmJYYxAB",
            "text": "Tony Pier has been around for years and the quality of food has not changed.It's still top notch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbmJFUjZUQzE0UWxGWlpuVjJiSFpzT1hCMVVVRRAB",
            "text": "Stopped in with a few family members (not my choice). First of all the establishment is a cash only place, they conveniently have several ATMs at the restaurant for a fee. The restaurant has indoor and outdoor dinning tables. Honestly this place really seems like fast food sea food style. Personally, I just am not a fan. I ordered the New England Clam Chowder which was not the way I like it, it was very runny and watery. I had the ribs because I did not want any fried sea food. The ribs were bad, smothered in awful bbq sauce. The only thing I liked were the tostones. My girlfriend ordered the fried whiting and it had no flavor it was rather blah.   I did not like this place and will not return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWVp6RlFjams1VlZOaE1XZHVaMUY1TVc5SlkwRRAB",
            "text": "Food is so fresh and the sea birds are still flourishing..."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa1ZrOURkeTF3YkZoWlpYZGxVRjlDTkZwaWNVRRAB",
            "text": "Es de mariscos y soy alérgica, pero los acompañantes comieron langosta  mejillones,camarones.\nSólo efectivo no tienen otro método de pagó"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCV1VtOWxWRXR4Vm5oelFsQk1RMVZEVFRKVFdWRRAB",
            "text": "All their fried food is crazy good 👍 just aheads up they only take cash 💸  ATM available"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU1RHMDFWSFpGTms1d1F6SmZNRW94YVRGcWVuYxAB",
            "text": "Great food asa always"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTFRWWjZaWEIyWm00dFNGcERUMEk1YW5GcGVIYxAB",
            "text": "Dude, that fried lobster tail and shrimp combo is the best part of the trip! It's so good, you'll probably want to get some to go, too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSU1rOVJkRzV1ZWxSWFZGOXJaRlozU0d4UFEwRRAB",
            "text": "Atmosphere super casual dining. Decent pricing for fried seafood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeVZHeGxRbXhoYWs1dlZqTjBUek5MYjIxWVJrRRAB",
            "text": "Many different selections of food choices, delicious seafood, and cheap non seafood, burgers, hotdogs, fries."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MWVtWkdaRXR1V0ZkNFZGWjVNRWhCTmtoaE9WRRAB",
            "text": "Good fast fried sea food good drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMVdVNTBZV3RaZDBGd1gxWXhVbVZmWlZGa1dsRRAB",
            "text": "A real good.\nSeafood restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMVVWVTJlbGRMY0cxWE1YaE1kSFpyTVVWUVZVRRAB",
            "text": "Classic spot for classic simple food and very nice people working"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWlduTjFOVmN6UkhsbFVUaGpTSHBFZGxsRE9HYxAB",
            "text": "Fresh and tasty food.\nEnjoy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRE9VOWlUelF3Y2pkd1Ywd3dPSFkzTkRkM1NGRRAB",
            "text": "Driving through the Bronx on my way to CT Do to the traffic. We Decided to stop off in city Island  at the dead end two restaurants end with parking,\nYou can order your food (CASH ONLY) and just sit indoors or outside the tables or your car and relax enjoy the Seagull, Or grab and go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toalIxVjBkWGx0UmpFeWRVeE5XVkZmWjNwMVVVRRAB",
            "text": "Visited on 8/7/25 for lunch. Ordered a fried shrimp with fries combo and observed the shrimp and potatoes to be undercooked. Experienced indigestion."
        },
        {
            "date": "2달 전",
            "language": "nl",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb05WcHRXbmM0YVUxb1lVeERTM1U1VjJwaFZHYxAB",
            "text": "Blijf hier weg! Alle zeevruchten worden gefrituurd en zijn smakeloos. De lobster roll (32 $) was de slechtste die ik ooit at ! Je kan ook alleen maar cash betalen. Ze hebben 2 dure ATM machines staan in hun zaak voor als je geen of onvoldoende cash op zak hebt.\nJammer dat je geen 0/5 kan geven."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFZYTnpXVVY0YURVNGMyTXdNVXRaZW1GRWIwRRAB",
            "text": "Only cash and no taste.  Went for the seafood combo (42$)  Everything has the same taste of fried stuff.  The lobster roll (32$) is tasteless.  There is an ATM with a high processing fee.  Seafood deserves better.  There is a terrace but the view is average."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ00yVmtUQzFOVG5rMmJYTjZka1ozVTNCUWRFRRAB",
            "text": "Bit pricy but good food"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cmItdEl3EAE",
            "text": "Only Cash ㅋㅋㅋㅋ"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkc2NVTm5XR3RNUkZKUFZXNHpaMHBKWjJSTlNWRRAB",
            "text": "A nice restaurant by the waterfront serving up seafood and many fried options.\n\nA dozen oysters for $18. A few tables had the king crab legs. The clams & fish whiting looked popular.\n\nThe cheeseburger was a bargain for $6. My New England clam chowder was not as creamy and a bit short in clam meat.\n\nThe venue interior is nicely cooled and organized."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aFpHZG1iMG8wWkRkWVJreENjR3B2TjFoaVZYYxAB",
            "text": "This place will forever be a staple in my heart! This a Bronx classic! You can't say you been to city island without going to Tony's. the fired seafood choices are amazing.\n\nThe fried shrimp combo always a good one. If you want to spice if up, get a combo #20 including lobster tail. Also had a seafood boil option with clam bar.\n\nThe drinks are also a fans favorite. The pina colada are to die for ! I love this spot! Me and my family been coming here for ages! On a good day when the weather is good especially in the summer, sit outside and enjoy the lake views.\n\nNever forget, always bring cash !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNG9yWWVnEAE",
            "text": "I recommend the seafood pasta as it has a unique take (usually they come with red or clam sauce). The fried calamares were a little too tough. The steamed clams was a great deal for the price. The bathrooms are clean. Overall, it has a beach seafood shack vibe and the staff were approachable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWEdqLVRtX0tDYU1BEAE",
            "text": "They have a great variety of seafood and it’s delicious. I would say fried food was a bit better than baked one but it depends on every person. They also have a variety of drinks (alcohol). It is a big place to enjoy with family and friends and it’s always full of people so you need to know there might be no table available for a moment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIanZlNUJREAE",
            "text": "FOOD: On our way through NYC we decided to stop at City Island! To try these exquisite styles of food!! We loved everything and they served us very quickly! We loved everything, we liked the tarta sauce.\n\nThe place was very clean and the bathrooms too! We recommend that if you go at night, you visit the patio! It's really cool. We loved it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcnZyMVNnEAE",
            "text": "My first time visiting Tony’s in years, glad I came tonight. The quality was excellent service was fast very accommodating. My Henny  colada was excellent. I loved how hot and fresh my seafood combo was. I highly recommend the mozzarella sticks. The crust was excellent and crispy with nice gooey cheese in the middle And I really enjoyed my scallops. I will be back soon."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd1pYQ1FBEAE",
            "text": "Seafood take out style restaurant. There is no table service, but there are plenty of seating available. It is bit expensive and not many healthy choices. Limited menu makes ordering easy.\nBeautiful location and views. Cashiers are very friendly.\n\nEven though it is City Island, It's the Bronx, and sometimes in the summer, there are  tough groups  where I got  the feeling a fight can break out 😬. I have felt they need private security during the summer peak season. So far I had no problems"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcGRyYVBBEAE",
            "text": "I used to go here back then but I visited here again today after 5 years I got the combo #20 and 6 piece mozzarella sticks and a drink the food is a little expensive since I spent $48 on my food there are not too many options and it’s mostly fried food but the food was good and the restaurant was mostly empty since I went around 12:30 pm on a Saturday. Tony’s is right next to Johnny’s which is closed during the winter. I will come back again during the summer time !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2UyT1FREAE",
            "text": "Great Shrimp and French fries and bake clams also the fresh oysters was delicious well worth it have cash ready cuz they only take cash"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdGFLei13RRAB",
            "text": "Ive been coming here all my life for shrimps and calamari. The taste is always fresh and I love the prices now. The best shrimps and calamari around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieGNDVm1nRRAB",
            "text": "Stopped here while cycling. Order at the counter, given a slip with a number, they call your number when ready & then you pay. THEY ARE CASH ONLY. They have small bar on the side to order drinks. Ordered the fried clam strips. They give you a ton of them, enough for 2 people. There was more clams than fries. Clams were good, will return again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eE1iY3VnRRAB",
            "text": "Delicious food with reasonable price. My hubby order me a combo which I thought it’s not gonna be enough for me to eat, but once I saw the food, I knew I was wrong. It was a lot!!!!!!!! Any way it was too delicious, so I still managed to…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6c2FISE5nEAE",
            "text": "I haven't been to City Island in over 25+ years. I used to bike over here from Manhattan to meet up with friends after a day at Orchard Beach!! Crazy! Where did that energy come from!!! A lot has changed but the food, people, smells are the same. Today I came with my daughters to have some seafood 🦞 Ahhh, you didn't disappoint! This was one of the first dates I had with their father, Rest his soul! That was 30 years ago! It was a beautiful memory then and now!! Thanks, Tony's Pier for the fond memories and spectacular food still!!! Those 2 crazies are my daughters!! Their dad would be so happy I came with them!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX3BieVJREAE",
            "text": "Never disappointed with my food. Javier is my favorite. He makes sure all runs smoothly. I usually go there to take my clients (seniors) and they could be a handful but they are so good at their service. They on point and the environment is welcoming, safe and clean. My favorite seafood place by far. 😋😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM3BQSGN3EAE",
            "text": "Ive been coming here since the early 80’s for the fish especially the whiting and used to love it. Today if my first time back since the fire and remodel and I was quite disappointed in the food. We were a party of five, ordered four whitings and one spare ribs. Everyone agreed the fish 100% went down in quality, it had a reheated taste although it was probably deep fried which would be fine except the quality was bad. I had ribs and they were good except for the sauce which was spicy and just sticky. The BBBQ sauce if fixed would make the ribs pretty good. Stay away from the Whiting fish what a let down. Next time we will go across the street and try Johnny’s. I do hope the owners can read these reviews and fix their food, quality is too low right now. They need to follow their parents footsteps and keep their food as before."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MUxldTVnRRAB",
            "text": "Been here over the years many times, very good memories and always has good food. My wife and I had the fried lobster tails and a shrimp basket which is their classic! Drinks were perfect and always hit the spot!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNWNYT0RBEAE",
            "text": "I came with my family on 1/25/25 as a treat it was empty and fast service I order crab legs it was quick like 10 mins during those 10 mins there was claw machines and I won a duck after I got my crab it also included fries the crab legs were good I would recommend this place and recommend eating crab legs"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Nzl2SE1nEAE",
            "text": "Quiet on a Tuesday afternoon. They have very affordable prices on the menu. The customer service behind the counter could be better. One of staff was kind of rude. As far as the food, they give you 2 big pieces of Whiting. I don't think…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac2RlUWh3RRAB",
            "text": "The food was fantastic. I got the fried  baby lobster tails with French fries and shrimp. The drink were well made, the prices were reasonable. The counter person was hilarious when we ordered. The bartender took care of us. The frozen drinks were the perfect combination. We went at night so there wasn't much to see but I've been in the area during the day and the scenery is nice. The place is cash only and there is an ATM on site. I cant wait to go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiazVTcktnEAE",
            "text": "Old school seafood place that's clean but starting to show it's age. Food is fried fresh when you order. Friendly staff and reasonable prices for what you get. A refresh of the property is overdue and would separate this place from Johnny's across the street."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S1h6ZG9XVmM1VURKSVF6QjVkMVZ0VFhZMFRYYxAB",
            "text": "The decor is a school cafeteria. There is no table service. Stand in line and get your food. NO CREDIT CARDS, CASH ONLY. The best part was the raw bar. Shucked in front of you. Fish and chips, big portion, but average taste. Prices are reasonable, attracting a questionable crowd. Had I known what I know now, I would choose another restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldXNqcnlnRRAB",
            "text": "My uncle and I visited this restaurant for a late lunch on a Sunday afternoon. The atmosphere, specifically outside seating area is very scenic and has great views!\n\nThe only part that was quite unexpected was the very long line and wait time. We waited in line to order our food for about 45 minutes! Once we finally got to order, we received our food quickly but the wait time was ridiculous.\n\nWe ordered the fried lobster tails with shrimp and fries. We both enjoyed our meals. It could have used a little more seasoning but it was good.\n\nI would have given it 4 stars but it gets 3 stars because of the ridiculous long wait time to order."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaVR6X2YwNU1tSmhBRRAB",
            "text": "The fried seafood here always draws a large crowd expect to wait 10 minutes or more before you can order. Strong drinks, clam bar and a bustling energy. The kind of place that has security to keep the hungry folks orderly. Bay views and good vibes"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNGY3djZ3RRAB",
            "text": "Todo  limpio. Ordenado. La comida buena.No  mucha espera. Un día de semana  estaba tranquilo.  Su comida buen sabor. Bueno  tragos . Su vista al mar muy bonito..ambiente  relajante."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ2NGOXhTMjlaZDI4eVFteEpkREJIYkRaRVMzYxAB",
            "text": "The quality of food has significantly decreased over the years. There are some tasty options like the snow crabs and clams but the majority of options are fried food that’s bland and unimpressive. The view of the long island sound is always a plus. Lastly, note that this place is CASH ONLY."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWFdWbEZaVkZ6TjIxUWJYbHVlRWMyTm1sU1VVRRAB",
            "text": "Date of Visit: July 7, 2025\n\nMy mother and I visited Tony’s Pier on our last night in NYC with our cousin and his wife. After enjoying food and three rounds of cocktails, things took a horrifying turn. My mother became immediately incapacitated — unable to speak or walk. I was also extremely unwell. We both began violently vomiting as soon as we got home, and my mother suffered complete memory loss for 12 hours.\n\nAs British-Caribbean women with extremely high alcohol tolerance, this experience was not the result of typical drinking. We drink Wray & Nephew regularly and could never be brought to this state from 2-3 cocktails. Something was seriously wrong.\n\nThis turned our final night in New York into a traumatic experience, and we are deeply disturbed. Be cautious if you’re drinking at this venue. We’re still left feeling weak, disoriented, and very concerned about what happened."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeGVFOVVPRVZ2YTFOUmFrbHBaWFJ6TWtSa2RuYxAB",
            "text": "Food is tasteless also the shrimp and fries seem to from the bag. Nothing seemed fresh the shrimp was small and overcooked. Steak fries were horrible Walmart seasoned fries are better than this. The tartar sauce was watery. I’m must say I should have stuck with Sammy’s Fish Box, I wanted to try something new. This was by far the worse seafood I have ever eaten. Oh and the corn was horrible it’s was over cooked no butter taste at all. You seen butter was on it but there was no taste to it. Everything basically taste like it came from the bag and dropped in water or just thrown in a batter and fried. No seasoning at all and the shrimp, as well as calamari was not wild caught at all. I’m very disappointed you pay for what you get. Sorry disgusting!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeFdHOXVkVnBmYjNSMFEwWktRemRMWjIwMkxXYxAB",
            "text": "The food is great, just needed a better air-conditioning inside. Service was ok, just the line didn't move at all like 10 min.long. But I love this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ejk2VE9BEAE",
            "text": "Food is good to really good. Scallops cooked near perfectly. Shrimp was on point. Fish was pretty good. Seasoning could be a little more flavorful, but I figure that's because customers can always add more seasoning, but you can't decrease it.\n\nFries were meh. But if you judge a seafood joint too harshly by their fries, you're probably in the wrong place.\n\nNot a fan of the fact that they don't take credit cards, but at least there's an atm in the building.\n\nService was fast and efficient.\n\nReally like the fact that tax is included in the prices and you don't have to calculate your totals. Especially since cash is required"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMGFpbWxnRRAB",
            "text": "Went for lunch. Fried shrimp and fries, fried lobster tails and shrimp. Feeds three ppl. Fresh n good. Enjoyed the trip and stay. Nothing fancy or special. No tourists. Nice start for walking around town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM1ExUk5hVTB5YVcxdkxXTnVRWEpYYTNsVmRuYxAB",
            "text": "Food was delicious, hot and fresh.\nService was okay (have to be used to the NYC rudeness).\nHas plenty of seating inside and outside!\nWater views are beautiful 😍"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMjl5VzB3RRAB",
            "text": "The fish was really good. It was fried just right and wasn't overly oily. The portion sizes were really good... I couldn't finish it all. I would definitely revisit. Because the food is made to order, there will be a wait. I advise that you plan your visit accordingly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214alYyUnJZVlJFV0d0ZllUbHJMVVJKV0dGbWJVRRAB",
            "text": "Been coming up to Tony's from Queens for over 30yrs. Never had any problems, Fish is good ,portions are good. Service can be fast or slow depending on what time you go."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdXVDSU1nEAE",
            "text": "The fish was pretty good but they could season the fish a little better. Portions were fair and the price reasonable. Got trout & my spouse got flounder. He didn't like it much & said it was greasy & thin. Others got shrimp & fries. They…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbHBqUnZnRRAB",
            "text": "Amazing amazing amazing seafood. The food is fresh and the drinks are great. This is the place that I like to go back to. This beats Sammy's and seafood city when I visit city island. Cant think of enough words to describe the place but…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcXhzTl9oMVpQc0xBEAE",
            "text": "Been coming here since a kid! Not one for reviews but seeing the past reviews saying “no seasoning” or “cafeteria look” best shrimps for 20$ you can get you want upscale go to ohanas or new atik. Tony’s 10 years plus not going anywhere i hope! City island classic!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROHBtNEd3EAE",
            "text": "So glad they renovated this place and reopened after Hurricane Sandy. This is my favorite spot in City Island! Their food is delicious broiled lobsters & shrimps are great and their fried shrimps and fries are yummmmmy. I've been going here for over 20 yrs and they never disappoint😉.…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJM2RuTFNIOHFQaWt3RRAB",
            "text": "Ordered fried shrimp and fried lobster tails. Whatever seasoning they use is not that good. The lobster tails were not fried fully. In between the lobster was still wet. If they want to call that tartar sauce, I will let them, but that is not tartar sauce. That is crap. I will make sure to catch Johnny’s before they close or go to Seafood City instead."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdUk3UDh3RRAB",
            "text": "Food never disappoints! Service is quick, and tho the place is not all that fancy, the cleanliness makes up for it. Prices have gone up a few dollars, but at least the quality of food has not gone down. If you want THE BEST FRIED SHRIMP... Tonys is where it is at!!!"
        }
    ],
    "reviews_count": 80
}