{
    "name": "JP's",
    "place_id": "ChIJ6WkcE2OMwokRQWEfgUGaGc8",
    "grid": "BX10",
    "address": "703 Minnieford Ave, Bronx, NY 10464, USA",
    "rating": 4.3,
    "user_ratings_total": 1479,
    "phone_number": "(718) 885-3364",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvdFdXa3RNMEpwZUdWb2JWbHRTMGxqUldsaWMyYxAB",
            "text": "We spent over $700 and the food was of poor quality and flavorless.  What a disappointment.  I would not recommend this place to nobody."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNU1uaG9MVkZvU2xWblVVRk9lRVZoVVZOU09IYxAB",
            "text": "Oh JP’s. It really hurts to write this review but this place has gone downhill. It’s been my favorite restaurant for YEARS, things have really changed more recently though. While the serving sizes are HUGE, the flavor/taste is NON EXISTENT. I can understand low salt however the food had NONE, no herbs, spices..NOTHING. There was a sign on the door warning patrons about pricing, that still did not prepare me for $75 WHITING and SHRIMP that I could’ve got from 125th street for a fifth of the price and more than half the flavor! I was also very disappointed in the garlic bread( which is usually a hit) that I could’ve rung out the butter like a wet washcloth. My stomach is hurting till this very moment from all the grease.\n\nIt was really sad to see the place with barely any customers on a beautiful evening on the weekend. JP I hope you see this and don’t take offense but rather use this as constructive criticism to make things better for the future.\n\nBe blessed!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYVRuQmpXbmRNWm5ONVZHdFpjVEJhVFZWUFVsRRAB",
            "text": "Love the colors of the restaurant and Mr.JP my mom and I visited from Charleston! We got to know Mr.Jp and everything was so fresh!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdF9EOXFBRRAB",
            "text": "Food was not that great way overpriced.Restaurant is drastically outdated"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa2FHdzVNVUZJZDA1VVUyZ3lOSFJGYXpReVVFRRAB",
            "text": "Damn, JP, S fell off . Needs to be cleaned."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMGREWlZTME40VGxKRVpHTlVkVm8xZVRKV1NHYxAB",
            "text": "Best spot on City Island and best seafood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTmMzUTNORzVuVVRadk9Fa3hOMnh1TVZWUmVHYxAB",
            "text": "Great atmosphere that pairs nicely with the amazing seafood. Ordered two broiled combos for 2 people as we had 4 people. Enough food to feed 6-7 people. :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQlQwSjJPRmx5TUdWMVpDMTVXWGcxUkZKNFZFRRAB",
            "text": "Love the food , great customer service. The salmon and lobster dishes are my favorite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dlYwdFRXRTFWVW5wMVNHWmFjME5KZFVadVIyYxAB",
            "text": "The best seafood restaurant I have ever eaten at in NYC. The owner prioritizes his patrons and the quality of the food and service is exceptional. If you want enjoy a meal with beautiful views of Long Island Sound and great atmosphere you have to eat a meal at JP's Restaurant."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTVFqQlpOWFV6Wm1wdGNVcEthRWxLVG5OclpsRRAB",
            "text": "Nice people. Not many servers. Went there because I only eat wild caught seafood because we dont like the hormones that farmed has, therefore, price isn't an issue.  Ordered shrimp stuffed with crabmeat. The shrimp were good but the crab meat was more breading than crab. I am used to distinguishing the crab meat. The rice seemed boiled. The bread was good. My sis took fried combo. Fish was too thin and shrimp was butterflied, not that meaty..  Did not have strong taste like im used to. Beautiful view.\n\nUpdate 8/24/25\nIn reply to your written attack...you never addressed the issues I mentioned. I was never rude or mean about the review. I was honest. The crabmeat was doughy with no sign of crabmeat.. you never addressed that. The rice tasted boiled, you never addressed that..the thin fish and butterflied shrimp was never addressed either. I can be as rude as you when I write as well but I chose not to. I just posted the review because I'm used to great food. Grew up going to city island but this was not a great experience. If the truth bothers you, maybe get a better chef, get your company off the web or just dont go on the internet. I dont know where your attack came from so I am just going to let it slide, maybe your going through something. Hope that things go better for you and you start taking this review as a means to better your food and not as a personal attack. Have a wonderful evening.\n\n8/25/25\nI decided to finally look at your reviews.  As you can see, your attack on me is your way of denying your food is bad.  And these are just a few...\n\nBill Murphy\nLocal Guide·34 reviews·37 photos 2 years ago\nDine in  |  Dinner  |  $50–100\nThe staff was great. The view is great. The place itself is really run down and needs a lot of work. The food is very overpriced for what you get in my opinion. Expect to pay $75 per person without drinks or dessert. You can easily pay a lot more without drinks or dessert as well. Drinks served in disposable plastic cups. Peas that come with the meal served the same way without any seasoning and seemed microwaved. Seafood stuffing mostly bread.\n\nEnza kico3 reviews 4 years ago\n3rs time at JP\"s and probably the last. Introduced to famous stuffed baked clams and loved them. Clams were stuffed with chopped clams til the last time, which were stuffed with bread. I ask server if recipe had changed and she was extremely polite to find out. We thought if we could get our remaining clams well done it would compensate for the ratio of clams to bread flavor. Approached owner and he blamed the sever. Sadly I believe the blame is the kitchen staff. Mistakes happen but you can't blame someone if they are not to at fault. Sad to see this attitude at JP\"s....some advice take the customer\"s opinion.😔\n🙏3\n\nCoolieLocal Guide·68 reviews·70 photos 3 years ago\nNot wort your time or money, DO NOT COME HERE, the food is BLAND, TASTELESS, Calamari had no taste what so ever, Streamed Lobster was the same, the only items that had any flavor??? was the fries and the fried shrimp, I truly believe this restaurant serves pre-boxed frozen meals, straight from the freezer to the frying pan, to yor plate, pics are in order of appearance, the fried shrimp amd fries, jumbo shrimp with crab meat stuffing, which had no crab, and last was the steamed lobster.\n\nLaniya Harris\n15 reviews·4 photos 2 years ago\nDine in  |  Dinner  |  $50–100\nCame for a graduation/ birthday dinner. Food is over priced. In the menu on top of each page in big blue letters it says add an additional 5 dollars to the already overly priced food. Rice tasted like it was microwaved, crab stuffing was so salty i couldn’t eat it at all. Before I went in I looked at the reviews and one stuck out to me. Every thing Mr. Murphy said was correct to the T. Service was amazing. My server “Mo” was the best. No order was messed up and she was very friendly. Price around 50-70 dollars with that additional 5 added to each individual price. My lobster tail was very tough and chewy. Atmosphere was great. Garlic bread was good as well. Will not be returning ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc1IyRTJPR05rU0drMlJFbHZlbEZ1WjBsWlgwRRAB",
            "text": "2nd time here for lunch and service and Food was delicious 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNFYwazRiM3BFVEZkMWEwODVWVjl1WDBwM1NGRRAB",
            "text": "The waitress was so nice, but for this place to have a family/  friend vibe it wasnt when it came to the menu, the food was very very overpriced,and some dish no flavor and the colorful sgin on the door felt more like family member playing a joke, but wouldnt recommend this place for family dinner"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlZFTmFZM3BLTVc5d2QyUmhVMTl2YmxReFRuYxAB",
            "text": "Best Damn Seafood experience period.  The owner greeted us and was nothing but kind. The rest of the staff was on point. Looking forward to going back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCM1duSkJkRzFpWW5SV1ZqRnNaVGs1ZFRoNlJGRRAB",
            "text": "Great food and service.. would have given 5 stars but atmosphere didn’t add to the experience. Pricier than some spots but food and service were great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WemRYVmxjblJGVVd0RkxYRk5OSGxhT1hnMVZrRRAB",
            "text": "Great 😃"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaVlXdGxaRlpOZUZNMmNIRXdaVUpsYUU5aU1tYxAB",
            "text": "Great views and great service. The server was extremely nice and even packed our food for us to go. The food shrimp and lobster were a tad bland but the star of the show was the stuffed fish."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb2VrdFFaR1ptVG1OMVgxVkRZbUV6WjBZeGFGRRAB",
            "text": "The food and service is great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR05scEVRMHM0YVRod1prTTJhR0ZzZDBwWE9XYxAB",
            "text": "Great food and service. Restaurant needs updating"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMk9XczFTazV5VW10bGJWVkhlaTExWWxOUmNYYxAB",
            "text": "I love it here so real raw amazing. Owner? Realest person youll ever meet no bs to just tell u what u want to hear hes going to keep it real 1000% of the time. He lets u no ahead of time how long your food will take and its very fast at that, drinks are strong and definitely worth the money ."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaThXLXpnRRAB",
            "text": "JP's is my go to place for celebrations.  The food is great, the atmosphere is welcoming and the vibe is chill.  They have indoor/outdoor seating with great views of the water. The servers are on point and eager to please.  The frozen drinks are amazing.  I always get the whole broiled lobster.  The portions are good and the food is delicious.  Thank you JP's for so many good memories!  See you soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ05IVjRVazEzZG5SbWVEQjFibFJvYWkxS1gxRRAB",
            "text": "Always good seafood and good service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd2VWUk5kR0ZaYjNabVdVc3hZVGR4TVRSc01GRRAB",
            "text": "Wow this place overall was a 10/10! My bestfriend and I left obsessed with this place! Literally noooo complaints at all!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUllXOTRNMGQwYWtoQ09XUXpUVFEyZUV4UllrRRAB",
            "text": "JP's still doing it well after all these years. Our first date here 37 years ago before moving out of state. Returned for our 35th ANNIVERSARY. Dinner was incredible, John treated my wife and I so wonderfully on our anniversary.  Maureen (Mo), our server, was excellent and made sure to make our dinner outing special on our day. What a polite and caring young lady( your parents did well)!!! God's willing we will be back next year (Florida)...THANK YOU JP's!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1kweFpkMEpKZWpWSVIxVnNRek51TWtaelZHYxAB",
            "text": "The owner was extremely professional and welcoming, and the food was fresh and delicious. Our overall experience was good, though our waitress definitely lacked professionalism, which took away from the vibe a little. Other than that, I’d still recommend trying this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLTh6WmZKZ055YVdREAE",
            "text": "Hot fresh seafood with a great view. Perfect for my sister’s graduation dinner with family last week. I had the stuffed shrimp it was AMAZING. Staff were great. 10/10!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYlhrdmpub2JlbzdBRRAB",
            "text": "I love this place. The food, the workers, the owner, and even the music. Service is quick and fast and they go above and beyond."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM0gwdF83b2RiRnF3RRAB",
            "text": "Been coming here for years never disappointment you get what you pay for quality and quantity amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPRDRscnlmcmRYRnVRRRAB",
            "text": "Been coming here for years. You get quality and quantity. Worth every penny."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKYVlwSXJxeFB6a3RnRRAB",
            "text": "Located in the back corner of City Island, it is hidden by the restaurant. Let's first of all talk about one thing, this place is pricey. Eating here is not cheap, and they know it considering the warnings littering the entertaining advising visitors to go somewhere else if they want more affordable food. Which I find to be both hilarious and quite honest.\n\nThat aside let's talk about the parking. The parking lot is very cramped, and the approach of the road isn't the easiest with an automobile.\n\nLet's talk about the atmosphere. The place is obviously the theme of fishing culture, along with seaside views and a very comfortable outdoor room where seating is many.\n\nThe food is good, and a lot, so you'll get what you paid for. Overall I can't complain."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV0M5c3pmaVoyOUtnEAE",
            "text": "Great food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNGNya1NREAE",
            "text": "We stumbled upon JP’s by accident due to lack of parking at a nearby restaurant. It turned out to be a great decision! Their paella for 2 people is big enough for 6, beautifully seasoned and the chef is very generous with the seafood! You get a whole lobster and lots of sea scallops, clams, mussels and shrimp. Highly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGFldHB3RRAB",
            "text": "The Best! Food fresh and delicious\nService was amazing.\nI wish I could give more than 5 stars."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOXVDUGhnRRAB",
            "text": "My favorite  bday  spot"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanV2N0VnEAE",
            "text": "Good food but still has that stench in there.  Responding to the owner. Like I said the food is good ask your other customers. This is the route\nyou take to respond as the owner? Nice. Constructive criticism Is what it is. Sad that ppl will see your response to a customer!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDUtb3d3RRAB",
            "text": "I've been going to place for the last ten years.  The food was always good with sizeable portions. Drinks are very good.\n\nThe place is old fashioned and unique in my eyes.  Servers are always pleasant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva2MtcmhnRRAB",
            "text": "I came here about two times,and I want to say the food was decent;however,I won’t be coming back due to the fact the waiter,who goes by the name of Angie served me BURNT BREAD TWICE. I mean,if you want to attract people to the restaurant,please treat them with LOVE. She knew she was serving me burnt bread,and by the look on her face,she knew she was wrong. Also,my husband complained about how nasty the male bathroom was. I have to say,walking to the Women’s restroom,I smelled pure piss,and it disgusted me. I want to say,thank you,but NO THANK YOU. I won’t ever come back again. BYE BYE,JP’S!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdk42VjBBRRAB",
            "text": "You get what you pay for. The best shrimp I’ve had in over 10 years and I’m not kidding. Had the shrimp cocktail ( legit jumbo shrimp )  and shrimp scampi and still can’t believe how fresh and tasty it was, much better than 90% of other places I get shrimp from.  Owner is very nice and sociable.  Service was outstanding.   10/10 rating overall"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaE0zcjdBRRAB",
            "text": "FOOD IS ALWAYS FRESH AND WELL SEASONED. Been coming here for years. One of the only restaurants on the island that i do go to. Never thought to leave a review, but I happened to notice that somebody recently left a bad one, and  I figure that I can balance that out with a good one. The food is simple and good. Perfectly seasoned and always fresh. Big portions of good food with a restaurant owner that takes pride in his product will keep me coming back so long as he's there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJODlTVXdRRRAB",
            "text": "Thier King Crab Legs are to die for. These are extremely huge and taste great ..not to mention thier garlic bread.. yummmm"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNHNqd09nEAE",
            "text": "The food was okay but they were doing construction. I will not go back until the place is fixed up."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cmZtRm5RRRAB",
            "text": "I would receive people"
        },
        {
            "date": "8달 전",
            "language": "no",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNGZxN1F3EAE",
            "text": "Superduper!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbEtxOEhnEAE",
            "text": "HEY JP. THIS IS AMERICA AND GOOGLE ASK FOR MY REVIEW. THE TRUTH MAY CAUSE OFFENSE BUT ITS STILL THE TRUTH. DID GOOGLE ASK U TO REVIEW ME AFTER ME AND A GROUP SPENT 400$ AT YOUR TRASH ESTABLISHMENT for garbage food? NO they didn't and yes I have time to prevent future possible patrons from a horrendous experience saving customers one review at a time . Hopefully you look better mote presentable  for the folks that gave 5 stars.Please do better . The owner  had his jeans hanging off him and his boxers exposed obviously intoxicated. He replies to reviews trying to defend the overpriced tasteless food. Clearly he is offended and needs to make excuses for the lack of effort he places into his business because I tell not one lie. If he paid more attention to the recipes maybe I wouldn't have noticed the horrible decor. Looked real outdated!  Fish tanks with no fish in sight  lined with big back old school tvs on the floor with candles on top as though it was decorative. Atmosphere I would give a negative - 8. As for the food... they had to pay pay people for the prior reviews because there is no way this place has 4 stars. The food was soo bland no love at all in the food. Everything Lacked seasoning except the free garlic bread. The drinks were sub par and that's being nice. It was 4 of us and we only came because the kitchen was open late. We collectively regretted our decision. Oh and The owner offered free samples of shrimp and made such a huge statement \"these are the best shrimp in the world, trust me!\" When they were in fact no where near the best shrimp I've had. Actually they were the worse. The server was sweet Angie but besides that zero stars."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdnQzMmpnRRAB",
            "text": "1st off, don't be discouraged by the construction going on go around it's worth it! The food was delicious and great portions! As the sign says when you walk this place isn't a cheap eats but again worth it I'm definitely coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRd28zcTFBRRAB",
            "text": "If I could give negative stars I would. Don't waste your time or money going here. Food has no taste and the owner was drunk loud and disheveled."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnc3RiWDJnRRAB",
            "text": "Great place a person told me to come here best on city island and I did . Owner John very friendly recommend dishes and we're great . Melissa great and beautiful server"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN0tLY29BRRAB",
            "text": "Jp is the illest ( BEST).💪🏾💪🏾"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnek1mZUl3EAE",
            "text": "J.p‘s City Island is hands down one of the best spots around! From the moment you walk in, you’re greeted with a warm and welcoming atmosphere. The vibe is perfect—whether you’re looking for a chill night out or a fun date spot, it never disappoints.\n\nThe owner, John, is an incredible person who truly cares about his customers and makes everyone feel like family. The service is always top-notch—attentive, friendly, and professional. You can tell that the staff takes pride in what they do.\n\nEvery time my girlfriend and I come here, we have an amazing experience. The food, the drinks, the music—everything is on point. If you’re looking for a great place to unwind and enjoy yourself, J.P.’s City Island is the spot. I highly recommend it—10/10 Brisfrom63rd"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNTV5aWlRRRAB",
            "text": "This restaurant is my FAVORITE in City Island the food is wonderful the service is awesome I went recently again for my bday 1/25 from the owner waitress service so welcoming so lovely on top of great service & awesome food HIGHLY RECOMMEND will b back 🥰🥰"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaWVydXlBRRAB",
            "text": "Worst shrimps I ever eat. I can't believe they are open."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURVOUwwehAB",
            "text": "진심 별로임. 옆집이 더 나음..비싸기만 허벌나게 비쌈. 왜 손님이 적었는지 이해가 됨..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbE5YcU53EAE",
            "text": "I have been coming to JP's restaurant now for many years, first with my parents and grandparents and now with my friends. My latest visit on June 13, 2024 did not disappoint. Their famous garlic bread is so good you cannot stop eating it even when you order an appetizer and an entree. It's just so delicious! I had the fried calamari as an appetizer and it tasted great. Our waitress was very pleasant and helpful in giving good recommendations about the food as far as what dishes to get since they were undecided on what to order. I had the shrimp scampi with linguine and it tasted amazing being cooked in the scampi sauce. I wound up taking some of it home since I had eaten too much of the garlic bread and the appetizer. The atmosphere is beautiful as it overlooks Orchard Beach & the Long Island Sound. In conclusion, I had the chocolate cake for dessert which was rich and flavorful. The owner is a nice man who takes the time to say hello and ask how your food is !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIamE2ZHlRRRAB",
            "text": "Went for dinner and received stellar service. Angie, our server, was the best! She is knowledgeable and helpful. John is a great host and awesome bartender. As the menu says \"You only need one\" 😆The food is fresh and delicious with HUGE portions. We will be back. Thank you again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMWNhblBREAE",
            "text": "First time going to JP's\nThe food is just phenomenal\nThe crab meat is the best I've ever had.\nThe food is a must everything great.\nI highly recommend this establishment.\nService is very good very hospitable.\nBest of all when the whole island is jammed JP's is the place to be.\nThe view from outside is beautiful. You can see Orchard beach from the out door seating. Beautiful views."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSek9tcXJBRRAB",
            "text": "As we were looking for nearby places to eat we happened across this gem on google. Right on the water so I know the views of the waves during the daytime would be amazing. We had no idea what to get because everything sounded amazing. But…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXamZHT3VRRRAB",
            "text": "What a great place for a celebration!  My family went to celebrate my birthday!  The atmosphere was cozy,, the food was delicious, our waitress was extremely attentive and the owner John was so gracious!  We had a ball,, and we're are all in agreement... reserve a table and enjoy!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoajd6b3NBRRAB",
            "text": "I like to tell the owner  John thank you for   His Hospitality and for the cheesecake. Service was awesome love the waitress ! That took care of us.   Lobster was good . The shrimp  Was nice size fresh right out the sea. I want to thank J p's again for the hospitality will return.  Sincerely  ,Sassy"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeG9YVF9BRRAB",
            "text": "Aside from the ignorance of the owner, the server was amazing, and I didn't expect the pasta portion to be so much. I would like to note that the restroom was rank. It smells like a swamp, dirty fishtank, or marshland. I had to try to hold my breath. I felt like I was on a dirty pirate ship based on the movies I've seen. They could use a lot more TLC in that department. If you're very particular about cleanliness, I wouldn't recommend this place. They seem to be oblivious to the natural ways to clean.\n\nI would also recommend paying attention to the menu a little more. It was our first time visiting this place, and it wasn't really explained that the prices went up, and new menus were coming in, so we were a little confused about the bill. The server didn't point out and explain the handwritten price that was written at the top of the menu until we questioned the bill. It said \"Add $1\" or \"Add $5\" at the top, but we aren't mind readers to know exactly what it was supposed to mean, nor did the server point it out to us after being seated.\n\nOh, and use seasoning on the peas if they're supposed to be a side dish with the lobster. It tasted like cardboard 🥴 We were unaware of some of the side items that came with the dish, because it wasn't mentioned, but I'm not sure why you would have to request food to be seasoned with basic seasonings.\n\nAnyway, if it's your first time visiting, I recommend asking a lot of questions about the food, and if you are particular about cleanliness, beware of the men's room. In my opinion, they think men like this look and women deserve better instead of giving both restrooms a pleasant atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMzVPUUxREAE",
            "text": "It was great, the food is amazing. You get your money worth. They serve big plates which basically if your very hungry you will be full. Juicy and overall tasty. The staff is very friendly and really nice and helpful. The owner is such a nice man and very welcoming and friendly. Definitely recommend thank you guys for your great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMazV5UXJRRRAB",
            "text": "I’ve been to this restaurant a few years back but wanted to check it out again on a Friday night. We were welcomed by the owner who was very attentive and nice.\n\nOur waitress came to us very quickly and took our drink order. The menu has a lot of options so you may need to time to order but the food was worth every penny. I just ate the rest today.. large portion and let me tell you my drink ?!!! Was amazing baby!! I felt a little buz buz! Definitely worth the $20. I had a blue margarita and my company had a Long Island! I enjoyed it and I just want to add..\n\nCheck out a place for yourself! I’ve been here twice and I don’t have any complaints."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNklmeUdREAE",
            "text": "I have been going to JPsfor over 25 years. Same owner, he is very friendly, quality wild caught seafood, always fresh. A bit on the pricey side but very well worth it. The portions are huge. The platter for 2 can feed 4 easily."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM08zNllnEAE",
            "text": "If you know, then you know. If you want great food you have to be prepared to spend good money. Quality and respect comes with this price. Don't forget to ask about the \"King crab legs\" because it's not on the menu.....so you'll understand my review from top to bottom 😉👍🏽✌🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNW96MGhRRRAB",
            "text": "This is the only restaurant that I eat at in city Island. The food is delicious and fresh very flavorful in big portions. The garlic bread omg!! Every time I come here my family and I leave happy! They are crab legs are so filling!! The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa29HMTJnRRAB",
            "text": "Came for a graduation/ birthday dinner. Food is over priced. In the menu on top of each page in big blue letters it says add an additional 5 dollars to the  already overly priced food. Rice tasted like it was microwaved, crab stuffing was so salty i couldn’t eat it at all. Before I went in I looked at the reviews and one stuck out to me. Every thing Mr. Murphy said was correct to the T. Service was amazing. My server “Mo” was the best. No order was messed up and she was very friendly. Price around 50-70 dollars with that additional 5 added to each individual price. My lobster tail was very tough and chewy. Atmosphere was great. Garlic bread was good as well. Will not be returning ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNU1XVzdnRRAB",
            "text": "Ok... So u need to come here! No question, the service was pleasant and caring. The drinks where perfect. The waitress Melissa was amazing. Ok now on to the king crab legs, what else is there to say, the crab was some of the freshest I have…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrNk92cEV3EAE",
            "text": "Fresh delicious seafood! A little pricey, but worth it! The servers were friendly and helpful. The garden salad is very old school along with decor, however the water front view, especially during sundown is worth the extra money! They are not skimpy on the alcohol in the mixed drinks. I would most definitely be returning in the future"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOUxIQ1ZREAE",
            "text": "If you want real legit sea food. This is the first place to go. Most ppl have no idea what they are consuming. U want real sea food this is the only place to go on the island. I eat here at least 4 days a week. Don’t be fooled by any bad reviews or these so called restaurants on the island."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4d3NqTHhnRRAB",
            "text": "The place is not the most beautiful, but the food is delish. I had the shrimp stuffed with crab meat, and omg...soooo good. And that garlic bread.. that's some dangerously delicious stuff. I also had a Cosmo and it was pretty good. The servers were excellent as well."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NThlNmZBEAE",
            "text": "First time here. Amazing I love the food and the owner was so comforting during this hard time it was nice to see his waitress happy to work and serve customers…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMTRLdnBBRRAB",
            "text": "This was my second time visiting JP's. Food is amazing! Decor is very unique. It has a sort of retro vibe to it. Staff is always super friendly. My cousin got a free t-shirt from the owner. You can't go wrong with JP's. Next time you're by City Island, Please visit. You won't regret it. The drinks are great too. They'll sneak up on you.....👀👀👀👀👀"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNEstcmVBEAE",
            "text": "I have loved this place for over 15 years. The food never disappoints, and the views are breathtaking! John is the ultimate host/owner and I always have a great time when I come here."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeV96eU13EAE",
            "text": "Fantabulous !!! What amazing service by the.hostess and server. The food was fresh, tasty and delish . Omg must try stuffed flounder with shrimp and crabmeat, shrimp scampi, fried shrimp.  Good portions and huge shrimps."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMnEzV1l3EAE",
            "text": "This place was empty when we arrived, quickly seated and forgotten about. The menu is overwhelming when you see pricing I think it's a little over the top average plate is going to run you about $30 don't bring your kids unless you expect…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4dmZQd0d3EAE",
            "text": "The food was excellent with huge portions. The garlic bread is so scrumptious.  A little pricey but we were celebrating so it was worth it. The wait staff was excellent."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbmZQQUxBEAE",
            "text": "This place is a hidden gem. As soon as you come in John greeted us warmly and even put on a little show with the fishes. The food is amazing!!! Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM3ZLZFRnEAE",
            "text": "He ido varias veces, me encanta el ambiente, la musica, la cual me hace recordar mi niñez y pre-adulecensia. Cada ves Q voy, me siento al lado de la ventana para ver el mar, de ves en cuando ver peces brincar del agua. La comida requisima. Buen lugar para ir con familia y amistades."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhc29hdUtBEAE",
            "text": "The service was excellent omg i will be going back. We went to have dinner with our friend it was her birthday and we had a food time the music was good the foos omg it was amazing our waitress they were the best. Thank you for making us feel welcome"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaDRPemtBRRAB",
            "text": "Vibe is different. You have sea view seats. It’s worth the price. There garlic bread is delicious."
        }
    ],
    "reviews_count": 78
}