{
    "name": "Crab Du Jour Cajun Seafood & Bar",
    "place_id": "ChIJVQjAbaGNwokRrBkhRhB3goM",
    "grid": "BX10",
    "address": "810 Pelham Pkwy, Pelham, NY 10803, USA",
    "rating": 4.2,
    "user_ratings_total": 565,
    "phone_number": "(914) 488-6448",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTWVuQXRVbUpGUjBKQ2RrcExaVVJWVm5OSU4wRRAB",
            "text": "Jereysa was our server and i absolutely loved her vibe and she was so nice. I asked for a to go bowl for my soup and she got it all ready for me! She definitely deserves a raise. 😌"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTVpYUTNlVlowVTJ4eGNqUldabDl1ZERrd1NHYxAB",
            "text": "I m very happy at this restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2VGODBjWFJIVEVFMlNUZzNSVGN6Um1kVVVuYxAB",
            "text": "Music may not be appropriate for children"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Wk5XaEhXamx4U0hCVlFrZDJVV2cyYWxwcE5VRRAB",
            "text": "I really enjoyed the fried shrimp dish.\nThe drinks were so amazing!!!!\nThe music created a great atmosphere!\nI definitely plan on returning with family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaE1HNTVNbVV6VkhabkxVWTNSM0p4UW5wVFIwRRAB",
            "text": "I recently visited this Pelham location, and while the food was absolutely amazing, the service left much to be desired. The hostess was incredibly welcoming, and the atmosphere was warm and inviting. The food was delicious, and we were really looking forward to a relaxing meal.\nHowever, things took a very disappointing turn when we went to pay the bill. We paid in cash, and the change was around $40. We waited for what felt like forever about 30 minutes and never got our change or the receipt. We had to approach the manager, who then called on the phone the waitress multiple times to bring us our change. Eventually, it seemed that the waitress had almost pocketed the change as a tip without asking us! This was really unprofessional and made us uncomfortable.\nTo make matters worse, the staff’s attitude became rude and dismissive, especially since it was closing time. When we finally decided to leave without tipping due to the unpleasantness of the situation, the waitress made a remark, “But this is America,” which I found not only insensitive but also kind of racist. It felt like she was responding to us speaking another language, and it completely soured our experience.\nIt's a shame because the food was great, but I don’t think I’ll be returning given the poor service and unsettling comments."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMVUzUldZVTF6T1RkeE1YcHhRVXBrUjA0MFpVRRAB",
            "text": "Great place customer service is awesome music is always on point Always Have A great time when I'm there with Family"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbldHNUhXR1F3T0dJd1puSkVObFZQYVVWSk1HYxAB",
            "text": "I had such a great experience here! The seafood boil was packed with flavor — I tried the crab legs, shrimp, and mussels, and everything was super fresh and seasoned perfectly. The house Cajun sauce with a medium spice level was amazing, not too overpowering but full of flavor. Portions were generous, and you really get your money’s worth.\n\nThe staff was welcoming and attentive, always checking in without being overbearing. The vibe is casual and fun, perfect for coming with friends or family. I left full and happy, and I’ll definitely be coming back soon! OH LAWDDDD"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdGVFVnNhamREVmtvNWRUUjVjMFZDYVdGeFFrRRAB",
            "text": "My mom and I went yesterday and the server was very very rude. The music was so loud that we had to yell over the music so she said I had an attitude. That's when I asked for a manger because from the beginning she was mad that we came in cause there was like four other tables there for the other waitress. The manger named Ivy took our order and was very pleasant but ignored how she started an argument with me and wanted to continue it she said her name was Deb but that could be a lie cause she never introduced herself The food was good but the way they run their business is not it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eE9YVkVUMGQwVm1WSWRrNTBjRVJJZEdsR1pXYxAB",
            "text": "Man listen, DONT waste your time at Crab Du Jour in Pelham. The boss Steve got the nastiest attitude I ever seen. Dude was straight up rude for no reason, talking slick like he doing me a favor. Food wasn’t even hittin’ like that, and on top of it you gotta deal with his disrespect? Nah.\n\nThere’s plenty of spots in the Bronx where they know how to treat people right. This ain’t it. Steve need to humble himself before he run the whole business into the ground."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeWFtNXNPRzVMY1hveGNXSkxlSGxpZUd0VmQzYxAB",
            "text": "I would give 0 stars. I ordered seafood taco trio for take out and they gave me 1 crumbling crab taco and 2 with only lettuce and tomato."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscmJsOUdSWFJTVFROSWFHbDBTRWt6WkVsc1ozYxAB",
            "text": "Exelente comida"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQmRFcHhkbmd6TUc5dllUZHpjREJNT1dOaFgyYxAB",
            "text": "Suprise gratiuity at bar at the servers discretion regardless to service quality."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNFFrRkRlVU15YUhBek1uQXhZekZ2WTFaeU1XYxAB",
            "text": "The food was good drinks was a lil weak."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd2JEWndkVFl5WmxwNE5sVktaazlZVTBaM05GRRAB",
            "text": "The seafood and the chicken wings are amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneE1tcGhUREF0VWtkWVNrSllaamg2T0U5SFNsRRAB",
            "text": "First off my waitress was unprofessional. I ordered food and it took forever to come. I went to the bathroom and she was sitting down at a table eating crab legs with a man. She took forever to bring my drink. Very unprofessional"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLVFk2dU94dXN6ZklBEAE",
            "text": "Service was great food was ok and it was hot. No ac in the restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKbmdzSU9fMHNxb3JBRRAB",
            "text": "Had the frued shrimp platter before and it was delicious, this time it's was cold the shrimp and tostones was greasy, the breading on the shrimp was falling off,my seafood boil cane out cold i was very disappointed, the fried crab claws was horrible"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMSFN3LTY3MWVQa1pREAE",
            "text": "The absolute worst service of my life. I too am a server in a restaurant and was BAFFLED and disgusted by the service I received. The waitress was rude and unpleasant from the second we sat down in her section. It took 25+ minutes before we were able to put in drink or food orders, and an additional 20 minutes to even receive water and soda. We even had to remind her about our drinks, to which we were again greeted with a disgusting attitude. When it came time for the bill, she legitimately stood in front of us and waited for us to put the cash down. We were so uncomfortable from the moment we stepped foot in this restaurant until the very end. Even so, we tipped 20% and will not be returning.   I’d recommend going elsewhere."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aktiZE9nEAE",
            "text": "Good place to hang out and have some sea food..\"TEN\" is one of the servers there she is always on point with good service and amazing drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOamc3UExtenZlRnB3RRAB",
            "text": "This is a neighborhood restaurant I visit at least once every other month. I loved this place and i like rewarding myself with a boil . But I keep noticing these old potatoes everytime I go there since the ending of 2024. I complaint the last time about the potatoes but keep getting the same results with takeout . This Mother’s Day I ordered 2 bags of seafood boil that was so small in size that amounted to $86 , online there is a promotion (spend $66, get fried wings ) I added it and made my purchase just to be told they would not honor what was advertised online because it was Mother’s Day . That was sad and a horrible excuse to not honor what was advertised on the website. Sad to say but I won’t be returning ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWGpzUHpRaVpiekt3EAE",
            "text": "Delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd1phZ3F3RRAB",
            "text": "Horrible one of the employees started cursing at me because I asked for multiple stuff and then when I saw her outside he tried chasing me 😢"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ1lfTzdBRRAB",
            "text": "Get your boil!!! Have a good time! And chill!!! They do the damn thing every time!!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZakphakd3EAE",
            "text": "I don't review places often but, unfortunately,  the service was so bad that I HAD to make note of it. I didn't get my tartar sauce until I was done eating, we didn't get the crab leg - cracking tool until we were almost done struggling to dig the meat out, and my beer , which I specifically asked for to be in a glass from the tap, came in the bottle.  Honestly, I only saw two young ladies waiting on the tables; they were VERY nice and they seemed busy, so they were NOT the problem. Seems to be a simple under-staffing problem. Took a long time and multiple requests in order to get the check, too. The food was good, but  I won't be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmFXdE1REAE",
            "text": "I have been to Crab du Jour several times, the food, drinks and music are great. I like to thank our server Tazia for exceptional service. She was attentive and kind. She made the experience totally enjoyable"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNy1MZEVBEAE",
            "text": "I’ve been to this place a few times — the food is always excellent. But your server Jayse completely ruined my experience.\n\nShe was rude from the start — didn’t ask a single question while taking the order, slammed the glasses and menus on the table like she was angry to be there. When the food came, she literally threw the plates on the table and walked off without a word.\n\nThis kind of behavior is unacceptable in any restaurant, especially one with such great food. I had to leave with my boyfriend because I completely lost my appetite. My evening was ruined.\n\nJayse is a serious problem for your restaurant’s image. You need to rethink who you allow to represent your business — because one bad employee is enough to drive people away for good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNy16dEtnEAE",
            "text": "I’ve been to this place a couple of times and always enjoyed the food — it’s genuinely delicious. But my recent experience was completely ruined by a server named Jayse.\n\nShe clearly doesn’t know how to take an order properly. She placed glasses and menus on the table aggressively, without saying a word or showing basic courtesy. When our food arrived, it was practically thrown onto the table, and she just walked away without a word.\n\nThe service was so off-putting that I lost my appetite and ended up leaving with my girlfriend. What was supposed to be a nice evening turned into a disappointment.\n\nI hope management seriously considers the kind of staff they hire. Jayse is damaging the image of your restaurant, which otherwise has great potential thanks to the food."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwak1lV3dBRRAB",
            "text": "Delicious Food. Fantastic service ( Ashley) was great!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeUllYlZnEAE",
            "text": "My seafood broiled was good. Our server was respectful,"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb01XV193RRAB",
            "text": "My go to seafood place. Fresh everything and everything is good. Been coming here for 2 years +"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MU12OGt3RRAB",
            "text": "I had lunch with my husband and daughter at this restaurant. The food and drinks were delicious. The ambiance was warm and welcoming, and our server Shayla was very kind. I love the crab fries. It was a hit with everyone. I highly recommend this little spot. Also, they have a kids' menu and a TV available to watch sports."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cFl1MlhnEAE",
            "text": "Excellent place for some seafood! Love to come here during special ocassions. Their bisque is delicious and always have to get it. The boils themselves can be a bit salty at times but I think thats just the way it is. Always delicious and enjoy coming here whenever I get the chance!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHBMSlVBEAE",
            "text": "This was my first time eating there and the food was very good. It was crowded, but we were seated fairly quickly."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbktqbHBRRRAB",
            "text": "Bad experience not family  friendly the play all kind of music that's not fit for kids plus they demand  tips n add to my bill tips is a option  not choice  I always  tips but they add $30 to my bill I would not go bk"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN05iazB3RRAB",
            "text": "I’m literally sitting at the table as I write this. Over packed. Staff unprofessional. If you’re easily overstimulated or get annoyed fast don’t even waste your time here. Customer yelling at workers. The music is cool. When they pass you the menu they pass a specials menu that says happy hour but don’t specify that it’s only the drinks. The food is at any point. It gives seafood based night life."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbjZ6SVVBEAE",
            "text": "Food here is always fresh and tasty."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMjdEWS1nRRAB",
            "text": "Shantell my serve was enteraining and provided great customer service.  Shr gave great recommendations and made the overall experience.  The food was also great and the drinks are hitting"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNU5uQUFREAE",
            "text": "Love it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcHJDWm5nRRAB",
            "text": "Frequented often for dine in or take out in the last year. Never had any major issues but I’ve realized a drop in efficiency and care lately. Dining in today with friends and asking for an order to go to be put in just to be forgotten wasn’t the end of the world,however asking again and waiting 20 mins for it just to be a completely different order was enough.\nHopefully they get it together soon it’ll be some time before I visit again."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNWNXMjVBRRAB",
            "text": "Amazing Food. Clean Restaurant. Decor is cool. Spacious booths. Comfortable bar with the sports entertainment. Music is entertaining. Great prices. Portions are generous. Friendly staff. Clean bathrooms. I love their happy hour. This is the type of restaurant you always want to be at. I feel like I can have a nice date with my wife here and always have a great time. The mood is right the food is right and the price is right."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aTVhWmdnRRAB",
            "text": "BARTENDERS ARE DISGUSTING !!! ATTITUDES DISGUSTING AND IF YOU NOT A MAN THEM BAR HOES DONT PAY YOU NO MIND"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2d2R6bThnRRAB",
            "text": "First time going on a Friday night, and I must say: IT WAS LIT!!! I've never seen this location so popping. Our server was awesome and we had tasty food and an amazing time overall."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeEtDUnFnRRAB",
            "text": "They need more staff."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcU5XQkVBEAE",
            "text": "I love this place. Great service and food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMWRxOEl3EAE",
            "text": "This place is awesome...you can't go wrong with anything you order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdGRESnB3RRAB",
            "text": "Extremely ill mannered employee who was RUDE because I asked her to switch a glass and proceeded to cuss and drop comments as though she was working for herself. I will NEVER be back. Disgusting behaviour from somewhere that was recommended. And when she switched the glass. She made the salt super messy. And imagine I'm on vacation from Barbados. I'm still here and cannot drink this drink fast enough and be gone. My money can never pay her!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbnVYVnl3RRAB",
            "text": "Honestly the waitress was horrible,  she forgot to bring me my drink even after she gave us food, I had to call her several times, she then had an attitude switch herself with another waitress without telling us.  I honestly wouldn't go back..also don't think serving hot food in plastic can be healthy for you.  How is this legal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdW9DTENBEAE",
            "text": "Great spot to eat and listen to music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa3VLdlB3EAE",
            "text": "Meh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNUtqaXh3RRAB",
            "text": "My first time visiting tonight. I was pleasantly surprised by the Sea themed decor. The music was loud and fun (I think they SHOULD avoid playing music containing Explicit lyrics). Several times many of the patrons, including myself, sang out loud when it was a well-known song with a good vibe. Overall, it was an evening well spent with friends and I think it is a great evening spot especially on the weekends. The food was absolutely delicious. Sadly, I completely forgot to take photos before we dove in. My bad… Next visit for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMEpIRkNnEAE",
            "text": "I was surprised. The decor, customer service was fantastic. But my food wasn’t too memorable.\n\nThe food came out quickly, tasted fresh and was hot (made to order). The only thing was that my meal was super-salty. My mild, old bag dry-rub Lobster Tail, Shrimp & Clams was drenched in dry-rub. The corn & red potatoes provided a great balance otherwise this extra seasoning made it salty.\n\nDefinitely a good place to visit with family on a Sunday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb3RTOUJnEAE",
            "text": "It was okay fried food. Was not a fan of the wings or burnt stiff garlic bread but the shrimp was pretty good. The virgin Pina Colada was the best part of the meal although it had a straw that was hard to get the drink out of. Our server was really nice and came to our table to check up on us often. The music also randomly went from really loud to just loud on and off."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeFBlQ1JnEAE",
            "text": "I dined in here a few months ago on a Saturday evening for my birthday. I ordered a seafood boil with crab legs and it was soo good! I ordered 2 clusters and I couldn't even finish it. It came with the crab, corn and plenty potatoes. I also ordered a frozen drink and it was delicious! It was pretty strong too,  it's a pity I don't recall the name of it! My friends ordered boils as well and they enjoyed their food. We also had barbecue wings, which was absolutely delicious! I am not sure if they do anything special for birthdays, but they definitely should! I plan to go back anyday now. Once I do, I'll update the review!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dU1QeXlnRRAB",
            "text": "I have been to 2 other locationsz and wasn't a huge fan. I came with a friend, I had mixed reactions. There is plenty of parking in the lot. The staff is friendly, but my waitress was not attentive at all. She was actually one of the worse ever, and I go out alot. I had to ask for water twice, our drinks took forever to come, after I finished my appetizer. She came over once to see how we were doing, and that was close to us getting the check. It wasn't even that crowded. The Crab Ragoon was nasty. They should take it off the menu. It's suppose to be filled with crabmeat. Inside, all I tasted was a cream cheese like filling. I had Crab Ragoon before, and was disappointed. The sweet potatoe fries aren't that good neither. Now what was good was their fried fish, and shrimp. It was seasoned well, and crispy. The bartenders make good strong drinks. On Thursday-Saturday, they have a DJ. She was very good, actually the highlight of the night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtc3BDTVV3EAE",
            "text": "This is the second time I've been here and I will continue coming here for the foreseeable future.\n\nOn this visit I was having a lunch date with my grandmother. We both love seafood.\n\nWe were seated right away and got the same waitress I had previously Jennifer.\nShe was phenomenal both times. Knowledgeable and friendly and constantly checked up on us.\n\nOn this visit I started out with the 12 Piece Honey BBQ Wings and the Cheese Steak Egg Rolls. I've had the wings before and the do not disappoint. They aren't those baby wings either, they nice and big and crunchy and l not to much sauce on them, just the right amount.\nThis was my first time having a Cheese Steak Egg Roll and it was very tasty. Good amount of meat and cheese (just needed a bit more peppers and onions).\nMy grandmother and I both went with the Du Jour Burger. Reading the description of the burger is very different them seeing the burger lol.\nThe burgers came out and they were huge. When I saw the burger I was wowed. The burger sat on red onions, lettuce, tomatoes, on top of the was the cheeseburger, 3 large shrimp and the du jour sauce.\nThus burger was simply phenomenal.\nWhat's more is the place is very affordable.\nOn my pervious visit (as you'll see in the pictures after the menu) I had the Crab Meat Fries. I don't know what I was expecting but it wasn't this lol. The fries was loaded with fresh crab meat and du jour sauce. Every fry I picked up had crab meat on it.\nAlso had the Fried Chicken Sliders w/ Sweet Potato Fries. The sliders were a mouth full and the chicken was so crispy and well seasoned (no extra salt needed)\nMy mom had the Fried Shrimp Po'Boy. Now that roll was beautiful to look at 6-7 larger Fried shrimp on a bed a lettuce and topped with the du jour sauce.\n\nAs of now I love this restaurant the food and the amazing service from Jennifer will keep me coming back for more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLXEyNGpBRRAB",
            "text": "This place is a real hidden gem! The food and drinks were amazing! We ordered rum punch and they were strong and delicious! Everything we ordered was cooked to perfection! We couldn’t stop eating! I def recommend checking them out! This is our new spot!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOEwyaFBBEAE",
            "text": "Great experience with the seafood boil. We ordered the du jour catch special, and it was really filling... more than enough for 2 people. The spice used for the boil was really tasty! Service was professional and quick!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeHRTbG13RRAB",
            "text": "Food and Drinks were good, Music was good, the only thing we didn’t like was that my friends crab legs came out cold and she decided to cancel her order after waiting for an hour and 40 minutes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcnNEZnB3RRAB",
            "text": "I've been here twice. First time after 6pm, there was a lot of people. Second time around 3pm and not much people. Everyone was enjoying their food. Both times the food was fresh and hot.  Flavors were great and not too salty. Get ready to get down and dirty with seafood buckets. Appetizers are great!!! Hush puppies and onion rings are great!!! The buckets and regular entrees are good and fresh as well.\n\nThe decor is very themey of a seafood place.\n\nOne thing I noticed is that everyone was returning their mixed drinks. The first time, I ordered a Long Island 2x and they did not taste like a long island or even tasted like the same drink. A professional bartender should be tending the bar. On the safe side, get a beer and make sure its cold. We were offered HOT beer! Obviously we returned it. The second time I went on the safe side and got a Pepsi.\n\nThe servers are friendly, the hostess always seems like a deer in headlights when you walk in, and the bartender, there are none- whoever is working that day is the bartender."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbXVQMlBBEAE",
            "text": "Was not worth my money at all. They gave me corn and potatoes to weigh down my bag when I only ordered king crab. Then had the nerve to give me ONE medium sized crab leg. Their garlic noodles are a joke, no soy sauce nothing like the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHZ2VTZEx3EAE",
            "text": "Thank you for the awesome service at Crab Du Jour Cajun Seafood located in Pelham. Excellent seafood boil!\n\nThe staff, service, and food is great. The atmosphere is very clean, safe, and laidback atmosphere.\n\nIf your in Pelham, highly recommend you give this place a try. You will not be disappointed with the food, drinks, and atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteHFidTh3RRAB",
            "text": "I come here every day at noon to have a drink and order some seafood, the waiter is very nice, the taste of the food is perfect for me, I come here at noon break to have a drink, in the evening I will bring friends, family, this is my…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaWRldk9REAE",
            "text": "I always go to city island to get the best seafood until on 12/30th I remember going to 5 Below weeks ago and saw this New seafood Restaurant. We went and let me tell you this... This will be our new spot!!! The food is finger licking good!!! You won't be disappointed!! And the customer service is great!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcjhTVW1BRRAB",
            "text": "My first time here.\nIt was pretty chill.\nThe prices were decent and the quantity was big.\nWe ordered the $50 seafood special and it was delicious.\nA tad bit salty but still delicious.\nI’d go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeUltU2pBRRAB",
            "text": "Never been in seafood restaurant with this concept where you get a pound of your choice between seafood, vegetables and sauce all inside of a plastic bag, Ii tasted it and was delicious not complain at all; honestly 100% recommended it. venue is cool, service is really good, drinks are STRONG ENOUGH to get you happy…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMlkybGFREAE",
            "text": "Music was so loud. Kids running around and falling and bleeding 🩸 that’s scary. Drinks strong. Food salty no flavor and I got the hottest and it wasn’t even mild. I would not return if the bill is over $150 they add gratuity which is weird. We tip always. Would not recommend"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd3J1Vlp3EAE",
            "text": "Beautiful atmosphere food was delicious 😋 Raven Ashley Tasia and Jenny was super friendly 👌 drinks was 🔥🔥🔥 had the shrimp po boy and wings lemon pepper wings no breading 🔥 po boy sauce slamming definitely will be back great girls night out 🤩😍"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbkozOVdBEAE",
            "text": "Crab Du Jour Cajun Seafood & Bar offers a delightful seafood experience with a Cajun twist. I visited recently and was thoroughly impressed by the vibrant atmosphere and the quality of the food. The menu is packed with a variety of seafood options, from crab legs and shrimp to crawfish, all prepared in flavorful Cajun sauces.\n\nI ordered the shrimp boil with the \"Du Jour Special\" sauce, and it was fantastic. The shrimp were fresh, perfectly cooked, and the sauce had just the right amount of spice to give it a kick without overwhelming the natural flavors of the seafood. The portion sizes were generous, making it a great value for the price.\n\nThe service was attentive and friendly, though the restaurant can get quite busy during peak hours, which might lead to a bit of a wait. The lively ambiance adds to the experience, making it a fun place to enjoy a meal with friends or family.\n\nThe only reason I’m not giving a full five stars is that the noise level can get quite high when the restaurant is packed, which might not be ideal if you’re looking for a quiet dining experience. Additionally, while the prices are fair, they can add up quickly if you’re indulging in the full seafood experience.\n\nOverall, Crab Du Jour is a great spot for anyone who loves seafood with bold flavors. I’ll definitely be back to try more of their dishes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZ3NQUDN3RRAB",
            "text": "my first time there. Walking in. the first thing I noticed was how clean it smelled ( though, slightly bleachy) and how very clean and nice it looked.\nour food arrived promptly, and the drinks were well made and strong 😉\nThe Staff were very polite and earned a nice tip.\nI will definitely be returning. p"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNFBXd1dnEAE",
            "text": "I order from here all the time and get different items every time, have not been dissapointed. In fact, impressed, the crab, the shrimp and omg there must be magic in the batter because the po'boy is amazing. 12/12!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbC1MbzFnRRAB",
            "text": "I thoroughly enjoyed my food here at this restaurant. Lovely atmosphere, great music and hey they have Belle too🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdWFmd1BnEAE",
            "text": "We had a birthday for my friends husband in august. A few months later we found out he had cancer.he frought well for two months and we lost him in November.  So his wife tejula Sergent johnson.decided to have his memorial thr. We had such a wonderful time. Your team did so well.thank you dearly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMnZxMjd3RRAB",
            "text": "10/10 restaurant!!! You won’t be disappointed. The food was great, the music was great and the drinks were even better! I happened to leave my car keys behind and the busboy unknowingly threw them out! The manager, Steve went above and beyond to help me relocate them! I mean, this man got inside of a dumpster to help me! A true lifesaver and the real definition of customer service! THANK YOU STEVE!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNU1DOUh3EAE",
            "text": "My fav spot in Pelham Manor, the staff is amazing, good delicious and overall a wonderful spot to eat and chill. They have a bar where you can watch sports and it's family friendly vibe. Their drinks are incomparable no one in the area makes better drinks and I've tried some places. This is always my good to want to eat and chill out for the night spot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2N3JQQmt3RRAB",
            "text": "This was my first time coming here and let me tell you the whole staff are very friendly and kind and the food is the bomb.com I love the hospitality and atmosphere here everyone check them out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeGJ6MUF3EAE",
            "text": "Loved it!!! I always enjoy the food!! The waitress took forever to bring our refills and the receipt. We figured if we started getting up, she'd come over. She never did. So we headed towards the door to find a Mgr or someone to help us, and that's when we noticed that we could pay at the cashier by the door. It would have been nice if that was said. We could have left already. The place is a little noisey with the radio playing, the tv's on, and people talking."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdDV5QmdBRRAB",
            "text": "I go here every day at noon for a drink and some seafood. The waiter is really nice, and I love the taste of the food. It's my go-to spot for lunch breaks. In the evening, I bring my friends and family because this is my favorite seafood…"
        }
    ],
    "reviews_count": 77
}