{
    "name": "Clipper Coffee",
    "place_id": "ChIJKxuOUaSNwokR5tnXxQnrJ74",
    "grid": "BX10",
    "address": "274 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.9,
    "user_ratings_total": 185,
    "phone_number": "(718) 744-0057",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdFJYTk5Na0oxVFdOblFXVjJVak4wUVY5UE9GRRAB",
            "text": "💯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRGNHSnJXREpyY0dKTVdHRlVVRVYzVkRrMmVsRRAB",
            "text": "Awesome spot, the staff are great. Good coffee and food and even cheap beers in case people in your party are on different parts of their days"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT2FYUnZiVk01U1VOaWNURnFlbHBTTmxaV1JVRRAB",
            "text": "A cute coffee shop. Great place to stop by for coffee with friends. Nice pastries. Just need more seating ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUmRsWllORlYxYjA1eFdqTmlhSFJrV2xCR04yYxAB",
            "text": "Stellar local venue off the beaten path. Highly recommend. Fun games, great food, nice people! Classic espresso, perfection! Stellar steak tacos. Super chill vibe."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZlNFVktaekpyWWtkc2JUQnZZMjF6VVZsMFJHYxAB",
            "text": "Nice local coffee shop in City Island. Have rose bottles and beer, too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WYWExbE9PV0pSVDI5SmJGODFRMVEzVVMxR1MxRRAB",
            "text": "Awesome cafe! We visited on a Sunday afternoon and it was the perfect venue to relax and unwind. We ordered the Iced Cafe Americano, the Hot Chai Latte as well as chocolate chip cookie and all were exceptionally fresh and delicious. The staff at Clipper Coffee are especially kind, patient and welcoming. Bathroom is spotless clean and their are ample tables and chairs to sit and enjoy your favorite beverage and treat they prepare with care for you. Super highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc09FcGxjaTAxZUhOd1l6TjNUVWszY21vNVFXYxAB",
            "text": "Best Americano I've had in a long time"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdVMxQjBZbGhpYTFSUE9YWjZWM0EyTTFVMVZrRRAB",
            "text": "Cherry cold foam chai was fantastic"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM20zLUwyby1MOUNREAE",
            "text": "Trendy, bustling coffee shop. Great for a fun time- delicious strong coffee roasted in house! Chill place to get work done- delicious pastries and fresh squeezed orange juice too. They’re always cooking up something new- game nights, little libraries, art gallery events- this place is for everyone- young and old. The atmosphere is vibrant, artsy and just scruffy enough to have that real Bronx grit. 5/5 so thankful for some REAL COFFEE…. Oh and did I mention they also have a beer and wine license and back yard patio now?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOWVxNldnEAE",
            "text": "Been going here for years. I drive to Clipper’s from Pelham Bay, then go to the park a few blocks away with my kids. Coffee is excellent. Very warm and welcoming atmosphere and great food! Love the avocado toast and the bagels are great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdVlYZWxnRRAB",
            "text": "Best coffee shop in the bronx. Thats all. Pete and Jerry are top notch"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbDRQNjVBRRAB",
            "text": "Best coffee shop in the bronx\nGreat matcha and chess to play"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM29Yejd3RRAB",
            "text": "Fell in love! Great atmosphere, amazing customer service, delicious coffee 😻😻😻"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MHNuMW1RRRAB",
            "text": "Great Coffee .. great Staff"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyXzh2cTZBRRAB",
            "text": "Great Neighborhood Coffee shop, with plenty of treats, drinks and good music."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcmJfRE9BEAE",
            "text": "Great ambiance and friendly people\ngreat food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMk56bGtRRRAB",
            "text": "always have positive experiences, Great and personable customer  service with good coffee to back it up. one of the best local spots."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ3JTUWdBRRAB",
            "text": "Un petit café absolument adorable 🥰 tenu par un passionné qui vous parlera avec amour de son café, de ses boissons et des meilleures adresses de l’île à visiter ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeV9PcURREAE",
            "text": "A very lovely cafe with lovely owners. Coffee is delicious and breakfast toasts are yummy. Chocolate muffin is so good. Nice rustic marine/beach decor( it needs a bit tidying up, and it will be fantastic.)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2ck9IOURREAE",
            "text": "Best Coffee Shop in the Bronx!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX0pqTjNBRRAB",
            "text": "Local, chill vibes…my Americano was great! The pastries we tried were amazing…the cheddar scallion scone was so buttery and rich and soft, I had it warm with butter and it was my favorite part of my breakfast…also tried the chilli cheese danish which had a flaky croissant like texture, a hint of spice and it was really delicious served warm. Service was great. Great value, it was $15 for breakfast for two (2 espresso beverages & 2 pastries which we split) which is almost unheard of nowadays!! Also loved that the restaurant has a free library where you can bring a book/take a book, what a great idea!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MTZLVl9nRRAB",
            "text": "Amazing coffee! Very relaxed and laid back atmosphere while you sip your coffee. Service and attention are great. I highly recommend this place. It's a gem in City Island"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydjVTRXdBRRAB",
            "text": "Tasty coffee"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqM2Z2YkVREAE",
            "text": "Relaxing coffee place. We got there in time for fresh blueberry muffins that were amazing!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN2RpSHVnRRAB",
            "text": "City Island is like a small town and this is the small town coffee shop. Great coffee, reasonable prices, a variety of snacks and simple choices,  and a nice relaxing atmosphere! Try it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOE5LczFnRRAB",
            "text": "Clippers coffee is a delight! A true gem of the Bronx and of City Island. All the staff there are super friendly, and their menu items are wonderful! If you go try their jumbo chocolate chip cookie, there are very few cookies that can beat it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dExyQkR3EAE",
            "text": "Discovered this place while coming back from a heavy fish fry meal and needed a caffine kick for the drive. Nautical themed place. Coffee is really really good. I always get the choco chip cookies for the kids and they love it too.\nSometimes we make a detour here just for the coffee.\n\nThe only negative i can think of is sometimes the lid pops open."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0M3Rpd2ZnEAE",
            "text": "Nice microfoam and friendly service 🙂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGejlpNDBnRRAB",
            "text": "V high quality coffee and espresso with other small bites and lots of comfy seating"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdG9lY1RBEAE",
            "text": "The coffee at Clipper Coffee is very, very good. The coffee shop is located in City Island on the main drag. Clipper Coffee provides people with a cozy environment to relax and have coffee or tea.\n\nWhat is good is the coffee. I had an Americano, which had a smooth and pleasant flavor. They have a small used book area with books that looked like they were worth reading. I also saw a chess set and a few other board games.\n\nWhat is not so good is that the place looks like it is not cleaned very often, certainly not at a regular interval as it should be on a daily basis. Surfaces needed to be wiped down. The floor needed sweeping. I saw cinnamon spilled in the front condiment area. There were a lot of crumbs in the display case where the bread was showcased. There is a sofa that is so worn-out-looking that it needs to be replaced.\n\nDespite that, it is a great place to enjoy coffee. I plan to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaajRDR3N3RRAB",
            "text": "Excellent coffee but place had a few flies and it could be cleaner"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaLWYzMkdREAE",
            "text": "Great coffee and the absolute nicest people!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXck5yam9RRRAB",
            "text": "Good coffee in a cozy spot. The coffee is always well brewed, good selection on the menu, and such a peaceful atmosphere in the Bronx. Love to see and support small business like this! Keep up the good work"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPX2M3MWxnRRAB",
            "text": "If only I could copy and paste Clipper Coffee all over the Northeast Bronx! I loved it here and can’t wait to go back.\n\nThere’s a very friendly young man in there who I think is the owner. He greets you with a smile. The lovely young lady behind the counter knew some of the patrons by name and warmly took their order. The music is dope. Once I heard The BeeGees I knew I was in the right place lol. There’s a small reading nook towards the back of the shop, and out front are some board games. They probably do a game night which, if so, is pretty fun.\n\nI had an iced latte w/almond milk and it was robust and refreshing for a hot summer’s day. I didn’t have any of their food items but I saw a couple walk out with some sandwiches that looked delicious!\n\nThere’s some outdoor seating, though not ample, which is quite fine.  I think it’s just right for the size of the shop.\n\nWho do I have to talk to to get more Clipper Coffees in the BX?! Lol. This place made my day, and I truly wish we could have more non-corporate (no hate DD and Starbucks- I still love y’all) coffee shops like this that stimulate culture in their local communities. Whoever owns this place, you have my support and gratitude!\n\nIf you’re on City Island, pay these folks a visit. Many families did the day I was there. It’s a charming BX spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbjRuOEZREAE",
            "text": "I tried the salted caramel ice coffee and it was nothing short of amazing. The service is great and I can’t wait to go back. Definitely a gem!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeDdEaGpBRRAB",
            "text": "Really cute place to get some nice food, the bagel I had was great. Staff is really friendly and welcoming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazVXTlhREAE",
            "text": "A great place to take a break"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNC1tWlJREAE",
            "text": "Service was awesome! Food was fresh, hot and tasty! Walked 18.7 miles from Astoria to City Island hoping to eat some good seafood but those places either only take cash or closed on Easter Sunday!  It says Best Coffee in New York and true enough! Coffee was fresh and has flavor!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob3VYdFJnEAE",
            "text": "Grab you some tasty drip, espresso, tea or matcha to stay or go! Add some food, good atmosphere and you're ready to rock."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodUtQdzlnRRAB",
            "text": "Me and my girlfriends love this place. The atmosphere is casual and peaceful jazz is playing in the background. The old timers are friendly and the breakfast food and coffees are delicious! Head to Clipper coffee for a relaxing time and delicious food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrNDVxU2FnEAE",
            "text": "A small gem of the Bronx that gives you a calm while sipping on your coffee. My friend and I ended spending a few hours here enjoying each other’s company as we went from topic to topic and even spoke with locals from other boroughs. It is…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cUotWnd3RRAB",
            "text": "Fantastic coffee. Great service. Cash and credit accepted. Street parking only. Definitely a great neighborhood spot.\n\nFANTASTIC COFFEE!!!! Great service, everyone is friendly, and wonderful neighborhood spot for breakfast, lunch or a quick drink. The turmeric latte was very delicious. Consistently quality, highly recommended for anyone in the area to stop by and check it out for themselves.  12/2021"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb3IydG13RRAB",
            "text": "Nice place to sit and enjoy the atmosphere of the island. Friendly staff. Can take fresh baked beans."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzaUttR3BRRRAB",
            "text": "Great place to relax and socialize. The tea is pure and additive-free. They also have all natural vegan snacks! My favorite cafe."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1LWRIeWJ3EAE",
            "text": "Great atmosphere, friendly environment\nThe coffee was really good I ordered a Cortado. Delicious sandwiches. It's worth the money for the service and quality food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbDZpdDhBRRAB",
            "text": "Today, I had an amazing experience at this Café. Aside from the amazing coffee, tea and pastries, the team was super accommodating and refreshingly community oriented. It was amazing to watch them address customers by first name and engage…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyenZDdXVRRRAB",
            "text": "Charming little coffee shop. Attentive and friendly staff. Large selection of breakfast items and fresh coffee for those who love coffee. Ice tea is really good too.\n\nCozy seats and friendly faces. The establishment is definitely a pillar on City Island."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eHVPTnpBRRAB",
            "text": "First though its closed from how the street front looks like, was persistent and happy I was.\nOne of the only places that has Oat meal with lots of toppings"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbUo3Uk93EAE",
            "text": "Amazing!  Great food and incredible coffee at perfect prices.  We drove through traffic just for their incredible avocado toast and were sad to find out the grills get shut off 30 minutes before closing.   Be sure to get here as early as you can in the day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMGJEUU13EAE",
            "text": "Always worth a visit! Owner and staff are super nice and all of their products are excellent.  I prefer the scones with their own roast espresso! They even got a small library/reading room in the back. Feels a bit like vacay!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3bnRDTi1BRRAB",
            "text": "This place is a true gem! Walked in to get out of the cold and found a charming and intriguing coffee shop. The store owner was an excellent and welcoming host and the used book store in the back makes you want to set up shop and stay the day reading and drinking delicious coffee."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdmFpeHhnRRAB",
            "text": "This place is a gem. The coffee is amazing and the staff is just as great. They also double as a used book store. Friendly atmosphere and customer service is always impeccable. Definitely one of my go-to places."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwNGUyVlpREAE",
            "text": "I love the Clipper! Such a wonderful place, so happy to have this café in the neighborhood. Great coffee and pastries, perfect spot to meet local friends and make new ones! Peter is the best."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOElhQXpBRRAB",
            "text": "Nice mellow vibe; great coffee & tea....good food/toasts—small selection but all good quality & fresh. Attractive interior, good soundtrack and nice staff & owners. Very pleasant place to sit and linger over a latte."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5a2VhM2ZBEAE",
            "text": "This place has ome of the best costumer service on the island. The coffee is always great and the food is amazing too!\nThey also pay attention to all of the current CDC guidelines without making it feel like a burden."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpOFotX1NREAE",
            "text": "Nicest shop! And the pecan Carmel cinnamon roll was the the most delicious roll I’ve had in my life! Ps to the guy at the counter hope you get your darn tough socks !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVbm9fSWdRRRAB",
            "text": "Cute shop. Lots of books in their library to flip through while enjoying your espresso. Clipper also is very neighborhood oriented. You'll find local hot sauce for sale along with adds for local services and events."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeFB6ZHdRRRAB",
            "text": "I don't like coffee, but went with a friend and decided to order an espresso for a caffeine boost. I can honestly say this is the first time I've ever enjoyed the flavor of coffee. Will definitely go back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0N3IySC1RRRAB",
            "text": "This is my absolute favorite coffee shop! I get my Vanilla Latte & Croissant every day that I can and they’re always amazing! A perfect addition to City Island."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjaWR2ZjZnRRAB",
            "text": "Great local coffee shop with a deep menu of coffee and food, comfortable seating, work from local artists on display, friendly service and reasonable prices. Highly recommended if you're visiting City Island."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMDZucHFRRRAB",
            "text": "Friendly neighborhood spot. Lots of interesting details, books to browse, games and a few toys for the kids. Didn’t try the coffee, but tea and treats were delicious. Will definitely return!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5LTVHcURnEAE",
            "text": "One of the friendliest places to hang out in City Island. Love it there when I visit. Great avocado toast from Ken in the past."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cTR5NGxnRRAB",
            "text": "Great pastries, breakfast sandwiches and spectacular coffee. Great local joint. Friendly staff and very reasonable. Go!"
        }
    ],
    "reviews_count": 63
}