{
    "name": "Ohana Japanese Hibachi Seafood & Steakhouse",
    "place_id": "ChIJ54uOdXyMwokR948-416QT80",
    "grid": "BX10",
    "address": "500 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.2,
    "user_ratings_total": 1547,
    "phone_number": "(718) 885-0700",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbnV2b1RBEAE",
            "text": "Best spot in all of City Island. It very sad to see they're close for now. The staff is very friendly. Drinks are good. Appetizer menu doesn't may even surprise you. This is the go to on the regular, birthdays, and special occasions. One of the most hidden treasures of City Island and The Bronx. 🥲"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeU4wc3dRbmwyWm1jdGExWndjRzVNUWpOWlNuYxAB",
            "text": "Byob place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV1UxcHFNbUkzWWpJMk4xTjBYelJyVEdOdWJuYxAB",
            "text": "Restaurant is closed for renovations"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU09HYzBMWGRCTW1NMmMxbENhMUphUTFOUk1uYxAB",
            "text": "If you guys are closed then you should post that"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWVpHcHFNVVU0VG5oV2NXcFJNbWx1YkVSc1VtYxAB",
            "text": "This place rocks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWclVGQXdiR2RtU1hKcE1ERkRZbGR0ZGtOcFFrRRAB",
            "text": "Good food and the chef is on point"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaGRXVnRaVmhXYUhCb1FuUTNjemhFY1VSWlZtYxAB",
            "text": "Quite frankly, if I was not a member of the civil services I would have probably left without paying. The services offered were not rendered.\n\nI used to frequently come here, but honestly this was the worst experiences I've ever had in any restaurant in my life ever. Not only did they try to scam my bill, they changed items before giving them my card and after giving them my card.\n\nIn reverse order: I received my bill, I gave them my card. On the itemized bill prior to handing them my card it did not have a tip; on the itemized bill AFTER returning me my card it has a gratuity bill.(I had a party of 4).\n\nPrior to making my main order I had requested some take away sushi, at the end of the night I had not received my sushi and they attempted to charge it.\n\nIt was my mother's birthday and we were being charged for the birthday event, even though we did not receive any cake, ice cream or dessert when we pointed this out we received the saddest little piece of ice cream with a single candle. As part of the deal a photo is included and we reminded the server of this, they hastily pulled out their phone and said \"I got it\" and took a and then went into their office to quickly print it.(I was charged 15$ for this picture)\n\nThe time was around 7pm and we had just received our main meals, we were asked if we wanted a refill on drinks. All of our drinks were full so we declined. Not 2 minutes later, we received our bill, no one had finished eating at this point and no one had even actually finished eating at this point.\n\nI understand that sometimes people have a bad day, the gentleman serving us cut his cooking show very short(based on all of my previous visits here) and he was also very rude to my mother calling her \"mamsita\" (/honey/ in Spanish) when she requested that he lemon her fish, he refused and then he very quickly left after putting out small portions of the food.\n\nI have never received such poor service in my life. I only came here because my mother has nostalgia for the location and this ruined her birthday night horribly.\n\nAlso... it's Sunday night at 7:00pm why are the floors sticky?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1ZUZExOSGRDWkhCaFZ6VlpWREpuZERGclkwRRAB",
            "text": "Today one of the chef chino loco did the nastiest food ever. The chicken the steak the rice was so nasty"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbFpEbHdTVVZNWkhWdVYxZGlZMEpyWlZselVXYxAB",
            "text": "Overall, good experience. On a personal note, I appreciated the personable staff who worked with me to plan a surprise birthday brunch of about 20 people. From conception, the manager was most helpful in taking my deposit, honoring my date/time, and menu selection. Our servers were gracious, hospitable, attentive, and deserving of the gratuity earned. The two hibachi chefs were entertaining, and our tables collectively contributed to a cash tip for them upfront. As I disgruntledly shared with the manager, \"I personally asked them if their tip would be added at the end, and one responded, no we accept tips\". I'd learned when I received the final bill, they'd been dishonest about receiving additional gratuity. And they'd be receiving nearly 60% of the gratuity - that meant they'd receive about $113/ea give or take, when we'd already tipped them in cash! And for what - a fire show and hibachi food?? I was so disheartened by their lack of integrity. I spent a good 10 minutes venting to management about it and demanded the tip be redistributed to our servers for the awesome job they did tending to our party. Unfortunately, I learned NYC restaurant law would not allow it, but I damn sure tried to advocate for our waiters!\n\nOutside that dishonorable tipping fiasco, we enjoyed our dining experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCR2RqVlNPR053Um1GWU1tZFVRbFpqV1U1VVFrRRAB",
            "text": "I've had better hibachi in less known areas, the food was bland and the drinks are weak, if your someone who love good food this is not the place, they also rush you to leave. I will not be returning sorry."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnemN6bG9YMFkwVjFscmF6VlRXbXRWYjBseVpYYxAB",
            "text": "This place is a tradition of ours.. This location stays true to me and my boyfriends' heart.\nFood is always great, nice vibe, casual, and the drinks are great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veU5GQkJhRWxKUTJVeFFWQXphblpQWkd4TWNWRRAB",
            "text": "I went there for Father’s Day.I had a wonderful time. The chef was amazing. The food was amazing as well if you like hibachi I definitely recommend a spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelVVeFNWV0o2T1Vzd2JYUlZaakoxZVUwMGJYYxAB",
            "text": "It was such a pleasure to had our dinner and enjoyed neighborhood here. We love the food. Ours were combination of steak and scallops, steak and shrimps. Steak was cooked to very right point, juicy and tender. Seafood was fresh. Servers were friendly and accommodating. We will comeback for our next trip. Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOWGRycEhPZ2VYUUx3EAE",
            "text": "I hate writing negative reviews, but I do this for everyone’s safety. My family came in here for a late dinner, and once we got inside, I knew it would be bad. We ordered the chicken, steak, and scallops. Although cooked, the chicken was smelly and had an aftertaste. A few minutes later, we started to get a stomachache. We also ordered beers, which had expired in 2024. The hibachi chef was friendly but it all comes down to the quality of food, so I would not recommend this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLTBzYUhWcjZYQXdRRRAB",
            "text": "Love my chicken and shrimp never leave hungry"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOYXh2dDNjMmZ6eEdBEAE",
            "text": "Online it says open at 12pm but when we got there my daughter and at 12:53 it still wasn’t open he finally got there at 1:15 pm we sat down ordered some food chicken and steak we got more chicken then steak the chicken was overcooked the steak a few pieces the bill came to 119 for just 2 people but still i paid I went home calculating everything I got came to 94 dollars but that’s the least both our stomach started hurting and cramping feeling nauseous we will never go there again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaWoyOEdrOS1Ddl9RRRAB",
            "text": "Title: Memorable 21st Birthday Celebration at Ohana's City Island\n\nI recently celebrated my daughter's 21st birthday at Ohana Japanese Hibachi Seafood & Steakhouse on City Island, and it was a delightful experience.  The staff were exceptionally welcoming and accommodating, ensuring our family felt comfortable throughout the evening.  The hibachi chef was not only skilled in preparing our meals but also provided entertaining flair that added to the festive atmosphere.\n\nWe all opted for the steak and shrimp combination, which was cooked to perfection.  The meal included a salad and soup; while the soup didn't quite meet our expectations, the salad was fresh and enjoyable.  The portions were generous, and the flavors were satisfying. The staff brought out a cake with a candle 🕯️ as we sang happy birthday to her.\n\nThe ambiance of the restaurant was lively yet comfortable, making it an ideal spot for special occasions.  Given our positive experience, I would highly recommend Ohana's to anyone looking for a fun and delicious dining experience on City Island."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJT1ZsWjZkbXBTa3p3RRAB",
            "text": "Mother’s Day 2025 took my wife to eat. Had reservations for 8pm didn’t get seated till almost 9pm. Before seated we had pineapple and henny coladas that were terrible and tasted awful with a bad after taste. Customers that came in after us was seated before us, took almost 10 min to get a cup of water. My wife and I asked the ppl who was seated next to us how long they been seated, they told us before 8pm with just a cup of soup that was horrible and water. After we began to order our food. Two family parties of over 5 people got up and walked out do to no service over an hour with only two chefs. So me and my wife and more couples got up and proceeded to walk out. Leaving me and my wife hungry and angry at the service. Horrible and the worst experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLVGFoY3o4cThIdWp3RRAB",
            "text": "I looked at the Menu, nothing spanish on it other than Maduros, Tostones and Empanadas. But they say Latin. They should just say its a Japanese and Sea Food restaurant. Shameful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNTVLZzNnRRAB",
            "text": "I dont understand how this place is still in business. The food is good… maybe thats why, but its Chinese food prepared in front of you. Thats why. Otherwise the place is a disaster! Why dont they invest in it. It has a good location. The sofas are so old the leather is broken. The chairs are covered by black covers but they are different chairs, one person might be lower than the other one. The bathroom is ugly and dirty and outdated. When i went it was raining and it was leaking from the roof. The place really need to have some love. Please take this review as a token of appreciation because the food is good. But my family and i will never go back until you fix it up."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveTdhSTR3RRAB",
            "text": "38th Birthday dinner.\n\nThere was a wait but there wasn’t up to capacity. The food was great. It was very interactive. The chef was young but listened intently. My family came on a Saturday night. (6pm) only thing I would say needs improvement is the service."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNzZDRWx3RRAB",
            "text": "Needs an update"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdUk3Mll3EAE",
            "text": "It was amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa1l5WFRnEAE",
            "text": "Been going for over 20yrs. The Best!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc3BxaThRRRAB",
            "text": "Food was good and we got a bottle of the Plum Wine, recommended if you like a soft sweet wine. Only small complaint is our chef overcooked the steak."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbDhMMnlBRRAB",
            "text": "We went for my son’s birthday. Our server was very aggressive, and not friendly at all. The chef who did our food didn’t say a word to us, he made our food and the silence was unbearable. We thought it was going to be fun since we have been here before! The waiter was a little bit upset when we asked him for chance after giving him the proper $40 tip!! This place is definitely not worth it anymore."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc3UzTlRBEAE",
            "text": "The chef is the best part of the show.\nHe cooks right in front of you and makes food with care.\nHe smiles and makes funny moves that make you laugh.\nDrinks like margaritas and hennycoladas taste great.\nIt costs a bit more, but the great chef and service make it worth it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc3BYaHp3RRAB",
            "text": "I had the best experience.. food was amazing .the service was excellent… the manager was so kind to let me be in the VIP room ..will definitely come back to Ohana ..hope he will offer me in the VIP .. thank you Ohana"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc3ZuazB3RRAB",
            "text": "The food was okay and the show was fun to watch.\nThe drinks were really good, especially the lemon drops.\nThe atmosphere was warm and welcoming.\nThe staff were very friendly.\nOverall, it was a pleasant experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna3BlUEZnEAE",
            "text": "Hibachi should be a mix of skill, entertainment, and great food—Ohana missed the mark on all three. The chef lacked basic hibachi techniques, and every single item stuck to the griddle, turning what should have been a fun experience into a frustrating spectacle. Instead of a smooth, skilled performance, we watched food burn, stick, and get scraped off over and over.\n\nThen, mid-meal, the griddle failed completely. Instead of handling it swiftly, staff left partially cooked food sitting there while they struggled underneath the grill with lighters, trying to revive it. The restroom was also shockingly unkempt—comparable to something you’d find in an abandoned rest stop. Management attempted to rectify the situation with a $50 discount from our $500 bill, but frankly, it wasn’t enough to make up for such a poorly executed experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbk1DYjdRRRAB",
            "text": "Not the place I remember. Let me start off at the valet that makes you park your own car. Then to get inside and still have to wait after we had reservations. We finally get seated and for some reason they left the gas on. It was so strong it was burning our eyes. We had to tell the waiter about the gas smell and finally they put the exhaust on. The chef and food were ok. Was very entertaining. Me and the wife order henny coladas but for some reason this place charges you for the pina colada and separate shots of henny. Never seen that before. I use to come to this place in the past and its was just a charge for the henny coladas. Anyways then we told them we was celebrating our sons birthday and they completely forgot about it. Another thing we had to remind them about. When the slice of dollar tree cake came out not even a happy birthday song. Wow never again will I celebrate anything at this place. Then they have the never to add gratuity like they service was so great. Such a let down from how I remember how good this place was."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN0lPMWlBRRAB",
            "text": "$400 later, first of all dont bother making a reservation you still waiting. Let me start by valet doesnt park your car. when we were seated they must of turn the stove on improperly which instantly let gas out. Had to get up and call someone over to turn the fan on. The only good part was the chef he was entertaining. They forgot sodas they double charge for a henny pina colada (pina colada is separated from a henny). Theres no japarican anymore. I had to get up and request service Thats unacceptable. Last but not least, i had to wait 45 minutes for my check just to see it has 18% gratuity included. There was no sign to let us know and on top of that service was severely poor. So sad it definitely has new ownership because this was never like this years ago."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN1BXZU13EAE",
            "text": "Unfortunately, Ohana does not deliver what you’d expect from a hibachi experience. The chef lacked fundamental cooking skills, struggled to control the griddle, and every single piece of food stuck and burned. The grill itself malfunctioned, and instead of a quick fix, our meal sat there unfinished while they tried to relight it manually.\n\nThe restroom situation was equally disappointing—comparable to a neglected highway gas station. A small discount was offered, but given the overall poor execution, it wasn’t nearly enough to compensate for the subpar experience. If Ohana wants to be taken seriously, they need trained chefs, functional equipment, and better maintenance across the board."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbkpfNTd3RRAB",
            "text": "The food is great but the service sucks. Very unorganized and slow. It used to be so much better years ago."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdTVxX0pREAE",
            "text": "GREAT ALL AROUND EXPERIENCE"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbGNMeGtnRRAB",
            "text": "Delicious food. Entertaining. Excellent service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeGJtbmNBEAE",
            "text": "The food was good, but the service was really bad. Server asked me if I wanted another beer and I said no, but he brought it anyway. The whole experience felt rushed and the place was dead. They asked my wife twice if she wanted a to-go box, she was still working on her plate so after the second time asking we took the to go box and left. The lobster tail roll tasted awful. This place was alot better a few years ago, not sure what changed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNnBXZklREAE",
            "text": "I came in late so I got a fast service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdWJUM19RRRAB",
            "text": "Came for dinner on a Thursday around 5pm. Sever was attentive, we ordered the steak and hibachi.  The order comes with clear onion soup and a salad before the meal comes.  We got fried rice, steak, shrimp, vegetables and lo mein.  The food was fantastic.  I really enjoyed the food.  The chef was funny and a very good entertainer and chef.  Food was perfectly cooked.  I highly recommend and would go back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfa2ZPMERBEAE",
            "text": "3 in our party. Terrible service. The chef was good but had to literally wait forever for my drink. Server went to another table to serve them then forgot my drink. Then the bill came with gratuity’s already on the bill which was bad enough since the service was bad but then when they came back with my credit card and to sign there was a tip suggestion on top of the gratuity. Like what they wanted us to pay a double tip. Will not ever go there ever again"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHNTSVB3EAE",
            "text": "So I went here it’s not my first time but this time the spicy tuna roll was dry and hard didn’t eat none of that but pay for it. The leftover food I heated up today and I ate it. It taste like the thing that they clean the hibachi stand with oh my God I almost threw up because I didn’t taste it initially, but I tasted the next day. It’s like chemical cleaning supply taste in the food you know how disgusting that is do better. I’m never coming back to the spot Horrible"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2NlT25nRRAB",
            "text": "It was my daughter's eight birthday, and she requested hibachi. Gladly, we went on a Sunday, and there wasn't any wait time. Parking was really easy since there is a parking lot.\n\nThe ambiance is nice. The place was basically quiet when we got there. We were basically the only people there for the first half hour. We loved it. The chef was very polite and fun. He sure brought the hibachi vibes, and my kids loved it.\nThe food was delicious, and the drinks were really good. We got fried rice with shrimp and chicken, some noodles, and veggies.\n\nOverall, it was a great experience. I recommend trying them out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMUlPVW13RRAB",
            "text": "Hey everyone, I’ve found the best habachi spot you’ll ever want to visit! The chefs are hilarious and have a great sense of humor. They’re also incredibly talented and can make the most amazing dishes. You’ll have a blast!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeE5qblVnEAE",
            "text": "The food was just okay.  I prefer Edo. The service was okay our chef needs a little more entertainment skills.  The bathrooms were dirty and no locks.  I like the private section but the atmosphere was average."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNjhiTVJREAE",
            "text": "Saturday night and our usual Italian place was already booked solid. What to do? My friend suggested how about Hibachi. Hadn't done a Hibachi place in quite awhile, but always a fun time, which is what we are about..:), City Island here we come!!!\nEasy to find the place and easy parking. Good start lol...Had to wait a few minutes for a table, so the well placed bar (big, in-lobby), was convenient, well-stocked and accommodating bartender, and we are off to the races!\nUsual Hibachi setup, extensive menu was very impressive and all delicious. We did Salmon and Veggies and the Chef was both entertaining and hilarious, but also knowledgeable enough to cook the Meat/Shellfish, only after our food was prepared. Well done!\nOverall, really good food, prepared expertly and with care, tasty drinks in a well maintained, well-run place. Great date night or bring the kids - Go and enjoy the Hibachi experience on an expert level.\nPS - Kindly note this is not a cheap night, not insanely expensive, but be prepared, especially you have some drinks. Tip is automatically added to the bill."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMGNHVUZBEAE",
            "text": "We had 2 hibachi meals here this afternoon.\n\nThe food was tasty and the service was ok.\n\nThe restaurant itself needs some TLC and overall updating.\n\nOVERALL: I would recommend this restaurant for the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd29qUy1RRRAB",
            "text": "We celebrated a birthday here, but the chefs weren’t as entertaining as at other hibachi restaurants. Once, we asked for saki, and the chef demanded money be placed in his cart in the middle of our dinner. Since it was a birthday celebration, we politely declined to pay then and there, as it was rude to ask for money during a meal. Despite this, the rest of the night, the chef grinned at us, and the atmosphere felt uncomfortable. He even made rude gestures. While a generous tip was included with the bill, I won’t be returning for the service we received from the chef."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ09fSW93RRAB",
            "text": "Love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuODZDeGdnRRAB",
            "text": "The waitress was horrible ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLV96MnlnRRAB",
            "text": "The ambience was a 8/10 for me. There wasn't much wait time. We were taken care of immediately which was awesome. The chef, however needed a little bit more vibe in delivering the Hibachi experience... But overall, the food was scrumptious! The avocado sushis were so goood! I recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa0w2dkh3EAE",
            "text": "My first time at Ohana. Went with family for a birthday celebration and I enjoyed the experience.\n\nWe were late for our booking but the staff were very understanding. They served as usual and even stayed past their 11pm closing time. Great job guys.\n\nThe food was great and the chef was hilarious. He made the whole experience so so fun. The birthday girl received complimentary cake on the house. The staff sung for her and even gave the pregnant lady additional slice of cake.\n\nThe negative was the washrooms, the floor was a mess with toilet paper all over. I'll pardon them and give 5stars because it was past opening hours.\n\nI will highly recommend. You can order for take out, dine in, make reservation. Closing time is 11pm don't forget"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdUstNUlREAE",
            "text": "My first time to dine in this restaurant. It was not crowded when we came, waiters were helpful and accommodating. Excellent chef. He made the food very flavorful.. We were blessed that the chef sang  Christian songs as requested."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb1lma3F3RRAB",
            "text": "Had dinner here. We went at a good time, it wasn’t crowded and we didn’t experience a wait. The chicken and shrimp was good, fried rice and noodles were excellent. Didn’t care too much for the calamari. It wasn’t flavorful or crispy at all. Would definitely come back again and try other options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcS1QTzNnRRAB",
            "text": "Came in shortly after they opened on a Monday afternoon. Very quiet but still the staff was very attentive and accommodating. Pricey but its a hibachi spot, you have to expect that."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNS1QN01BEAE",
            "text": "Food was delicious. Service was decent. Chef was engaging and prepared our meal was love and care.\nMenu items are on the pricier side and the meat and fish options are rather small. The vegetable options are limited and not that tasty.\nDrinks are decent.\nBathrooms are small and requires better upkeep.\n\nI would recommend going with a party of at least 4 to enjoy the hibachi experience"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbE0tbmRBEAE",
            "text": "Honestly really loved this place!! Super amazing and great food, the staff were great and the chef was so funny and cool, like honestly the best of the best! I loved it! The food here is kind of expensive, but I'm going again because the experience was just amazing!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MV9QaWpnRRAB",
            "text": "Really enjoyed it here the food was amazing. Service from waiters taking orders were alright not really to caring on the table. The chief was there more than he was. Quick and great service for going in after 5 pm today. Would return whenever they open their sushi bar back up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4b3BUYlN3EAE",
            "text": "Food was amazing, the cook was hilarious made us laugh alot, we had an amazing time and they were very professional and catering to us. I recommend this spot 🔥"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM3FTMUFnEAE",
            "text": "Have been coming here for years and the food has always been delicious. But recently, it’s gotten horrible. I used to come here more for the fried rice which I really like, but it’s now mushy, the soda tastes old and disgusting, and they…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrLU1fazRnRRAB",
            "text": "The food and the atmosphere was to die for.  They gave my daughter a beautiful birthday experience! Staff and service excellent.  Our first time being there!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINVBXR1RBEAE",
            "text": "The service was good, food below average.  We had a miso soup, steamed and fried shrimp gedza, unagi sushi rolls, and scallops sushi rolls. Gedza and unagi rolls were more or less ok.  Miso was below average - a clear salty broth with little pieces of something like dried onions. No toffy, no sea weed. Scallop rolls - hardly unidentified as scallops."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobnZ5RzNRRRAB",
            "text": "The atmosphere is amazing and so friendly, and the food tastes great\nLittle pricey, but the place deserves it"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNX0x1dkFnEAE",
            "text": "Service was awesome! Chef and servers were very courteous and friendly. Beautiful ambiance. Drinks were on point. Love this place ❤️"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NnVlU1FBEAE",
            "text": "Un lugar genial para compartir en familia , compele años , eventos de grupos , la comida es deliciosa , lo recomiendo , el cocinero es muy amable , la atención es súper , es nuestra primera ves pero regresaremos , vinimos entre semana…"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLTRUYndRRRAB",
            "text": "Scoperto per caso mentre camminavano per il quartiere, direi ottima scelta.....😊😉servizio accoglienza  cibo, veramente autentico"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcU1HU3NRRRAB",
            "text": "When we arrive their is a guy that park our car in their parking lot very nice guy.\nSo the restaurant  has a parking lot.\nWaitress very nice . The  chef 👨🏻‍🍳 Alex was so funny and cool makes us laugh and enjoy time with my family .\nsatisfied with the 🍱.\nFood was so so so delicious.\nPina colada virgin was wow great.\nWe are  coming back soon.\nI give not 5 stars ⭐️ I give 10/10 🌟\nThe price was worth it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMjdYb0NnEAE",
            "text": "Came here grouped with family and friends for a birthday, Had a wonderful time. The staff is pleasant, welcoming, and very attentive. Its Mainly a Hibachi place as their tables are centered with a grill. The Hibachi chefs are nice, great,…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJekxmdXNnRRAB",
            "text": "Awesome food, Awesome staff, Awesome atmosphere and awesome location. If you love hibachi this is the place for you. Theyre a bit more pricier than Edo's but worth every dime.\n\nThe staff is friendly and does everything to make you feel valued as a customer. I love the theme, the lighting and authentic Japanese decorations.\n\nMy only critique is the drinks couldve been a bit stronger. I barely tasted the alcohol. Other than that, I highly recommend this place."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURna0k2MGJREAE",
            "text": "Outstanding looking blend of traditional and contemporary Japanese Restaurant.\nAnd also very friendly atmosphere.\nOf course,  it's to be expected, as you enter into a wonderful traditional…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOG9qRjFRRRAB",
            "text": "Great experience ,the waiters are so attentive , good service and food was delicious and our chef David was very entertaining made our birthday fun . Fully recommend 10/10"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRZzdfcGNREAE",
            "text": "What I liked most about this place is that it's Latin Fusion Cuisine. City Island its really nice so a nice place to spend an evening. Food was good a little on the bland side but not too bad. Nice bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aGZtMmZREAE",
            "text": "Any time we are in the mood for hibachi this is where we come! Food is always good. Sometimes the wait is a little long but over all its not bad. We love one of the cooks who's extremely entertaining. I keep forgetting his name but hes in the video and makes it fun! The menu is a little pricey but its worth the treat every once in a while. Drinks are good and food is very flavorful. The miso soup is delicious!  They give enough food to take home for lunch the next day!! I recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOU9IVEpREAE",
            "text": "The cook is funny. But it is a give and take. If you don't interact with the cook it will be awkward. Since the cook is also part of the entertainment. The food is great. They do ask if you have any allergies before they bring the food out to prepare in front of you."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhN292OFJ3EAE",
            "text": "First time going. Very clean, the place is alittle small but it's a fun atmosphere the drinks were good.. I had chicken and steak with rice veg's very good food.. I will be going back and the workers are very nice and welcoming"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleU95UVBnEAE",
            "text": "Excelente atención, camareros muy divertidos y la comida muy buen sabor!!\nLo recuerdo."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhaVpuSW13RRAB",
            "text": "Fantastic place with fantastic chef that makes your evening wonderful. The food was great as well as the drinks. If it's your birthday you get a free entre and at the end of the day you get ice cream."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdVluUkpBEAE",
            "text": "The gentleman at the front with glasses could've been a bit more friendlier, I asked for a knife and his response was \"we dint have knives,that is why we have chopsticks \""
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4OFpxVUpREAE",
            "text": "Terrible\nTerrible.\nWaited 2 hours for a take out order which they didnt make until the dine in people finished (I watched them and the hostess acted as of she was checking on it several time after I asked), then the food is mediocre at best, no sauces provided and the Hibachi chicken was dry. Scallops were well cooked though.\n\nI will never go back to this place again. I don't know what the rave is a about"
        }
    ],
    "reviews_count": 78
}