{
    "name": "Mamajuana Cafe The Bronx",
    "place_id": "ChIJj2SE5kiLwokRT-HE6Gqn1TI",
    "grid": "BX10",
    "address": "3233 E Tremont Ave, Bronx, NY 10461, USA",
    "rating": 3.9,
    "user_ratings_total": 1655,
    "phone_number": "(718) 824-8400",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SV1RsSnpTMUUyWmpWMk5EUlhWbkprVlVKcFlsRRAB",
            "text": "Music was way too loud. So loud, I couldn't hear anyone speaking to me. My drinks were given to me in a plastic cup and didn't look like the pictures on the menu at all. I'll say the drinks tasted great, but presentation sucked. Food: my appetizer with the pinchos was great, however, for the entree I had to send it back because it was made wrong and I got the wrong things. My waiter then switched our table to another waitress because he got upset that I sent the food back. I'm not going to sit here and settle for a plate I'm paying 39$ for. Fair to say, I'd likely not go back."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3d2JYQklNbmxEVGpOWFVrZFJVMHBzTWxGT1oyYxAB",
            "text": "Great place to celebrate your birthday."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RFIzcFNObUZZYXpSaU1VWmtVelJHVEhCT1gzYxAB",
            "text": "I went there with my daughter who was visiting and on a Tuesday when they had the band and we had a spectacular time from the moment we walked in. I saw people that I knew, though it had been quite a number of years since I’ve been there. It was warm and inviting lively and we were lucky enough to sit next to a family that was celebrating their 80+ birthday. The sushi fusion that I had was amazing and it consisted of steak shrimp with bit of sweet plantain and my daughter had steak and arroz con gandules. We practically licked our plates.  finally and I wish I could remember the name of our waitress who was very attentive and we just loved her. My only regret was not getting her name. We had a wonderful time and I cannot wait to go back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVGRWcEZVVzA0VjFwRlZIbFBiVkZDVlZvM2NHYxAB",
            "text": "Salsa Tuesday with live band awesome dj"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNFoxTnlha1p1ZUVGR09ESXljbEkxUkRSaGMwRRAB",
            "text": "Loved the Arroz con pollo"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeldWOURZVmhHVTAxWmRuVjVTbkZpU1hoUWQxRRAB",
            "text": "Because we went early there is no wait but I do suggest that you schedule a reservation as this is a very busy place.\nAlso it is a little bit loud inside due to the amazing music and great DJ so I would not suggest as a place if you are looking for a quiet restaurant vibe. This is more for you and your friends to hang out, drink,and dance. The Sunday brunch is great. It's a out $50- $70 spending wise. Definitely more on a Saturday. The staff is so pleasant and attentive.  Everything is clean as well. This may be the 1st time I didnt ask for a cup of hot water for utensils"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUlRsOTVWbE5WVEVaMGNWaDNWMUpvZFdsT1NrRRAB",
            "text": "Buen ambiente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNFRUVXROek0xWjJsUlRGb3RkMWRVYVMxemVtYxAB",
            "text": "Always have a great time here. Had one issue one time but was immediately corrected and resolved. Music is always great. Passion fruit margaritas are my favorite here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ1ltMDNhME56YUVKRFgySnZZWGcxYlVzM1JGRRAB",
            "text": "Daniel the bartender wow the best great drinks awesome personality... Anthony our server was amazing food was so good the place the staff the food 10 out of 10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbGIyNXhhbEZXVmtJek9EUmlhMlUzZERSelJWRRAB",
            "text": "Nice place to enjoy. happy hour is only at the limited bar, boo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CT1VrRkNMVzVSYzJJM1VrbHlSV000UW5seExXYxAB",
            "text": "Bottomless brunch that turns into a full out party, the sangria is reallly good! However I warn you all that after sitting there for 3+ hours your ears will be ringing when you leave. I highly recommend wearing ear protection!! (ear plugs)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV2NUUmtiMll3YVcxcmJuWkxTR0kxVmtzMGJuYxAB",
            "text": "The atmosphere is very nice the food was absolutely delicious the only issue that we had was a language barrier with the wait staff other than that. The experience was definitely worth it. I would return for another visit there are items on the menu that Im interested in tasting."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVN6WktZVjl3Y21aclduZEZPVEZ3YkRaRmVVRRAB",
            "text": "Tengo años yendo a ese lugar y me encanta el ambiente y su comida se puede ir en familia, sola o acompañada"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MGVrbzJja1pvV1ZWT2IyRnNWV1Z1T1VGSFJuYxAB",
            "text": "I go there on Tuesday nights for the Latin night. We get there early for dinner. Stay for the dancing and band. If you love old school vibes when it comes to Salsa, this is the place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoclZGQlBSVnBLYTBkNmMybzNhVFE1WkVOelRXYxAB",
            "text": "Expecting food to be slight better. I ordered mofongo. It was dry, but good flavor"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeFpIb3RSVnBpYTJWcVltVktkVEpoVmxWb1dFRRAB",
            "text": "I don't know what kind of beef was is my chaufa but that certainly did not taste like meat..no flavor and the texture was totally off..gave me Chinese spot vibes..eww other than that drinks were good and music on point"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTGVrOUZhMVZXU0VNeWRYQnhVamt0WVhNM09IYxAB",
            "text": "The bartender don’t  know how to make drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TFZHZHBZVWhVTFU1Nk1teFdURkpwTlVGUGEzYxAB",
            "text": "The food and the service wasn’t great at all."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWYVlsQTJOeTFLUkhJdFVWcHJMVWRDZWxOSFEyYxAB",
            "text": "Es muy  especial si es entre parejas  lo recomiendo 👍"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxalRWa3pNMUZ4VFZwS05FbFlaV3Q2VFVwMVlsRRAB",
            "text": "Excelente ambiente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdFMxRnlSRE5DUzBabFNGQkpPVWx1Y2pCVlRIYxAB",
            "text": "I don't think this is a right place for married couples or with children, the champagne is great but the atmosphere is not for men with families."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFRrSlZSVE5DY1VONVYzSjFVbEUyY0VGaFRXYxAB",
            "text": "I don't eat there, just a few drinks. Very nice atmosphere. Will visit again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORVZteHpjalJoTFVac1FVdEJZV1Y2YURCdlJHYxAB",
            "text": "Mamajuanas is the VIBE\nThe food is good not perfect but good\nI have been coming here for years Love, always love the vibes they give and as always the manager accommodating extra ppl it is not the first time , we make reservations and someone is added last minute usually places will turn you away but they never do here\nIf ya want the VIBES definitely is the place for it ! Food drinks unlimited mimosas and music\nOnly thing is I can say maybe the dj could play a little more enough like R&b rap and reggae the music is more of Spanish  but again still a vibe !! As always I will definitely be coming back and so will my family !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWlQzVktWekZZZG5WSlVVZFplRWx3YnpOUlZsRRAB",
            "text": "There are times when you enter a Spanish establishment and your not Spanish the looks the stares the assumptions but as much as I notice it I sit down and order.. I break the ice it works everytime! Went for happy hour for for photos but I ordered white sangria , plantains And arroz Amarillo with gandules was YUmmy!  Rodolfo was the bartender and waiter we sat at the bar for happy hour!! Forgot to take photos of small bites."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveWIxQnNiV0V5TlRNM2QwMTBhMDh0TWtsTWEyYxAB",
            "text": "On 7/12/25, a group of us decided to go to the restaurant, after an event we were promoting in the Bronx with a number of recording artists and politicians who showed up. To our surprise it was the worse experience we had. We all sat down while the waitress was very friendly and taking our order. As we waited for our food we heard pop shots followed by two more pop shots, thinking it sounded like gunshots inside, everyone was running and going under the tables and many ran out to their back patio, running for their lives and screaming. Some tripped over each other and slippers were left behind. People were running for their lives. It appeared that all this was because a drink was dropped on someone’s foot, as we had heard. We did not stay around to see if it was actually gunshots or not. The cops arrived but we didn’t stay around. Many left and left their food behind. We decided to go to another restaurant to eat. I Will never go back to this restaurant again. People do not know how to act. If I can give a zero I would. What we can say is, at least many of our lives were saved or spared."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1YxSm5PRGswVUhkV1ltZzRkRTVGWkRreldHYxAB",
            "text": "Perfect happy hour / dinner spot near The Met Cloisters.\nI got a frozen piña colada and paella. They were delicious, the amount of paella could probably feed 4 people! I was super hungry, ate about 1/3 and took the rest to go.\nI sat at the bar so my service was speedy. A music was blasting but i did not mind it.\nPlace has different offers including unlimited dining experience, i would probably be a regular if i lived nearby! Very affordable.\n\nPs. That day they had a cerveza República promotion from Dominican republic, there were a lot of people and a very fun atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5S1NIa3hhV3BIUnpoVWRYZHhTMHh0ZUZjNVFrRRAB",
            "text": "Arrived at 915, by 1045pm still waiting for the food, mind you the place says it closes at 11, they were picking up the outside seating while we were still waiting for food. Bathroom had no toilet paper, it was not even at capacity, literally 7 tables with people 🙄.  Completely disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMVNWZHJlbTFIWm5oamFYUk1TMmxNVVdVNGQwRRAB",
            "text": "Services suck, everyone looks like they done like their job. Food is not is a 5 out of 10.\nPrices are little over price. DJ isn’t that great.\nI was sitting at the bar. Theirs a lot of fruit flies. I told the waitress, her reply was its fruit fly season."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOZkpzUENfaEpXRnFnRRAB",
            "text": "The music is very good, but too loud.  You have to scream when you talk.  The food is so so.  I had Chicken and waffles and the tenders were over cooked.  My husband's steak was over cooked as well.  They didn't ask him how he wanted it cooked.   The good thing is they keep the drinks coming for the brunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPRHh0SjZZNE5iQ3dBRRAB",
            "text": "Great spot to hang out and get some drinks. Not a place for kids or a simple family dinner. Place is bumping with hookah smoke and loud music."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTGVrXzJRNDVpWFFnEAE",
            "text": "Very good food. The owner personally came to welcome us."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOYTBwSm1IdG9ycmd3RRAB",
            "text": "Absolutely horrible service every single time. I’ve given this place more chances than I should have, and every visit just confirms how badly run and disorganized it is. I’ve been here multiple times, and the service either stays the same (which is already terrible) or somehow manages to get worse. On this last visit, I waited over an hour for TWO appetizers. Not entrees—just two basic appetizers. And when I politely brought it up to the manager, he had the nerve to tell me that it definitely hadn’t been over an hour, as if I was making it up or didn’t know how long I had been sitting there. No apology, no solution—just attitude and defensiveness.\n\nThe server? Barely around. I had to physically get up multiple times just to find him and ask for things because he never once came to check on us. No drink refills, no updates, nothing. And this wasn’t a one-off situation either. The time before that, I ordered a hookah—and two HOURS later, still nothing. It never came. No explanation, no follow-up, just forgotten like it didn’t matter.\n\nTo top it all off, I came here with my friend and our children for Mother’s Day hoping to enjoy a nice, relaxing meal. Instead, we spent most of it hungry, annoyed, and ignored. The manager’s rude attitude and the staff’s complete lack of care or urgency ruined what was supposed to be a special day. When I voiced my concerns, they brushed everything off like it was no big deal. Completely nonchalant, like they couldn’t care less about the customer experience.\n\nI will never return. I’ve had way too many bad experiences here, and this last one was the final straw. Save yourself the time, money, and frustration. This place is a mess."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZM3AzSW93RRAB",
            "text": "It took over an hour to get our food. The waiter never checked on us we had to keep asking other people for items. After we ate we had to wait another hour to get the check after we asked 3 people for the check… never again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvazRLLXR3RRAB",
            "text": "It's Lit on Sundays I had a great time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWN1eklREAE",
            "text": "Excellent People! Excellent music! Excellent food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdFBydHR3RRAB",
            "text": "New Saturday Brunch situation is Litt! Stop by and see for yourself. Live Dj and great Food!! Vibe is all the Way Up!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOTR1djB3RRAB",
            "text": "I've been here over the years for brunch, lunch and after parties ..... I've never had a bad experience! Great time always!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNl9pZ0Z3EAE",
            "text": "Awesome"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOXVhRFhREAE",
            "text": "Great hookah must go on Thursdays after work"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ajZEVjhRRRAB",
            "text": "What an Amazing place for a Sunday Brunch! The atmosphere was amazing and filled with of life. I had avocado toast and the steak and eggs. They have unlimited mimosas and sangria"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbi1xRUdBEAE",
            "text": "If you plan on going here on a night where there’s security don’t your NOT SAFE. Last night Friday March 14, 2025 between 10-11 pm my friend came out of the restaurant to have a conversation  (we stepped out next door) my friend was standing outside and had a physical altercation with a male, where he slapped and flipped her on the concrete right in front of the security guards. Not one of those Male security guards (there were 2) came out to help her. She is physically hurt but I thank God there were no weapons involved because then maybe if she was outside on the curb bleeding they would have intervened. It’s sad to say in this world we’re not here to help one another in a time of need especially with all the domestic violence. If you are going to have security make sure they’re there to protect and not just Check IDs because this altercation could have progressed to something  that we could not come back from..and if any of this is in question please check your cameras so today if I could establishment 0 stars I would"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdk12bEJnEAE",
            "text": "La comida muy buena .pero la atención con la mecerá y el personal de bienvenida fue muy malo una atención muy desagradable no sentimos muy incomodo y decidimos irnos del lugar"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbHFENXhnRRAB",
            "text": "Ok"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBN29hRG13RRAB",
            "text": "We went to celebrate my daughter birthday and we had a great time. The food was soooo good. The service is amazing. 💯 recommended 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eTVYeVlBEAE",
            "text": "Had dinner with my sister here. It was a Tuesday evening, plenty of seating available, they accommodated us with a table outside as per our request. We ordered drinks and an appetizer. We ordered the maduro relleno to start, chuletas and rabo al guiso. The dishes were pretty tasty. The sangria was awesome too. The server was nice, but as the night progressed we saw less of him. It was a good nite altogether. We will def make another visit in the future."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvajdfNHd3RRAB",
            "text": "I've been here a few times and I enjoy myself each time, especially for brunch which turns into a live club atmosphere after 3:00/3:30P on Sundays. A negative is you must check your outwear unless you plan on keeping it on and it's a $1 cash fee. Another negative is the tight ladies restroom, especially for anyone of a larger figure, the ladies restroom always fills up much faster than the men's restroom so I feel there should be more stalls available, etc. Overall, it's a great environment to dine and party all in one."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURma3JITmVREAE",
            "text": "The food is soooo good, especially if you don’t mind waiting. The wait times in between food, apps and drinks were long. The coquito was kinda too thick. But there was a table blowing soo much hookah smoke into my face bc they were so close that i immediately threw up whatever I ate in their bathroom 😭. I was super excited to go out but it kinda ruined the night for me. Food wise - definitely try it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCejZIUWh3RRAB",
            "text": "Very clean food and presention was amazing food taste great drinks was on point all staff was very nice and waiter was attentive all around great experience. It was not packed when I went because I was there at 530pm  place starts getting packed from 630pm on"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKZ1oyS3pnRRAB",
            "text": "I went here on Tuesday evening knowing my friends will be playing in the band at this restaurant. I ordered a Mofongo mix with Shrimp. Ohhhh boy super delicious\nblew out my mind to find it so tasty.\nThe shrimp were clean and I didn't see any black veins left in it.  I can be very picky with that.\nThe dish was really good, I will definitely go back for more\nService was slow, I was seated at the bar but the bartender couldn't keep up with the amount of people, maybe having an extra one working might work specially when the restaurant is having an event.\nStreet parking is the only option and for me that night was a bit tough.\n\nDefinitely will go back\nJust to think of the dish my mouth gets watery. !="
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdUlMdDVRRRAB",
            "text": "Had a great time this past weekend for my sisters birthday brunch! First time there! Great music, vibes, interaction! I had the croissant with fried cheese, egg and bacon along with the Chicken Chofan. Brunch is 1-5...$60 for 2 food choices and unlimited mimosa/sangria for 2hrs! That includes tax and gratuity for birthday brunch party - it was a total of 14 of us. No complains. There were also Cheerleaders from local High School were there for a good time. There was a raffle to help them earn money for there upcoming competition. This was very nice! Will definitely go again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcVBiUXZnRRAB",
            "text": "I went to Mamajuana for my birthday, and they did not disappoint. The atmosphere was beautiful. The staff was very professional and friendly. The food was really delicious. I got the mama de la mama sushi- delicious. It's a restaurant and bar. They have hookah as well, if you're looking to just have drinks and smoke with a few friends or have dinner with family. They have a photographer on site that can take pictures if you're having a celebration. If you want the photos framed, it's $20 each.\nOverall, it was an amazing place and service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcG9yNzZnRRAB",
            "text": "My first ever time being here and it was a fantastic experience. The chicken chunks, the chuletas we're so juicy, and my girlfriend couldn't get enough of her food either; the atmosphere was a 10. The music selection was not too loud and kept the experience pleasant, I greatly appreciated the service. I will be returning 💜"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWeHIyUzJBRRAB",
            "text": "Complete and utter transparency:\nPrior to arrival, I called to ask if I needed a reservation, the staff member told me yes. I made a 3:30pm reservation on a Saturday. Arrived at 3:45pm. When I walked in they were ready to seat me without even asking about the reservation. It took 5 minutes for staff to come and address the table, which was odd because the restaurant was empty. Our waitress was inattentive during our dining experience; which  aggravated me because as you can see in the photos, the place was empty. Every time we looked up, she was too busy smoking hookah and hosting conversation with her friends at the bar. Food finally comes and it's not even hot. It was as though they cooked it and had it just sitting in the kitchen. I had fried pork chops, rice and beans, and my friends got the bento box. The pork chop had an odd taste to it. It also lacked flavor! I'm aware that vinegar is a staple in a Hispanic kitchen but that was all I tasted. No spices, no Sazón, no adobo, JUST VINEGAR. The meat tasted almost rancid. My friends didn't care for their food either, it lacked flavor. Then when asked how the meal is, I honestly explained I didn't like it and gave reasons why. They offered to change it for something else and I said no thank you because my friends don't like their meal either. To make matters worse, our waitress gathered with her coworkers near our table to talk badly about us in Spanish because they assumed we didn't know Spanish. I guess employees don't value quality customer service when they know gratuity is automatically added. The best aspect of the restaurant is the busboy who frequently checked to see if we needed more water. When we left, whatever little bit I ate, I vomited. I was sick for the rest of the night. I will never go back to this place!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOGM2WC13RRAB",
            "text": "Hands down a vibe. The brunch was fun friendly and live. Too loud damn near bust my ear drum but that's just the old man in me talking lol food was meh but drinks flowed freely and music and atmosphere made up for it. Was a def highlight of our visit back home."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cWQzWld3EAE",
            "text": "First time here and I really liked it. The mussels appetizer was really good. We ordered the Paella and it was enough for 2,and really good. Good drinks I would definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa2ZXYjJRRRAB",
            "text": "I usually have gone here for dinner and drinks followed by a lil dancing, but this day we went for brunch to celebrate my sisters birthday. We had a blast got there before noon and were served brunch and dinner, by the time we left it was about 5pm and we were all feeling super saucy. It was good food, with nonstop mimosas and sangria. The atmosphere was everything, when they brought down the shades and brought up the music, you totally forgot it was still daylight out. Great time for sure!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDc04zbDJ3RRAB",
            "text": "Make reservations!!!! Sometimes they don't take walk ins. The Back is nicer then I thought. Drink are good, food is good, hookah is not back even tho they only had one flavor (Mint)\n\nBill wasn't bad. Definitely not a bad place to go."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbTl5WXp3RRAB",
            "text": "Food was great, but the service sucked. Took forever to get my food.  After ordering my food, 20-30 minutes later, the mangager came over to tell me they were out of Lobster Mofongo. Why did it take so long to come and tell me? Didn't offer a free appetizer or anything. Just his apologies. Miscommunication between the kitchen and the waitress. Now I had to wait for my next food choice to be made. SHE SUCKED! She wasn't attentive at all. Didn't ask how the food was when we got it, if we needed anything else, but only kept coming to see if we wanted more at the bar. Had to ask someone to find her so I can get the check. On top of that, this rude woman had the nerve to take her tip out of the money I gave her before giving me my change back. First time ever experiencing that. Tip wasn't included in the check. That's not how it's suppose to work. What if I wanted to give more or less before she sucked as a waitress. Who was she to take her 15% out on her own. When speaking to the manager about it, seemed like he was covering for her. Best thing he could do is bring that up in a staff meeting and mention it. Nice place, and nice vibe, but I definately won't be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaTRxXy13RRAB",
            "text": "I absolutely love this place. The food and drinks are delicious. The hardest part is trying to decide what to order. There are so many choices… every time a waiter passed me with a dish, I said to myself, “that looks good.” Eventually I…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bFoyd3BRRRAB",
            "text": "I ordered the Maduro relleno, it has cod fish in it. It was ok, the cod fish was a little chewy for my taste. I like that they have a an and a half of unlimited sangria and mamosas. Definitely got lit hahaha. I didn’t really like their…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a0plSUJREAE",
            "text": "Did my mother's 50th birthday here. They let us set up quickly and the food and atmosphere was amazing. Very beautiful time with family and friends here"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa19McVpREAE",
            "text": "Por segunda ocasión  recibí el 2024 en este magnífico lugar. Este año fue la temática árabe. Dieron el servicio gratuito tatuaje henna. Hubo bufete incluido bebidas alcohólicas libres. La seguridad es meticulosa están al cuidado de los clientes en todo lugar del local.\nRecomendado 👏🏻"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNl9mZmNREAE",
            "text": "Service was awesome! The food was great and the price was decent. I love the ambience of the restaurant. I would definitely recommend this restaurant. The daytime is good for family and looks like it would be a good date night environment"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NWRmY1NBEAE",
            "text": "Always great Spanish Cuisines, we have had quite a few events here. REALESTATE AND MERCHANTS ASSOCIATION OF THROGGS NECK. friendly environment very close to  home. Owner has a great attitude...food is finger licking good. Host your next event at Mama Juana's"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMDZQNFhnEAE",
            "text": "Service was great. Food and drinks were great. Didn't enjoy the couple smoking hookah next to me as I ate."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdFBpZjRBRRAB",
            "text": "Great place with out the over crowding. Bottle service got $125 Henny & Goose. Good guy to girl ratio. Little too much with the TSA like security but you feel safe. So thats a good thing. Dj also was very good forgot his name but he played all the good music even spanish music for a while"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX3VPSUNREAE",
            "text": "My daughters and I picked this place for the ambiance we experienced for my moms birthday. We visited here again on 10/26/24 on a Saturday to have dinner for my daughter's birthday with a few friends and family. The all red ambiance I craved was set up beautifully for Halloween. Shout out to Irene the host for accommodating us last minute at a busy time 7pm and to our server Gabriel for taking care of our needs there was another young lady at the door that showed us great hospitality and the young lady at the bar did not disappoint. The atmosphere was mellow well lit and they  were playing good latin music and the Yankee Game on the Big screen TV,  if you know you know. It was full but not crowded for a Saturday night. We sat at the Bar and had some drinks before moving on to our table as our guest began to arrive as well as other patrons for the business. The tres leche coquito was amazing. I tasted the Passion fruit Henny Colada But the Henny Colada always a fave. Our appetizer chicharon de pollo ordered at the bar was a little delayed and we ordered from an early bird special for $19.95  at the table which include a house salad or soup. We thought that was a deal and decided to order from that menu. Welp that was not a good choice as it was not its best quality food they serve there. We saw other steaks from the more expensive menu come out on the cast iron fryers still hot and sizzling. The pork chops were pale and tough and the rice and guandules was tasting like to much tomato sauce was used. Not to mention there was a slight 1hr delay in us being served our food and yet another appetizer was delayed. They said they wanted to bring it all out when we were seated at the same time. I guess we sent mixed messages as some of us kept going outside to the outdoor seating area. The salad and soup were very good. They don't allow outside bottles and the do provide bottle service. In the end you pay for the Birthday slice of Tre Leches Cake $7-8 a slice and they sing Happy Birthday. There is photographer on site that  takes really nice pictures and a nice Halloween wall for pictures at $20 ea. Although it was a little on the pricey side I regret not ordering food from the more expensive menu as I have before and it was great. I recommend the Mama Juana sushi with pollo and chicharon  and sweet plantain amazing. Overall they were very attentive to my table and we enjoyed our night. My daughter was happy and thats all that mattered."
        }
    ],
    "reviews_count": 67
}