{
    "name": "Leno's Clam Bar",
    "place_id": "ChIJ_QeOmquNwokR7AeUIEISYKY",
    "grid": "BX10",
    "address": "755 Pelham Rd, New Rochelle, NY 10805, USA",
    "rating": 4.4,
    "user_ratings_total": 416,
    "phone_number": null,
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xST01FRlhUMTk1WjJseVMyMDJMVVF6Wm1Gb1JYYxAB",
            "text": "Scientists have finally isolated the gene for \"crispy batter and impeccable comedic timing.\""
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQ2NYbzRiVE5uTVV4d1ZDMUJNRVJqYW1WbVQwRRAB",
            "text": "It's a 'clam shacks atmosphere with delicious food, small menu (thankfully) and outdoor tables & picnic style tables/ benches. The staff are very nice and efficient. The prices are GREAT. Plenty of food for the cost. We had a great time there. Had shrimp(9) & fries and a dozen clams on the half shell & 1 iced tea drink for $34!!!\nOn street parking but not a problem at all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVGFGWmpWMGhXV0dKTFVsOW9lWEZvTkc4eE1sRRAB",
            "text": "Food was disgusting clams didn't taste fresh the hit dog bread was stale the French fries had freezer burn and to top it off a rat came out from a hole and ran back in the hole i thought I was seeing things\nNever again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVZrSjBZbmRFV1c5WWEwVkxNUzFYZEdZM2VIYxAB",
            "text": "New to the area… tried this place because I always drive past it. Definitely city island without the crowds. Food was good, even the fries. If you like spicy, be sure to try the hot sauce on the table. Soo good ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTldHZ3dOa1pFV25GM00zUkVXbWwwWlVJdFRuYxAB",
            "text": "Landmark eating there since 70s"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNGVWQm1kM2gxT1ZKNmNtMUJaMUZhU2w5SlFtYxAB",
            "text": "Clams were horrible, old , and sandy. Fries , burger , hotdog were fine.\nService was good and I liked the outdoor seating."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT2IxTjBaRWhaVW5RdGFrRkRUbm90V1VJdGNuYxAB",
            "text": "Nice little place, similar to Johnnys and Tonys on city island.  If you are in the mood for city island but don’t want to deal with city island crowds the. This is the spot.  They have takeout or outdoor seating.  I like this place.   The clams were fresh and the food was good as was the service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPZVg1UHk1MXJiMXJBRRAB",
            "text": "Cheese burger & fries\nFried fish & fries\nHotdogs\nFried clams\nFried shrimp\nThat's what we had, and all of it was great.  I've been\ncoming here for over 25 years  and will continue to come here.  Great place, nice job, guys!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdzhTcXNRRRAB",
            "text": "Great place to stop for a quick meal."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd2NfV0x3EAE",
            "text": "We've been eating here forever!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbUpTSXJ3RRAB",
            "text": "It's kinda hard to tell if the food was the same ingredients or not because obviously it was new ownership that took over but didn't change the menu or anything which is a good thing. It was exactly the same last time I went. I do remember when I had the first bite of cheeseburger with onions was absolutely bangin!!! This time wasn't it 😔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMFBHUVZnEAE",
            "text": "I  love this spot. I CRAVE from when I was a kid.  It was Greasy Nicks to me and my Bronx family. Great burgers, corn on the cob and their steamers are to die for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOEpicFZREAE",
            "text": "Been wanting to come here for years and finally stop by to have lunch with the family and a long time friend from the area. It was a good choice. All the dishes we had were delicious. The service was very good. The prices were reasonable. A nice option to the madness in City Island. We’ll be back to try some other staples."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbUxtYWpBRRAB",
            "text": "This place has been here for so many decades, my parents used to go here. It hasn't changed much. Outdoor seating under a roof or out in the open. Greasy, delicious burgers with grilled onions in the specialty. It is not a fancy place by any means but the food is good but they don't have lots of choices. The steamed clams are always fresh. It's right on the road and parking is only on the street. Enjoy 😉"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNdF9uS1ZBEAE",
            "text": "Greasy burgers. Great dogs, chicken fingers, clams and fish. Let me run this place for a month ill serve steak, fried chicken, hero sandwiches, coffee and breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUazZibFh3EAE",
            "text": "What happened here, the hamburgers are the size of McDonald's for 5.50"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUM2JIVmJnEAE",
            "text": "Love \"Greasy Nick's\" I have been going for years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUM2E3TUxREAE",
            "text": "First time visiting this place of business, I was very dissatisfied with the level of cleanliness I observed. Saw 5 workers while I sat for 25 mins waiting for my order no one changed gloves after dealing with food, cash, raw clams, fried section which you have a clear visual of the grill. I observed the grill worker take off his hat with his gloves, run fingers through his hair, then started prepping burgers and hotdogs on the grill, then proceeded to take cash, place into register, went back to interacting with food. I was disgusted. I informed this worker gloves need to be changed as sanitary code would recommend. Grill hood filthy with grease and gunk. There was no soap or paper towel in the restroom, I was given a Dawn dish soap and napkins.  They also ran out of shrimp. No Attention to detail."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbWVUTkZnEAE",
            "text": "Very disappointed in this place. My boyfriend and I ordered our food at 5.00pm and we're waiting for our food. I asked my boyfriend do they have numbers on the table to know where the food should be given too. He was like I think they memorized it. I was like ok. So we are seeing everyone getting there food. People that recently came in and they had there food. Meanwhile we are still waiting waiting for our food. Servers came in and out with orders. Meanwhile nothing for us.  Forty minutes later and my boyfriend is angry and he told one of the servers where is our food? We have been waiting for a long time and nothing. Then we see the guy that took our order searching our food from other folks. I was like really. My boyfriend at this point he is like that's it we're out. There has to be a better structure system. Put in numbers on the table. Or write the customer's name so when they are bringing the food they know who they are giving it too. We are very disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdjh6N25RRRAB",
            "text": "A great fun tradition!!\nEverything is really good. Sit outside and enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqajluSVBREAE",
            "text": "Great food!  Friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMTdEbDJRRRAB",
            "text": "Very reasonably priced and since there are not many raw clam bars available this is a great spot to fulfill the craving!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqN0llTDFBRRAB",
            "text": "A New Rochelle institution!!!!!!  Great food, fabulous service, and reasonable prices.  I've been going to \"Greasy Nicks\" for over 30yrs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbU5fYVd3EAE",
            "text": "Great food and great vibes! Some of the staff seemed a bit stressed by the amount of people at the time so I hope that things wound down for them after we left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkejdMS3Z3RRAB",
            "text": "Aka \"Greasy Nick's\"\nOnly open during the summer months but great \"hole in the wall\" type dining when looking for a no frills, quick & cheap, local, bite to eat! Love it ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ3RlbnRnRRAB",
            "text": "Summers living on the sound are not complete without visiting \"Greasy Nicks\" (preferably a bunch of times). Food is simple and delicious, especially when Pat is on the grill (though everyone who works there is awesome). It has a no frills classic vibe and is a staple of this area. I always get sad when they close for the season. But hopefully, they are around for many more years.  Leno's is a staple and little slice of childhood that remains the same as I remember. ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXVpLUd3EAE",
            "text": "I've seen this spot while driving by over the years I've lived in New Rochelle but didn't actually realize how long standing it was...So I stopped in hungry this past Saturday. Glad I read the reviews first to see they only accept cash. Service was friendly and the food (an order of shrimp, fries and a cheeseburger) was ready between 5 and 10 minutes. Best way to describe it - \"Simple& classic\" . Found parking right in front. Fries were basic, no salt which I assume you could request; the shrimp were fresh, with flavor rivaling City Island's fried shrimp in my opinion. I can't review the burger since I gave it to someone else. I think, with an updated menu online to match current prices, a phone number to pre order, and maybe a little face lift to the interior, it may become even more popular.. New Rochelle needs to be able to keep spots like this! Will visit again just for the shrimp- $15."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOWJfZWJnEAE",
            "text": "This place is old skool. No frills, walk up, cash only. Basically burgers and clams. The burgers are simple classics but absolutely delicious. $6 for a cheeseburger. Served with grilled onions, by request, and a gently grilled bun. Top tier stuff. Loved it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeDdHSElBEAE",
            "text": "Great spot to enjoy when the weather is beautiful, the seating is outside and it's only open in the summer, but it's worth it to pay them a visit. They've been at that spot for so many years. The fried shrimp is great, but their burger is amazing. Wonderful place to take the children to enjoy the air and the sky.\n\nI definitely recommend this place if you want to avoid city island when it's busy, you can avoid that long line to enter city island and come here and have the same exact food.\n\nGreat service, great food, great atmosphere!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMWUzSjZ3RRAB",
            "text": "Ok, so Lenos clam bar better known as \"Greasy Nick's\" is a local favorite for Pelham and New rochelle. Lenos was owned by Jay Lenos Uncle, and Jay Leno grew up in New Rochelle. If you want a quick, inexpensive burger on a Keiser roll you go here. Good prices, fast food, and it fills you. Just don't be expecting a Michelin star restaurant. Great Corn on the Cob!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcDhlQkFnEAE",
            "text": "A great place for simple, wholesome fast foods. The food is cooked traditionally in an open kitchen and served on paper plates by the cheerful owner and staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMU9ydUVnEAE",
            "text": "This place is unique for reviews. It's an under cover outdoor filing chair type place. Great burgers and hotdogs. You can get fresh clams. The corn is absolutely amazing like it was soaked in butter for a week. You grab your own drinks and they will get the food for you. No reservation just sit anywhere you want. This place is an awesome last minute burger place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjVqcFRBEAE",
            "text": "It's been 35 years since I last visited Lenos, or as it's known to locals, \"Greasy Nick's\".  Great burgers and clams.   They no longer have ice cold cheap beer, which was a let down.   Was fun to be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNS1Qdmx3RRAB",
            "text": "Love the shrimp and fries.. just need a little seasoning like maybe some salt and pepper but other than that its pretty delish and they give you good portions!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdmVEc2l3RRAB",
            "text": "It's not the healthiest, but I had fried shrimp and fries. Corn on the cob was soggy, and I won't order again. For a quick fix, it was okay, but I won't be a regular customer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdWN2RUhREAE",
            "text": "Nice little hideaway to get some raw and fried clams"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMmN5SS1RRRAB",
            "text": "Love this place, only eat there when the father cooks, otherwise absolutely worth the trip every time. Excellent food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMjlhdzh3RRAB",
            "text": "Good hamburgers , good clams , good corn on the cob"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeTU2Nzd3RRAB",
            "text": "Love it here ! Everything is fresh and fast service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcm9fS1lREAE",
            "text": "Love how affordable the food is. Very relaxed vibe. Good eats."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaEpfWnJBRRAB",
            "text": "Awsome food.  Got the clam Fri with French fries.\nNicest people I ever met.\nI think it's Jay Lenos brothers place.  I love it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNThxTUVREAE",
            "text": "Nostalgia"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdEtfdUZBEAE",
            "text": "All the food is great. Steamers and a cheeseburger with onions every time. Say hi to Pat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcmNfSzJRRRAB",
            "text": "A local favorite. All was good, but the burgers tasted slightly different than usual"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dTZDWXNnRRAB",
            "text": "Place is special.\nYou better check the place.\nRecommended."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdHNMYXRRRRAB",
            "text": "Been coming here since I was little. Fishing and then burgers. Now I bring my son since he was little. He likes his burger and fries like mommy does!!!Grilled burger with onions. Fries with grill onions and a bottle of water.\n\nAn early dinner."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX01UaDNRRRAB",
            "text": "Love a quick bite at Greasy Nicks (local name). Cheeseburger with onions $4.50 & a huge corn on a cob $2.50. Other items on the menu and cash only.. Love love love"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDOHJMTnhnRRAB",
            "text": "The food is excellent. Fresh and tasty. Definitely a great alternative from City Island. Staff was wonderful. Will go back again for sure!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MHFIQXBRRRAB",
            "text": "Leno's  was recommended to me by a co-worker and said to have the freshest shrimp. I was not disappointed. The shrimp was fried perfectly and had a nice sweetness to them. This is a hidden gem with a simple menu done well. Can't wait to go back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbE56dXZRRRAB",
            "text": "Great place right off the road. It will always be Greasy Nick's to me. Decent prices and it's nice to sit outside and eat."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReDdHNEhnEAE",
            "text": "I've been coming to Lenos for 15 years and I love it. Nothing fancy, super casual great comfort food. Their burgers are simple but  delicious. A bit sloppy with grilled onions but I don't mind that at all. You can't go wrong with anything on the menu. The shrimps with fries basket is always a treat."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNkx1QUZnEAE",
            "text": "Leno's clam bar aka Greasy Nicks has always been one of my favorite little places to eat. I'm 33 and I had my first steamer there when I was about two. The burgers are amazing make sure you get the onions on it! The steamers and clams on a half shell never changed quality. I will be back real soon!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPd3NEakp3EAE",
            "text": "Great alternative to the fried fish joints at City Island. Leno's is a small no frills roadside shack. Outdoor dining (no indoor). Food is exactly what a clam bar should be - it is no surprise Leno's has been around so long. No alcohol sold, but you may bring your own."
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNm9EZTBBRRAB",
            "text": "I have been going here since I was a child when everyone referred to them as \"greasy nicks\" and they only had hamburgers. french fries. clams and corn on the cob.  I am almost always brought back to those days because the appearance,…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpaktQWXBBRRAB",
            "text": "Excellent quick in quick out comfort food spot. Leno's is fully compliant with CDC guidelines for COVID-19,  glass they didn't close down throughout this Pandemic , you can dine outside if you wish or grab your food to go . I usually stop by to grab lunch for me and my wife to go personally.  Shrimp and Clam Baskets are always fresh and crispy upon receipt.  \"Greasy Nicks\" (locals only understand) cheeseburgers are a must with any order. The team is very polite and will accommodate you the best they can.  They do request you wait at the front door for them to greet you and take your order in these current Pandemic times , PLEASE do as they say in regards to this, they come out right away and its four everyone's safety,  we need Leno's to stay open for many more years to come. Finally they are extremely reasonable priced and are cash only ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc1pQYl9BRRAB",
            "text": "I’ve been coming here since I was a little kid and have been to countless other burger restaurants and I can basically guarantee that these are the best burgers you will ever try. Staff are very polite as well and prices are very reasonable."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdWRIRHhBRRAB",
            "text": "Tables outdoors were extremely dirty. Trying to overlook that after walking there, I cleaned it myself. The food portions left us still hungry and we ordered a half dozen clams but they never came. I was disappointed.  After passing by so many times I hoped for much better."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrXzZQc3RnRRAB",
            "text": "Always great to dine at Leno's, Aka Greasy Nick's. Clams, burgers with grilled onions & the corn on the cob are good food at a fair price. An iconic landing place that feels like home for lower Westchester natives."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxN3BYeUF3EAE",
            "text": "OMG, super nostalgic, simple menu, for me, the Clams and Corn on the cob is a MUST! Staff was super nice and great outdoor seating - very old-school yet great experience! Can't wait to return!❤️"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbXBmNlJBEAE",
            "text": "I grew up in new Rochelle right access the street .As a young kid going with  my family and  even after college .\nIt was always the place to get the best bugers in town.\nThe owner is a great person alway remembers his customers.\nNow living is FL still can't find a good burger like there's .\nWhen we come back up north we always make it a plan to stop by and have a great meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdmJfSmR3EAE",
            "text": "First came here back in the 80's and a lot in between I felt  a bit nostalgic and was happy to see its still open...food is still amazing for a quick bite...and the corn on the cob is still the same Like back in the day.  It's worth the stop after fishing or orchard"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMk1TLWJ3EAE",
            "text": "I have been coming here since the 1980's. You cant get a better burger in New Rochelle. The corn is amazing! This is one of my favorite places to eat"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ejd6bHNBRRAB",
            "text": "It's a nice little place by the road.  The young staff serving were attentive and polite.  We enjoyed the food and the family atmosphere.  We will definitely visit them again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyN0l6N1BREAE",
            "text": "Had lunch at \"Greasy Nick's\" today. It's  been over 30 years and I still feel like it's officially summer when we eat here. I'm happy paying $9 here over Mc's every day. BTW, my partner had the fish sandwich and it blew both of us away. Who-da-guessed? Classic New Ro. Don't miss it"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4eHJqSnZRRRAB",
            "text": "Great alternative to City Island's piers. Fantastic tender fried clams. Friendly staff. Tables are spread out well. Hand sanitizers and masks provided, as well as clean bathrooms. Very relaxing setting."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbUtuM1NnEAE",
            "text": "Great delicious food❣️ Family Business. Cash only."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0cEpQaDFBRRAB",
            "text": "Whether it's clams, steamers, hot dogs, burgers & fries it's always a great meal when you come here. The corn on  the cob, onion rings and fried fish is delicious as well.  A classic place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdjV5Unl3RRAB",
            "text": "Love Greasy Nick's.  Had fried clams for first time. Big and delicious. Great clams on the half shell and steamers. Great outdoor dining."
        }
    ],
    "reviews_count": 68
}