{
    "name": "The Black Whale",
    "place_id": "ChIJHWzmi3iMwokRirDTbEIhX-8",
    "grid": "BX10",
    "address": "279 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.6,
    "user_ratings_total": 500,
    "phone_number": "(718) 885-3657",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReFFTMVlkMWxZVERSTWRsSmpNME5TUVcwNGVFRRAB",
            "text": "Kertle was a great server, food was great, fast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUmJUaERRMDR6ZWxwemRVSnRibUpQZDJOc2JuYxAB",
            "text": "Food was very good and atmosphere was lovely"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VVpGRlNTazk2VFRSWGJtUmZOMHhhT1ZscmIyYxAB",
            "text": "Good food, good service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUFozSTBWakZ0Ukdzd1YyeEJZbVpSYldsb2NGRRAB",
            "text": "The best plan for a beautiful Summer Sunday or all year"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUWRFdFZTWFJuVVZaTFVtUkNaV3BKYzJKUlVsRRAB",
            "text": "Wonderful eclectic atmosphere with open space in the back. Great service and delicious food. A City Island treasure! Looking forward to sharing the experience with friends and family."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTlpIQjRVbGh0V21oU1MwaDNaVWMwUjJ0eVVHYxAB",
            "text": "Would give it 6- stars if could. (Had brisket sandwich, crab+ corn soup, key lime pie.)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdGFtNWlNRFl4TlhSak1tazRRMXBqVGw5bVdsRRAB",
            "text": "Nice spot to eat when visiting city island. We had a great server."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZldHOHhjbTFWWmtNMVExaExaMlpYVG1Zd05sRRAB",
            "text": "I came here last night for my birthday with my friends. We had a great time. I called last minute for a table of ten then I changed my mind to sit out there. They were VERY accommodating. We loved the food, service, and drinks. The outside seating area is so unique. We’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa1JreEtlUzFYWWpGUVMwdGZSR2RyUmtNemRWRRAB",
            "text": "Nice cozy quiet family restaurant with gorgeous sea food and cocktails. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTFByUE83cE5TdElnEAE",
            "text": "Great spot for a nice upscale meal on City Island.  Good beer selection, great cocktails and food. (Made a reservation, so no wait)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUzF6TGprdFBLMXhRRRAB",
            "text": "Delicious, perfectly cooked, well prepared, lovely order taker, outdoor area and dimly lit quaint setting, highly recommended, intimate atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMGZuQnRBRRAB",
            "text": "Still the cutest and quaintest eclectic little Jewel on City Island. Been going there for over 20 years and their chocolate cake is to die for"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvd3VqUVlREAE",
            "text": "Once again everything was excellent.  Drinks strong, food capital and desert yummy."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtME9xdGNREAE",
            "text": "Great place. Good food and my favorite bar tender Curnel!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ZzhUR0JBEAE",
            "text": "Came here with my family. A bit pricey. All in all a nice experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc1lhc2p3RRAB",
            "text": "Wow! Back in time! A nice cozy place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNnRDUkZBEAE",
            "text": "I connected with the people there. Everyone was vibing and having a great time. The cooking was exquisite and tasty."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anE2bDZnRRAB",
            "text": "Beautiful spot with  an antique and vintage decoration  really beautiful… the food is  good and fresh my recommendation that you won’t be disappointed is the meatloaf…. The one that is not good is the steak but besides that is a beautiful and unique restaurant that worth the trip"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNWNyOVdREAE",
            "text": "Extensive menu with excellent food, super friendly service and the decor and cleanliness were top notch! We will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudEtfUk53EAE",
            "text": "Fabulous restaurant. Charming wait staff. Wonderful, boho vibe. Very generous portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmNxalp3EAE",
            "text": "Loved everything about this place..staff was so welcoming and friendly..espresso martini was on point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMkp1V2Z3EAE",
            "text": "These is a charming place for a date night or friend get together.  The ambience is relaxing, cozy and warm.  The back yard whiMISICAL AND CLASSIC.   I would give it a 5 star because I believe the menu could use a revamp, such as minus the starving artist plate, add some tasty dishes such as chicken frances or clams oregonati, and maybe some complementary bread with olive oil to dip as we wait.  For dessert  fresher, entire churros. like 4 pieces instead of 2 cut in half.  This place could really soar !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIelpHVGFREAE",
            "text": "One of my favorite places ever. Such a unique atmosphere, excellent food and friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdVlucXl3RRAB",
            "text": "I little greenwich village style cafe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3X011RTFnRRAB",
            "text": "Wonderful atmosphere, outdoors while away from street noise. Excellent menu; delicious food; first class, warm, gracious service. Our second August birthday dinner there. Will dine there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMzRibjJnRRAB",
            "text": "An absolute delight. The back patio is quiet and dreamy (consider bug spray on a summer evening). The cocktails were well-made, the mussels heavenly, and the fish is prepared with love. It was the perfect capstone on a City Island day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiakpLSlNnEAE",
            "text": "The ambiance alone keeps bringing us back.    Cocktails are clearly made by someone who knows what they are doing  and we always look forward to seeing what’s on the specials menu.  Want to play it safe?…angel hair bolognese or the meatloaf.\n\nThe garden is lovely during the warmer months, but the charm from the main room cannot be beat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyc3MzdVZBEAE",
            "text": "Delish food and great staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydDdPeXZ3RRAB",
            "text": "I ordered the grilled NY steak meal, having a taste for steak on my mind all day and boy oh boy, it did not disappoint. Compliments to the chef. The steak was seasoned throughout and grilled to perfection. Nice, tender, and juicy. The mashed potatoes and vegetables were seasoned and cooked well, too. I recommend this place if you're in the area and want to enjoy a nice meal in a peaceful environment"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXFyZE53EAE",
            "text": "Food is quite good, service is friendly and attentive and the outside courtyard is delightful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeDd1cU9nEAE",
            "text": "The BEST Dining experience I have had in City Island. Best Crab Cakes ever! The food is amazing!\n\nService and atmosphere are good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeHZYSWVnEAE",
            "text": "Love the atmosphere here. The food and the bartender are awesome!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNzVmQ3lBRRAB",
            "text": "Cozy atmosphere, meaning very small place. Think a living converted. In warmer weather there's an out door space at the back. Still warm cozy atmosphere. If you looking for an intimate setting this is it.\n\nIts a resturant so the food. For the price point.. on the fence. Guess city Island everything more expensive. Back to the food. The Salmon was good, the shrimp and  pasta.. for the price.. on the fence."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdlBXTkdnEAE",
            "text": "Possibly one of the most unique atmosphere's on City Island. Everywhere your eye turns there is something special to see. Great food, fresh ingredients, wonderful friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEME9PS2lnRRAB",
            "text": "I recently dined at Black Whale, and it was an absolute delight from start to finish. The moment I stepped in, I was greeted with a warm ambiance that instantly made me feel at ease. The service was impeccable; the staff were attentive, friendly, and knowledgeable about the menu.\nNow, let's talk about the food - oh, it was a culinary masterpiece! Each dish was meticulously prepared, bursting with flavor, and beautifully presented. From the appetizers to the desserts, every bite was a delightful journey for the taste buds.\nThe restaurant itself was a gem, with stylish decor and a cozy atmosphere that enhanced the dining experience. Whether you're looking for a romantic evening or a gathering with friends and family, this place ticks all the boxes. Without a doubt, it deserves a perfect 10/10 rating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MGRTNHdBRRAB",
            "text": "Compliments to the chef"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MXEtUF93RRAB",
            "text": "The foods are so bad! it is not tasty i feel like i eat cardboard!!!! Dont ever ever come!!! Hear me out and dont waste your time and money on here🤮"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocExLWlRREAE",
            "text": "Excellent! I luv it very much..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbVlIMTN3RRAB",
            "text": "Beautiful time with a delicious menu, friendly, warm and welcoming service.  Drove out for kids first meal on city island and it was a hit.  Our family eats wide range of food and all were happy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMnVydElBEAE",
            "text": "Great vibe. Old school taverna meets thrift store. Backyard was closed for the winter, can’t wait to get back in the summer to enjoy a couple of crisp beers there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MnQ2V25nRRAB",
            "text": "Hidden gem on city Island.\n\nThis restaurant has the best sweet potato fries I've ever tasted!\n\nUsually, sweet potato fries aren't very crispy but at The Black Whale, the crunch on both traditional French fries and their sweet potato fries are unmatched.\n\nThe restaurant has a very  rustic feel and the service is phenomenal. You're always greeted with a smile and a warm welcome.\n\nI haven't dined in, but it's usually not too crowded so you can expect to be served relatively quickly after beeing seated.\n\nHighly recommend their Penne Alla Vodka with Shrimp!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNkt1QW93RRAB",
            "text": "It's delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbC11eENBEAE",
            "text": "Food was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseFplVHRBRRAB",
            "text": "I LOVED the calamari.  The service was excellent. Wide variety of food and drink options. Their City Island Iced Tea was yummy. Although I wish they had space for a separate bar area, I look forward to dining there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseHQyTUF3EAE",
            "text": "Amazing food and amazing service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGX2I3QTB3RRAB",
            "text": "The food was not spectacular has hoped for but it was good. Service was excellent. I might try it again and try another dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGa1luNXV3RRAB",
            "text": "The islands local gem. Always great food, service & vino👌🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNjdEZnVRRRAB",
            "text": "A must stop on City Is.!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGOC1qWnNnRRAB",
            "text": "Excelente comida. El trato es excepcional\nEs un ambiente limpio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Z3Z6OWpnRRAB",
            "text": "excellent all around"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNX1B1WDNRRRAB",
            "text": "First time at this restaurant, service was amazing. The waitress was knowledge and very courteous! Her suggestions were spot on! Very cozy ambiance. My favorite dish was the shrimp pesto. Drinks were delish!Desserts spot on and cappuccino…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlektEN3hRRRAB",
            "text": "Wonderful experience. We got there as soon as it opened, a group of 4 people and we had a great service from the people that worked at the restaurant. The food took a little while to get to us, but we ordered the main courses that require…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXODVxeWh3RRAB",
            "text": "Updated review!!!!!\nThe  food was really good BUT they sneaked in a surcharge if you used a card that was put on a small piece of paper in the check envelope thing   They should have told us before we got the check if this is a new policy so I guess pay with cash when you go I love this restaurant but this wasn’t like this the last time I went which was like three weeks ago. Also when asked the waitress said to ask the owner about it who wasn’t there…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dThQQ0t3EAE",
            "text": "Such an Amazing Gem on City Island! The food is amazing, I highly recommend going in the evening and sitting outside, the ambiance is amazing. The Staff is amazing, and the food is amazing! This is a place where you will not regret waiting for a table.... The food is tasteful, made to perfection, trust me, not everyone knows how to make pasta! And I'm VERY picky when it comes to eating out as I am a chef! So I highly recommend this place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMGJlRWVREAE",
            "text": "I've been going to the Black Whale since the 1970s, and it's always a joyous experience, from the charming antique-shop decor to the yummy food to the transcendent desserts. One of the best and most enduring spots in City Island, for good reason."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoa3ZfdDlRRRAB",
            "text": "The most unique place with the best food and service! We love coming here through the year. It feels like a secret hideaway! They have a nice variety on the menu and usually have delicious specials as well.\nThe \"Starving Artisit\" is one of our favorite dishes and the muscles and clams appetizer, the seafood salad appetizer is also yummy and so fresh! We also love getting one of their big entree salads (cobb is my fav with steak on it).\nHighly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dmVHb1lBEAE",
            "text": "What a cool spot!!! So happy to have found this awesome restaurant with such excellent service. The staff was wonderful and very inviting, and the ambiance inside (and in their adorable back garden) = unmatched. Food was also excellent, and they let us sit in front with our dog (and brought him ice water!!) That’s how you stay thriving after 60+ years I guess. We’ll be back very soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaGV1ajlBRRAB",
            "text": "I simply adore this place and the service is impeccable the food amazing. Had the sesame seed seared tuna what mashed potatoes and veggies I was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NmQzeTF3RRAB",
            "text": "Dinner in the outdoor dining space was really nice. Good cocktails, fresh and tasty food, attentive wait staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbWRPWWtRRRAB",
            "text": "Cute ambiance restaurant. The daily soup Manhattan cod chowder was delicious. Lobster portion was huge! And we both loved the cheesecake."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMDZIRThBRRAB",
            "text": "I’ve given The Black Whale three honest tries and, unfortunately, each was lackluster. The last time I went I ordered the steak, mashed potatoes and vegetables. The steak tasted as tho it was boiled and maybe thrown on a grill for the grill marks. The mashed potatoes had to have been instant/out of the box, and the vegetables just taste strange. I am disappointed because I love the atmosphere. The food is strangely bad. Considering all the above, everything is significantly overpriced. I love city island and love supporting local businesses so perhaps I’ll try again in a year or so. I’m praying the food gets better."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacnUyMm9BRRAB",
            "text": "Eclectic small restaurant with great food & service. The New England Clam Chowder was light & ever so fresh!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPb3I3QXFBRRAB",
            "text": "Just celebrated my daughter’s 25th birthday at The Black Whale yesterday and had to write this review and let everyone know about this hidden gem on City Island. A small, quaint, quirky, magical, Alice in Wonderland like place that exceeded my expectations. Thanks to everyone at The Black Whale for making my daughter’s birthday a magical experience. I found out about this place by reading their reviews and they not only lived up to the many reviews I read; they knocked it out the park! From the moment I called to make an inquiry and spoke with the owners granddaughter Luna, I was sold! She was amazing from that first phone call to the very end of the night after we left the celebration feeling full and well satisfied. We celebrated in their courtyard out back under an eclectic covered patio, which was reminiscent of Alice in Wonderland! The evening was magical, the food fabulous and the staff amazing! Hat’s off to The Black Whale, their owner, hostess, wait staff, cooks and everyone who helped to make my daughter’s birthday a memorable one! Also a very special thank you to Luna, who is the Gem of The Black Whale. Please go check it out! They won’t disappoint!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZd3ZUY1dREAE",
            "text": "I love this place. The grilled chicken penne all’s vodka is so creamy! My other favorite dish is the Grilled Chicken Croissant with melted bite cheese over sliced Granny Smith apple with a side of French fries. Dig in!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVXzhpZlp3EAE",
            "text": "City Island treasure. All you can eat brunch was well done. Food and service were very good. Eclectic patio with interesting antique /  garage sale style. Cozy interior too."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRazR6UDdBRRAB",
            "text": "Great portions. ! Fish tacos super big, go hungry. They offer bread when you are seated so, dont order appetizers. Although the coconut shrimp and lobster ravioli were to die for."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvODRuRWx3RRAB",
            "text": "Haven't visited in years, actually decades, however this has always been a traditional place on the Island.\nAs I remember, the cuisine was always exceptional. I do believe, that they have maintained their premier excellence of deliciousness.\n\nPerhaps, because would always visit, with friends, after sailing around the island on our boats, (mine christened the Deep Blue Princess), searching for the great Whale.\n\nAges ago, all long gone, down to Davey Jones Locker, both boats and friends.\nWe were enormously ravenous for a hearty feast, after a long hard day on the water, matey. And this place always delivered the hidden treasure.\n\nPostscript : Anyways as the old marnier saying goes,  \"The second best day of your life is when you buy your first boat.\nBut the absolutely best day, is when you sell her\". 💙💜💙 Cheers Matey 🍺⚔"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdjVDb3pBRRAB",
            "text": "Just stopped in for dessert, the back garden is delightful filled with fragrant flowers and interesting antiques. Good food, good drinks, good staff = 5 *"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcDZqRTh3RRAB",
            "text": "Celebrated our Cardinal Spellman High School grad with family and friends today. Thank you Liz and Maurice for the red carpet treatment!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdk1McGlBRRAB",
            "text": "The restaurant is aesthetically pleasing & adorable outside. The food is mediocre at best."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MGVuN2dBRRAB",
            "text": "Always a fantastic place to dine in! Each year we make it a point to go, at least once for our anniversary. This year did not disappoint at all, in fact, exceeded my previous experiences. We had the special of the night: porterhouse steak…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMUoyeGNnEAE",
            "text": "What a lovely place!❤️❤️❤️,Awesome decoration,Romantic,Delicious food,Warm and outstanding service,cannot wait to go back,Thanks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbkliVmhBRRAB",
            "text": "fantastic experience Four of us arrived there as soon as it opened, and the staff members at the restaurant provided us with excellent service. We chose the main courses, which require more preparation and attention, so even though it took a little while for the food to reach us, it was well worth the wait because everything was produced in-house at the restaurant.\nWe got the salmon, meatloaf, weekend special, and chicken, all of which were cooked to perfection. The food itself was fantastic.\nYou can certainly enjoy a dinner with your family, friends, or a date at the restaurant because it is beautifully decorated and the environment is comfortable and attractive.\nWonderful experience!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bXFfYkpBEAE",
            "text": "I've been coming to Black Whale for years and always recommend it. The food is amazing, service is exceptional. It's a great date spot, especially when it's warm out and the outdoor area is open. I recently visited with a group of family…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzXy1YWF9nRRAB",
            "text": "Took some friends for the Sunday brunch on City Island in the Bronx, which was absolutely delightful.  Reasonably priced the buffet pretty much had more than I had hoped for.  If it wasn't there, they'd make it for you. Everything was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4LWVPelhnEAE",
            "text": "They food was OK atmosphere was nice, but they were severely understaffed and we couldn’t get anyone’s attention. Took forever to get someone to bring us ketchup or the check and they have a high (illegal) credit card fee and a card asking you still tip in cash. Feels like there is an owner that is really cheap and doesn’t want to hire staff and will break laws to avoid fees (and maybe is stealing tips if staff is asking to tip in cash???) either way if felt sketchy. I wouldn’t go here again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOEpLR0VBEAE",
            "text": "Used to come here many, many years ago when it just served Ice Cream. Beautiful place, great food!!!"
        }
    ],
    "reviews_count": 77
}