{
    "name": "Havana Café",
    "place_id": "ChIJYdXIy06LwokRIPXgdWwsd-8",
    "grid": "BX10",
    "address": "3151 E Tremont Ave, Bronx, NY 10461, USA",
    "rating": 4.4,
    "user_ratings_total": 3538,
    "phone_number": "(718) 518-1800",
    "reviews": [
        {
            "date": "수정일: 12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbUs2bnl3RRAB",
            "text": "I love this place! Momday night comedy is a must!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNlpVOUpiSEpGWjBZeFdUaEtSR0kxWlMxRFduYxAB",
            "text": "This place is so good!!! The vibe, food and service is Top Tier."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZal82WXJRRRAB",
            "text": "My only suggestion.  If you have 1 bathroom. COÑO !!! Make sure ya clean the bathroom every 2 or 3 hours . That bathroom was disgusting and the smell ufff. I told one of the guys that works there that the bathroom was dirty and he looked at me like he didn't care."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcllWRmZaMWxFYzNFeFJGWklZM1Z3TlhNemFrRRAB",
            "text": "The manger let 5 men fight 3 woman and a man…..they jumped us the police came and he  lied for the guys and hide them in the back of he restaurant…. Count ur days"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM1dEQnJjVEpvWVZRMFVEUnBSa2N3WjBKM1ZVRRAB",
            "text": "The total was 49, and after I left this morning I was charged extra 5 dollars for tip, what kind of madness is that? If I didn’t tip cause maybe serves wasn’t all that, that means just take a tip off ?? That’s wild"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weWVrZzRkRzFVV2tKZk0yNTRVMmx1ZGpOYWRFRRAB",
            "text": "I love the food here. Just learned they have daily specials. Mashed it even better."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdmFFWXRNR1kxYW5oSExYRk9iRWQ1YzFCVWNVRRAB",
            "text": "Had the salmon and it was delicious. The mojitos are dangerous lol. It was standup comedy night and I have respect for anyone who can get up in front of a bunch of strangers to perform anything. They kept topics light, engaged with the audience and it was overall entertaining. The music is always a vibe. Love this place!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeE5GbzFSMDVETkhKblFVazNZVmx2YkhoV2NWRRAB",
            "text": "Clean, establishment, good food and drinks. Friendly staff, nice location. Parking is dependent on day."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1RWWXlSaTFaVm10V1dqTTJVamhSVnpSTmIyYxAB",
            "text": "I absolutely adore Havana café; it's truly one of my favorite spots to unwind and enjoy a meal. The ambiance and general atmosphere of the café is simply amazing 👏, creating a perfect setting for relaxation. When it comes to the food, I'm always blown away by the delicious dishes they offer. One of my all-time favorite dishes there is the red snapper; its flavors are simply divine. Every time I visit, I'm greeted with a warm and inviting atmosphere. I highly recommend checking out this delightful café whenever you have the chance! #HavanaCafe #FoodieFavorite #AmazingAtmosphere #RedSnapperLove"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMFUxOWljMUl4VXpGdlRtcFJXREpuZG05T1lsRRAB",
            "text": "Service has gone down hill since last time I've been here, food quality is not the same and atmosphere is just not the same not sure if the Sunday i went was just off but definitely different from before I used to love this spot"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM01sZFZNRjlaWVZFeVkyZEtjMWhxT1dVMVoyYxAB",
            "text": "10 de 10 la atención , visite este lugar hoy con mis amigas de trabajo , una de ellas está embarazada y fueron realmente especiales , nos hicieron sentir muy cómodas y la comida es deliciosa, nos sentamos afuera y pudimos conversas a gusto y pasar un rato agradable , definitivamente regresaremos , gracias 🙏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreGQxUm1VRkI0WmtFNVNWQjRVVTgzWmtOT1JIYxAB",
            "text": "Incredibly delicious food!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S05EQmhiVVk1UmtWaWJteEpXV3RWYVVOMmRrRRAB",
            "text": "Good food. Great music (if a little loud to chat easily with dining companions)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taM2NEZzFjRVpDVjNOdWRqQTBjMXBwZFhOQ1puYxAB",
            "text": "We had a Wonderful time and the food and Drinks were amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdUxUaHliamxYWkV4UFZXNVFjVmhTYzFwRFEyYxAB",
            "text": "Amazing Cuban Cuisine!!!!! Top notch service and culinary experience!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SGIzcExTbXB2TTA5bU5tOVFNakI0VW5Sb2RVRRAB",
            "text": "Food was cold. Maduros were not sweet 😔"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd2VFRjZVRjlhV1RWaE5VMU9hVTFpTTNkVVMxRRAB",
            "text": "This restaurant is nice place to go to for after work, hanging out with friends and family, or just if you want to get something to eat or sit at a bar to have a drink. The music they play is relaxing and sometimes loud but you can still talk and have a great time. I recommend this restaurant 100%."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNGRtdzBNa3RMVkdwcFpGbDFUVk01VlZGM1gwRRAB",
            "text": "Food is always delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQmRFWmFTWHBDZEdGdGVrMXJNRmhUU0VobVFWRRAB",
            "text": "The service was amazing.  Its a bit loud but if youre looking for a turn up, this is your place in the evenings.  I enjoyed the food as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdFkxRjBUMmxoVG1oSE9WUnVVWFpZZUhsT1lrRRAB",
            "text": "Food is very flavorful and cooked to perfection. Drinks are good as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRlNubFNSV2wzYzB4R04zRnJkME5ZY2xsSVVsRRAB",
            "text": "There was a misunderstanding about the meal however Oscar (our waiter) accommodate the change. We were so satisfied with the meal. It was a sufficient amount and the service from the bus man to the waiter was professional and kind. Eduardo is very kind and pleasant. The ambiance it's rustic and trendy. I've coming here a while and still like it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSVVtd3hkR2RWTVV0a1h6Z3dXbmxNYVdzNGMzYxAB",
            "text": "It was really delicious. Vegan Paella was really worth getting  we shared it so it was anice amount of food. The fried Yuca also good"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toalpETXhTbTlPUlZWbWNuRnpaVUZVYkRkbmMxRRAB",
            "text": "Agradable y socila"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSmMwMUdZVFJqZDJ4WVYxbEhXbVpzWTFWc09FRRAB",
            "text": "I had a great experience here from the venue to the server to the guys on the front they were very nice helpful and attentive. The only thing me and cousin thought was for nearly 50 dollars for a plate of antojitos not once slice of limon lol that we agreed should have came on plate. Other then that loved this place ❤️❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdE1XeGZiMnhtWkdsTGFEaDNaRVZuYlhCS2NVRRAB",
            "text": "This is one of my favorite places bartenders are great as well as the food always some lovely ladies in attendance"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWk4wcFBTVEIzTkVwUldIbDRWamQzVFMxYVltYxAB",
            "text": "Mucha tristeza volver a ir y pasar lo mismo ! La Estrada un fracas y los trams y calamari’s fatales ! 🤦🏻‍♀️ 2025 y va en picada este lugar ! La mesera llegó a la mesa sin presentarse y duró una eternidad para llegar ! Los dueños deberían prestar atención por qué esto está en el vecindario y no es bueno . El trago sabía a leche cortada…"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preWNsZ3lZWEphWkhWMlRGUklabVJWUTE4eFpYYxAB",
            "text": "This restaurant is beautiful and spotless, creating a pleasant and welcoming atmosphere. The staff were truly amazing—friendly, attentive, and professional. The food was absolutely delicious, with every dish full of flavor and perfectly prepared. A wonderful dining experience overall!\n\nEste restaurante es hermoso y está impecablemente limpio, lo que crea un ambiente agradable y acogedor. El personal fue realmente increíble: amable, atento y profesional. La comida estuvo deliciosa, con cada plato lleno de sabor y perfectamente preparado. ¡Una experiencia culinaria maravillosa en general!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUWFFTnBNMEo0TUVFMlJEZG1PSEp1WVVWQ2VsRRAB",
            "text": "The food was really good, very tasty, and the atmosphere was charming."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZk1VVkpNa1JCTjFGbk4yUkVWMmxGVW1aQlpsRRAB",
            "text": "I placed an order on Sunday Aug 10 at exactly 12:00pm because thats their opening time right, I ordered a “COMBO” in any other restaurant when you order a combo you are expecting food to feed a few people because thats what a combo its about, apparently in this restaurant they lack of communication and the lady that took my order through the phone FORGOT to explain that in this restaurant a combo means food for one for even more money than what a combo can get you in other restaurants.\n\nThey had my husband waiting for more than an hour without explanation of what a combo meant, when we were expecting food to feed the family, he paid the $55 dollars that it was supposed to be paid and at the end “the manager” only explain to him that in this specifically restaurant a combo means only a side of rice and bean and whatever meat you choose for ONLY ONE PEOPLE. At the end they did nothing they returned the money, and we left up without food of course, with an Inefficiently explanation and not even an apology for the time wasted.\n\nWith this being said next time managers please train you employees better in order for the customer to get a good experience and for the customer to know what to expect when ordering, and also managers be more kind and helpful while talking to the clients because remember thats your job as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMmFFVlFVbGhHVlZWRE9XZDRiMDVYUmtONk5uYxAB",
            "text": "Drinks,  Food,  Atmosphere,  Music. All the good vibes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWlQwOWtja2RCVjJoYU9HOUZhRlpETFdGclUyYxAB",
            "text": "Love this place! Everytime I see Sue at the bar it’s a breath of fresh air. She is always attentive to her customers, stays professional, but always has a way to be personable as well. I always return!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNmRIaVNBEAE",
            "text": "Havana never disappoints. I haven't eaten here in a while, but  I had their cuban sandwich, which was a delicious and nice sized portion.  Will definitely be back in the near future."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOWZYLWVnEAE",
            "text": "Hi was here today, August 6, 2025. Food and drinks good. But they put the air on blast that literally your food gets cold within 5 minutes.  Not good and disappointing! We took the food home. Hope they read reviews and see this!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOclRXdFpibXhMY2xCUFF6SjZjWGx2VFhkaGRXYxAB",
            "text": "Clean, comfortable, and stylish environment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcU1XWnhla2MwUTJ0U2IzZ3dSRGx3UTBkdk1tYxAB",
            "text": "The appetizers & drinks were great! We ordered our entrees the we had an unexpected guest at our table which was a roach 😳 messed up the whole experience and I was looking forward to my steak & eggs!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObmIyTTRWa3BEUWxoWlRqQm9RVWhWZGxoWVduYxAB",
            "text": "Lugar muy bonito la comida muy rica ambiente muy agradable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV1NXcHdaMmhrTFhOSmEwdEZNSHBvU25NM2NrRRAB",
            "text": "I’ve been coming to Havana Cafe for over 10 years, and while it’s definitely changed over time, the vibe still hits every time. On my recent visit, the drinks were absolutely on point!! On point like a porcupine! The DJ kept the energy high, and the atmosphere was lively and fun as always.\n\nThat said, the food wasn’t at its best this time. The white rice was a bit hard, and there weren’t many steak options to choose from. Service could’ve been more attentive too.\n\nStill, the overall experience made up for the downsides. If you’re coming for the music, drinks, and a great night out, Havana Cafe still delivers. Just hoping they tighten up the food and service a bit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWlVuQmxRa1pMZW1saFZVZFFkR1JsYlRsNmFrRRAB",
            "text": "The place is great, the prices are excellent, and the service—the bartenders are the best in the world. But the place has no air conditioning; it’s like an oven, unbearably hot. You can’t even stay there on these hot days—I almost passed out from the heat. Honestly, I love this place and I go every day, but if they don’t fix the air conditioning, they’re going to lose their regular customers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWU1IaFRWRWR4ZURCWk9IWndaalJ3UlRCVVJWRRAB",
            "text": "Food is always good, (pastelon and spinach empanadas are my fave). Drinks are amazing and the music is soo good. It's been my neighborhood go to for years."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MWViek9BEAE",
            "text": "Very good food. Staff was great! DJ was great. Can't go wrong."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeWNqVnlTMkpYWlZod2RWRlVhbHBaY2s1VWIyYxAB",
            "text": "Outstanding service. We came in with a party of 10 at 3 p.m. on a Saturday and were surprised to see how lively the place was even during off-peak hours. Despite the crowd, we were immediately welcomed, seated, and provided with everything we needed — plates, utensils, water, and a full explanation of the menu. The staff was attentive and genuinely warm. Our server checked in regularly without being intrusive, always ready with drink refills and quick to respond to anything we needed.\n\nThe drinks were perfect. My ginger ale was crisp and well-balanced, with just the right amount of ice to keep it cool without watering it down. My kids loved their Shirley Temples — not overly sweet, and served with a fun presentation that actually made them ask for seconds. The cocktails were also well-made and strong enough to taste the quality ingredients.\n\nThe food was absolutely delicious. The *pollo al mojo* was juicy and deeply seasoned — the garlic and citrus flavors were cooked into the meat, not just poured over. The salmon was flaky and full of flavor, perfectly cooked with a sauce that complemented rather than covered. The *Palomilla steak* was tender and packed with authentic Cuban spices, one of the best versions I’ve had. The *arroz con pollo* was a hit with the kids — plenty of moist, shredded chicken and bold seasoning. My kids are picky about flavor, and even the teenagers cleaned their plates.\n\nI ordered a side of avocado and was pleasantly surprised by the portion — beautifully sliced and ripe, more than enough to share. The appetizers were incredible too — the *empanadas* were crispy and full of flavor, and the *chicharrón de pollo* was perfectly fried and seasoned. But the real standout was the *maduros* — caramelized just right, sweet with a perfect texture. Everyone at the table agreed: best maduros we’ve ever had.\n\nThe tables were clean and clearly well-kept. You could tell the staff took pride in keeping the dining area tidy and welcoming.\n\nAnd let’s not forget the live DJ! He added so much energy to the space without making conversation difficult. Great music choices that kept the vibe fun and upbeat. If you're craving flavorful, authentic Cuban cuisine with great service and a lively atmosphere, **this is the place to go**. I absolutely recommend it — especially if you're coming with a group. From start to finish, incredible!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twa2QxODFhVTFqUWtoclkyMUxUWEkwTlVaUlRVRRAB",
            "text": "Great experience my first time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podlJUSnRXbWs0YlhWdlgwTkZZMkZ0U3pGTldrRRAB",
            "text": "Great experience. We were with a group of friends, but the service was great."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRanJfb2lnRRAB",
            "text": "This is nice place to go too, you will love the drinks, food & local people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSVRYRnpkR1J2WVRaelEyZDFOMlpRWkdvNGJGRRAB",
            "text": "Havana Cafe hosted my Family's Repast and they did an Extraordinary job. Even though we arrived an hour later than the allotted time due to a major mishap at the cemetery, our VIP section was still setup and waiting for our arrival. The reception, hospitality and the service was exceptional. I would recommend Havana to all of my family and friends ‼️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQlRFSlZWM2RJVEY5c1VUZGFjRUZGV2xwTVRHYxAB",
            "text": "The food was really good, pretty quick but the music was the only thing a little too loud. i couldn't speak with my family and friends of how loud the music is."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eFNFMW9XVlpGYkZoR1JrNU9OSGx1VEVsak0yYxAB",
            "text": "Food was amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGJuZFljazk0VVdsWWQxbFZNRmxKYTNCZmQwRRAB",
            "text": "Service is good. Check-in process is always a mess. Drinks are great. My 1 star review is due to its loss of freshness of food. Calamari was chewy and very tough to chew. Chicken and rice  was not fresh. Food took too long, and restaurant…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ2VWUnhibVZwYUU1cFZucEdRazk2TTJZMFIzYxAB",
            "text": "Great food and drinks. Good atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toblptVXRWemxWYUhkcE5uTmFSMjA0VWxsQmNFRRAB",
            "text": "Delicious food!  Had the arepas.  Yum!\nWe're there on  Sunday noon in July...  Super noisy inside... There was a dj!\nNot our thing... We wanted to talk, so we sat outside.  90°, but was a breeze so was nice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQckhnTk8waE5UOElBEAE",
            "text": "5-17 - Bad Service / Flavorless food.\nBad Service. The place was empty at 3 pm on a Saturday. We had to ask for plates and utensils. The appetizers were brought to us before any plates or utensils. What are we supposed to eat with? The place was pretty empty, yet there was a lack of service for my party of 10. I had to wait a very long time to ask for a drink refill. No one came by every now and then to check to see if anyone in a party of 10 needed a refill or anything else.\nThe drinks were heavily water down and FULL of ice. I ordered a single ginger ale and it was 75% ice and 25% ginger ale. It was full of water 15min later as the ice melted quickly. The other drinks my family ordered was also an entire glass of ice with minimal alcohol beverage. The same for my kids Shirley Temple. They didn't even want anything to drink again it was so bad.\nThe food was very bland. The pollo al mojo was unseasoned. All they did was cook the white meat and then add the sauce on top after. The same could be said for the Salmon. It was also unseasoned and the sauce poured on top after. The Palomilla was the same thing, steak cooked without seasoning and the sauces added to it after.  My children did not like the Arroz con pollo due to the lack of chicken. 90% rice 10% very small pieces of chicken. And my teenage kids are good eaters and know flavor. I ordered a side of avocado to go with my meal and they literally brought me an entire plate full of a whole sliced up avocado.\nThe appetizers were much better than the meals. The emepandas were really good as well as the chicharon de pollo. These best part about our meal were their Maduros. Everyone agreed was amazing.\nI would not recommend coming here again unless you only ate appetizers and maduros.\nThe tables were all very sticky from overuse and years of improper cleaning.\nThe best part about this place was the live DJ and his music.\nAvoid this place if you want authentic Cuban food or drinks. And no, im not sorry for my detailed post.  They need to do better."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNktvNnE0bHZQcXFnRRAB",
            "text": "hay un poco de música y el aire acondicionado estaba bastante frío pero la comida nos ha gustado muchísimo, las porciones eran muy ricas y deliciosas!!\nlooooved it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcXFLZW5BRRAB",
            "text": "Wow this place was great just the perfect spot for our anniversary, we had such a wonderful time and the host and our waiter were extremely professional and very polite. We definitely recommend this location. The food was superb it reminds me of my home country food (Dominican Republic Food) very similar. The price was definitely right too, you can't go wrong!! The atmosphere was pretty awesome and quiet we both really enjoyed it very much! Hope you guys enjoy my pictures!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c09UdVRREAE",
            "text": "We came in on a Tuesday night.. and it was hopping. Dj spinning, people dancing.. the food was great. It's a little pricey but we enjoyed it and we loved the rum Manhattan cocktail."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLLWF3ZEdldWZpSVpnEAE",
            "text": "Stopped by on a Thursday night. The service was reasonably quick and the food was outstanding. To reiterate—the food was AMAZING! I’ve had Cuban food in Cuba and Miami, and this place is a top contender. However, the music was extremely loud—so loud it was hard to hold a conversation, especially given the small size of the restaurant. It felt more like a club than a restaurant. The atmosphere is what cost a star. Maybe if I went earlier in the day or week, it would have been more enjoyable. I would’ve easily given 5 stars if the music volume had been cut in half"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VObWg5NjYtbWVqdTRBRRAB",
            "text": "Vibrant place and variety of South American dishes! Staff was food and welcoming 🙂"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaDdqbHpBRRAB",
            "text": "Yeah basically the bartender Melissa got me hella drunk cus she saw I was 22 years old also made the comment, \"you can be my daughter she was born in '03\". I usually get this comment a lot from older folks and I typically don't have an issue it's cool I just brushed it off with a smile. So, I was charged 80 dollars for 1 entree which was a chicken quesadilla and 4 drinks after saying one of the four drinks was going to be on her yeah she actually lied about that just to get me pissy drunk and im sure if her manager was breathing down her neck she wouldn't even think to make such an inappropriate comment to \"someone who can be her daughter\" mind you im a whole adult and a whole paying customer at that. I'll never come back because I felt like she didn't care about my well being after I TRIED to deny her from getting a fourth drink I was just trying to end my night off with an espresso martini as a \"dessert\" she just had to push for a second espresso martini for me to consume and it just gave she only cared about the money I was so willingly to spend because I was so wasted lol.\nSo she gives me the second espresso martini and then just gives me another cup with the left over from her shakers (this is when I caught on to her conniving ways.) (Food was excellent tho, will probably order to go next time, and avoid the bar entirely yeah it was a big no for me if I can give it 0 stars I would experience was actually awful.) Melissa is just overall a shady character and doesn't care to make any of her guests feel comfortable, (side note: her drinks were hella strong, so that's when I knew she didn't give a crap, should have tipped her nothing honestly.) Ambiance was annoying and loud holy cow!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeEpXWFVREAE",
            "text": "First time here. It was fairly busy but the service was good. The food had good flavor but my chicken was a bit overcooked. They had a DJ that night that played good music but unfortunately they sat us right next to a speaker which made it very difficult to hear and was way too loud to enjoy our meal. Overall it was good but not the typical Cuban restaurant I'm used to in Miami."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeFpMS0xBEAE",
            "text": "We celebrated or Sistha Wendy Bornday. It was a party of 18 people. The drinks could have used a bit more liquor in it. The food wasn't that great, I had the Pernil, and it wasn't tasty at all. I guess it was a rush because the party was so big and people had different meals but they could do better. It wasn't worth what I paid. It's a no for me next."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeVBLUU1BEAE",
            "text": "I was visiting The Bronx for a very special family get together with a large group and we stopped here at Havana Cafe I have to say first of all I was greeted by the manager Apollo who was extremely courteous and professional and went above and beyond to make sure our special get together was one of a kind to remember.  Not only did he take care of us and sat us outside where we wanted to sit but when the rain came down he immediately addressed the issue and without hesitation in a timely fashion sat us inside as soon as the availability became available. He continued to come by and made sure we were fine. The server Daisy also went above and beyond and was constantly checking on us. On top of all of the great service the food was excellent from appetizer to dessert very good quality everyone enjoyed. So a big thank you to that team that over there and the cooking staff. Thank you Apollo."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeU9MYl9BRRAB",
            "text": "Place was so nice! Love the atmosphere. Everyone was pretty cool and accommodating. We decided to sit inside but before ordering I was feeling a-little uncomfortable with the choice of sitting inside since it’s been awhile since I had to sit inside with other people so I asked to sit outside and there was no problem with us doing so which I really appreciate. Our server was very nice, Leo ( I believe was his name)  was very patient with us. The food was really good too. The only issue I had was one side of the steak was abit burned/charred but it didn’t take away from the good flavor of the rest of the food and I actually didn’t complain about it because I was having a good time so I don’t even think they knew so I’m just going to let it be but I’m sure if I brought attention to it, it may have been sorted out without a problem. No biggie."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNOXNianBRRRAB",
            "text": "I love this place. The food is so good! And the sangria is the best. They have different flavors... Customer service is great. And the presentation of the food is good as well. I came here w my baby and they accommodated me well. Had high…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLXBPWXV3RRAB",
            "text": "I went for a late lunch with my best friend to celebrate my daughter's 32nd chapter in heaven. It's a lively restaurant even early in the day on a Friday afternoon. The ambiance is chill, with Latin music playing in the background- not so loud that you can't hold a conversation. The menu is plentiful and mouthwatering. The food does not disappoint! We both had the pollo guisado special. I had the white rice with maduros and my girlfriend had yellow rice with maduros & aguacate. For appetizers we shared bacalaitos.\nIt was very different from our typical Puerto Rican bacalaos but then again, we were in a Cuban restaurant.... The service was great. I enjoyed a virgen Piña Colado & she enjoyed a Tito something or the other lol.\nNeedless to say we both give this place two thumbs up! I will definitely return when I visit from Texas."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MzlXSVpREAE",
            "text": "This is my first time dining in. The crowd is trendy and mature sprinkled with a few families. Baby friendly but the music volume may not be good for a small child. Isabella was an awesome waitress! She was knowledgeable about the menu and drink options. “T” took over when Isabella left. He’s a personable and spirited young man. The roast pork wasn’t as tender as the one I had at the Castle Hill location but is served with tasty coconut rice. The bacalaitos are shaped like small alcapurrias but tasty with or without the sauce. I really like their garlic sauce as well. The ribs were great. The sangria was bangin’!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaXF1cHBRRRAB",
            "text": "Great food! Great pricing. So fun. Warning, if you don’t like crowds and loud noise stay away. This energetic vibrant atmosphere is not for you. Staff are on their toes and your food and drink delivered with flourish and a smile. Live band on Thursday evening made dinner and after-happy-hour crowd very happy. Clean, Unisex bathrooms and real close seating make this restaurant feel like a very large family gathering of boisterous and very diverse family members. Their mojito game is strong!!coconut is my fav until summer when passion fruit is the must have. Not really for family dining with kids nor a romantic dinner on Thursday evenings. Good first date venue because there is so much distraction happening to provide great conversation starters."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbTdTelB3EAE",
            "text": "My first time here; Our waiter Peter explained the menu in full detail to us, and guided us as we made great choices. For me its very rare I go out and get great drinks. These drinks were not watered down at all. As far as the food' the…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cmRTbjdnRRAB",
            "text": "Nice little tucked away spot in the Bronx. The atmosphere is very Culturally Cuban so it makes you feel like you are somewhere else, nice escape.\nGreat Brunch menu.\nWas able to have unlimited Sangria's for $8 for 2 hours.  Can't beat it. Wait staff was very pleasant and accommodating.  I would definitely venture to this location again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSFRHaE5URFZ0ZFMxVVdrTTNNMHBTVUUwelJrRRAB",
            "text": "If you are a young adult this atmosphere is right for you. If you are an older adult that want to come to a restaurant with calm or no music and just enjoy your food and talk to you mate or friend do not come the music is tooooooo loud. You will not be able to talk or hear a thought in your mind.  The fish I had is tough and the broccoli was tougher. It is not worth the money if you are not looking for club life in the early afternoon. The DJ was good, but too loud for my taste."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMi1tb3FnRRAB",
            "text": "We had a wonderful experience at Havana Café!  The food is absolutely amazing, fresh, and served quickly.  The wait staff is pleasant, friendly, and attentive.  The ambiance of the restaurant is nice and the music sets the mood.  We had a great time and definitely will be back to try the rest of the menu!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodFNYSnlTRWxPYWxoQ2RUWTJUSEZWUldwck4wRRAB",
            "text": "I gave the food a 3 because it needed more flavor to it. Also the drinks wasn’t as strong like I thought it will be I had about 5 drinks and still was sober. Atmosphere was ok could have been a little better."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNDZiR2lBRRAB",
            "text": "The restaurant itself is pretty neat. Love the dark atmosphere, makes for a nice romantic lunch or dinner. Outdoor dining as well is amazing amazing did a great job with their set up.\n\nThe food itself was pretty good too. I ordered the Vaquero steak which came with green beans and  I believe mashed yuca. It was cooked perfectly. Would eat here again for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbnZHcU9BEAE",
            "text": "The DJ was great, interior is nice, but the food is mediocre at best. Drink was also too limey. Details:\n\nOrdered mahi mahi and salmon dish.\n\nMahi mahi wasn’t seasoned or marinated so it was very bland on it’s own. The salmon was too fish-y, it needed at least some lemon on it. I wouldn’t be as harsh if it were less expensive. At this price, I expect a lot better."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxME8yX1BREAE",
            "text": "Great food, great vibes. Happy hour is the great although the drinks are not as strong before the pandemic. Happy Hour Sangria, Mojitos and Margaritas are always good - a little bummer that the speciality ones are no longer on happy hour.…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJdVNsN21mbHNXNFpBEAE",
            "text": "My wife and I decided to come to Havana Café to have a drink or two. She drinks piña colada and I offered us to try this spot because the pictures of the drinks looked very appetizing. I would like to first say that the staff there is great. They are very attentive to the customers which I appreciate. The food and the drinks were not. My wife had the piña colada that had no flavor to it I had a drink that had Hennessy in it and that was good. I ordered the calamari and it was very chewy and felt like it was taken out of the fryer a couple of minutes too early. She had the fried chicken and we both agreed that tasted very well. The piña colada, which was the reason why we came was so much of a disappointment That we had to send it back and she ordered the same drink I had. As far as a calamari being that it was chewy and thick, I’ve never had a fried calamari be so chewy. We didn’t want a chance of ordering something else and not liking it But I kind of was fully which way from a previous meaI had earlier in the day. As I stated before, the staff was wonderful they are very good at what they do so I’m definitely not knocking them. It’s just the food and the drink was a little underwhelming. By the way, my wife didn’t really care for the chicken even though I thought the chicken was decent"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBXzZ6cDZBRRAB",
            "text": "Great tasting food, everything was delicious. I love the large portions from appetizer to the drinks, everything is way larger than the average size plates you'll normally get. The prices are very reasonable and fair and the service is one…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldHJEdThnRRAB",
            "text": "You want some great food?! We traveled from Uptown Manhattan to get to this gem. Great food, great music, great atmosphere. We came on a Sunday morning and it was already happening. Our server, Tano (who is also a musician and singer) was amazing! He was caring and just spoke to us like if we were family. Highly recommended for the food, the atmosphere, and the staff. Ask for Tano! He’ll take care of you."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDdUppOUNBEAE",
            "text": "10/10! Came here on a whim tonight. I’ve been here before for brunch 3 years ago which I also recommend. Because of Covid they aren’t taking reservations. I waited about 30 minutes for a table. My waitress was Jessica. She was very…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RlgwSjRiSGcxTVRKdllWTndiVWg0UkhCV1ptYxAB",
            "text": "Very nice place, sometimes the music is a bit loud but always good dancing music"
        }
    ],
    "reviews_count": 78
}