{
    "name": "Da Franco & Tony Ristorante",
    "place_id": "ChIJ7WHfHVKLwokRGB9Q__vhY18",
    "grid": "BX10",
    "address": "2815 Middletown Rd, Bronx, NY 10461, USA",
    "rating": 4.7,
    "user_ratings_total": 403,
    "phone_number": "(718) 684-2815",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25admFEaExVRE5NUWtwWGNtWnpPVlJSUW1oMVJGRRAB",
            "text": "Best Italian I know of in the area.  My usual spot when in the Bronx.  Class all the way.  Love it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocVMxbzVaMmxHV1hveldtdFpOR1ZrZFRrMmRuYxAB",
            "text": "Been coming for years. Never a bad experience. Gracious servers."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRlUwc3haa2RLTW1KeGRqUmpiVzFHTlRrdE9IYxAB",
            "text": "I have hosted several parties here and the food and service is always amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WS2JHeFpXbWhuVmpCVFNYZG1TRmMyWVZwblVFRRAB",
            "text": "The best food and all the waiters are so attentive and kind. Love this restaurant in country club"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVlRIUXphMnhFTnprd1RtRnNORlZtYzFVd1ZYYxAB",
            "text": "An exceptional place to dine. Great service, good selection of wines, delicious specials (arugula salad, mango, cranberries, and fried goat cheese), veal with porcini and cognac sauce  (mouthwatering twists better than  veal Marsala-), linguine con frutti di mare (scallop, shrimp, squid, fish) a very hefty portion with delicious light  tomato sauce, bread appetizer on the house (homemade bread and eggplant relish- yummy). Completed our dinner with Chianti Classico Riserva, ending with pistachio cheese cake (so scrumptious), cappuccino and amaretto (on the house). We will definitely be back here again when  in the Bronx.  Alexa was our attentive and informative waiter."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV1RrVnllVm8wYmxGU2VtaEZVV0pWV21SRFEzYxAB",
            "text": "The perfect place for a private party. Package prices were on par with the area and the food was delicious and plentiful. Service was top notch, they understand true hospitality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNlUyZ3pMVlIzUVZWQ2FFTk5NRUV5WlVWVFZrRRAB",
            "text": "Great food and service. Parking is an issue."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYnVnOW1uNE96c2VnEAE",
            "text": "Excellent lasagna.  It was delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNU1VxNGVNdmZ1a2VBEAE",
            "text": "Went here for a small family wedding dinner, decided just to stay in neighborhood, food was subpar quickly prepared and brought out, everything was rushed, before you can finish the apps they were bring out the main course could barely have time to have a conversation. Seems like they just wanted you in a out, spent a nice amount of money just to be rushed out, it was after wedding dinner you think for the amount of money being spend they would off a glass of wine on house. Desserts were terrible would not recommend this place if ur looking for good Italian food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b0xUeFlnEAE",
            "text": "Excellent Iranian comfort food. Traditional dishes,  great portion size Great service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReEotT053EAE",
            "text": "I highly recommend this restaurant! Food was 10/10, customer service was pleasant and my favorite part of my meal was the delicious house made tiramisu. The owner checked in on us and seemed genuinely friendly. Me and my partner had a pleasant and overall lovely experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN0xEbGlnRRAB",
            "text": "Terrible service!\nMy wife has food allergies to cheese which we stated when we placed the order. I picked it up and asked the guy if there was any cheese on the pasta because my wife has an allergy, again he assured me there was not. 25 minutes to get home with traffic and sure enough there was grated cheese in the pasta. Thank goodness she noticed and didn’t eat it. We called and the guy was so rude and said they would not refund. I have been a customer for over 15 years, I will never go back or recommend again."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0eC03VzJ3RRAB",
            "text": "Great local eartery"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOGQ2TWt3RRAB",
            "text": "Service is great and the food is very good."
        },
        {
            "date": "9달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMHFiUFdREAE",
            "text": "服務親切的餐廳"
        },
        {
            "date": "9달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd2ZPY0hREAE",
            "text": "Beautiful, quiet spot. Take your lady there.. My family was treated right...Un ringraziamento speciale a Da Franco.. Grazie mille per il super servizio alla mia famiglia. Saluto."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcGJ1R2lRRRAB",
            "text": "Friendly service, good food. Never disappoints."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbGF1RGtRRRAB",
            "text": "Best food best service best staff"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbU9xTmNnEAE",
            "text": "Food and service amazing ! The olives are a bonus"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbE5mXzBBRRAB",
            "text": "The house chard was good, the food was delicious, except for my  filet of the sole was dry and overcooked.   My two guest said their entries were delicious.   They had the gnocchi and the ravioli."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMHBPNDRBRRAB",
            "text": "Amazing food, amazing service & a nice and quiet atmosphere. Deff will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeU1Iak93EAE",
            "text": "Favorite spot in the Bronx. Without a doubt the best Italian food! And the staff is wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbEpiOWNnEAE",
            "text": "Beautiful atmosphere.   Delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcUkzOFh3EAE",
            "text": "The food was horribly bland. Stuffed artichoke had no stuffing and no flavor. Duck breast the skin should be crisp there's was soggy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3Z18yMm13RRAB",
            "text": "I attended a surprise birthday party held here and the food, service, and atmosphere made a very happy occasion that much more special.  The appetizer arancini was the best I'd ever had. The salmon in mustard sauce was cooked perfectly.   Personally, I have never liked Tiramisu, but here it was amazingly good. I tasted it, not expecting much, and was pleasantly surprised. I would definely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aXBUa1R3EAE",
            "text": "A hidden gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbE5IUTBnRRAB",
            "text": "Traditional Italian food. Food was great and staff were great too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOEtmM2tRRRAB",
            "text": "Consistent great food and service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREa3VXN0RBEAE",
            "text": "Friendly, polite, welcoming atmosphere, good food!\nGreat for family events!\nThank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZzVDTmt3RRAB",
            "text": "Very good food in a friendly atmosphere!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeWY3bU9REAE",
            "text": "DaFranco and Tony without a doubt is the best Italian\nrestaurant in the Throggs Neck area. The food is delicious. Everything on the menu is awesome! True authentic Italian food. Great ambience and professional staff. Definitely worth the trip!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcFo3NHZnRRAB",
            "text": "Really good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeGVIeHhBRRAB",
            "text": "Great italian food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMmNHSmN3EAE",
            "text": "Great food Great Service Love the Atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb2V1RnNRRRAB",
            "text": "Food was delicious and the service was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcl9Qb1BnEAE",
            "text": "Fantastic service. Delicious food. Wonderful ambiance. Perfect in every  way. Thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWME16NDlRRRAB",
            "text": "Best Italian food! Great service and the staff makes you feel like family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURscTVqajRRRRAB",
            "text": "Great atmosphere and great service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aklLdGNBEAE",
            "text": "Really good food.  The seafood risotto and seafood pasta were great, made with really good ingredients. The risotto had lots of saffron too!. And that fig tart was so, so good\n\nAlso the restaurant has such a great, neighborhood-joint atmosphere. The waiters clearly knew the clients, greeting them personally.\nAmong the best Italian-American restaurants I've been to recently."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eUxITHl3RRAB",
            "text": "I love this place! The food, ambience, flavor, and lighting is amazing. It felt very family-oriented. The food is extremely fresh and hot. Alex is a gem! ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaczhYUVVnEAE",
            "text": "Unbelievably good red sauce Italian food in the Bronx. Everything a place like this should be!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabmV1SmhnRRAB",
            "text": "The food was pretty good eggplant parm was cooked well. Other guest were extremely loud"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaM0x1QTNnRRAB",
            "text": "Excellent food. Excellent service. Great drinks!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwb2VUUmhnRRAB",
            "text": "Small and cozy. Was looking for a quick bite after work, and found it and then some.  Quiet atmosphere even as more customers were coming in. Ill def be coming back to the bx to this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDhqTTJRRRAB",
            "text": "The only good Italian restaurant in the neighborhood! Always consistent: the food, the service is excellent! They have great specials every day too. Love it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M2VMNFFBEAE",
            "text": "I went there with a friend, I liked very much the way I was treated with courtesy, attentive the ambiance is great & the food is delicious 😋  but don't take my word for it, go & check ✔️ it out for yourself. 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Z3EzbFlBEAE",
            "text": "Enjoyable dining and atmosphere. Check it out."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdEttWEZREAE",
            "text": "We stopped by because we were going to get pizza from next door but saw the restaurant & decided to get a meal. The clams oreganata were very good the sauce was watery but tasty. Chicken & veal parmigiana were very good, tender and sauce…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheDR6YlNREAE",
            "text": "Great food and Spectacular service!!!\n\nWent here to experience a hearty Italian dinner and was not disappointed. They have a great selection of Italian menu item that will surely fulfill your heart’s desires.\n\nI started my journey with their fried calamari. This marvel is heaven in every bite. The calamari is soft, buttery and flavorful. I’ve never had one this good in a long time. Dip it in their marinara sauce, and you can call it a night.\n\nBut the night doesn’t end yet, I ordered pasta carbonara for my main course and creamy pesto. Both dishes were superb. Each bite gives you comfort and satisfaction.\n\nCome visit this gem of restaurant in Middleton Road, the Bronx and experience their greatness"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwb3JIT013EAE",
            "text": "listen to me, the best in newyork . I order the lamb chops, sauteed spinach, angel hair pasta , carrot cake , etc.....I'm always there❤ I'm totally in love with that restaurant.  I can eat there every day and don't tired 🙌 more than 5 star. I give it 100 star 💥…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLczVEOGNnEAE",
            "text": "11/10. Spectacular food, service, and atmosphere. So welcoming and so kind."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMDk2aUVnEAE",
            "text": "My family and I were celebrating two special occasions on March 25, 2022, my son's birthday and his engagement to his now fiance.\n\nThe owner was very friendly and attentive and so was his staff. They also allowed me to bring in some of my own decorations for the table and stored the cake for me until the time was right. The restaurant is small but beautiful. As for the food, every course was delicious and served in a timely manner. The server was attentive in making sure we had everything we needed and our glasses were always full. I definitely will recommend this restaurant to anyone who wants a good meal,  friendly servers and a nice ambiance.\n\nThank you Da Franco & Tony for making this special evening memorable."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNzc3VjchAB",
            "text": "Nice ambiance. The staff is incredibly friendly. The food was absolutely delicious. We ordered everything from the specials, and we were impressed. The creme brulee and espresso were a perfect way to end dinner. I was also shocked that the specials were so reasonably priced. Truly a gem. I can't wait to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdmFXenhnRRAB",
            "text": "Parking is a challenge. Our table was in the back portion of the restaurant, right next to the outside street underneath the el. It was LOUD. Halfway through our meal, we were offered a table in the front but it wasn't worth the hassle. If you go via car, prepare to circle for parking for a while or to walk for a bit. Request seating in the front of the restaurant. Food and service were excellent, though, and I would go back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJd095UUp3EAE",
            "text": "The food was very good. Their bread was delicious and was always hot when it got to the table. The wine list was good too. We had a 4 o'clock reservation. At that point the place was almost empty. By the time we got food it was packed. Reservations are a must.  Surprisingly good coffee."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdHJhTkx3EAE",
            "text": "Frank the owner is so polite and welcoming along with Mario being an amazing server. He remembered how I want my Chicken  Francese prepared from over 3 years ago. The food quality has always been top notch as well as the service. My favorite Italian restaurant in the Bronx!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dnVDYzNnRRAB",
            "text": "I have been here four times now and every time the food has been great, the service courteous, and the atmosphere pleasant (exception for some loud customers).  I'm a vegetarian, and there are three non-salad choices for entree, and an…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMHZfZ0xBEAE",
            "text": "My family had dinner there last night (Saturday-1/22/22)- my husband and I love this place- really good Bronx Italian Food! Great service- the chicken parmigiana , eggplant parmigiana and stuffed pork chop were delicious - cannoli and cappuccino- delicious. Great food, service- NOT expensive- definitely worth a try"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMWMtWXJBRRAB",
            "text": "The best Italian restaurant in the Bronx. The staff is like family. Very accommodating and they get out of their way to assist. I’ve been there for dinner with my son who is Autistic and they accommodate him in a special table without…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMHY3MFV3EAE",
            "text": "This restaurant is a little pricey, with that being said it's some of the best food I have ever had. The waiter was great and the food was amazing! It tasted delicious with good portions and I will definitely be going back as well as recommending it to friends and family."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNzd5V1lREAE",
            "text": "I went to this restaurant twice in a week.  Each time the food was excellent and the service top notch. While the menu looked intriguing, when the servers described the specials, one of them sounded too good to pass up. Good sized servings but not so much that you wonder who else is going to be eating off your plate. Also they were not so large that I regretted getting an appetizer. The people I went with each could not stop raving about their entre. Expect  to walk out paying about $50 per  person. But absolutely worth it. One the more interesting things about Da Franco and Tony is their background music. They play what sounds like 'Hits from the 70s' Pandora station. I enjoyed that a lot. Just not at all the kind of music I would expect."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX283TWd3RRAB",
            "text": "Food is amazing. Service is amazing. Prices are very reasonable. There were four us we had the ribeye, lobster, scallops/pasta, a few appetizers and of course a few deserts. There is nothing to change or suggest about this place, except get it while the getting is good. Soon this will be one the city's best known places."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvb2ZyNnJRRRAB",
            "text": "I can not even find the words to describe my experience here. You know how often, when you set an expectation for something, it's usually never met? Well, the restaurant Franco e Tony has done just the opposite. It was amazing. Incredible in every way possible, from the moment you enter, you are treated like a king. In addition, you will be treated like a real guest, as if it were someone's house. The waiter / waitresses have their own art with the way they communicate with their guests, which is impressive when viewed alone. And then there is the food, which is nothing short of perfect. The flavors of each element work together incredibly well and look fantastic as expected. I am by no means a food critic or even so much expert when it comes to food, but I would highly recommend booking a table here, if you ever have a chance, you really will not regret it. I really hope I can eat here again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaDlDWkJBEAE",
            "text": "Made reservations for 6:45pm. Got there 10 mins early, and they had the table already prepared. The experience was excellent, from the hospitality and delicious food. Very welcome treatment. Plus there was parking in the neighborhood so that a plus too. Definitely recommend it and am going back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0eWVMNkRREAE",
            "text": "Came with friends for a graduation  lunch. Did the prefix meals. Not going to say that the food was bad but as I mention to the other guest in my party and looking at what they order I somewhat correct by saying that they kept the food…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbzZTMl93RRAB",
            "text": "Went today to have dinner with the family, first we ask for arancini, it was cold and taste like old rice, no good at all, orden the eggplant parmiagiana, no taste at all, cheese was really chewy. They replace the arancini with a octopus and the dish taste burn, horrible experience to be our first time going to this restaurant. We inform the waiter about the quality of the food and he ignore us, we will never return,"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaHRLTTR3RRAB",
            "text": "I’ve been coming to this place since it opened. The food is amazing. You can’t get better service anywhere else. It’s cozy, great ambiance and the best wine."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwME5DUmNBEAE",
            "text": "Cozy place (dress up or casual is ok) but the food took a very, very long time. It was a Friday evening. The shrimp in the shrimp and risotto was a bit chewy and not much flavor. The desserts were fabulous and had lots of flavor. Our party tried the apple crisp, creme brulee, and other desserts."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNGZXZDJnRRAB",
            "text": "The food was delicious.. we went to have dinner as a family and we all tasted each other's food and all we kept saying was WOW this is so good. Appetizer awesome, main course awesome. Risotto, veal, alfredo.. stuff clams, seafood salad... yum yum... we would definitely come back, food was hot, service was great."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMjlubGtBRRAB",
            "text": "This was our first time dining at this restaurant, I can definitely say that it was a great decision.  We were greeted warmly upon entering the restaurant and were promptly seated at our table.  I recommend making reservations as it can get crowded during dinner rush hour.  Tony, our waiter, was very friendly, helpful with menu recommendations, and was very attentive.  The restaurant has a robust wine list and the chianti we chose paired perfectly with our food.  Our food was absolutely delicious, flavorful, and cooked to perfection.  When it came time to dessert, there were so many items to choose from.  We decided to go with the pistachio cheesecake.  It was not overly sweet or too dense.  It paired perfectly with a nice double espresso.  We finished off the evening with a nice limoncello as an apertif.  I highly recommend Da Franco and Tony...we will definitely be dining here again!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeWZxRDlnRRAB",
            "text": "This is a halfway meeting point for my college friends (from Westchester area) and myself (from Suffolk county) to meet for dinner and I have to say, it never disappoints! The food is consistent, the service is impeccable....and they have…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBaVAyTVh3EAE",
            "text": "Even though we live in Westchester County, We recently catered food from Da Franco & Tony.  We ordered 7 trays of food and it was absolutely excellent! Frank is very personable and flexible with the menu. His prices are reasonable and the…"
        }
    ],
    "reviews_count": 72
}