{
    "name": "Little Frida's Eatery",
    "place_id": "ChIJB8WUiPGNwokRbJvT1h4t2Kc",
    "grid": "BX10",
    "address": "415 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.9,
    "user_ratings_total": 78,
    "phone_number": "(718) 885-9656",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWE4zbG5NRzB3VGxWRFMyMVRVakJWY205SFdIYxAB",
            "text": "This place is such a gem. Stopped in for lunch because I passed by it all the time and it was wonderful. I will definitely be back for more!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVFMzcGhSWGRaUlVnNWVubExWVTlsTlhwcmVXYxAB",
            "text": "Cute little place with authentic, delicious home made food. Offers a variety!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcUxWQmxOa3R5ZFdGd1dXSkRPVjlQV25saldrRRAB",
            "text": "The birria tacos are excellent, genuinely exceptional, and my wife's vegetarian huarache was perfect.  The service was fast and everyone was kind, even though we showed up while they were trying to eat lunch.  Thank you! Sorry we interrupted lunch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZmszc2VNdDV6VXFRRRAB",
            "text": "Grandma style cooking! Delicious, affordable, generous portions. Family owned and quaint. The burritos are the size of your head and the al pastor is amazing. The birria tacos are delicious so juicy to dip. Love the salsa verde on everything! Try the mole tamales on the weekends you won’t be disappointed- always fresh and steamy. If you’re looking for high quality home cooking this is the place to go. Happy to have you in our community- making City Island a better place. 10/10 would recommend to everybody."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHo0UHFRMmRuQnlRRRAB",
            "text": "Wonderfully friendly atmosphere, very attentive waiters. A huge selection of food both Mexican and American. Been coming here for a while, NEVER disappoints!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2X01UMDVnRRAB",
            "text": "Excellent Mexican food, consistently very good!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcGJ1SmZREAE",
            "text": "The best chilaquiles this far north of CDMX!\nPerfection"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUx2S1VnEAE",
            "text": "Great Mexican  food with wonderful flavor & service. Small about of seating for dine in but the offer take out. Reasonable priced and nice staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcktqd3BRRRAB",
            "text": "Why we go to Little Frida's on the evening of a rain storm in City Island no less. Craziness. We were driving right into the storm. We enjoyed our food and made it back home safely."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmekxLNUNREAE",
            "text": "I was starving and needed a quick meal for the day and Little Frida’s delivered! I ordered beef tacos and guacamole and chips. Everything was so flavorful and delicious. The tortillas were perfection, the beef was super tender and juicy. I wanted to take the red and green sauce home with me. I can’t wait to bring my family back here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MlplODZ3RRAB",
            "text": "Went to eat with a few of my friends and the food was amazing, service was great and would recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MmVPSUNnEAE",
            "text": "OMG you guys, I just had the best Mexican food! The tacos were so flavorful — bursting with fresh ingredients. The vibe was super chill, and the staff made me feel right at home. If you’re craving authentic Mexican flavors, you’ve gotta check it out! My taste buds are still happy dancing (no joke) 🌮✨."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcy03Rk5BEAE",
            "text": "Clean and cozy neighborhood spot with a few tables for indoor dining and occasional tables outside as well. The tacos were very well prepared - some places have chewy meat but the meat here is tender and evenly textured."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOElpRDhnRRAB",
            "text": "Everything is homemade, fresh and delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeDVXZk13EAE",
            "text": "Food is soo amazing here!! Super fresh and flavorful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6Mjg2V09nEAE",
            "text": "This is one of the best shrimp tacos I had sorry I didn’t get to take a picture I ate it all but hands down real good & the place is clean"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb2JMUzdRRRAB",
            "text": "Our favorite!!  Great ceviche, huge buritos, ecxellent guac...love the outdoor dining.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNHA3ZlZBEAE",
            "text": "The food is delicious. Price point is great. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcUltdEhBEAE",
            "text": "What a wonderful spot. Food is delicious and the young man at the register is very nice. This is a nice family place with real home cooking. I am not usually in the area, but I'm going to start coming just for this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXJ6Sk9BEAE",
            "text": "when you enter the interior is kind of odd with one table inside along with a few window seats (two tables outside) but don’t let that turn you away. the food was fresh & tasty.\n\nI ordered the Chilaquiles & the grilled chicken caesar wrap. the Chilaquiles had a wonderful green sauce & lots of yummy cheese. the caesar wrap was jam packed with fresh crunchy lettuce, avocado, caesar dressing, & grilled chicken.(side note, the fries were delicious too! thin, crispy, & seasoned well!)\n\nit’s a small business folks…food takes time. this isn’t fast food mediocrity!\n\nthe service was great & attentive. it’s a solid choice! Will come again :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweW91SzNnRRAB",
            "text": "First time coming to this place. Very nice to dine in or outside. Really recommend this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNTZLTHJRRRAB",
            "text": "Its a great little GEM but to sit and eat you have to have patience the girl is really slow to take your order.thats my only complaint everything else is GREAT."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwak1Lb2lRRRAB",
            "text": "Food was great service was terrible waited 30 minutes for a togo quesadilla.. also was standing at the counter waiting to pay for 10 minutes while waiting to pay as the girl stood there and ignored me"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeHBlMkNREAE",
            "text": "Best Birria tacos I've ever had. So much flavor and the consomme was great! Ordered chicken tenders and fries for my little one and they were really good too. Lots of food for the price. I'd definitely recommend going if you're on City Island. Small place but authentic atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLVpiUzV3RRAB",
            "text": "Excellent choice for fresh prepared Mexican fare. We do take out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aVppWEpBEAE",
            "text": "Excellent tacos! Tried the carnitas and el pastor, both were delicious with lots of flavor. Home made tortillas. Tacos 3 for 12$ and very good and friendly service. Definitely worth five stars!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OGNXWnh3RRAB",
            "text": "Delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OGRtOHlBRRAB",
            "text": "Excellent tacos and churros 😋…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OGZhdk13EAE",
            "text": "This place is a little gem! From the Frida Kahlo wall art to the relaxed ambience and delicious smell of Mexican dishes! Me and my partner love to stop here for for honestly anything on their menu, everything is delicious. But a special shout-out to their tostados, burritos and horchata!  And to the owner Nazareth, who is always kind enough to remember my allergy and even my regular orders, thanks for being you! Do yourself a favor and stop by !\n\nJay and Dan"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OUxXYzhRRRAB",
            "text": "Little Frida's Eatery is awesome and a must have on the Island! Incredible and authentic food, the friendliest staff, and great prices. You can't beat it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bE1TN1N3EAE",
            "text": "I came here last Friday with my co workers, our first time also. THE BEST MEXICAN FOOOD IN THE BRONX LIKE OH MY GOODNESS ..LOLCustomer service was amazing , I believe it is a family business... Very Clean place as well. Super Inexpensive !!!!!!! I highly recommend if your in the Bronx or around City Island area if your looking for Authentic Fresh Mexican Food. Would definitely come here 100000 times over and over again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eE9XVzlnRRAB",
            "text": "Everything about this place is perfect. The food is freshly made, some ingredients imported from Mexico. The food is flavorful, filling. You can just tell the food is made with fresh ingredients. I ate 3 tostadas (I overate) and still didnt feel weighed down. The owner's name is Nazareth and he is super friendly! The music was good too! Nazareth made sure we were comfortable and was extremely attentive. The restaurant is clean and bright. Nothing to dislike here. 11/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eEtYN3NRRRAB",
            "text": "Small place with big personality and flavor.  The owner Nazareth is incredibly nice, and the food is absolutely delicious.  Everything is made fresh in house and you can't go wrong with anything on the menu.  Definitely worth a visit for breakfast, lunch, or dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMThlYnN3RRAB",
            "text": "I really like the sopes, I eat the beef birria ramen often.  Its always steaming hot like I like it.  The place is very clean and the staff is efficient."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNWR5YTRnRRAB",
            "text": "The best food ever !  Thank you for your delicious lunches and dinners .  Nazareth you are the best !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLXYyN1dBEAE",
            "text": "My family and I LOVE Little Frida’s! The food is great and reasonably priced!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbHFLYllBEAE",
            "text": "My favorite in the City.  The owner is so nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeXMyV01REAE",
            "text": "Great mexican on City Island. My lord. Go support."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodUpqSjZRRRAB",
            "text": "Amazing Mexican food! Rice and beans, burritos and churros are the best. Delivery is super punctual and they always take the order with a smile. We love it! My favorite restaurant in City Island!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodU9qWEx3EAE",
            "text": "I have lived on city island all my life, and this is one of my favorite restaurants here ever! I love Mexican food, and the fact that we get affordable authentic cuisine right on the avenue is too good to be true. I hope this place stays in business for many years to come. God bless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocGZQck53EAE",
            "text": "I love this place. The staff is really friendly and the food is DELICIOUS. The food is gormet, which is surprising given the the casual atmosphere. I would highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocGU2UWFnEAE",
            "text": "Love this place!!! We have tried everything on the menu and always delicious! Excellent chef and cute place!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobWVHcWdnRRAB",
            "text": "We had the most amazing lunch at Little Frida’s Eatery. Highly recommend if you haven't had a chance. They have outside tables and great service."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeTdIcWlBRRAB",
            "text": "La cemita de milanesa muy buena\nLas tostadas de bistec también muy ricas ,\nY muy amables"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCanZTYWZREAE",
            "text": "What a surprise to find this little gem on City Island! Such great food and friendly people. A couple of tables and a counter to eat in or take out if you like. Lentil soup and tostada were delicious! All homemade and with a Frida Kahlo theme."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCN1l2Vkd3EAE",
            "text": "This food is soo good and fresh. They are really nice! Great prices. I've eaten here 3x in 1 week. Chips and guac are the best! Definitely recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNXByMFpnEAE",
            "text": "Very Calm Environment If You’re In The Area & Don’t Want Seafood This Place Is A Must The Food Was IMMACULATE🌟🌟🌟🌟🌟…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbk12am1RRRAB",
            "text": "Excellent food, service and prices.  Several visits to eat in at their tiny but cozy dining area and also for takeout.  We recommend everything we’ve had including chile rellenos, breakfast, tamales (all 3 kinds) and their delicious soups.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaUt1eGVnEAE",
            "text": "Amazing food. Amazing staff. 100/10 recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtN1l1RjBnRRAB",
            "text": "First stop in here today.  Very nice folks and cute interior.  My wife and I picked up a beef burrito and a chicken cutlet cemita to go.  Both were fire.  Red and green sauce on the side.  Going to be one of our local go to spots!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtek5pazZnRRAB",
            "text": "The food was very good. I'll go again next time i'm in the area. People were very friendly too. I had the burrito and Fajitas. The burrito was enormous, too bad i ate it before I took a photo. :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtc1l2bjR3RRAB",
            "text": "Have ordered from here a few times now and it's quickly become a favorite. Steak tacos are consistently excellent as are all the sides I've tried. A welcomed addition to City Island"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNk1hRW1BRRAB",
            "text": "If you like authentic mexican food this i the place to go!!!! Great food, great service and beautiful location. I got a milanesa de pollo cemita and the fish tacos. You know you’re getting food made with love when you order from here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlc3FlRV93RRAB",
            "text": "Their tacos were incredibly delicious...best I've had in the Bronx! The service was fast and friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNTdUT2tBRRAB",
            "text": "The food was too good that I teared up because of enjoyment."
        }
    ],
    "reviews_count": 55
}