{
    "name": "The Original Crab Shanty",
    "place_id": "ChIJg-5OF3mMwokRLWcz9lsaWNo",
    "grid": "BX10",
    "address": "361 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.3,
    "user_ratings_total": 4682,
    "phone_number": "(718) 885-1810",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a2JsWnFjbGxWVTNjemFrZFpWMFYzT1ZSb1pWRRAB",
            "text": "It's true, the garlic bread IS to die for! 😋"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTE5GbFBVVFZuYzJwU1JWOVpSbVZHUkRKSVlrRRAB",
            "text": "A favorite does not disappoint!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVJVUjBVVGR2VmxBMmVHMDFOSFJuYmtOWFQwRRAB",
            "text": "A Go too when family and friends are in town who eat seafood.\nGood service, fast food, great drinks.\nPrices have gone up but food portions are the same.\nYou are better off getting a family meal, to share it's a lot and feeds up to 3-4 people.\nThe bread will fill you up with drinks before the food comes. You may have food to take home. If you got a family."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NlVYUkJObTlyY210dGRWQm1UamRDZVVKUGIyYxAB",
            "text": "We had such a great time"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YWFHZG5iMGRWTW05Zk1XcHVhVVZGVW0xbmNsRRAB",
            "text": "Good food portion, great service lunch menu value for money"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbE1GTXhUREZWY1ZSeGFYVmxTMFJPTjBOeE0yYxAB",
            "text": "Been eating their since 1990 food is still delicious best fried shrimp and broiled lobster tails on the island 🏝"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRVJsZFBUbTlqTXpVME4wazVhbTVLYkhKbVlVRRAB",
            "text": "I had a 70th surprise lunch party for my father at Crab Shanty.  Everything was wonderful from start to finish. We were able to dine in the garden room which provided privacy for my party. I was able to bring in my balloons, party favors and the staff refrigerated my cake. The price was perfect for the prefixed menu. The options were very fair for the price. The food was delicious. My host Fernando was absolutely amazing. It’s not an easy job to handle a crowd, but he handled all matters with a smile. I couldn’t ask for anyone greater to provide a service for us. The owner Michelle and her mom who helped me take my items from my car were so fantastic. I have been going to crab shanty for years. My father and everyone were so happy with the turnout."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRVNFeElla3BSTkVoUlprRmZaVVowWVRWZldIYxAB",
            "text": "Had lunch there with my co-workers. A mouse ran under our table. Flies are everywhere flying in the food.  Do better Crab Shanty."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bmJ5VW13RRAB",
            "text": "They take care of you the first minute you walk in"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUGRHdzNla1ozT1hSd1RGbENNMjV5ZURWR1ZuYxAB",
            "text": "Not what it used to be"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUGVqTktkRTgwTWtSWlFuVnlORmhRZGtsc1UyYxAB",
            "text": "This is my favorite spot. I mean you get the salad  garlic bread and then your meal with a choice of sides. By the time your main course arrive your full. Lol. I can say the food isn't seasoned unless you get something boiled but we all know that not everyone can have salt. The season is available. They have specials available besides the regular menu. The service is always fast and pleasant. I always get the same servers most of the time. If something isn't right its never a problem rectifying the issue. The owner or Mgr is always on deck. Love me some crab shanty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4emRFdHhXRnBmWTJsTmEycEtaRFJXUjNGQlZHYxAB",
            "text": "---\n\n⭐ 1 Star (Would give 0 if I could)\n\nOne of the worst dining experiences I’ve ever had.\n\nWe came in, were seated, and waited over 30 minutes—with nothing but salad. Everyone around us looked just as frustrated, also waiting on their food. When our table was finally served, only 3 out of 5 people received their meals. The other 2 had to sit and wait while the rest of us ate.\n\nI ordered the special for $33 and was shocked to receive just 1 clam, 1 shrimp, and a very small lobster that had no meat inside—just seasoning. I brought this up to the server, who seemed lost and unsure of how to respond. He pointed me to the manager.\n\nThe manager told me the lobster only has meat in the tail. I explained that there was no meat at all, just seasoning, and all I could taste was the seasoning. Instead of listening or offering a solution, he just repeated the same line and walked away. No resolution. No apology.\n\nI’ve been a customer here for years, and I’ve never been treated like this or had such a bad experience. If I’m paying my money, I expect at least a basic level of service and food quality.\n\nAvoid this place if you don’t want to be ignored, disrespected, or served overpriced, low-quality food.\n\n---"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseU5UaHFZVlZCU2pCaVlUVlRWRWRKV0ZONFFtYxAB",
            "text": "Good food. Great specials. What else can I say"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVGRYQlVYekkxUlV0ZlNtNVBPWEJOY21oamRXYxAB",
            "text": "This is a great place to take the family out to dinner. The staff of always nice and friendly and the food is always delicious. Also great prices. Been going here for years."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMlVFSkRNRGxQTm5sdFozRjJkSGg1TTIxeFRrRRAB",
            "text": "Loved it going back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNE1qVlFSRFpFV0RaYVZrWkhlalJvUkVJdFpsRRAB",
            "text": "The 1st time I was introduced to this establishment, I knew that I was going to be a regular.  The seafood is fresh and delicious. The staff is very attentive. This is awesome experience at any sitting!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLOWV5U3lRRRAB",
            "text": "The food needed some flavor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTFRWcFhSRFJZYTNnNU5TMVdVMWRFY1ZCVVRHYxAB",
            "text": "The staff was very friendly. The food was on par with a third-rate restaurant. The clam chowder was okay, but the baked potato was tasteless. The salad was poor. Worst of all was the spaghetti served in a plastic bowl. This isn't a shelter how could such poor presentation be possible!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeExUbFhPVlU0VnpSeWNqVlJRM0YxYldwVFJtYxAB",
            "text": "Our waitress was really hostile and dismissive and rude to my teenage niece who’s a child but the owner quickly responded and handled everything."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcGN6ZHpjMmRYVlZoV2FVd3lORTEzVkZSbWVuYxAB",
            "text": "Meh! Same as 20 years ago..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFpHd3RlbDlIVmtKM00waG1WMGRLY1VGdmRHYxAB",
            "text": "Food is good. Service well we were forgotten.   Only after we got a server was when we attended well.  All else was good and pleasant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aldUZFpWbGd4TUhOdExXMUNaVXhXTUdaNlVGRRAB",
            "text": "Not recommend 🤢👎"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trd1NHaHpjbTVIYWxneGVHTnZlbGR0U0ZWZmFVRRAB",
            "text": "The staff is very nice and the food is great."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2N3IzVE5BEAE",
            "text": "Good food.  Service was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scmNrbzJUbFZWWDBaWVJYVTFSVUZYTkcxcE5uYxAB",
            "text": "I personally wasn’t impressed by the food this was my first time going the staff was nice went above and beyond keeping the table empty. Maybe it’s a personal preference but the menu was a lot to look at and nothing looked really good everything looked bland that came out .. I only ordered mussels as I was very unimpressed  and they was bland I had to ask for old bay . Imma giving it 1 star because I just think that wasn’t the vibe for me the bread was good I’ll say that"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGZlpsOVpkMHRUZW05MFRHbGtSbTh6TXpWelRFRRAB",
            "text": "A very nice cosy place! Enjoy the food and atmosphere there.. a traditional taste!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeGVVTlRkVVJ3Y0VwMlUzZDRaV1ZuZFZGeU9XYxAB",
            "text": "Anytime I’m in NY, I make it a point to stop by Crab Shanty, and last night’s visit did not disappoint. I wasn’t too hungry, but the $35.99 special was more than enough and such a great value. The special included a cluster of crab legs, a 4 oz lobster tail, fried shrimp, and a choice of soup or salad—I went with the Manhattan tomato-based soup. You also get to pick a side of rice, fries, potatoes, or linguine, plus complimentary garlic bread to start.\n\nThe ambiance gives off a fun, ship-like feel, and I noticed they’ve even added a side patio for outdoor dining. Service was standard, but the food came out hot and fast, which I appreciated. Crabby Shanty has been a staple for me since childhood, and it’s amazing to see that even into adulthood, they’re still serving up consistently delicious seafood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMWJrcHZiMTlCTWs1M1RuRXdZMWRQVWpkMVJVRRAB",
            "text": "This restaurant serves Seafood, get the surf (leave the turf at Orchard Beach), ask for Sisco, and look no further.\n\nI went here on a Friday around 5pm. The free valet parking made me feel relaxed before I even entered the door.\n\nWhen I walked in I was instantly seated and served garlic bread in the form of an Italian loaf (which I ate every damn bite of).\n\nI ordered a Manhattan (served in martini glass) which all in all maybe could’ve used a touch more vermouth, not bad though.\n\nThe extensive menu offered a plethora of options for all seafood cravers (at a good price).\n\nI ordered the fried calamari which was served with wedges of lemon and delicious marinara sauce and tartar sauce which whilst dipping the calamari I did not get anxious about running out of.\n\nI also was provided a very tasty creamy New England Clam Chowder as a side option.\n\nI initially ordered the prime rib medium rare and jumbo shrimp, while the jumbo shrimp tasted amazing…\n\nI took one bite of the prime rib (served with Ajou and medium rare as ordered) and truthfully was not impressed, HOWEVER, Sisco (Who I might add is a very attentive server, never felt rushed, and service must have been his mantra as prior to even ordering the steak provided the A1 Sauce without me even having to ask) asked me pretty shortly after getting the steak and not only completely understood that the prime rib wasn’t to my liking, he was able to switch me out for a Lobster Tail that was out of this world, served with dipping butter, it’s been two days and I still cannot stop thinking about that lobster tail.\n\nI finished my order up with some cheesecake, which not to be redundant… was on point.\n\nBe sure to tip the valet driver on the way out (which I add I did not feel any pressure to tip)!\n\nThe Original Crab Shanty, I shall return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeFoybEtUVGxTVkdGd1ZFZzBVREJzUW5Odk1YYxAB",
            "text": "If you liked sizzler , you’ll be ok with this mediocre see food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1ZGZEVkVmw2ZEhwa2JIRkNUeTB4WTA1aVEzYxAB",
            "text": "Excellent food, wonderful  service plenty of choices. Fresh seafood ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCalgwTm5TR2RUTjJneVpVbHRVbDlNWkd3eFEyYxAB",
            "text": "The food is always fresh here and the bartender know how to make the best drinks I personally love their fried shrimp and French fries"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxek83ZWZBEAE",
            "text": "Excellent service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaU1rbHNVMk5yZEVKWFVsOTVNWFpOVGs1TFVHYxAB",
            "text": "Some of the best fish I’ve ever had! I came to city Island for the day and heard about its excellent seafood, so I decided to give it a try. Here I had the lunch special for around $20 a salad, side, main, and some very good garlic bread. I had the fresh trout-the best trout I’ve ever had! Everything came in reasonable time and the staff was very nice. Would definitely recommend if you’re in city Island!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFMwcFpUMjFqWDNsUVgxVmZkbW93TWtWbVNXYxAB",
            "text": "Drove up to City Island from Bay Ridge for lunch. Stopped here because I read the reviews and decided to give it a try. Food was good service was professional & drinks were reasonable. Our server was Tara who suggested we get the lunch menu. Portions were big. In the area check this place out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRlp6WlViM0JsTVcxdlJYRkpkWE5rVG0wdFdWRRAB",
            "text": "Food is 😋 delicious and affordable! It's a nice chill place. Just gotta keep servers attention because they often forgot things."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxemNIUTNUMjl3WWpkQ1NWQklRa0ZMU3pNNE1VRRAB",
            "text": "Fresh Seafood galore... You can smell the freshness and the ambiance is fantasic."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pablkzaG5RME5RWWt0TFNYZE5jamxxWWs1ZlRrRRAB",
            "text": "Great food Great service and great staff 👍 highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeU4wOVZiazF2UjI5WVFrWXhNRFp4U1ZoVE1FRRAB",
            "text": "City Island is a Bronx stable in terms of seafood, Crab Shanty being a big factor.\n\nThe place is a quaint and charming little restaurant that has both outdoor and insider seating. The outdoor facing the street let you taking in the charm of the island main street.\n\nPricing is good, actually better then you'll expect, and once you consider the great food and portions you'll easily see that it worth it. The combos like Lobster and Shrimp for a little over $20 is insane really.\n\nThe staff were pleasant, intensive, and patient. Food came in good time, and the over all vibe was calming and welcoming.\n\nDefinitely a place to bring your family on a sleepy weekend at or after going to the beach."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVZ18yc2ZnEAE",
            "text": "Always hits"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVVuWm1WRGQxZFUxMlVXb3pNM0J5Wm1KS2JVRRAB",
            "text": "Great food.  Great for the price too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d1NIZFRSazQ0Y1hCYVdDMURMVXRQWXpORVdWRRAB",
            "text": "Great family owned Italian Seafood restaurant.  Great selection of drinks, entrée, appetizers, etc...  Have been going since 1st year they opened.  In my opinion, the best on the island. Staff is friendly and hard working.  Overall ambiance is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSGMyMTBYMjFrVnpoUGQyaEJRMGxITXpsalNIYxAB",
            "text": "Food was ok but not outstanding.  Ive had more flavorful fried calamari. Shrimp was a bit overcooked and chewy. Fried clams looked like burnt bits. Best part of the meal was the garlic bread and baked potato.\nThe Inside ambiance is meh so best to sit outside."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVUyc3lTakIxYmtWMmVFSlpUbFZEVmpreE1rRRAB",
            "text": "Nice place. Food is good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WT2FIRkZjMWwxTVZoWFFuRTRhM05STUcxT1VGRRAB",
            "text": "First time eating crazy and lobster. And I am happy that this place was recommended :-)\nThou I know that I am not a fan of everything I have eaten for the first time, but I do recommend a lobsters tail! :-)\nAnd the staf is really friendly and helpfull in choosing the most suitable dish  :-)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbGIweHlTREJ0ZWtkR1dWaFFkRFJKWDJwV1FsRRAB",
            "text": "The food and drinks are excellent. The service was very good and the atmosphere is wonderful. I went with family to celebrate my mother's birthday and she most of all enjoyed the restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUk5rNTFTMDVGTm1kV1ZIZERNM0JsT1dwelMwRRAB",
            "text": "The service was terrible.  They did not give me all that I paid for.  I had to ask for it and it seemed they were annoyed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eU5HcEtUR2hJYWw4eVFsaDFSSGxaZWxCMVZIYxAB",
            "text": "Food was amazing as always!! Been coming here for years  ..visiting from Florida and had to stop at one on my favorite spots..the main fault today was the server Juan . Not very attentive and did not check on us as you would expect..we had to ask someone else for bread .."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmajVxeGxBRRAB",
            "text": "Good food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkT1p6QnpVemd5YWs0MFptVXdXRzFvTmtWRWNsRRAB",
            "text": "Cesar our server was polite and very friendly... gracias Cesar"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMi1mOHV3RRAB",
            "text": "런치스페셜 가격좋고 디저트까지 무료제공"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWkxYRnROWFZzYWtKVVVUTnJXVXRoZUdGUllYYxAB",
            "text": "Oh, the Baltimore Blue Crabs In A Garlic Sauce is the bomb; I always get it. That dish with New England Clam Chowder and a side of baked potatoes is the perfect combo. The rich flavors are so satisfying, and the garlic sauce is the best. Every time I go there, the service is always great, with friendly servers. DIVE SEAFOOD JOINT."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMjY5b1h3ak9XaVpREAE",
            "text": "My first time here was amazing! Our food took a while to come out, but I was not disappointed once it did. Fresh, hot, and sooooo flavorful! Yummy. Our waitress was so sweet! I'm definitely coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMFRHTm5MVms1VG1Fd2FFMU5PVWxYTVdJdFZYYxAB",
            "text": "First and foremost shut out to Cisco our server  who is very friendly, engaging and gave a great breakdown of the menu and what kind of deals to get and good job On upselling the drinks\n\nIt was my first time trying crab legs and they have a great deal offering crab legs shrimp and lobster tails. Absolutely delicious. I always have to laugh at the Salad but the  creamy Ranch was good, the crabcakes. were definitely small but seafood is very filling.\n\nMy gf  Enjoyed her drinks & The best part of going to his restaurants in city island is that they are deceptively large on the phone. It looks small, but when you enter and see all these booze and we were in a nice private booth, and it was outside seating area as well, that looks very comfortable.\n\nSadly, I failed to get pictures of the outside of the establishment but I can take pictures of the food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdUxIRVhREAE",
            "text": "I had an incredible dinner at The Crab Shanty in City Island! The atmosphere was warm and welcoming, with friendly staff who made us feel right at home. I ordered the filet mignon with lobster tail, and it was absolutely perfect—the filet was tender and cooked to perfection, and the lobster tail was buttery, fresh, and full of flavor. The portions were generous, and everything was beautifully plated.\n\nThe service was attentive without being overbearing, and you can really tell they take pride in what they do. Whether you're a seafood lover or in the mood for a hearty steak, this place delivers. Definitely a must-visit if you're in City Island!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqenE3enRRRRAB",
            "text": "We went in a Saturday with a big group without reservation and they were able to accommodate us, but I recommend to prior reserve a table. The service is really good, they are very fast and gentle. The drinks are fantastic. The food was ok, I missed more flavor and I found lobsters very soaked in oil. Fish and chips were amazing, steak and pasta too! There is a parking valet from the restaurant for free."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaU9GaEJkazVyUVY5b1JGQm9iV0Z5UjJ4NGVIYxAB",
            "text": "Food Was Decent.. Service Was Ok… The Seats Are To Close Together… I Enjoyed The Drinks More Than The Food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZk1yNzY2dE16RW5BRRAB",
            "text": "I had a wonderful experience. Carlos was attentive, made suggestions, and gave us a complementary birthday surprise. The food was fresh and cooked correctly. Oysters, tails, snow legs, all done right!! Love this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNVJIQlBhSEF5TXpnME1HNTNVWGc0YjNad09YYxAB",
            "text": "This restaurant has cute outdoor dining with good food and drinks. I ordered the shrimp scampi with garlic butter linguine. Very delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbU4tMnJ3RRAB",
            "text": "Edgar our waiter was absolutely amazing. He did an outstanding job. Friendly and extremely helpful. Food is always good. Drinks were awesome. Keep the good work up."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcklpbFZnEAE",
            "text": "Came here and had the tuna steak , my friends had chicken with salad , lobster tail and baked calms , shrimp and scallops, crabs legs , calamar . The calamar was too soggy , tuna had a fishy taste , chicken wasn’t season the right way , pasta had no flavor, lobster was bland. No taste . Will not come back again"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXZ6ODhnRRAB",
            "text": "Came here yesterday for Valentines Day. The hostess said it’d be a 30 minute wait, we got in just under. The portions are worth the price! The snow crab legs were good, some of them were fresh and the other cluster I had was a bit salty, in an older batch kind of way. The Henny coladas were really good. They stuff anything with crab for an extra $13.99. Super delicious btw! Garlic hero is sooo garlicky in the best way. The staff were really nice, fast! It was worth the drive."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcTlnWlhBNUlMdzNRRRAB",
            "text": "Our serve(she) was fantastic. Well.spoken, great sense of humor, and awesome attitude....my sister and I enjoy VIBE OF THE PLACE,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6N2FHNWNREAE",
            "text": "I had the $33.99 lobster special that came with two stuffed clams (whole clam).  The special also came with garlic bread and two sides.  For $13.99 extra, I got the lobster stuffed with fresh crab meat.\n\nI chose the following sides:  a baked potato and a bowl of New England Clam Chowder.  Dessert was included in the Special.  I chose a slice of carrot cake.\n\nFor a base price of $33.99, the  LUNCH SPECIAL was worth it.  FAVORITE FOOD:  the garlic bread, which was topped with fresh garlic.  LEAST FAVORITE:  the clam chowder.  I prefer whole clams in mine.  The chowder had clam bits.  I exchanged it for a side salad with blue cheese dressing.  The dressing was chunky and delicious.\n\nFor an alcoholic beverage, I had the HENNESSEY COLADA.  It was divine.\n\nTara was my server.  She was friendly and did a fantastic job."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdExxdFh3EAE",
            "text": "I decided to come early Saturday before the crowd and the congestion.  Haven’t been here in so long they still provide valet parking. They also have new Benches & Tables in the front of the restaurant if you prefer outside seating in the summer months. Providing customers with  Ordering window for To Go orders. I got to sit in my favorite booth since it wasn’t crowded yet when we arrived. I haven’t been here for years and honestly couldn’t wait to enjoy my nice New England clam chowder. Yet it was disappointing not creamy and thick like I remember it also very bland and watery. We both had the broiled lobster special. Unfortunately my lobster was very mushy. The claw meat was stuck to the shells and wouldn’t come out which made eating it very hard unfortunately. The texture was off like who it’s mushy lobster meat it was just left very disappointing and left still very hungry."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbE5YaDl3RRAB",
            "text": "Every time I come here they do not disappoint.\n\nI like that they don’t stress the mask wearing policy.\n\nOur waiter is always knowledgeable, helpful & pleasant. Valet is a breeze & we even got seated pretty quickly with no wait time.\n\nOur food was hot, fresh, flavorful, delicious & memorable, as always. Every single time the food taste amazing.\n\nWhen you’re in city island, GO HERE for the best seafood!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeUxHLXNBRRAB",
            "text": "I traveled with a group of seniors on a day trip. Each ordered what they felt was right for themselves. I ordered broiled Scallops and asked my server to give me the garlic sauce, it was perfect.  My friend had the fisherman's platter and said it was so much food.  Before the meal started we had garlic bread. I had the Manhattan clam chowder with my meal.  The Scallops came on their own platter and were cooked to perfection. After the meal we had dessert,  I had coffee and chocolate 🍫 cake with chocolate 🍫 frosting. The server was very nice and answered all of our concerns with speed and grace. In my opinion.. this is a very good restaurant to bring a friend or family member for a memorable meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdW9MUnRnRRAB",
            "text": "When I lived in NY, this spot was always on the menu. I only visit twice a year from GA and it's a must that my family and I visit. I love this place. Service and food is always 10/10. Till I see you again❤️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcWJqekRnEAE",
            "text": "Friendly staff. Good food delivered in hefty portions. Always has been a good experience through the years. Still no complaints. Sorry for the Rib photo…we dug in quickly!! They were “fall-off-the-bone” tender."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNT1lqSS1vaTVEUHV3RRAB",
            "text": "Service:\nThe service and the wait staff were great. They were patient, took their time to explain the dishes and what was included, and had friendly demeanor.\n\nFood:\nI would not dine here again.\nThe only good thing was the garlic bread. Even though the portions were large, everything else was lacking in flavor.\n\nParking:\nPlenty of free street parking. I saw an attached parking lot but unsure if it was valet or not."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseVNqVmZhVEJYYmt0UmJWcDRZVlI1UlVONlNGRRAB",
            "text": "Our server was awesome and the food was good. She was kind, very helpful and patient. There was a valet person there who was not kind at all. I watched him yell. I watched him put up his hand in a stop position and the vehicle was already stopped. He was acting very rude all for no reason. He was totally wrong but he didn't think so at all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WE5WODFiRU51TVhVNE0ycFBOekZoYVU5dlZIYxAB",
            "text": "I haven’t been here in years and its definitely not the same. Food was ok, ordered fried calamari and got a mix of fried calamari and fried squid?\nFood was eh nothing special\nFrozen margarita was eh tasted the ice the most\nService 👎🏻 I waited probably a hour for waiter to come to table so I can ask for another drink, people that came after me were served paid and left before me\nDefinitely not worth the price I paid, will not return or recommend 🙂‍↔️"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbklqMHNRRRAB",
            "text": "Amazing food the food, the portions are huge. Everything came out so great!\nThe crab clusters are amazing. Carrot cake is great, recommend the pasta with garlic sauce don’t forget to get the bread!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbHBxZVFREAE",
            "text": "Great service. Great strong drinks. Delicious food! I had the crab legs and lobster it was so much crab legs. Big thick crab legs that come out in one piece when you crack it open. So filling and satisfying."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLZmM5cDNwaXBxV0dnEAE",
            "text": "I ate there with my adult son and daughter. We had the calamari appetizer, clam chowder, crab legs, fried lobster, steaks and broiled lobster. All of the food was pretty good overall. I enjoyed the clam chowder, lobster, and crab legs the most. The calamari was OK. Some of it was good and some was quite chewy. I would eat there again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeHFfQVJREAE",
            "text": "Another Bronx/city island classic. Seafood fried/ baked/ grilled, lots of bread and strong drinks. Been coming here since I was a kid. Throughout covid to present, the service has been consistent which keeps us going. Great spot for large…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQanZzWS1WMktIMlZREAE",
            "text": "Food is always good but the service is never good. We had to constantly ask for a pitcher of water so our table of 7 didn’t have to wait for the busy team to pour for us. None of us got our side dishes. The back seating section was extremely hot and they refused to turn on the air conditioning"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNDkzdGpBRRAB",
            "text": "They catered to my every need inorder to surprise my brother in law for his 🎂 bday.  Food is unbelievable 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRGVERktWazV3VTNWSVVVb3hjVWREY0MxMVkwRRAB",
            "text": "The service was amazing at this store, the server was very polite, I ordered one steak from these guys and it was super bloody, smelt bloody and was bland as hell. I asked the server to take it back! He was very polite, I just will never order a steak from a seafood spot again! If you can't perfect a steak, then take it off the menu. I will be back for the seafood next time 😌👌🏾"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd05mNEhREAE",
            "text": "Cute little spot with good seafood for all. Fresh, and tasty seafood. Was able to get a table for 5 on Easter weekend with no issues service was great food came out quickly. Portions are huge you will definitely have leftovers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dFEwWmhjMXBrZERoU2R6Wk9URXBpVlVKYVQyYxAB",
            "text": "My first time there service and food was great. I would go back again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcG95Mnp3RRAB",
            "text": "I've visited Crab Shanty on multiple occasions throughout my life. Growing up in the Bronx, City Island was and still IS my favorite area to dine in. Crab Shanty is one of my favs on this strip.\n\nDuring my last visit, i came with a group of 11 people. My family and i had just gotten done baptizing three of the kids in our family. Naturally we agreed to come to Crab Shanty afterwards for a meal.\n\nWe did not have a reservation and were seated with no problem. It was Sunday about 3:30ish. We were sat towards the back which is alot wider and spacious. We usually sit back there since we always come as a big group. The main entrance is holiday decked out. Love the decor and big Grinch at the door.\n\nThe waiter was very nice. We had one main guy and about three different people assisting him as well. We were immediately given water and this amazing garlic bread. The amount of garlic is ridiculous yet so amazing. We asked for extra.\n\nWe all ordered the Millionaire Margaritas. I certainly recommend them. The flavor is not bad and the alcohol content was great. Not too much not too light. Others at the table had coffee and sodas, all of those came out great as well.\n\nWe had two dozen clams. 12 baked and 12 raw. Both were great quality and tasted good. We also had 12 raw oysters. They were huge. Fresh and tasty. Two of us had the lobster special. It was one whole lobster with two baked clams and two broiled shrimp. I also had it with salad and baked potato. The have a number of sides to choose from, i believe they were rice, pasta and vegetables. The lobster was cooked perfectly. The clam and shrimps were also good. I wish i would of ordered more shrimp, they were on the smaller side. I got my lobster stuffed with crab meat, highly recommend it. My husband got shrimp scampi and a lobster tail. For some reason his lobster tail tasted fishy. He didnt eat it. The waiter took it off the check and was apologetic about it. I recommend ordering the whole lobsters always. We had ravioli from the kids menu and chicken tenders with fries. Some family members orded broiled blue fish with rice. They loved it. The rest had a seafood special which had shrimp, broiled clams and crab legs. For desert we had cheese cake. Everything was really good.\n\nOverall we love it here. The service is always quick. The food is delicious. The prices are reasonable. I recommend getting the meals for two. Those are huge and worth the value 100%. This restaurant can get full especially during holidays. Any parties from one to 20 people can be accommodated. Maybe more but i would recommend calling for reservations. We were lucky to just show up and be seated with no problem. I wouldn't try this move in the summer time though."
        }
    ],
    "reviews_count": 81
}