{
    "name": "The Sea Fire Grill Westchester",
    "place_id": "ChIJnRABzvvzwokRVtiLIzqEDrc",
    "grid": "BX10",
    "address": "71 Water Grant St, Yonkers, NY 10701, USA",
    "rating": 5,
    "user_ratings_total": 40,
    "phone_number": "(914) 614-4369",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONE1HVktaVXQ0YW5jNWFIbG5jRlkzVlRsd04yYxAB",
            "text": "The Sea Fire Grill in Yonkers is absolutely outstanding. From the moment you walk in, the atmosphere is elegant and welcoming, with stunning views right over the Hudson River. The service was top tier, attentive without being intrusive. Every dish was perfectly prepared, from the appetizers to the dessert, and the cocktails were some of the best I’ve had in Westchester. It’s great to see fine dining back on the Yonkers Pier. Highly recommend for date nights, celebrations, or anyone who appreciates great food with an even better view."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMllVWjBjbFJIZGpkeFVXeGFZV0pFZFVaQllXYxAB",
            "text": "Amazing looking dinning room . Great wine list ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcVdHb3RXbGQyYTJOblJuSlZWRzB0VEc1T05YYxAB",
            "text": "Overall 🤌 ! See picture !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd2JsQmtaakowVFVobllreDBUMHhsUzNFMk1uYxAB",
            "text": "Great food, great service and great experience. Incredible views and atmosphere!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFZVVjVSVWxUY2xWcVZFOTBjWG81WXpkSWFtYxAB",
            "text": "Ooof! 🤤 Unbelievably delicious, gorgeous atmosphere and service worthy of a king. The caviar, the steak, the pasta; all to die for!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdGFYcHRNelJmUVdGNGFqSndhbU5FTVZWc2RGRRAB",
            "text": "So Ericson was our waiter. He was absolutely amazing. The food was incredible. The ambience was great, but the nicest thing is the manager came out at the end of the night and gave us a glass of port  which was amazing so I advise everybody in Westchester and Beyond to come and visit see fire Grill. You will not regret it. You’re going to be pleasantly surprised at the amazing food they serve and the ambience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SVlUWktWVFJ4T0dKeVdGQTBTRkZYTkc1SGRYYxAB",
            "text": "Amazing place , food and service 10/10 , definitely coming back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFRGOXJRbXRtUkhSekxUSkhabGd6TURreVJrRRAB",
            "text": "Erickson made sure we was taking care of. We loved the food and the wonderful service. We would definitely recommend this restaurant.  5 stars all the way"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbVdVbEVXVko2UldKeVp6QnJNVEJ5YjIxVmFIYxAB",
            "text": "Outstanding dining from start to finish!\nThe See Fire Grill delivered one of the best dining experiences I’ve had in a long time. The Porterhouse steak was perfectly cooked—juicy, flavorful, and beautifully presented. The tuna tartare was fresh and refined, with a balance of textures that felt like true artistry on the plate. I also loved the crab meat and oysters, both incredibly fresh and full of ocean flavor.\nA special mention goes to Nick, our waiter, who made the evening exceptional. He was attentive, knowledgeable about the menu, and had that perfect mix of professionalism and warmth that turns a great meal into an unforgettable evening.\nEverything—from the food to the service and ambiance—was top-tier. I’ll definitely be returning soon and recommending this gem to everyone who appreciates outstanding seafood and steak."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VFMxZFZPRWhHZUZZNVdFNXBYMnhPZHpaRWJrRRAB",
            "text": "Fantastic food, superb wine list and incredibly friendly service. A special mention to Ennis who made us feel so welcome."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob05XOVdjMll0UkVaNllubGlRMjQwTXpSTFpuYxAB",
            "text": "I had high expectations since I loved X2O which was previously at that location and I was a fan of the Benjamin Steak House who’s ownership group owns Sea Fire Grill.  The venue was elegant.  The food was delicious. I had squid ink pasta…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1gydzVRVEphU1hWbU5IRkhkMk5rTjBaallrRRAB",
            "text": "The Sea Fire Grill Westchester is absolutely amazing! Everything from the food to the atmosphere was perfect. The seafood was fresh, flavorful, and beautifully served.\n\nBut the real star of the day was our waiter, Enis — he was beyond excellent! So friendly, attentive, and professional. He made sure we had everything we needed and made the whole experience extra special.\n\nI highly recommend this place — and if you go, definitely ask for Enis. You won’t be disappointed!"
        },
        {
            "date": "2주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca05XTXdaR2hHYjJoTU9WZzBNVGRKV1c4d1VsRRAB",
            "text": "Excellent service avec une cuisine exquise."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQmMzTlpVRXhtWHpWNFptYzFha3BtVG1WRU1XYxAB",
            "text": "Maybe the best restaurant in Westchester!  Great job!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWmVtVm9RV3RXYlVJM1pYWTJTM3B3WVZZMGJtYxAB",
            "text": "Food was excellent and service was even better. Thank you!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZlFqUnpRa1JoVlZkTFpsVjRla1owTFhoSE9YYxAB",
            "text": "We had such a great experience thanks to our waiter, Enis. He was welcoming from the moment we sat down, gave great recommendations, and checked in at just the right times without being intrusive. His professionalism and genuine kindness really made our evening special. We’ll definitely be back!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVGEzWnJSR3RTTFV4WlRHTXlabUptTXpKb1ozYxAB",
            "text": "Food is tasty. Service is very good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTk1IaEpVa2M0YjBGbVEwbHBlRlJyVUd4WFpXYxAB",
            "text": "Enis was the best server!  Very attentive."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNVozaFJUVTFoZVdsd1RuaHBRV0ZDVW1ScVprRRAB",
            "text": "Amazing!! The food was fresh and full of flavor, our server Milot was very attentive along with Remy at the bar who took care of us while we waited to be seated. You can really tell they care about their customers. I’ll definitely be coming back soon!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaGJXbDJZMFp0Y0VKSFEwTXpRa3MzVEd4bVFtYxAB",
            "text": "Zero complaints. 100% perfection all around. This is the gem of Westchester bar none."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVkzSkZaVTFVVFdaalZteDViVFIyTm1oTVYxRRAB",
            "text": "Top experience in Yonkers and the surrounding area."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UFJsWlFaVkJXY0VFMFVtRkNORWQ2ZEd4bVQzYxAB",
            "text": "I had an amazing dinner this evening! Every bite was perfection. Our server Nick really made the evening special; he was super attentive and very knowledgeable. The wine menu is exquisite and there is a perfect pairing for any dish. The ambience was spectacular, perfect for a date night, dinner with family and friends or happy hour at the bar."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1VtY3hZVzVsUmxCbFlXZENPVXcxYWxSS2NIYxAB",
            "text": "We had such a good time here for my moms birthday. The food and drinks were delicious and the service was great! Highly recommend it!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbE5qWkxZelkxVVdrMlJIVmtkRzlTTFdjelEzYxAB",
            "text": "The Benjamin Group continues to redefine fine dining with each new opening, and The Sea Fire Grill Westchester is no exception. Arguably offering the most beautiful views north of Manhattan —every detail of the restaurant meticulously curated to elevate the guest experience. From the bar upon entry, guests can gaze south toward Manhattan and the GW Bridge, with endless views.\n\nThe food and beverage program, service, and staff all speak for themselves, with each element surpassing expectation. The hallmark Benjamin hospitality is unmistakable; you simply cannot experience it anywhere else without visiting The Sea Fire Grill for yourself.\n\nFew establishments can boast a team so loyal, polished, and passionately dedicated to the brand’s mission. The Sea Fire Grill Westchester is a testament to The Benjamin Group’s unwavering pursuit of perfection.\n\nIn short, even living on Long Island makes the drive well worth it, to experience an amazing evening, if you want a change of pace from Manhattan."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMlFrd3liMHQ0VDFwTU9YTmZlVkZXU0Znd1JHYxAB",
            "text": "What a delicious treat with upscale ambiance! We were told they just redecorate and reopened, and the space looked beautiful. Our server was so nice! They were all very friendly and professional. The food was fantastic. I don’t normally see grilled calamari and it was cooked perfectly. The squid ink pasta with lobster was absolutely delicious!! We all did the 3 course for $45 which seemed like a great deal! They made the birthday celebration special! They have a little balcony where you can get the views and a few nice pictures as well."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU2NuWnlVSEZ2TFZaUFIyTTVOM05vUVdOQ1dXYxAB",
            "text": "Delicious menu, lovely view and great service! I had a lobster chowder soup, NY Steak and Tiramisu with coffee ☕️! Would recommend these menu items.\nPlus they have🚗 Vallet Parking!  🅿️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NVVrdHhRMGxxYTFCak5YWk9OV3gyWWxCWmNsRRAB",
            "text": "Had a wonderful experience at the restaurant. The food was fabulous and appetizing. Each dish was made with care and presented professionally.\n\nStaff/service still needs some improvements, especially with attentiveness in handling drink orders and removing finished plates; hopefully it will get better over time. Staff members were kind and carried themselves professionally.\n\nOverall a worthy successor to X2O!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201c1gwWXhkazlMVDFWTldtZ3hWbFZoUjFNM01FRRAB",
            "text": "My first time since I was renovated. I\nHad an amazing dinner. Service was a 10 so was food ambiance and decor. This was the best restaurant I\nHave been to. The staff was amazing\nIf you want that special memory and\nOutstanding food service and memory for a lifetime go to sefire grill yonkers. Wanna thank everyone for the great night and the deserts where the best I've had especially the cheesecake the best I've had in my life. God bless success and health and my guest where grateful on youre accommodation of last minute add on of 6 more guests."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213eFNYTnFNV2hyTTBKTk5tWjZTVjlLVjBvMlZGRRAB",
            "text": "We had the pleasure of dining at this beautiful new restaurant on its second night of opening, and it truly exceeded our expectations. From the moment we walked in, we were greeted warmly by the host and immediately impressed by the stunning décor and elegant ambiance — every detail was thoughtfully designed to create a welcoming yet upscale atmosphere.\n\nThe staff were professional, attentive, and clearly dedicated to ensuring every guest had an excellent experience. Our waiter, Enis, was outstanding — friendly, knowledgeable, and incredibly professional. He guided us through the menu with great recommendations and made the evening feel special from start to finish.\n\nThe drinks were perfectly crafted, both in flavor and presentation, and each dish that arrived at our table was beautifully plated and prepared to perfection. It’s rare to find a new restaurant operating so smoothly and delivering such a memorable experience right from the beginning.\n\nWe’re excited to see this place flourish and will definitely be returning soon. Highly recommended!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aFdFSlRiRzVGY1docE5WUlNWRUpNWjFsa1pFRRAB",
            "text": "A new dinner date spot unlocked!! Food was amazing!! Service was wonderful!! Enis was on point - he had the best recommendations and was overall so friendly and attentive to us!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUVptTjZkbTAwZEhOa0xWbHZTMFZMU2w5R05VRRAB",
            "text": "Had such a great experience here! The service was excellent - attentive, friendly, and perfectly timed. Every dish was delicious, from the fresh and flavorful tuna tartare and creamy burrata to the rich squid ink spaghetti with lobster and perfectly cooked filet mignon. Great wine selection too. Plus, the Hudson River view is absolutely awesome - it really adds to the whole experience. Definitely recommend this place if you’re looking for a nice spot with delicious food, great vibes, and beautiful scenery!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbU5qQlhPRGR2UVd4Q2RWTXhYMk5XY25Sc1lYYxAB",
            "text": "I’m so excited that The Seafire Grill has finally opened in Yonkers! I went there yesterday for dinner, and it was a wonderful experience. The atmosphere is cozy and inviting, the music was special, and the overall ambiance made the evening very enjoyable. Can’t wait to come back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1ZFWmhTMlJQUm1ORWRXdHROV1ZJU0UxcmQzYxAB",
            "text": "Finally, they are open!  Just passing by… but when I found out they are now open to the public, can’t pass up the opportunity to join them on their first night.  And it was a wonderful experience! First of all I was not sure if I was appropriately dressed but I was still greeted like an esteemed guest.  Since it was still early, I was able to sit at one of the best table with the corner view.  The starter bread was warm, crusty and soft, partnered with a tasty aioli?, dipping oil and butter. Beet salad with arugula was refreshing and dressed just right.  My entree of Mediterranean Branzino would have been good for two. Cooked just right and deboned.  Dessert was pecan tart a la mode… buttery crust, sweetness was well-balanced.  Ambience is stylish though I was more focused on the river view.  Service was superb… they were attentive and friendly.  It was a great treat for myself, worth the price.  I was informed that they have prix fixe menu on weekends which may make me a regular!  Come celebrate a special occasion or give yourself a treat!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcGJUQlNTelZrYkdvNU9HaG5VbGRyTTJkMk4xRRAB",
            "text": "Delicious food with an awesome view! Service is great as always."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NllVaEdhRXBHVTJWb1MzUXhVRzl3VlhveGFXYxAB",
            "text": "Absolutely stunning from the moment you  enter the space.  Excellent service and most high quality dining experience.  Can’t wait to visit again!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reGNVaEJRblJoVUY4elYzUkVjMVpLWWpKdU1XYxAB",
            "text": "From previous experience from their midtown restaurant and what Ben does, I have high expectations with this place.\nI will be there soon after they open."
        }
    ],
    "reviews_count": 36
}