{
    "name": "Archie's Tap & Table",
    "place_id": "ChIJJfxUfHyMwokRToPYbGARuXY",
    "grid": "BX10",
    "address": "536 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.6,
    "user_ratings_total": 214,
    "phone_number": "(718) 885-9229",
    "reviews": [
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM2J6UTFSMVU0UVZkYWNXbHVRM2cwYlZaMFRVRRAB",
            "text": "It's a cool place to chill, grab a bite, have a drink, and listen to some awesome music. You should check it out! 🎶🍔🍹🎧 #ChillSpot #GoodVibes #Music"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTlFXMUJSa3MzV0c1TFFUUTRkSEUyYUhZM1ExRRAB",
            "text": "It’s excellent every time we dine at Archie’s. Service, food and drinks were all excellent for our party of eight for brunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVE1GUjNVSEJIZWtaWFZEaGFYMHhGZVZaS2VGRRAB",
            "text": "Fantastic food on City Island.  I had never associated City Island with creative and refined dining.  Archie's is punching way above its weight.  It is an unassuming location with a food and drink menu that would not be out of place at a Manhattan fine dining restaurant. This was our second visit (once for dinner and once for brunch) and everything we have ordered has been terrific and made with attention to detail."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQlV6aFFka3ByWVZReVowRnVjRVExYjNVMVptYxAB",
            "text": "Hidden gem.   I was pleasantly surprised by this restaurant.    The place is coz and the ambiance is romantic and very nice.  The music was great.    Lots of 70s and early 80s r&b.  The service was attentive.   The food was delicious.   My favorite of the appetizers was the saffron shrimp.   The cabbage fried rice was gad a nice smoky flavor.   And the Detroit pizza was really good.   The bisque had a very nice flavor with  some heat.  I will definitely be returning to try the other dishes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeS0ycFNGbUpiR1RBEAE",
            "text": "This is an amazing spot for entertainment, drinks and fun. The atmosphere is spectacular and so is the staff! This was a 10/10 experience. Alex ensured that we felt comfortable and at home. I recommend coming here if you’re looking for a quaint spot to hang with your friends."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSEJ0LWVKNVlLTkJ3EAE",
            "text": "My favorite place to eat on City Island!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOWNqMEl3EAE",
            "text": "Hidden Gem on the island.\nFood hit the mark. Will be back.\nThanks Archie."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzlxdHRRRRAB",
            "text": "The food was amazing and super creative - unfortunately the small space was predominated by loud family groups with small children so difficult to fully enjoy the experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbXI3SmpBRRAB",
            "text": "Fantastic food! Everything was delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBenAyemp3RRAB",
            "text": "food is good and so is customer service definitely going back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbTRtdHdnRRAB",
            "text": "A treasure in City Island.   Had the best Buffalo Cauliflower I've ever tasted."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIc1lpNG5nRRAB",
            "text": "Amazing 100 percent recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cHNPZWhBRRAB",
            "text": "The smokey salt was amazing. The food was amazing. The service was amazing. Such great people and environment. I love it here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bDhEeTh3RRAB",
            "text": "We really liked all of our food and the staff was pleasant and efficient.  Had some starters...Tuna tartar, dumplings and buffalo cauliflower. We would recommend any of them. We also split a detroit style pizza that was quite delicious dense with a great crust. Will definitely return and would recommend to friends."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaE5fcW5nRRAB",
            "text": "What an amazing place for a great dinner or weekend brunch!! The food, cocktails, and service are at Michelin level!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaWRub2pRRRAB",
            "text": "Maybe I just don't get it, but I found this place to be exorbitant. $27 for Huevos Rancheros, seriously? We ended up ordering eggs and pancakes, two drinks, and left spending $85 before tip. Insane. The portions were small, but the food itself was good. The coffee was cold, and the Bloody Mary's tasted like sweetened tomato juice.\n\nWe sat outside because the inside had no air conditioning on, so it was cooler outside. Before I left, I used the bathroom — where I was met with a dirty baby changing station and a ton of cleansers.\n\nThis place is trying to be high end but it's just price gouging and feels somewhat poorly managed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaF9YRjVRRRAB",
            "text": "Everything we ordered was delicious: Belgian Waffles, Eggs Hollandaise and Onion Rings. My espresso martini was also great. The standout was the Hollandaise, which was probably the best I've ever had."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMzlmSzZBRRAB",
            "text": "Exelente lugar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeExhSjlRRRAB",
            "text": "Absolutely thee best breakfast I've had in a while!\nI had the mushroom omelet that came with cheese and a tiny bit of sautéed shallots with these fantastic and correctly sliced shitakes. This omelet was stellar and I finished the whole thing. Something I rarely do.\n\nYeah right. 😉\n\nMy girlfriend had the chicken and biscuit sandwich which looked really good as she confirmed and proceeded to not offer me any any even though I gave her a bite of mine.\n\nAnyway 😉 moving on...\n\nThe ingredients are fresh, the food looks and tasted next level delicious! The pricing is super fair for what you get and we will be driving from Astoria to our new favorite brunch spot on the regular. This place is next level, trust me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMM2I2M1RnEAE",
            "text": "OJ small glass 10$."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMM1BxRGRBEAE",
            "text": "Must try!\nI was amazed by the service of Mame and Emmett.\nGreat food selection by the famous chef Alex.\nI devour lobster roll and deviled eggs with bacon.\nCod fish sandwich was mouth watering."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOUt1VWhnRRAB",
            "text": "Literally a gem in the rough. If you come to City Island there’s no other place you should go. The food is phenomenal, staff is amazing, and it brings you into a new world.\n\nThe city has good food, but that’s too far. This brings the perfection of a city 5 Michelin to local, and on top of it the best food on the island.\n\nThe staff is amazing, will become your best friend as the food takes you away, destroying any thoughts of what normal dining is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NGNIRUNBEAE",
            "text": "Super friendly staff and delicious food. We had brunch, great choices on the menu and the specials. Highly recommend when visiting City Island!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbFBmRkV3EAE",
            "text": "My husband and I love this place!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcVBIUzJ3RRAB",
            "text": "I reserved the restaurant for my birthday lunch, and the whole process was amazing and effortless! Chef Alex was so accommodating with my logistics (food allergies & preferences!) and he came up with both a menu and flow for a spectacular event. The guests could not stop raving about the food, the delightful staff, and the space."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc2IyemdRRRAB",
            "text": "Everything on the menu is terrific."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndE83aEN3EAE",
            "text": "This has been my favorite place for many years. Alex and his staff never disappoint. Yesterdays dinner was a VIP experience, where chef created a festival of flavors for us. My taste buds were exploding with every bite. Thank you, thank you, thank you. I will be back with other set of my friends to enjoy this place again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eGFLZGxnRRAB",
            "text": "I was so disappointed when I was charged\nEight Dollars for syrup for my waffles then the guy had an attitude when I asked why I’ve ate thair multiple times and never charged for syrup “ever!!! shame on him I did not get his name but it was the only mexicn that wk there I’m so disappointed  won’t go there again.\n\n*****Bravo for such a poor and fabricated excuse to justify the ridiculous actions done by your establishment. If anyone who has visited & ordered the same dish , chicken & waffles knows you only provide a small syrup dispenser which holds a certain amount so if your guests are only allowed to use a table spoon of syrup maybe that should be noted in your menu like “ beware use syrup at Archie’s discretion not to your liking or there will be a surcharge”. !! Then exaggeration of 20 packs of sugar.. come on! You don’t even supply 20 packs of regular sugar in those containers.. STOP IT & then now resorting to a fictitious situation that happened in the dinning room, hahaha , you know that never existed, had there been such incident I never would have been seated .. I think you’re just bitter you can’t get a good staff, one that doesn’t allow your guests to just sit there for 20 min and not be tended to, or giving people orders they never asked for and charging them for things they never ordered like the table beside me .. you should be appreciative.. what’s wrong with you Sir … who watches how many PACKS of sugar a person puts in their CUP of coffee anyway!! This place officially SUCKS.. I think it needs to be converted back to the garage the architect designed it to be … so much for supporting small business, my money will happily go somewhere else perhaps Denny’s🍻🍻🍻🍻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkalByaDVnRRAB",
            "text": "Delicious Brunch! Wanted to come here for a while now and finally made it, totally worth it! awesome atmosphere. Outstanding service staff was attentive and friendly. they close after brunch and reopen for dinner. Definitely coming back specially in warmer days to sit outside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcUpPejNRRRAB",
            "text": "High end Whiskey and Bourbon selection.  Chef Alex culinary skills shows in his food….fantastic.  Staff is friendly and wonderful. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bXJ1RmV3EAE",
            "text": "We went for brunch and it was amazing! I got the shrimp omelet and also tried the sour cream pancakes. The shrimp omelet was perfection! Sour cream pancakes were fluffy, with a bit of a chewiness. Also had virgin bloody mary’s — they were very good! A touch of horseradish, nicely balanced, not too much heat. I’d love to come back and see what they do for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NnBPNFpBEAE",
            "text": "Food was beautifully made . Staff was very friendly and the atmosphere was just great ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0aElEMUdBEAE",
            "text": "Great place.  Nice atmosphere, terrific service, and delicious food.  Loved the Salmon BLT for brunch.  Hubby raved by his eggs platter."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOU1td2tRRRAB",
            "text": "Archie's!  The real thing.  totally neighborhood (City Island) friendly, warm, welcoming.  Outstanding menu and food is so fresh and well prepared for a small place--don't know how they do it!  Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsZ19mMnB3RRAB",
            "text": "Great service & food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cXVyRjZ3RRAB",
            "text": "Good yummy food and friendly. Outdoor seating"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGeGRYU3hnRRAB",
            "text": "Archie’s Tap is absolutely fantastic!  I heard about this hidden gem for some time now , but haven’t gone until last night. We had the pleasure of being meeting the amazing chef Alex, and he is so welcoming, you feel like you’re dining with your best friend !\nThe staff is phenomenal! Jorge was our server, and his friendliness and warm greeting definitely impacted our dining experience. We had a few delectable appetizers! Blistering Shisito peppers 🌶️ are amazing, also had the Tuna Tartar definitely one of the best flavors I have ever had. We also had the burger , superior quality !! And the Detroit Pizza .. omg A M A Z I NG!! I would come here again, and again a million times. Definitely worth a visit, and don’t forget the amazing selection of rare find liquors and top shelf liquor. I had the El Chapo it was THE BOMB ! Love the entire experience THANK YOU ALEX AND and Staff for a wonderful Saturday Night!! As Arnold Schwarzenegger says “We’ll BE BACK”!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaajRMYnJRRRAB",
            "text": "Everything we had was tasty and the portions were generous.  The service was great and the spot was so cute!  Will definitely be bringing my friends here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNnV5d0NnEAE",
            "text": "Went in on a recommendation with a friend and it did not disappoint! Killer bourbon selection, food was phenomenal, and Alex couldn't have been more hospitable if he tried!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLWZxSjlBRRAB",
            "text": "The food is always excellent. The service is friendly, but inexperienced. Had to ask for flatware, etc."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa3ZpYzRnRRAB",
            "text": "Delicious food was served hot and in a timely fashion. Waiters were very friendly and helpful. Drinks were delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4blBfMWF3EAE",
            "text": "This was a new spot I went to with some friends. The waiter was friendly and attentive. Also, the food was delicious, and I would definitely go to it again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cHM3bk5BEAE",
            "text": "Go to spot for brunch & dinner on City Island. Everything on the menu is delicious. Always excited to see what’s on the weekly specials menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdDhIb2dBRRAB",
            "text": "OMG this is the best place in city island! Delicious, friendly, clean, and fun. Come over and meet Chef Alex."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob0lfdU1REAE",
            "text": "The very best!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoai15eGxRRRAB",
            "text": "Our first time there absolutely adorable.   Great looking place. Jorge was wonderful...but here comes the but.  $17 for a glass of wine, when this particular bottle sells for $25 this is totally insane.  You are City Island not Manhattan.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeHZlc3RBRRAB",
            "text": "Brunch!! This is the place to be, especially on a warm sunny day. Outdoor seating as well as indoor. Been coming here since 2017 and the service and experience is constant. Attentive and solid food options keeps us loyal- Mom and I come here and love it."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlemNyazlBRRAB",
            "text": "While eating the Mussels Fra Diavolo, someone ordered the Blistered Shishito Peppers with a Black Garlic Aïoli Smoked Maldon Sea Salt and Lime. It smelled delicious.\nI will order it the next time that I am there. Also, the Chef's Gelato Selection is fantastic!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbk5hR1dREAE",
            "text": "I enjoyed my chicken and waffles. I loved how my food tasted. The salted avocado was great. Note if you have a kid who loves avocado please make sure order more than one."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaTRiaFN3EAE",
            "text": "Food was excellent and the service the same. Will definitely return!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMl9tWG5nRRAB",
            "text": "It was nice, beautiful day this past Saturday and we decided to take a leisurely stroll to City Island.  We happened upon Archie's and decided to give it a try.  We were greeted by the hostess who seated ups promptly.  She was friendly, attentive, and helpful with beer recommendations.  The restaurant is a nice and quaint place tucked away from the weekend City Island madness.  I can really envision sitting here during the warmer months and enjoying a nice cold brew.\n\nThe food came out quickly, was piping hot, and delicious.  The portions are generous.  The buttermilk fried chicken is extremely juicy and delectable!  I will definitely stop by again and give brunch a try!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3cnVfRFpnEAE",
            "text": "This place is new but, it's definitely the shake up that city island needs. Its the only place that is like this on the island! It has that upper west side feel, chill atmosphere but the food does all the talking. Been there for brunch and…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dTZDdHBBRRAB",
            "text": "I live for mimosa and coffee on any given Sunday and I found my nirvana at Archie’s Tap and Table. Tucked into what seems to be a garage, I was happy to stumble upon this unassuming local restaurant with good vibes and great hospitality.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLM19xNGhRRRAB",
            "text": "We loved the food and the place. A friendly staff, a large choice of food. The chef makes a great job, with many details bringing more smells and colors in your plates. A great experience for a very reasonable price."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbklxTGhnRRAB",
            "text": "Very very very happy with my visit here! Excellent food and service and they make most of their ingredients in house. Had the Huevos Rancheros, corn beef hash with eggs and French toast (with cream cheese frosting!!!) Everything perfect. Highly recommend!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bXRiQnNBRRAB",
            "text": "Had a bangin' brunch there. Chicken & waffles are no joke...delicious! The chef needs to keep those chicken thighs on the menu (I heard it was only on because they were out of chicken breasts). Extremely flavorful and juicy. Beer selection is great, too  👌👌…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dDl1eHJBRRAB",
            "text": "One of the best brunch place in NY. Must visit.\nFood is just soo delicious, I would take my friends and family to experience the experience and brunch."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcmRQcndRRRAB",
            "text": "First and Foremost, this place has to be considered a hidden gem when it comes to Artisanal (&intimate) Fine dining in the city. If you are ever feeling inspired to both witness and taste perhaps your favorite go to dish like Mac&Cheese, Burgers, Steak, Salmon elevated in a way that will knock your head back and make you swoon the likes of Strawberry and Cheese in Ratatouille then I beacon you to this haven located in City Island. Now here's the rub, I'm Vegan and this place does not have a \"Vegan\" menu. However, the chef, culinary genius that he is, enjoys putting custom dishes together to satiate the palates of his diversely growing customers. I wish that I can tell you, by name, the details and ingredients that went in to create these marvelous meals I consumed with both love and satisfaction but I hope as they say, a picture is worth a thousand words. (crossing fingers)  In all, if you have never heard of this place or think you may live just outside of the range, I ask you from one Foodie to possibly another, if given the opportunity to taste a little piece of Disney magic, could you for one moment step away from your reality and live alil happy ending? Oh, and for extra credit, high acclaim goes to the staff at Archie's. They not only promote hospitality but they help to generate an additional level of patronage. Elevated food, Intimate dining, and Refined rapport. Buen Provecho"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydE52SXNnRRAB",
            "text": "We loved the Huevos Rancheros , oh so tasty , it is said that a picture is worth a thousand words , hence , the picture.\nMy wife had the spicy bloody Mary and she loved it , I had the coffee and it was no disappointment.\nThe staff was very attentive and friendly , Julian was the bar tender and Tyra was the host/waitress and to find out that they were locals made it more quaint ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0X3E2dUVnEAE",
            "text": "I have been coming here multiple times for brunch which is always amazing and decided to stop by today for dinner. I don’t normally write reviews at all & I HAD to not be selfish and keep this gem of a place on city island all to myself! Great food, great atmosphere great server and great chef that came to the table to have conversations with us. I have been a repeat customer for brunch and I’m sure I will be a repeat customer for dinner. The food is elevated and is certainly what city island needs. Stands out way above the rest of the other restaurants. Always great quality food and presentation. The attention to detail is impeccable! Don’t question it just Go go go! You won’t be disappointed!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDdUxPYjV3RRAB",
            "text": "The bugs were horrible sitting outside behind the kitchen.  We couldn’t last 10 minutes, the gnats were landing in our food and drinks.  The waiter was great and moved us to a table outside in front on the street side.  But I tell you, the bugs were terrible there too.  The food was pretty good, but it was impossible to have an enjoyable meal with all the bugs.\n\nI appreciate the response from the owner and upped my rating from 1 star to 3 stars.  The food was good, but the bugs made it impossible to enjoy."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4b3VTTDhBRRAB",
            "text": "Dined here for brunch to celebrate my daughter’s birthday. The waitstaff was accommodating enough but didn’t introduce themselves and didn’t produce a menu. We sat outside due to the pandemic but didn’t expect our food to be delivered as…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFMl91cFBnEAE",
            "text": "Went there for Father's Day brunch. I want to like it, but the experience was frustrating. All three of people on staff seemed to never have waited tables before and were clearly in the weeds the entire time that we were there. We had to wait for a table even though they were only half full because every single open table still had dirty plates on them and hadn't been bussed. Then delivering food and drinks to the wrong tables, taking forever to serve, making multiple trips for forgotten silverware, all of them standing together around the computer trying to figure out to use it. There was much more, but you get the idea. It was like watching \"I Love Lucy\" if she and Ethel had gotten jobs in a restaurant.     The food was okay. Our appetizer was the grilled green peppers, and they were the quite good (might have been a special). We both ordered the Shrimp and Avocado omelette. Not terrible, just very plain - three or four shrimp in essentially simple unseasoned scrambled eggs folded over, with sliced avocado dropped on top.   And for that, with two mimosas each (we had plenty of time to wait), the total was $105, plus tip."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNktXbjhBRRAB",
            "text": "Fantastic little spot for some ridiculously good quality food and drinks. The type of establishment we're actually happy to have on City Island, minus the price. Great for a solo meal or with a group, Archie's has indoor dining, outdoor garden dining and a hybrid-covered-outdoor dining at the entrance. The ONLY thing holding it back from 5 stars are the aforementioned prices... probably the highest on the island (no joke). I would eat here much more often if it wasn't for the cost! $$$$"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMF8yNE9nEAE",
            "text": "I really enjoyed Archie's Tap and Table. We decided to try it out on a Sunday afternoon but was worried about City Island traffic. Y'all know how it is on a nice summer day. Surprisingly, no traffic!  The inside decor is modern and clean. It's not very large so if you're a large party I would suggest reservations just in case.\n\nEven though we dined during brunch we decided not to have any drinks. But the prices seemed a little steep. For entrees we ordered the chicken and waffle and shrimp omelette with avocado. The chicken was tender but could have used more seasoning. The shrimp omelette wasn't great because the shrimp wasn't seasoned at all. I think adding even a little bit of salt and pepper would have gone a long way. The good part about the omelette was it did have a decent amount of shrimp wrapped inside.\n\nThe service was good and I would visit again. Hopefully, next visit they add some seasoning."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVLS1yNzN3RRAB",
            "text": "Six of us met here for brunch.\nIt is a tiny place so make reservations , especially for a larger group. Service was spotty, with many dishes being delivered to the wrong diners, and repeated requests for simple things necessary, to the point we had to laugh about it. The menu was creative and most of us enjoyed the food.  However, the fried chicken  and waffle  choice consisted of a lot of flattened chicken which was so dry as to be inedible.  The nowhere to be seen owner apologized via the waiter and only consented to reduce the bill by a few dollars when pressed ( it cost in the vicinity of $15.00.)  Order something  else!  It is not an inexpensive place, but very casual.  A few tables were set up outside on the sidewalk area, as it was a nice day."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMDZMbDZ3RRAB",
            "text": "You can't tell from outside but this is a very cozy spot with a very modern feel.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdHUzemR3EAE",
            "text": "Wonderful brunch at Archies . I had Porches Eggs with Canadian bacon and biscuits. My friend had the very fluffy airy pancakes. The white wine sangria was super. All the food was delicious. Wonderful attentive service - waitress Carmella. Will definitely be back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMm83VHJBRRAB",
            "text": "I love the brunch at Archie’s. Food was delish and service was excellent. A bit on the pricey side compared to other brunches I got to. I wish they had unlimited mimosas or something like that here. That would have made it perfect for brunch. Try the chicken and waffles, best thing on the menu!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvZ1ltckpREAE",
            "text": "Small but nice. Nice size portions. Definitely a hidden gem."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzamRPYUJnEAE",
            "text": "Haven't been to this place since way back when it used to be Sugar and Spice. I miss the old place and the old decor but the food is still absolutely amazing.  Best food on City Island.  The place is super small but that's a good thing. The…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpOTlEQ09BEAE",
            "text": "I got to try their famous chicken & waffles and huevos rancheros for brunch and I had a pleasant time here :)\n\nChicken & Waffles: 4/5. I was pretty disappointed with this dish because I had high hopes looking at all the reviews but my chicken was not seasoned to my liking. Everything was nice with the smoky maple syrup and all but the chicken seasoning was just too blend and I do not eat my food salty in general so that was a bummer.\n\nHuevos Rancheros: 5/5. This will be the dish I would get every time I go here. Literally, every time. The steak meat is huge! Loved every aspect of this dish. Every ingredients go well together.\n\nPortions: HUGE.\nService: GREAT. The waitress who worked the past Saturday gave a great service.\n\nI would def be back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcnNhalJBEAE",
            "text": "So I've always been a huge fan of Archie's for their breakfast/ lunch on weekends and dinner during the week. But the last few times I've went the food is still very good but the quality of service has gone extremely down hill,  since the…"
        }
    ],
    "reviews_count": 73
}