{
    "name": "2 PaiZan’s Pizzeria Cucina",
    "place_id": "ChIJVT2KbgCNwokRr_YnlOlbyV8",
    "grid": "BX10",
    "address": "250 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.8,
    "user_ratings_total": 33,
    "phone_number": "(718) 885-0919",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU2RWbHNaMlpCYTFwclgzVjNhVjgyUVhNd1YwRRAB",
            "text": "A must visit on City Island!! 2 Paizans is a true family run business with excellent service and both affordable and delicious Albanian food. The yogurt and spinach Burek is an out of this world combo! No pics were included in this review, because sometimes you’ve got to just experience thing’s for yourself! Thank you 2 Paizans for helping to make City Island a place for all of us to call home 🧘"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeVRGQlJkVjh5VTFGbGFtaDNlV3hQY1hkbE1IYxAB",
            "text": "I recently visited 2PaiZan’s, and it was an absolutely fantastic experience—easily a five-star! The pizza and Burek I ordered was phenomenal: perfectly crispy crust, rich and flavorful sauce, and fresh, high-quality toppings that made me do my happy wiggly dance with every bite lol. The food was definitely the highlight; you can really taste the care and attention in every bite.\n\nThe atmosphere was warm and inviting, making it a great spot to relax and enjoy a great meal. The service was attentive and friendly, which made the entire visit even better. I highly recommend 2PaiZan’s to any pizza and burek lover looking for a top-notch experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS1kxOUpORVJwY1VwSU9HeHJSWFJtVFdJNFNIYxAB",
            "text": "A True Gem on City Island\n\n2 PaiZan’s Pizzeria Cucina is more than just a pizza place — it’s a full culinary experience. The pizza is outstanding: perfectly baked crust, rich sauce, and high-quality toppings. We tried the pepperoni slice and it was everything you want in a classic New York slice.\n\nBut what really makes this place shine is the variety and authenticity of their menu. From savory burek to stuffed cabbage rolls, grilled meats, and fresh salads, every dish tasted homemade and full of flavor. And don’t leave without trying the fried dough with powdered sugar — light, fluffy, and addictive, the perfect sweet finish.\n\nThe atmosphere is welcoming, family-oriented, and the staff treat you like one of their own. You can feel the pride they take in both their food and service. Whether you’re dining in or grabbing takeout, you’ll always walk away satisfied.\n\nThis is the kind of hidden gem that makes City Island special. Highly recommend stopping by — once you try it, you’ll definitely be back!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSGFVdElZV1pYVTNaaWJqaGZZWEZGTURodkxWRRAB",
            "text": "The customer service they give people is wonderful on top of that all there food is amazingg!!!! My favorite is the borek idk is spelled correctly but just know you will enjoy it and go back for moreee....."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU1UwNHpkV3hQUVcxMGEycFlRVmh5ZDIxNVduYxAB",
            "text": "The Pizza is sooooo good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMllWaGljbmhWV1VSdmEyd3dUMDV5UWxwNlgxRRAB",
            "text": "Our first time ordering. The pizza came on time , pipping hot and was delicious. Btw they deliver to South Minneford YC . A great addition to the Island."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYWJIQm5NbGRSWDBOblRGWXRhM296Y2xaQ1JXYxAB",
            "text": "Amazing place.\nRecommended by Sea Scout Ship 272"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdFMwTTROWGRUYTA0dGNtUkxTbmRvYkdrMVMxRRAB",
            "text": "What a class act! This place is amazing! Get yourself over to City Island and check this place out. The food is more than great, its incredible. The Burek is my favorite, but all the food is to die for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aalFYQm9OMUpEWkhBemNIVmFhMFJQUkZCaVltYxAB",
            "text": "A Hidden Gem on City Island!\n\nI rarely write reviews, but 2 PaiZans Pizzeria deserves all the praise—and more! From the moment you walk in, you can feel the pride, culture, and heart behind this family-run spot. The staff treats you like you’re part of the family, and the food? Next level.\n\nTheir pizza is perfectly crisp with a chewy crust and just the right amount of cheese and sauce. You can taste the tradition in every bite. But don’t stop at the pizza—try the burek or the Albanian-style dishes. It’s not often you find a pizzeria serving such a unique mix of Italian and Balkan flavors—and doing it so well. The sandwich was a knockout, and the strawberries with chocolate and pistachio was the perfect finish.\n\nIt’s clear they put love into everything they do, and that love shows. Clean, welcoming space, great music, and a truly local vibe you can’t fake. Whether you’re a City Island regular or just passing through—this is the place to eat.\n\nHuge respect to the owners for keeping it authentic and delicious. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MFQyUkRhMnRsT1RCS1ZuUllWVFpTYldWMmIxRRAB",
            "text": "Yo. Best customer service. Great pizza but I come from New Rochelle for the Zeppoles. Banging. Come here. Get them. Now. Extra powdered sugar!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa2FVeEhjV0l6ZEVSelIwaDNRVWxKY1Vac1RVRRAB",
            "text": "Had a great late lunch here.  Pepperoni pizza was awesome as were the honey glazed wings.  Nice to be able to sit outside.  Emily, our waitress, went out of her way to make my 90 year old mom and me comfortable and welcome.  Will definitely come again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTFZsVnBRblpDWlVVdGVWOVRNamR3YnpaSFIzYxAB",
            "text": "Absolutely amazing pizza and burek, with a warm, family-friendly atmosphere! The Margherita is out of this world, Pizza man Joe is the real deal! The burek is outstanding, perfectly crispy and savory. This is a family-owned and operated gem with years of experience, and it shows in every bite. So glad to see real, authentic Italian and Albanian cuisine right here on City Island. A must-visit!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX01ETzlBRRAB",
            "text": "Using canned Mushrooms is not real Italian.  Try using fresh Mushrooms!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVDIzdXp0NnJXbGNBEAE",
            "text": "I recently visited 2 PaiZan’s, and I have to say—it completely exceeded my expectations. The pizza was absolutely delicious. You can tell they put real care into their ingredients and preparation.\n\nThe atmosphere was warm and welcoming, Cindy & staff were incredibly friendly and attentive.\n\nI highly recommend trying their burek, but honestly, everything on the menu looked amazing. This is definitely going to be one of my go-to spots whenever I’m craving great pizza!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQ0ZrY21sdjRDQUd3EAE",
            "text": "I have lived in New York all my life. This was the best margarita pizza I have ever had. Hands down. The sauce, the cheese, the garlicky goodness….it was perfection. We devoured the entire pie in a few minutes. Also tried their Albanian meat pie and of course a regular cheese slice. All delicious, you can’t go wrong."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM1VvYUtyNmNuOWpBRRAB",
            "text": "Great family, great food!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLWZ5dWFBEAE",
            "text": "Our go to for pizza and burek on the island! The quality of the food is fresh and delicious. They have special fillings like cabbage and potatoes in the burek and exclusive toppings on their pies on certain days that you will not find anywhere else in the Bronx! Hit the follow button on social media for their daily updates. Oh and their Albanian cevape (sausages) with cabbage salad and feta are a must try!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMTdLVXd3RRAB",
            "text": "Excellent pizza some of the best in the Bronx you really should take a ride to City Island you'd be amazed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaTZLZGdRRRAB",
            "text": "Best pizza in the island"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnBTREhnEAE",
            "text": "Tonight I had a Sicilian slice that was very good. The crust is not heavy it’s fluffy so not overly filling. I also brought home a Burek. They are so good you have to try it. Will be going back soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnFqRFB3EAE",
            "text": "Warm and welcoming the best margarita slice!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNnNIckxBEAE",
            "text": "Love the pizza"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdExIRlhBEAE",
            "text": "Always courteous. Always delicious. Always ready to come back. A little birdie told me lasagna is on the way"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcm9lcVlBEAE",
            "text": "The staff made great recommendations, and the atmosphere was warm and inviting. Whether you’re dining in or grabbing takeout, this place never disappoints!\n\nIf you’re a pizza / burek lover, this is a must-try spot. I’ll definitely be coming back for more!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcnN5RnFnRRAB",
            "text": "The food here is amazing!! You must try the burek. Also, the service and hospitality are wonderful!!! The best food around."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaXZUMUFREAE",
            "text": "Burek has now been added to my list of favorite foods.  Kudos to Cindy for making my special request.  It was so delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMC1pc0h3EAE",
            "text": "Really yummy pizza shop in City Island that offers some traditional Albanian food along with the beloved Italian pizza shop staples. I tried a pizza with turkey pepperoni and it was so yummy and flavorful. The Albanian burek has delicious…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcUplUVFREAE",
            "text": "Awesome food Awesome people!"
        }
    ],
    "reviews_count": 28
}