{
    "name": "Cap't Loui Whitestone Bronx",
    "place_id": "ChIJ1TGoLb6LwokRbu9C63RQ6yU",
    "grid": "BX10",
    "address": "815 Hutchinson Riv Pkwy, Bronx, NY 10465, USA",
    "rating": 4.7,
    "user_ratings_total": 549,
    "phone_number": "(347) 293-6871",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWGVUaE1ORTlWZERKSVlVSlRkRWRPU3kxU1dWRRAB",
            "text": "Stopped in for lunch while visiting from out of state and we were not disappointed. Good portions. Decent price. Clean bathrooms for customers. They may also do Korean corn dogs on a different menu? Shrimp po boy and Cajun fries for me. My spouse had classic fish and chips. Canned sodas available and other options. Easy to park at a nice Target anchored shopping center."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UVdFUlZiV1ZOVURWRE5rZG5XV3hTWWpGU1pHYxAB",
            "text": "This is one of my fav seafood boil spots in the Bronx but Idk what’s going, service seems to be declining. I went on Friday and the sauce seemed different and very stingy with the amount of sauce in the bag. I had to ask staff multiple times for extra sauce (which i was charged for) and at the end, i had to leave more than half of my food because it got cold waiting.\n\nI also understand workers talking to each other when there’s downtime but at least pay attention as you’re conversing so it doesn’t feel rude interrupting a conversation lol."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKV1RFTlJZM05CTmtsS05FTlRkMHBCZDI0NFVVRRAB",
            "text": "Very rude crew in the morning"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreGEwdDFVa3BsV2tWTlgzcEVSbWROUmpJeFMwRRAB",
            "text": "It's seafood, so it was expensive, I suggest going with a group and splitting the bill, but the food was delicious👌🏾 I would definitely recommend it to people and I'll be making another visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMkxVdE9Va1paZEZOaWFXOW9XbVpXVkhKYVdsRRAB",
            "text": "I had an amazing experience at Captain Louis! The food was absolutely delicious and served fresh, and the service was outstanding from start to finish. Justin went above and beyond to make sure everything was perfect—his attention to detail, friendliness, and professionalism really stood out. The service was truly 10 out of 10. I left very happy and will definitely be coming back. Highly recommend Captain Louis to anyone looking for excellent food and top-notch service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQmMzTlJhM2gwY0RSUVUyTldOVVZTZVdSak9WRRAB",
            "text": "Pick up service is bad"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVGJYQnNNV2sxUlRSS2NEbFRhazF5Wm5KaWFrRRAB",
            "text": "Good food and service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdFRrZDNiMHA2WTJ0WGJXSlVRa3BJYWt3NVduYxAB",
            "text": "Food was delicious & service was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVJGUmhjSFpGZDNORVZ6bG5SMUJaY21ORFgzYxAB",
            "text": "The food was excellent however, I wish the cooks were careful about people who have shellfish allergies.  Please cook shellfish separately from fish and calamari."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1RHaHRXbGhxT0VSM1kySmxWalZWYTFoNE1uYxAB",
            "text": "The food is good and the restaurant is well-kept, but their seafood is relatively expensive. For example, I would expect the shrimp to be $3-4 cheaper based on the prices of other restaurants."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWV0xUSjNSRko1U2pFMlNIVldXV3RUZEZKMWRGRRAB",
            "text": "ive been sleeping on captain loui , crab legs ,with loui sauce 🔥"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlgxa3lVbVJHYzNsM00yRk5jREJDWVhsaWRWRRAB",
            "text": "Jason was the best server. It was my family’s first time eating sea food boil and he guided us through our whole experience. Amazing service and the food was 10/10!! Would definitely be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GR2QweEhkVGRXZFZseVF6Tk5jMVYyVjJWWlVHYxAB",
            "text": "The calamari was good, the juice was great. Not bland but also not too sweet. Also like the packaging. Good marketing. The highlight was the fries with the lemon pepper seasoning. My girlfriend enjoyed the snow crab. Overall good flavor on all the food and great portions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQy1sb0tHeXN2anZnRRAB",
            "text": "Food was delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMFgyWnBNbUl6U1RKRVgzSXlWM05TWTBFMWRHYxAB",
            "text": "First time here. Was looking forward to checking this place out and eating here. Food was ok. Very pricey. Had I known that I would have just gone to city island. Nothing to rave about. My corn dog was falling off the stick, my drink was watery and we weren’t even given crab crackers or crab forks. Some pieces didn’t need the tool but others did. I’m guessing they wanted me to use my teeth and break them while I cracked the crab legs. This place was def a one time thing. I could have fed my entire family of 5 for the price they charged for 2 people elsewhere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbFRXaEtVblJNZDNOUFoyNUxMWEZFV2tkMk5YYxAB",
            "text": "Not good service I didn't like the food not too many choices and there is not lobster"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPem15TzdXOGJPRVNBEAE",
            "text": "Food is good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbWgxSnZYd1pTRFNREAE",
            "text": "Nice little spot. tasty corn dogs of a different variety. Staff is very nice but pre-order as it takes a while to get your food. Boil there tastes great!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPXzB6S0MzcDRQd2VREAE",
            "text": "The chicken was unexpectedly spicy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJelBtc3VrcmRqQ1h3EAE",
            "text": "The food way okay I got a shrimp po boy. The flavor was good but there was only 6 pieces of shrimp. Other was good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKU3Qzb2FDNDVESUN3EAE",
            "text": "The Lobster Rolls🦞 🥖 here are great & tasty. With the sauces included is a + but with out it, it's still excellent. With the Canjun Fries🍟 is even better. The service was great & the staff was attentive & nice. I would definitely be back & i recommend this place for your seafood boil. 🥖🦞🦀🦐🥘🍴🧈🥤"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMHNtZWhBRRAB",
            "text": "Food was amazing. Came with my friends got a seafood boil 10/10. Our server was Christian very attentive and  positive energy made our experience better 😊."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHNuNlNBEAE",
            "text": "christian really took care of me and my friends really good service apart from the food which was also a 10/10 !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMG9uYjlnRRAB",
            "text": "Service & food was amazing\nChristian was really attentive and constantly checking in on us on a busy night!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbU9ydzdRRRAB",
            "text": "More expensive little bit food the worst place that service They charge you even for a cup of water five dollars I would never come back to that place again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbDVUQzZnRRAB",
            "text": "Literally worse service ever. Waited over 30 min. For one stupid corn dog. All it takes is to defrost this bull. Store is not even full. Absolutely worse place ever don't go there if you except to get one thing and get it quick"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2JIZ1p3EAE",
            "text": "Not as I expected, it’s better to go red\nLobster 🦞 than waste your money here . Service is slow . Food isn’t that great , no beer or nothing"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2ZITHV3RRAB",
            "text": "We went to have a nice dinner and in the middle of us eating the seafood boil, a mouse is running around the floor. The whole restaurant was screaming and telling them do something. They didn’t do anything. To add on, they refused to take money off the bill for the inconvenience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNjhhdjB3RRAB",
            "text": "They are horrible made a mistake with my Oder and decided to do nothing about ut"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvelpxQ3lBRRAB",
            "text": "Friday dine in 👎🏽\n50 min wait for food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJODR2d1VBEAE",
            "text": "It's a little pricey, but what isn't these days."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbklHSi13RRAB",
            "text": "10/10 recommend😍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MnBfOEJnEAE",
            "text": "It was a very long wait.\nThe waiter was very nice and took time to explain everything.\nThe food was very mediocre and a bit pricey for what it is. Other places at least add more corn and an egg 🤷🏻‍♀️\nWon't be coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dXBmZVp3EAE",
            "text": "Over proced"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdElLRzdBRRAB",
            "text": "i’ve had their food multiple times and they’re always good! the vibe was great and the staff were very friendly. i went sometime last week and my server, partoza, always asked if i wanted anything else and was quick to refill my water whether i would ask or not. very competent with bringing my food and he would give me a heads up if it was going to be a few minutes late if they have a lot of people coming in. staff he works with are also competent with bringing my orders to me, giving me a heads up as well. they were never rude or anything like anyone says. this establishment is mostly busy and there would be like 1 or 3 people serving at a time, it’s a restaurant.. of course there’s other people staff would need to serve and not just you, keep this in mind if you’re impatient. please be considerate to the staff, they do a lot. i would recommend going here if you love seafood boil, but there are other types of food to choose from too! like chicken, corndogs, etc., if you don’t like seafood. there are only two types of dessert so far, but the funnel fries were so good! forgot to mention the drinks, it’s kinda a small selection but they’re great! i’ve had the watermelon and mango lemonades on separate occasions, but the shirley temple is my absolute favorite i recommend it! great food and drinks with excellent staff service, this place definitely became one of my favorites and i’ll be coming back soon to try different food and drinks on my next visit!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRczlTN3VRRRAB",
            "text": "Sigh I cane here today with my friend at approximately 1pm. Me and Her were the only people in there and We didn’t get our food until almost 2pm. Pissed was an understatement. All the times I have been here this has never happened.\n\nIt was almost 30 minutes after ordering where I called our server Partoza over and asked him where our ginger ales were, he had completely forgotten. right after I asked for an ETA on our food because it had been 30 minutes. Mind you, once I asked for the ginger ales I noticed him laughing with his coworker clearly signifying that he forgot to get them. Again there is only one other table in there and they were already eating by the time we got there. They were a table of 5 and we were a table of two.\n\nUpon asking him the eta, I WATCHED HIM put our order into the computer almost 30 min later. Leading us to have to wait almost another 30 min for our food. a few minutes after I asked for the ETA he came over and told us they were “washing a pot” so our food should be out in 5 minutes. HUH????? Our food was not out in 5 minutes.\n\nBrought us the check didn’t ask if we wanted dessert I had to ask another guy who wasn’t a waiter to change our bill because we wanted dessert, I am only giving a two because the food was good. There was no reason we were the only ones in the restaurant, it took us almost 30 min to get our drinks and almost an hour to get our food.\n\nOn top of that two ladies were seated around the time of us getting annoyed and they got their food right after we did, they were seated for about 15-20 min before they got their drinks and food and by time we finished eating they were almost done. Maybe they had something against us, idk.\n\nOverall the food was good but a terrible experience. I have been here multiple times and never been treated like this."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLVByWEVnEAE",
            "text": "I haven’t tasted anything else in this spot, but the one item I got was awful. I thought jambalaya is supposed to have sausage, shrimp, beans and rice with some good New Orleans seasoning, but instead I got slop. I just wanted something small and I ordered a bowl of jambalaya which was a cup of 16oz slop. And to think I paid $12 with tax, for slop. 😳😳😳"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneGJTRHZRRRAB",
            "text": "While working in NY, I've been eager to try this seafood establishment. As a frequent visitor to this shopping center, I thought I'd give it a try. The service was excellent, with a friendly and relaxed crew. I enjoyed the flavors and spices of the seafood boil, particularly the Crawfish and shrimp with the head still attached. However, I've noticed that this is the third seafood restaurant in NY that I've visited, where the seafood tends to be overcooked. As a professional chef with ServSafe and food handling certifications, I find it disappointing that seafood is often overcooked, given its relatively short cooking time. While I may not return, this establishment seems suitable for younger crowds seeking a casual seafood boil experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXQyQXRRRRAB",
            "text": "Had a wonderful lunch here today for the first time! Can’t wait to be back. Excellent service, food was delicious, flavorful, and exactly what we hoped for and more!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ282MjlnRRAB",
            "text": "jambalaya is tasty but spicy. Lunch specials are good. It's BYOB (Bring Your Own Booze)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGVtQjVBRRAB",
            "text": "The review isn’t for Captain Loui, but for the Kong Dog restaurant inside the place. Ordered the 6 pack of Kong Dogs and after receiving the order and getting home, we noticed an additional charge was added that wasn’t noted on the menu. Got me once, not next time. If you are charging an additional fee on an item, post it. I have a low rating on the service because we should have been made aware of the charge. A common practice these days at some places adding an over charge."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMGFYT0N3EAE",
            "text": "I did not like the seafood boil the house sauce was to sweet the seafood tasted bland like nothing the king crab was old the mussel and clams was chewy lime rubber  however the service is great.. the food itself was tasless"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MTVTVlpBEAE",
            "text": "The food is always delicious at CL. I ordered the lunch special(shrimp basket)for $13, which, to me, is a steal. The shrimps are a good size, and the sweet potato fries came out crunchy and salted to perfection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX295WnNnRRAB",
            "text": "35 minute wait BARELY anyone inside for one corn dog …"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbXJydk53EAE",
            "text": "Fried shrimp basket was tasty. Spicy fries were crunchy and had great flavor!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX0pEY2lnRRAB",
            "text": "Really enjoyed the eats"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eU5TZkhnEAE",
            "text": "We only ordered the Gorilla Dogs, but they were good. Saw everyone enjoying their seafood orders. I would go again and this time bring my beer. It's on the menu...lol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3c2QzUWZ3EAE",
            "text": "it was my first time experience in the bronx.i love their food.specially the lemon papper fries was awesome.i would recommend to go their."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3M3VPem9nRRAB",
            "text": "We came here on a Wednesday around lunch time. The service was great and our waiter was very helpful in deciding what we should order. All of his food and drink recommendations were great. The boils were some of the best seafood I've had in New York. The shrimp and crab were cooked to perfection. The fried platters were flavorful, crispy, and cooked to perfection. I would definitely come here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3d3V5OW5RRRAB",
            "text": "For my first time I really enjoyed everything. The food, the venue and the service is great! I would recommend this place if you enjoy seafood. Food tastes very good and portions are big for the combos they have. Not to mention complimentary mouth wash in the bathrooms neat addition you dont see a lot in places"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dDkzbmtBRRAB",
            "text": "The purpose of this review is not to hate or harm this restaurant in any way, shape, or form. That being said, I hope you take this review as an informative review.\n\nAtmosphere: I came here since it was the only place with good reviews around the area. Looking at it from the outside, it looks like it has a pretty chill vibe. However, once you're inside, you don't get that same vibe. It is kind of confusing because the style of music does not go well with the food being served. Their TVs also show more sporting channels. So, the atmosphere is a bit unclear.\n\nService: I have got to say that the service had its ups and downs. They're attentive and welcoming. However, it took so longgggg for them to make my order. This was the first time ever I have had to wait so long to get my food. It literally took them more than 30 minutes, 35 to be exact. So, if you're planning to order at this place, do it 30 minutes ahead. Even if you're planning to dine in, come 30 minutes earlier.\n\nFood: I was hoping that my order was worth waiting 35 minutes. Unfortunately, it was not. I ordered the Shrimp Po' Boy sandwich and the Cajun Pasta. The sandwich was just a bit misleading, finding the ingredients at the top and empty space at the bottom. The pasta tastes okay until you become overwhelmed by the oil in it. I could not finish it. In my humble opinion, pasta should have more sauce than oil.\n\nPrice: In my perspective, I know seafood is pricy. Therefore, you should be able to make the most of it in order for the product to be worth paying for. My experience and my order make me feel like their prices are indeed high. Perhaps their other dishes are better and worth paying for. I think that is up to you to find out."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNFphUDd3RRAB",
            "text": "We absolutely love this place. The food is always fresh, seafood is seasoned well, the staff is always very welcoming and it's location is open with outdoor and indoor seating. We usually order the boil with Capt Loui sauce \"Hot\". They do have non alcoholic strawberry lemonade and mango drinks and you can bring your own bottle of wine or the like to have with your food. Shout out to our guy \"Jun\" who always takes care of us and is just super nice. Try the mussels..they are amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobHM3THBRRRAB",
            "text": "My friend brought me here because she said it is her favorite place for seafood. She was completely right. The food is amazing. We ordered snow crab, shrimps, and calamari with garlic noodles and a piña colada. It was worth every penny"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aGU3NDZBRRAB",
            "text": "I went to the Kong Dog inside Cap’t Loui and it was tasty and good. Not so much a corn dog person but you can get it with cheese or half and half with topping of your choice. They have a selection of ten different options. A great place to eat when shopping near the outdoor mall. Their wings are great too. The service is excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsN2Rxd2NnEAE",
            "text": "I took my girlfriend out to eat here and we enjoyed it. The service was attentive and direct. The food tasted great and you get to pick your spice level which is a great touch (we got the second hottest flavor which was very flavorful). It's definitely affordable as well, the price makes complete sense for the quality and quantity you get."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNFk3OVF3EAE",
            "text": "The food was delicious and fresh. We went on a weeknight for a late dinner.  Ordered a green apple and mango drink (they were delicious and not overly sweet), 2lbs of pick your own seafood boil, side of garlic pasta, and a cod fish po' boy sandwich with lemon pepper fries. Hubby advised that the medium spice for the seafood was very spicy.  If you're not a fan of too spicy,  stick with the mild. The lemon pepper fries were surprisingly sweet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNjRlUWhnRRAB",
            "text": "Very clean spot, friendly staff quick yet quality service. The food was AMAZING!! Best boil sauce Ive had in a long time. BYOB"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eWYzeWd3RRAB",
            "text": "Well I’ve been loving Capt Loui for a very long time. I celebrated my Bday here as well as their other locations. Great food, great service and a very friendly & safe environment especially for the kids. Family & I Love it!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNzZpYVZREAE",
            "text": "If you are looking for Cajun seafood, this is the perfect place to go!\n\nThe staffs are very kind and nice.\nKeep the smile all the time.\n\nOrdered the pick 4, you get 2kinds seafood for free.\n\nThe cajun sauce!! YUMYUM\nVery tasty!\n\nThe place is new, very clean! Awesome.\n\n5stars!!! Definitely coming back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bWJDb2FnEAE",
            "text": "Love, love, love this spot for delicious Cajun style seafood boils!\n\nFood: I always get the 1lb snow crabs legs, in medium spice (has a great kick) which comes with potatoes and corn. I also get the garlic noodles which are an amazing accompaniment to the seafood boil. The boil bags comes to the table hot, and nicely seasoned in the Cajun sauce/oil.\n\nDrinks: I will admit this capt Lou does not sell liquor/drinks with liquor at this location however, this spot is BYOB-friendly and there is a huge liquor store Ont he same strip as the restaurant for convenience. I have had their virgin Pina colada which was also tasty and even better when I added my own rum!\n\nServuce: The Servuce has always been A1 here each time I’ve come. The servers are very friendly and helpful in deciding what to order from the menu.\n\nAmbiance: This restaurant has a live jazz band play right outside of their establishment during the week and plays R&B, Top 40 and Hip Hop on the weekend. The est has always always been clean and welcomes you inside with the delicious scent of Cajun food!\n\nOverall, you can’t go wrong here - especially if you’ve never tried a boil before. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NjhqRXp3RRAB",
            "text": "So I’ve officially become a regular now! Been there three times since it’s open and the staff is starting to recognize me haha !\n\nFirst of all the location is perfect! parking is huge plus! The presentation is great, great ambiance when you arrive! THE FOOD !! if you’ve been to capt louis before you know what to expect GREAT SEAFOOD ! So far at this location the flavor has been superb! Well cooked ! Served nice and hot! The bibs and gloves are a MUST because you will be digging in! The pricing is reasonable because you get your moneys worth. Portion is even shareable if you wanted. I love the drinks in zip lock pouches! Just great honestly ! And they have chicken for the kiddos that don’t eat seafood !\n\nThe service - the girls that greet can be a little more attentive, they usually aren’t at the front and when they run to the front when you walk in they aren’t actually greeting they always have this weird attitude but I’m not worried about being greeted by the time I arrive I’m heading straight to my table. But as a first impression greeters are important.\nThe waiters - TYLER is amazing! Such a nice guy. Very attentive to what you need, comes by to see if you need anything not overwhelming but not forgetful either. Just the perfect amount of attentiveness !  Is almost immediately over with anything you ask for! Super friendly and provides excellent service. Takes order within reasonable time. There’s another guy who helps but I haven’t been able to catch his name he’s really good too!\n\nOverall I give this place 10/10! I will be back I have told all my friends to go ! Love it !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLVpuQWJBEAE",
            "text": "From the service to the quality of drinks and food, this place is amazing! My friend and I usually go to the Harlem location and have pleasant experiences there so we were a little nervous that this location would live up to it. However, to our surprise, it surpassed it by far. Definitely a place to come to for some good ol seafood boil.\n\nP.S. forgot to take good before pics but the aftermath should be proof that we enjoyed ourselves lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4djZEbFdREAE",
            "text": "Amazing service. We got the crawfish, snow crab, shrimp, garlic noodles, steamed rice, corn on a cob, soft shell crab, Cajun fries, everything was so good! My favorite was the CAPT LOUI sauce, it is to die for! The server was amazing!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMXBlV3Z3RRAB",
            "text": "Delicious Food is served in a nice hygienic environment. It’s my second time and you should definitely too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUsybVlBEAE",
            "text": "First time at this restaurant my wife and I wanted the corn dogs.\nThe girl who took our order said would we like all cheese or half cheese. We said all cheese thinking that the actual hotdogs would be completely cocered in cheese. So basically we got really big mozzarella sticks.\nSo basically your staff should ask customers if it's their 1st time and explain what half cheese to all cheese means. Half cheese is with the hotdogs. All cheese is no hotdog...\nThey gave us a new order with the half cheese and hotdogs inside!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoeXFMNXdnRRAB",
            "text": "A surprisingly delicious seafood boil joint here in the Bronx!\nCap’t Loui is a humble seafood boil restaurant before crossing the Whitestone bridge. The place is unassuming but the food packs a punch! The head-on shrimp was one one of the best shrimps I’ve had in a long time. It was juicy and flavorful with the perfect complement of the cap’t loui sauce. We also ordered the chicken tender basket - the chicken was tender, juicy and flavorful. With the side of cajun fries, it’s the perfect balance of textures when eaten with the seafood boil.\n\nAll in all, come for the food and also experience great customer service. This is definitely an unexpected find here in the Bronx."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4M05fbEtREAE",
            "text": "Food was amazing!  Fast and friendly service.  Music gave it a great vibe.  Totally recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSelk3ck9nEAE",
            "text": "Food was top tier. I got the snow crab legs and shrimp head off and chose the capt loui sauce(hot). I must say it definitely is spicy how I liked it usually other seafood boils tend to not spice up the food even when you choose for it to be made spicy so I appreciated that. I would definitely come back and also you can BYOB."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNVB6SkdnEAE",
            "text": "Went to this pl yesterday .it was great. The food perfect. Service perfect. Will b going back soon. My server was trained hospitable. The staff was warm and friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aXBDMUpBEAE",
            "text": "It was incredible food! We both ordered the po-boy and they were phenomenal. The sauce is amazing. The place was also very clean and they have mouthwash in the bathroom."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3N6WFpREAE",
            "text": "First step into restaurant is a wonderful smell of spices The food is fresh and flavorful (be sure not to eat with your eyes this food will fill you especially with the noodles)the servers and host are amazing welcoming and respectful. An amazing place to eat"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM2ItM1RnEAE",
            "text": "The food is amazing and the staff are super friendly. I come here with my mom at least once a week. Definitely recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOUwyZWJREAE",
            "text": "This place is amazing. Me and my family always come here when we are in the mood for seafood. The music is great and the service is phenomenal !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa1BxcGVBEAE",
            "text": "Food is delicious.  Service was great."
        }
    ],
    "reviews_count": 74
}