{
    "name": "Made in Puerto Rico Latin Cuisine Bronx NY",
    "place_id": "ChIJHaVzNEaLwokRQB_-jwrkW2E",
    "grid": "BX10",
    "address": "3363 E Tremont Ave, Bronx, NY 10461, USA",
    "rating": 4.3,
    "user_ratings_total": 3141,
    "phone_number": "(718) 684-1309",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMlNHcFRZa0ZTUVRaVWIxa3lNRVJKYlhkNFluYxAB",
            "text": "I would give a 5 star for Atmosphere if I was younger and it was more my scene. Music was enjoyable but at times too loud. Not the restaurant's fault, just my preference for a quieter ambience. Service was amazing tho! Jason, our server, was attentive and and friendly. Food service was quick, without sacrificing quality. Amazing tastes! Thank you for a great time!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRFJqbExSbHAzYm5obGNHWmFOVEZNVjFGbE4yYxAB",
            "text": "My husband and I came here for the first time a couple of weeks ago , our server since than has been Maria she is amazing always making sure you have everything you need and is also a great conversationalist. The food is amazing the music is on point and the drinks are top tier. I love coming here with my husband for happy hour. It’s just a vibe every time we come here."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NWFIbG5ibGd4ZEdoaFFXdGFZa014VkZkSk1rRRAB",
            "text": "Maria was great ! Her hospitality was above and beyond. They will definitely take care of you here . I came with my wife and the experience was more than expected. Pull up to MIPR"
        },
        {
            "date": "6일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNFlsSjZZakU1TkZBeVdYbE9XWEpwYTNkWlluYxAB",
            "text": "La comida habla por si sola un 100 , el servicio espectacular por parte de Maria 👍🏽"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5d1YwMVJaRFpGVG5wRE0wbHhWREI0VEZkcFZYYxAB",
            "text": "The food is ABSOLUTELY DELICIOUS!!!!!🤤😋🤤😋"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaFRFTlVSa1ZFUjJaUldtMDJiMU4zU0ZSUWQxRRAB",
            "text": "Excellent excellent looooooves it great portion very authentic the jibarito excellent the arroz y gandules and the coconut margarita excellent customer service excellent looooooves it will be back thank you"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVVpXaDVOa1Y1WW5SaFEwSjRhVWw2TldSMFdYYxAB",
            "text": "I like that this place is by the water. Didn't like their service much; the server was not that attentive. I also didnt like that they pass you a \"paper\" appetizer menu (which is definitely not professional looking at all, and is all they serve) the place is spacious but the dance floor on out side feels like being in a can of a bunch of sardines lol very loud on the dance floor, but outside erea is moderatly noisy. Not my cup of tea."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdE1UWndiRzFUUmtOTExWUkJVVWN3TFVWRldrRRAB",
            "text": "Worse experience ever …. Drink was trash the passion fruit mojito tasted bad. They made A last call for Hookah , and the second I order it the manager says he can’t do it no more. After I told him the bartender never came To me when I was Trying to order it the manager still said I can’t Order it.. go to another location this place sucks."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR1pYaDZPWFYxZWs5amFWVkRTelJzZFhOUlVuYxAB",
            "text": "i loved this place for brunch so much that this was my 4th time returning , however this experience on Saturday October 25th was terrible . i made a reservation for brunch for 9 people for 4:30 and called Saturday at 3:04 stating i have a reservation for brunch for 9 people however 7 people are only attending . The person who answered the phone was a man and he said your all set . i traveled 45 minutes away just to come here to celebrate my husbands birthday only to arrive and they sit us down and the manager a male dressed with a baby blue shirt  who btw was the same person who took my call told us brunch was over at 4pm and that we had to get something off the dinner menu . i was annoyed and was going to pretty  much walk out because its unacceptable to not honor the brunch knowing i made the reservations specifically for brunch , the manager saw me standing outside on a call and came out and told me i cant honor it but i can do a prefix menu . This is the beginning of one of my many problems from this day , the waiter took our drink orders and brought us our drinks and took 40 minutes to take our food order . the food was great but the staff needs improvement.  the staff and management here obviously lacks communication  and they lack sense or urgency . The manager made the experience just overall sour , we didn't even eat our food we just packed all our food to go  and just wanted to leave at this point . i tried ordering a hookah they never showed up . i asked for the bill paid and  i didn't even bother expressing anything to the staff and just left . out of all the restaurants that are great on tremont i came back here because of all  my great experiences . wont recommend this place again ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeGVscG9hbFUyVmpSdGRFSnFZbDkzYldsbVNuYxAB",
            "text": "I came here for a team get-together that also lined up with my birthday month, so it was the perfect chance to celebrate — and I’m really glad we did. The vibes were amazing from start to finish: great music (major shoutout to the DJ), perfect lighting, and a lively, fun atmosphere that made the night feel special.\n\nThe food was fantastic and the portions were huge — seriously, two or three people could’ve eaten from my plate alone. I ordered the pernil with rice and beans, plus a variety appetizer platter. The pork was juicy (though I do wish the skin was a little crispier), the beans were flavorful, and both the garlic and chimichurri sauces were top-notch. The potato salad was okay, but overall, the meal delivered big flavor and big portions.\n\nSince it was my birthday, the team surprised me with a birthday flan and tres leches dessert plate that the restaurant provided. It was the perfect ending — sweet, creamy, and delicious. The birthday celebration itself was incredible; you truly feel like a superstar. Between the LED signs, the DJ shoutouts, and your name flashing across the booth screen, the energy was unmatched.\n\nThe drinks were just okay, nothing to write home about, but they got the job done. The only other downsides were the limited parking (especially at night) and the two-hour time limit for our party of ten.\n\nStill, it was a fantastic night overall. Great food, great vibes, and a truly fun experience. I’d highly recommend Made in Puerto Rico for birthdays, team outings, or anyone looking for flavorful food and an energetic atmosphere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSFJYTndiRFl6WVZCVU1qSnNSVnBGVEdKamMxRRAB",
            "text": "Delicious food in large quantities. Highly recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZelZtNXpXVWRVTldOVmVFazFSMkZNZGkxTlIyYxAB",
            "text": "Made in puerto rico great place good location with plenty of street parking available.\nawesome drinks but server -5 specially jason i think he is drinking half of my cocktail or doing some other hardcore drink rude...\nIf you seat by the bar on single table will see heavy traffic of empty buckets flying over you and you food.\nI order a beef mofongo it was nothing but fried plantain with pepper steak from china wok cousin...\nMy second visit to this place because i had doubts but now is all confirm mipr need to do better."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSGFGTnBjMGs1T0dwRExWZ3dWRmQzTjI4dFEyYxAB",
            "text": "You should try this place at least once. The quality shines through from meals to mood. The team demonstrates exceptional adaptability to requests. Tastes amazing and you get so much food. I prefer it here. I'm surprised anyone would rate this less than perfect."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWmJqSkZSVzl5ZFRSb2VHNTNjbkJyWkVwcmVIYxAB",
            "text": "Great food.... Good music...But super loud for no reason. Can't have a conversation.... Therefore not the best for dates or bdays where you might want to talk to the people next to you..\n."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNFpUQkJjMEpCVjFOWWVUVTFTV2xYWVVGRFEzYxAB",
            "text": "Any place that serves my people."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGakxXczJaMVpRVkc1S04yNXpWRVZvVHpCVGNHYxAB",
            "text": "What a great time! Came on a Sunday evening and the dj was on point! The food was delicious and Jason our server was awesome, attentive and friendly. Can't wait till next time!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbGJWTnliMFJTYWtGS05sSkVhR3R0ZDFrMWNYYxAB",
            "text": "Had a great time at this spot. The food is really good. Every dish is a hit. The servings are enormous so theres definitely food coming home. The music is 🔥🔥🔥 as they hit every genre and have dope mixes on Sunday evening. Thanks Jason for being a dope server.…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVVEaGhWSFJ3YVRJMVZFbEVZMnAxVEUxelVuYxAB",
            "text": "Jason was AMAZING!!! The food and service is remarkable. PR!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVWFGTmtSVUZ2V0hsVE56QnRRV0p5ZFROM0xVRRAB",
            "text": "Came to made in PR for brunch and had a great time. The food and sangria were on point, also the service was 👌 I will definitely be coming back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeWJIaHBXWEZWZGxkMllYcHNTWHBXYUhGV1YwRRAB",
            "text": "Their brunch menu options don't necessarily scream \"Puerto Rico\", but what they offer is tasty and the portions are big. Great service, and the hookah is pretty good and one of the most fair prices I've experienced lately. They are very generous with the brunch beverages."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNFFUVlVkR05XWlhGSVZUSlFUMHB3UjFSU2NYYxAB",
            "text": "Great service.  Cathy was great thank you"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWVVuUkpNMHd4UkdsdlVVTjFZbU15VURSQ2FtYxAB",
            "text": "Food superb. I love this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUk5XRlRZbkZ1UzNoelEzZzJaMWRpTTBWSldFRRAB",
            "text": "Authentic taste"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSU9IcFNXRmRaVmpkWFMxWjVZMVZRVTJocGNWRRAB",
            "text": "Maria was amazing the food was very delicious will definitely come back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saWVEbHBXV0pEVW5aRlJYcG9WM2x6WWxSVVJXYxAB",
            "text": "Had a group of 9. Service and the food were amazing. Will definitely be back soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWVJWaEhaVll5Vld4c2QxSldiVTVWVTJaUWNXYxAB",
            "text": "Music is good for the old school heads!!! Lovely vibes and older crowd! Food is very authentic n yummy! Alcappurias will always be my favorite! Carlos was a great bartender!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVFUwWXliVmwwV0VsZldYUlpabkJFY1ZRNFVFRRAB",
            "text": "The good: We unintentionally stumbled in here for the boozy brunch. We had a decent enough time. This is a great place for group outings. The food was good. The rellenos de papa and the empanadas de pollo y de carne were the highlights. I'd go back for that. There's a kids menu that was good.\n\nThe bad: The music was loud, which isn't bad. But loud and exhausting is not good. The music they play are outdated and overplayed club anthems that you can't take a break from because of the volume."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaXVmTEt3EAE",
            "text": "WELCOME BACK CIN…. Love the atmosphere and your services! Ur the best xox"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVFVGOHlNbkJ3ZFZCNFJVWldTV3gxYldjNFJsRRAB",
            "text": "The food was ok the service they need to improve, and the Music I'd was to loud, we can't even talk 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ob1JVZGZOVkp1U0hVMGFFZEZNR3BCUVRKMGJtYxAB",
            "text": "Great food, service and music💯💯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aFVuUlBTamhSYjNGT1NVbHRjalE1YnpoQ05sRRAB",
            "text": "Bar could get packed causing a small wait for drink but the spot is valid"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcVFVWm1jSEIyUTBwdVVFdExObGRVTlVkdFQyYxAB",
            "text": "Food is great but service is awful. Ordered from Uber Eats and did not receive entire order because the restaurant forgot to send the complete order.- restaurant required us to order again. Paid 200 dollars worth of food twice with no refund from either Uber eats or the restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV0xVWkxkV3RDTVhwWlVqaG1WbVJ4VDFKWFZXYxAB",
            "text": "Wonderful Latino food and Puerto Rican decor. I Absolutely love the photographer's photo memento great touch"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRFJWaFZVRXMzWjNKblIxZERTa2RHZW1KaFEyYxAB",
            "text": "Me encanta el ambiente y la comida. Pero lo mejor es el servicio al cliente, siempre  boy ala bara y me gusta que me atienda La bori. Esa nena es Super servicial y hace unos tragos buenísimo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbE9IZERSa2xqVG5OMGFreGtSVTlYYTNsNFFtYxAB",
            "text": "The worst experience ever the manager did nothing. To make up for it!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOU2RqRkJXRzFsVGxaYVdtUkRWakZUUkZSc05sRRAB",
            "text": "Delicious Puerto Rican 🇵🇷 food. I've been here many times and have never been disappointed. I was told they'll have pasteles by years end. Prices are reasonable but they add 20% gratuity to the checks. I usually tip 25% so its no issue with me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMlJYVm1XbDlRUzBReVIzcFBkR3R5TTBOV2RWRRAB",
            "text": "The vibe and service is beyond 5 stars"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTVJISlNXR1pWZURCVVYwaGhiRlJtZDIxR1lsRRAB",
            "text": "I really enjoy coming to made in PR!! Great food, atmosphere and customer service. Letty is a great bartender and a whole vibe! Will definitely keep coming back!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ2VpMXVjRVpYTjNOMldsOVJha1ZWTUhZNU1VRRAB",
            "text": "In my Opinion; The Mofonggo was not real, authentic Mofonggo is mashed to perfection. I do not know what the uncooked,hard old potato & rice that was. SMDH VERY DISAPPOINTED 😞\n.…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WWVYRkpUMUpoVkZkSE1XWnhZbTFEU0U1NlJHYxAB",
            "text": "Patrons beware!! Recently, I visited this establishment, and after reviewing my check, I found that there was a “non-cash transaction” fee added to my check. I had taken out the cash for the exact amount of my check. Upon questioning the waiter about the extra charge, he explained that the non-cash transaction fee only applies to credit/debit card users which was not explained when handing over the check to me. He asked me to deduct it from my check. However, I find that this establishment does not practice honesty. I have been to many businesses in which I am asked if I am paying cash or credit/debit, and have been informed that there is an upcharge for using my credit/debit, which leaves it to my discretion whether I want to pay the extra fee. I have also been to many establishments where the check displays the amount owed, whether one is paying cash or paying with credit/debit card. The Made in Puerto Rico Latin Cuisine needs to change its practices so that they are not defrauding their customers. Also, beware that they are charging every patron a 20% tipping fee. In the United States, the standard tipping is 10 to 20% depending on the quality of the service. Therefore, the customer is paying 20% regardless of the quality of service they receive. Not sure if I will return based on their practices. My suggestion you should ask your customers the which form of payment they will be using before printing the check. Stop deceiving hardworking individuals. Transparency is the best policy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlFtSlBabVJYYlZWRU0wUkNaRTE2TWtzNE5sRRAB",
            "text": "I’m so upset with this place. food was ok, service was nice at first, margarita not good but one of the workers unnecessarily came to turn off the speaker. Me and my family were eating outside it was our first time in this place but we…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV1pIRjRWVkp0U0dSd2FXeHNaRUZLVTFwaFRWRRAB",
            "text": "Great Puerto Rican restaurant and Bar. I was not having a great day but the bartender changed my frown upside down. I stayed longer than i anticipated but it was worth it. She made me laugh and I just loved her energy. She’s definitely an asset to this establishment! Thank you for your kindness and outstanding energy gorgeous Blue."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVFJXVXdXVmx3ZDJ0c1dESmZOelF5YmpCNVUxRRAB",
            "text": "Stephanie is the absolute best behind the bar! She was delightful and made the experience amazing! The food was good, the drinks were on point and overall good ambiance!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdk9XdzNaM1J0VmpFMGRXSlZUV3N3V0hkSlUxRRAB",
            "text": "Food is delicious and authentic and the bartenders and servers are a whole vibe super playful and funny"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR2RXZFllbUpqVG1OTFpFdzNlR2Q1YXpKVVNuYxAB",
            "text": "DJ no good 9/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMVRqbHVjeTFhWDI5TFluVjVSelV5VkVOelVXYxAB",
            "text": "Came here with my girlfriend for the first time last week, (we’re from CT)and the whole place gave us real P.R. vibes. Our bartender, Blue, was such a vibe—she complimented us, made us feel completely comfortable, and mixed some of the best mojitos we’ve ever had.\n\nWe came for brunch, and everything was delicious. Blue suggested the sancocho for my girlfriend (who was craving soup), and she loved it. I went lighter with an appetizer, which was also really good.\n\nThank you, Blue, for bringing it all together for us! We’ll definitely be back, and I’ll be looking for Ms. Blue to serve us again. 😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRWNqVjVZVUZGVFZKTVpXTnZSM2xuTXpKbk1YYxAB",
            "text": "Very delicious dishes 👌🏽"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkZlQxSm1VMnR4V25Gc2RuRXRXRkZOTUhWcVEzYxAB",
            "text": "Excelente, todo bajo un buen ambiente para disfrutar con familia y amigos."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSek5VSklXbUl0Y0ZoRlVHWkdVblpqZVdWVlRYYxAB",
            "text": "Great local spot for service, vibes and food! Shout out to our bartender Viv for bringing the chats, the options and recommendations. And best birthday shout out I have had in a long time. Worth the stop in if you haven't"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1NHaFVXa2N0ZUhod2VrNXpTbGwzVEdwTU1VRRAB",
            "text": "Vivian was great with the energy & service.  We came here to celebrate a friends birthday and she needed up having a lot of fun."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT2JrazBWSFEwTVY5SGVrZ3RlR3BVUkRsU1gzYxAB",
            "text": "I loved the vibe from the moment we got out of the car! Servers were attentive and the food was on point. All fresh and seasoned well (not salty) DJ and the music was like my personal playlist was used. I was literally in heaven today. 🇵🇷❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWlVrcEhYME5qY21zemJtaFhZVWhaV1VkS1NuYxAB",
            "text": "Fun atmosphere and delicious dishes! Came here for a girls night out and it was the perfect place. Excellent service, trendy drinks, and traditional Puerto Rican fare. The skirt steak was tender, juicy and flavorful. Absolutely delectable medium rare with the rice and beans. 🤩🤩🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM1ZHRmlaelUzYlU1Sk5IazNOMmN6V2tScVRYYxAB",
            "text": "I had a wonderful experience at Made in Puerto Rico! We were celebrating a friends Birthday. The atmosphere was warm and welcoming, and the service was friendly. I tried the coconut mojito, which was absolutely refreshing and full of flavor — the perfect balance of sweet and tropical. For my meal, I had the pork mofongo. While the pork itself could have used a bit more seasoning for my taste, the mofongo and everything else on the plate was delicious, hearty, and satisfying. Overall, it was a tasty experience, and I’d definitely come back to try more of their dishes and enjoy another one of those mojitos!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd2NXdzVhVkV6VW1KV05XRllPREEwWTFWT1NYYxAB",
            "text": "A group of us went to have early dinner and to my surprise, I was not impressed with their service and food. The music speaker was next to me though I complained because it did not sound good, totally ignored. The food served to a number of us were small portions. I had the Ropa Vieja , which had no taste and was oily and the rice was ok, not to impress. The waiter was not attentive, took our order and took a while to come out. Once it came out and delivered by others, he never came back to ask if everything ok or food ok, etc.The dishes ordered were very expensive and not to impress. I have not found a good Puerto Rican restaurant with authentic dishes in the Bronx. I had tasted a little of octopus salad and explained to my friend had no taste and was rubbery. I travel a lot and like to go to restaurants and try different ethnic foods and give my ratings and overview. Unfortunately, I will not be returning. Their cooking is not authentic Puerto Rican food, in my opinion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ3VqWi1hc3JEejlRRRAB",
            "text": "Food was incredible; service felt as if I were home. Thank you Papo, we will definitely visit the Orlando location. It's pretty close to us! I'll let Jose know you sent us."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jek1XTnlibUZWUTFZeFNrSkdRbWRQUmtGbU9IYxAB",
            "text": "Do not order take out. I been at the location multiple times, ordered octopus salad always good. First time doing take out look at the portion for $30 (octopus salad) not the same when dining in.\nAnd poor quality on the mofongo with pernil.\nVery disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib1liVTJ3RRAB",
            "text": "I have gone here for a party. The service was good. I have no complaints, and in fact, I praise the waiters and DJ. The atmosphere felt modern and looked visually appealing. The flowers add a good touch to the design. The food was authentic and really was good. I recommend the seafood as the shrimp is exquisite. The prices are definitely for a date night or a treat, but If you want an order for lunch or something, get something from the kids menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWGczcm1fcHFPcEVREAE",
            "text": "I just went for a few drinks. Great vibe, music and videos were entertaining. People  contributed to a welcoming atmosphere"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRejRXYWd3RRAB",
            "text": "I’ve been to other Made in Puerto Rico locations mostly to drink. This was my first time in one to eat. The Mofongo with shrimp was good, the steak and onions was really delicious. But the white Rice was a bit bland needed more salt; now as far as the beans I mean come on this is supposed to be Puerto Rican these beans tasted like you open the can heated it up and that’s it. Where is the salt & pepper? the potatoes the cilantro? not even an olive. At least if you cooked it a bit more the sauce would’ve reduced to make it look edible. That’s not  how it’s done at least not in Puerto Rico even here ny bodegas you get better tasting beans like really, you gotta step up your game on that especially if you’re charging $26 for the plate.\n\nAlso a B Food safety rating. No Good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM3BqMEpnEAE",
            "text": "First time here, Wasn’t sure what to expect, but whoa - this food, atmosphere and service all 10’s. Price is reasonable too. Definitely, recommend if you want good Puerto Rican Cuisine. Only drawback is parking can be tough depending on the day. Dj and karaoke they got you covered!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eVNVOHlNemRQTjJVemF5MW5abFJVY1cxTGFtYxAB",
            "text": "El servicio súper bien y la comida excelente , creo que el ruido es demasiado y constante, amo la\nMúsica pero creo que de vez en cuando se puede bajar el volumen a algo moderado de lo demás siempre los he amado y he ido múltiple times"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMlpUTURREAE",
            "text": "This was a dope spot in the Bronx. Went here for brunch with my family. Spanish vibe music nice. Food was great! I love me a great skirt steak with chimichurri and this was a good one. It could have been lil more on the well side but other than that no issues! Them potatoes was mad good and the eggs was light and buttery!!!! Yummm\nThe waiter was kind and attentive. Not a long wait. The lady at the front was extremely accommodating. She wasted to get us a table for us and our two year old but the one they did have available was perfectly fine and good for us. I appreciated that she considered my child when seating us."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzamF1NE53EAE",
            "text": "I have been here  a few times and I’m never disappointed with service and food. This visit really made me write a review because it was just amazing. I came to celebrate a birthday and since it was more than 10 ppl we had a prefix menu. The picadera included pastelito, bola de papa, calamari chicharron the pollo and cerdo. It was so so good and very generous. I felt full and really thought the main dish would be a small portion, boy was I wrong. I ordered pernil and when I tell you they give you a HUGE portion and its SOOO good and authentic. I was surprised, the yuca fries were soooo good. I love this place. Everyone was happy with their dish. What I would say though is that the drinks can be stronger, I am not much of a drinker but I can tell when drinks just need a bit more. They have many unique cocktails annd everyone at the table did agree they didnt feel the alcohol. Our waiter was patient and very friendly. Music was on point. Love me some great music and food. Highly recommend, especially for bigger parties/bday dinners."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMnRuWl93RRAB",
            "text": "Nice spot. Brunch is great. Live band playing. Could be loud for some sitting close to the band but we enjoyed it. No soap in the bathroom for a bit. Seemed busy to keep up. Definitely would go back. Food and drinks were amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcVEzZDViMDE0UTNOalUxUjJWVzR5TURsc05uYxAB",
            "text": "The food and ambience is highly recommended. I celebrated my birthday and others as well. The bartenders are always attentive. Kelly is the best! If you want great service and a good safe bar in comparison to many others nearby, I would highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybUxyYVJnEAE",
            "text": "The staff are wonderful. Our server Maria was excellent, gave us great great recommendations, we went with churrasco with rice with pigeon peas. It was fantastic, took me back to Puerto Rico the flavor mouth watering. Each bite taste of deliciousness.Then our drinks were well made. Wonderful atmosphere, relaxing and enjoyable. Definitely will come back. Food and service they got it right."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeVlXbUtBEAE",
            "text": "This restaurant has been here for a long time, been here on different occasions and the service, food, atmosphere, music... everything. Today I went for brunch and it was everything and more. The portions were perfect (I was full for hours) the organization and clarity with brunch service (no surprises) host tells you everything at arrival. Mimosas were 👌. I will be returning and recommending."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SVFuSTFjR3RxU0c0MlZVWlhXazlYUVRocGVWRRAB",
            "text": "🎤 Food Preacher in the building and on all social media platforms! 🙌🏽\n\nMade in Puerto Rico in the Bronx? Lawwwd have mercy! This joint brought the sabor straight from the island to the BX! That Mar y Tierra—grilled chicken and shrimp scampi—was baptized in flavor, with a side of creamy avocado that hit like a holy anointing. The tri-fongo? Let’s just say the shrimp scampi on top had me speaking in tongues! 😮‍💨 And that ropa vieja with rice and beans? Whew, it told a whole story—tender, soulful, and cooked with love like abuela used to do.\n\nThe vibe? Loud, live, and full of life—the DJ had the whole place moving like it was Saturday night revival on a Thursday. 💃🏽🕺🏽 I ain’t just recommending it—I’m laying hands on it. Go taste and see, fam. 🔥🍽️ #FoodPreacherApproved #BronxBlessings #BlessYourTastebuds 😋🍽️💃🏽"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbkttWHlBRRAB",
            "text": "As soon as I opened the door, there was this beautiful young lady with a beautiful smile welcoming me to the restaurant. She told me her name is Umami (if I’m spelling it right) and sat me at the bar. I was then greeted by another beautiful young lady with a beautiful smile and told me her name is Viv and took my order and brought me my food. Both of them were very friendly and food was amazing and the atmosphere was nice and the music was dope. I’m definitely coming back with my peoples"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YWRuVlNVbXRUY1RkcU9Hc3RSRlZhVVZkMFluYxAB",
            "text": "I never leave reviews but my experience was so negative I had to. Had my graduation party here after making reservations well in advance. Had to remind the staff to give us a bottle of champagne and wine that was part of our bottle service - didn’t get it until 2 hours in. The package I paid for included balloons and a sign - didn’t get either. We were supposed to be seated at 8 PM - we weren’t seated until a half hour later after being told multiple times they were getting our table ready. Also had to wait a long time for our orders to be taken. They kept announcing it was my birthday despite me constantly repeating it was my graduation, which goes to show their lack of attention and service. They also added 2 pork chops for 50 dollars each (?!)  to our bill that no one ordered. Good thing we read the bill carefully and got that taken off.\n\nConsidering this was an important event and we spent a lot of money, disappointment isn't even the word. My only positive comment was we had an attentive waiter, but management is disorganized, inattentive, and just not good. I would never trust these people with an event or come here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFlYQmZhM05xU1VGYVVuRXdXbFJzZEhGYVluYxAB",
            "text": "Come to the bar. Ask for Viv best bartender ever. With her beautiful smile and charming character she makes your time at made PR am awesome time. Great service and great food."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXRQWXZnRRAB",
            "text": "You won't be disappointed with the drinks and amazing food, you will taste a bit of puerto rico."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTlZtTXdXVEZRTFhkcGFVSlJZbVprYVhkeFdXYxAB",
            "text": "This place is amazing and the food delicious and the  Dj music Wow!  , Maria is amazing so kind with the customer ! I recommended this place !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cGZIUWd3RRAB",
            "text": "I just celebrated my 50th this past Saturday(brunch)the staff was amazing!! Lisha and Delilah were awesome and very helpful! The food was delicious the live band was epic!!!! My server was phenomenal very attentive!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNGMyUnRiV3R2VjFsdVYweGpRbGRWV1VveVZWRRAB",
            "text": "The trifongo was delicious, portion a good size. Calamari appetizer came or crunch enough. Drinks were tasty, not to strong. I would def go back. I went on a Tuesday and it was karaoke night if that's your thing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMHZEd2ZnEAE",
            "text": "The music was loud for inside and a tad outside.  The atmosphere was nice not particular to looking at the street. Me and the hubby got mono go with chicken. Did not care for the chicken used to it cut up and inside the mogongo with chicken crinkling. The sauce from the chicken could have a nice garlic taste the chicken should be soft and melt in your mouth. My child got chicharon de pollo sun hijo he loved it.  service spot on and prices too"
        }
    ],
    "reviews_count": 76
}