{
    "name": "Sammy's Fish Box",
    "place_id": "ChIJoa_X8oWLwokR93LqwUaPSNA",
    "grid": "BX10",
    "address": "41 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.3,
    "user_ratings_total": 10561,
    "phone_number": "(718) 885-0920",
    "reviews": [
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFYxcGZZbkp0U1RCWk1YZFZOVXhIYUZWS1ozYxAB",
            "text": "The restaurant offers an exceptional lobster that truly stands out! While the salad and pasta were decent, they didn't quite steal the spotlight. And let me tell you, the Long Island iced tea packs quite a punch!"
        },
        {
            "date": "1일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU1VUSndaRk5rUzNweFQyeGFjbFZrT1hRMVYzYxAB",
            "text": "ESTE RESTAURANTE ES PARA PERSONAS CON BASTANTE DINERO, TODOS LOS PLATOS COSTOSO MIEDO DA VER EL MENÚ.ES UN ABUSO LO QUE TIENEN."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OclVtdFpRWFpRUVMxVVN5MUtjakZLZEc1bkxYYxAB",
            "text": "1st Off The Seafood Is Amazing!!! The Variety is Like No Other Place I've Ever Been Too!!! The Staff was Sooo Friendly & Nice! Our Servers Name was Stephanie & She did Not lead us wrong when it came to ordering!! We had Lobster, Huge CRAB Legs, Scallops, Stuffed Shrimp, Broiled Clams & Mussels & Some Broiled Sole!! Worth Every Penny!!! I would give this place a 1000 StarS!!⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️🥰🥰🥰🥰❤️❤️"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR2FYaHlOa3hVZDIxWGJWVmtjR2hmYzE5eFYyYxAB",
            "text": "I can't say enough about the wonderful service at Sammy's! My family and I drove up from Maryland and was able to secure a last minute reservation to celebrate my mom's 70th birthday! The owner Lauren, is phenomenal and a true gem!! She went above and beyond to introduce herself and welcome our family. She took the time to take photos of our family and made the occasion much more special! The food, drinks and service were awesome. We will continue to celebrate all of our family occasions at Sammy's!!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bFRYSllYM2hCVUZWU01sTnNWbWwzZFdST1ZuYxAB",
            "text": "It's just ok. They are generous with the sides that come to the table. The corn on the cob is delicious. The bread is warm. The yellow rice is good. And you can ask for more. I expected more from the main dish. Where's the salt? Any seasoning? Couldn't tell."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WclZFdFphRWd6ZEhONlgzSnFRekV6ZG1aVFpYYxAB",
            "text": "food is always good here 😋."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMk5EZzBlRFJLT1ZkVUxYWktRaTFFVmxveloxRRAB",
            "text": "The food was delicious as always. The service was ok."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dmVFNXhVRmRwVUc5WVYwOW1kMUV5ZVc5bUxXYxAB",
            "text": "When you get a delicious seafood meal at almost midnight, you can only give the place 10 stars although you only have 5. I would definitely eat from there again and recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd2IyUmFiMjFzV0ZsUU9YUm9lUzFhZUhaaFpIYxAB",
            "text": "FOOD WAS AWESOME.DRINKS STRONG."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFYwRkRTMEZLUVZGUWVqRnZNV2h3VWxORVpWRRAB",
            "text": "Came here for my birthday and the service was absolutely amazing.  Our waiter made my special day even better. We truly enjoyed ourselves. They never missed a beat with assisting all 16 of us. The food & drinks were so good!! Look at my pictures...so much yum!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRE1HMVNWazVQZGxscE1FMWtUV0k0Wm5seVNIYxAB",
            "text": "Always fresh seafood with great ambience"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBb0xfQklREAE",
            "text": "Not crowded at all at lunch time"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QlZrdExRMFZEY1ZsQmNIZEZUR1pxZVd0U1JrRRAB",
            "text": "This was by far the best place I ate at. The environment is just like the NYC streets servers, busser everywhere moving out of the kitchen and up the aisle with food plates and bread plates. It's like watching an intricate dance. Sammy's Broiled Special is way to much food, oh my was my eyes bigger than my stomach. It was all FINGER LICKING GOOD. This is a Must if you are in the city.  And on the way out we saw deer. Amazing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWWIzazBSVkZyYTNFd1ZGbEJlSFp5UW5SaloxRRAB",
            "text": "I officially put them on my \"DO NOT EAT LIST\"; food bland and not served at hot edible temperature"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQlUwWnlVMlI2ZVhVMWJ6RXhhV1UxUW5wV1pYYxAB",
            "text": "My family has been visiting Sammy's since the 1960s and we drive all the way from West Harlem.  Great food and service.  A little pricey but I had enough food for another dinner tge next day.  Worth it!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S2VXWmlNVWhMUWs1SU5EWktOMDFMWkVwa1ZYYxAB",
            "text": "Long ago, I frequented Sifu Restaurant, where I was always satisfied with the generous portions and great value. Recently, I visited for the first time in a while and ordered my family's favorite banquet dish. However, I was incredibly disappointed. The quantity and quality were so poor that I was shocked. Perhaps that's why, even though it was a weekend evening, many of the tables were empty. I thought this restaurant's past reputation was over. I won't be visiting again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMVpHNVhRVEZ2ZG1oUWRGZFFTRlJ1YTNsRmVrRRAB",
            "text": "Been coming here for many years and it's always a pleasure! Highly recommended. Great portions!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveExYTTBibGxDTm5Sc2NGY3lWbGhPZWtoRVJuYxAB",
            "text": "My favorite place to go!! Great food, service and staff."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdGJWRnRXVlZMTFd0bVZHc3haMmxUUkY5alMxRRAB",
            "text": "The food was very fresh and arrived quickly at the perfect temperature. I ordered the broiled salmon and lobster tail. I rated the food a 4 out of 5 because there was too much oil at the bottom of my plate."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFpVMHhhMDk1VUZaSFZ5MUdRbmR1U2trNGJsRRAB",
            "text": "Great place to eat & drink. Service is great"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bGNURTRiamhEV0VwTUxYVjNWR2MwWVVoQ2JWRRAB",
            "text": "I sooo love this place! Anytime i want crab legs i go here! I’m never eating my local crab legs again! It’s just something about the food here that gives REAL seafood! The smell, The flavor, the decor! Just a great experience over all! They even sang happy birthday to my dad! And give him ice cream 🥰 birthdays, holidays, celebrations or just a taste for seafood Sammy’s is where you need to be"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdlJVTkNPVlZpYm05b1gwSjVUVWhEVWsxaGFYYxAB",
            "text": "Absolutely delicious and flavorful. Exorbitant prices but you get massive massive portions. The fried scallops were the bell of the ball absolutely divine didn't need any sauce, massive scallops and a ton of them. The coconut shrimp were…"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NWFFaHBhSFoyZFhSck9XRnZUVFF4WWtaTFNsRRAB",
            "text": "I went for my birthday with some of my Diva Friends. I ordered the Shrimp and Scallops. I got a side of Spaghetti with marinara sauce and yellow rice. The only thing that I liked was the Scallops, bread, relish tray and the water. The spaghetti and shrimp was tasteless. I was very disappointed. They took one meal off of our bill and we got 2 desserts for free. He act like he did not want to. I will never go back. If I could have rated the food a -10, I would have."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dE1ESjVSbm8wTVV0a1RFOXdOSE5QZVZwQ1JHYxAB",
            "text": "Great place for any occasion. All the food was so good and very fresh!\nThe atmosphere of the place is happy and joyful, the service was great. Thanks to Jeff for the awesome service!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUlduaG1SekpoYlRsQlYyaEpjVjlsVmtocFJYYxAB",
            "text": "Everything was great. They served us fast. Did not like force valet parking, but I did find street parking so... 🤷‍♂️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMU4yNUZSRk5MTFU5NVQwRlhSR0ZrYW1kdmVuYxAB",
            "text": "They don't cook like they use to. Food is tasteless"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad2N6TkVTM1pZWmpWME5sUndWWFJZTVZCRGNYYxAB",
            "text": "I visited this restaurant 9/26 for a late night dinner so the restaurant was fairly empty. A woman sitting down about to be served the initial bread and vegetable plate had a ROACH crawl across her table and the server killed it with a menu on the table. We then observed another ROACH on the seat at the booth next to ours. It was horrible! We had already eaten and were ready to go but we couldn’t stomach taking our leftovers. The manager gave us $50 off of the bill and claimed they have an exterminator come 3x a week! That sounds like there’s a big problem. We know these places an aren’t perfect but the attitude was too casual for me and like I said 3x a week for an exterminator sounds troublesome."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVNqZHZaMGxNYVdaTVNEUklXV1pIVTBVelVsRRAB",
            "text": "Great food and service!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcVJGQXhRbHBwV1d0blJGSktUV2xUUkVwNFVGRRAB",
            "text": "We were a party of three celebrating a birthday and shared the Snow crab legs, Baked whole red snapper, and the seafood broil. Everything was fresh, delicious and the portions were generous. The complimentary bread for the table was a variety of cornbread, toasted garlic bread and a seeded round loaf with a wedge of cheese and a side of pickled veggies. All entrees came with a salad, side of yellow rice, corn on the cob and your choice of another side. Sammy’s met all our expectations. At the end they came out with some ice cream and sang her happy birthday. So nice!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbDZ5c1R3EAE",
            "text": "This place is great. I have been coming to Sammy's since 2005. Always polite service. Large portion. Great price. I will travel to the Bronx any day of the week."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhclB2NWpRRRAB",
            "text": "The service was great! The food was ok. The lemonade OMG, for the second time,  it was diabetes in a cup. Whomever is making the lemonade and ice tea, STOP please!! Fish and fried seafood needed seasoning. Bland tasting food. Also, I think they needed to wash the scallops a little better, grainy like sand 1 or 2 of them. Nice inside area. But 1 fly wouldn't leave us alone, then a tiny one came as the food sat out. So we quickly packed up the leftovers and covered the rest with napkins. It's not cheap to eat here and I came from far away. So they need to fix these things so customers can at least get their money's worth."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVd1RXOXdaWFphYm5SMWRucEljRXBNTmprME5GRRAB",
            "text": "definitely has fallen off so much. Food used to be so good now it feels like it’s thrown together. The atmosphere is aged out"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcVEzWnZWM1pPV0dWSFZ6aHhOVEZ6UmtobVNYYxAB",
            "text": "Wow the quality of food has gone way down. Even my kids do not want anymore. Fried shrimp not seasoned, fries cooked soggy in dirty oil, clams hard no season and calamari not cooked all the way. Food seemed rush and did not taste good or fresh. Also, you spend a decent amount of money to get a tremendous amount of ketchup not cocktail and tartar sauce. Sad to say not going back out family tradition of having summer seafood feast is over."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NGRUWlhjMHh5ZUZCT09GZE1SVGMzUzFrNWIzYxAB",
            "text": "Datenight the waiter was excellent with making us feel great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNVpXVkhWREZyY25ac2VWOVlVeTFmY20xS04wRRAB",
            "text": "Everything was very good. We had a really large party and the food was served in a timely manner and perfect temperatures."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaWQwZEZabmxOTm5relRWSXhYMGR4YlRCblowRRAB",
            "text": "Great food, huge portions. A NYC icon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVVtaEVaekJ4VVVaRk5IYzRZbmxIYkV0cldHYxAB",
            "text": "COME HUNGRY! Delicious seafood and massive portion sizes. Great little day trip spot from Manhattan to get your fix."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMlNUaG9XRlJwVVZWbWVWSmtaM1Z5UW5kTFFYYxAB",
            "text": "The  shrimp box changed the  menu, so they said fish box menu was the same  it was, but the  Food was horrible  definitely not the same for nearly 400 dollars  for 2 people"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsV1ZIUm5kMFI2V1VJd2JGVXpRbkZ4ZDNkaVNHYxAB",
            "text": "Subscribe to frostfire hjk i need 100 subs"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcExTWHVRRRAB",
            "text": "메뉴가 너무 많아서\n선택하기 좀 어렵긴하지만\n맛은 너무 좋았다."
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdU9HUTRnRRAB",
            "text": "굳이 오지않아도 될집\n\n특출나지도 않고 오더 미스도 두건\n\n불쾌했다"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMFlyQ213RRAB",
            "text": "맛이 조금 짜서 아쉽지만 저에겐 추억의 장소입니다....로컬분위기로 서비스도 좋고 가끔 생각나는 식당이에요"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdE4ydE5nEAE",
            "text": "2번째 방문!!!  ~~~술을 마시려면 ID는 필수.음식 대처적으로 맛있음."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNajhhSFJ3EAE",
            "text": "12월31일...내 생일때마다 가족들과 저녁 먹는곳...\n추천!!!"
        },
        {
            "date": "9년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROHRLSnF3RRAB",
            "text": "완젼 맛있어요 한국인 맛에 딱입니다"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMWM3WGhBRRAB",
            "text": "맛있어요 분이기도 좋아요"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNb3U2djhBRRAB",
            "text": "싱싱한 해산물을 푸짐하게 즐길수 있습니다"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvemU3eDNBRRAB",
            "text": "가족적인분위기.친절하고,맛있다"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNek9haG13RRAB",
            "text": "이탈리야빠에야 ㅋㅋㅋ엄청푸짐한 해산물"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbl9hUkZBEAE",
            "text": "👍…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTVQwcDFaVWh0VWtreFRXMXhYemRCTkUxSk5GRRAB",
            "text": "I recently had the pleasure of dining at Sammy’s Fish Box, and I must say it was an exceptional experience. From the moment we walked in, the welcoming atmosphere set the tone for a delightful meal. The highlight of our visit was undoubtedly the crab—it was simply amazing! Perfectly cooked and seasoned, it was a true seafood lover’s dream.\nThe corn bread served alongside was equally impressive, with a delightful texture and flavor that complemented the meal beautifully. While the prices might be on the higher side, the quality and portion sizes more than justify the cost. Each plate was generously filled, ensuring you leave satisfied and content.\nOverall, Sammy’s Fish Box offers a fantastic dining experience with delicious food and great service. It’s definitely worth a visit if you’re looking for a memorable seafood feast."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzME5FNVFjRXhVVVZWMVJtaFBWamR5TVRGT1lsRRAB",
            "text": "Loved the seafood options and everything was served hot, tasty and plentiful. Ordered calamari, crab legs and lobster tail combo with salad and loaded baked potato. The drinks were great too. Our waiter was very nice and professional."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS2h5ZDYweWZDbzRBRRAB",
            "text": "This place was pretty big. Very specious with different seating arrangements to accommodate various party sizes. We were a party of 13. The food was descent service was good. Nice vibe. Drinks was good. Lemon drop get you lil litty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOSC12N0swLXJfcVV3EAE",
            "text": "Food was average besides the scallops. The scallops were absolutely amazing. We did not care for the shrimp because they were huge/ larger than traditional jumbo size.\nPrices were a little high but the portions were decent. We were seated quickly and the food came out within the expected time frame.\nMonstrous Drink was definitely worth it though.\nTraveled a little ways and was expecting more."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMFpEbk1nEAE",
            "text": "if you are looking for a true seafood experience this is the restaurant for you, we ordered “Our Fabulous Feasts for 2” but it is actually so big that it could easily fit 4 people, the lobster and crab legs were super fresh and juicy, so was the rest of the seafood except for the jumbo shrimp which seemed dry to me, everything in this restaurant is huge, they greet you with 3 varieties of bread and fresh vegetables, to drink we ordered corona margaritas and they were very tasty, the staff was very attentive and diligent and the restaurant itself has a very fun and pleasant decor! We will definitely be back for more!\n\nThanks for watch my review and please don’t forget to follow my page for more!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMXBLcWVREAE",
            "text": "Unfortunately I did not enjoy the food or the drink I ordered. The food tasted like they just put seasoning on top and left the fishy and seafood taste (bland) to stand out. The salad looked like I could have made it at home as it had little to no thought. There was no Caesar dressing option as well. The food is definitely not valued at the price it displays. I thought it would be a great experience overall because I had Sammy’s before and I remember it being scrumptious. About 4 years ago is when I went last.\n\nI did however love the customer service. We had a really great waiter who laughed at my husbands jokes. We won’t be going back but did have a good date night overall."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNaVhfOURGa3NESXhBRRAB",
            "text": "Food is great. Service could be better but they are trying their best given how many people are there and very little space to navigate around. Prices are high but expected for fresh seafood nowadays"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSFVHRlpjRVpxUnpKSk9IVlVNVEZ5YTBrNE4wRRAB",
            "text": "Food was great! Prices were reasonable. At first service was slow but in their defense the place was packed so can't be too hard on them about it. Once server came out the quality of service was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ1dIb3dYME10ZEhwM2IwbHJaRll5UVRaaVlYYxAB",
            "text": "Love Sammy's, I've been going for years. Took my son for the first time, he loved it. Food was great, served in abundance, I always have leftovers. Service was excellent, my waiter was very attentive. And the atmosphere was  lively but not loud. Absolutely no complaints.!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRGFHWlhiMHQ0WTA1bmEyWlBPVVJPV2tOc1VGRRAB",
            "text": "Hubby and I been here a few times..but Sammy's Fish Box is a treasure on City Island.\n\nThe service and atmosphere is great. You cannot ask for a better, dining experience.\n\nThe seafood portions are large, definitely great value for your meal."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfay1TMXlBRRAB",
            "text": "Update March 9, 2025: Today’s lunch with my son was outstanding, thanks to our waiter William, who has been serving me for over 20yrs. His hospitality and professionalism as a waiter is outstanding and few can be compared to him in the restaurant business. His bosses should feel proud of his professionalism and caring for his customers. Today my son and I order fry calamari, shrimp and chicken Parmesan and lobster including an apple martini and a Corona beer .The food was a large portion unable to eat all so we packed it up to take home. Today’s lunch my son and I really enjoyed and thanks to Willie’s hospitality and professionalism , we truly enjoyed. Therefore for today’s rating it is 5 stars. The restaurant was pretty packed today with many customers since this Sunday was a sunny and beautiful day. Note: First two pictures were from Jan 15, 2025 , the other pictures are today’s lunch.\n\nJan 15, 2025:Went to celebrate my birthday and was disappointed with the food. The service was not the greatest. I have been going to city island and to Sammy's for over 50 + years. I always have had my waiters for over 20 + yrs. On this day my waiter was not in. I ordered mussels and half was empty but they gave me another one. We had tilapia fish and it was very small the last time it was a bigger piece. I also had chicken with linguine, and the chicken breast was burnt as well as the wing. I also ordered chicken and shrimp Parmesan with linguine to go. When at home to eat the shrimp was over cooked and no taste. To conclude the quality of the food has gone down and service. I do know many of the owners in many of the restaurants in city island too. I have always rated Sammy's with 4/5 stars, for their food and service. I guess my waiters were not there on this day and it changed my rating based on the food and service. I have for years celebrated my birthday but this day was the worse. Note: first  2 pictures."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMQ2RxLXpJNTczTUdnEAE",
            "text": "I can’t believe I came all the way here for this. The baguette served before the meal was the best part. The lobster and the fried dish had no flavor at all. I honestly wondered if the pasta on the side was even meant to be eaten. I absolutely love seafood, but this was the most tasteless seafood I’ve ever had in my life. They even deep-fried a hair along with the calamari. Never coming back. A complete waste of money and time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZkhrNmFPNXBpcVdREAE",
            "text": "Our server was amazing, the food was plentiful, the staff was pleasant, and the vibes were high. It was my second time back in the past 2 years. This time, we came to celebrate my Mom's 70th bday. She was happy. Thank you so much to all of the staff for helping."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMlpuUk1RV1JtU1ZCTWRtNW9WRVZRVDFCM1JsRRAB",
            "text": "Love the broiled seafood platter and linguine with red clam sauce - fun decor & cool experience. Definitely a cultural landmark on City Island!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OVByTzd3RRAB",
            "text": "Although life is getting harder with the bad economy, Sammy’s meals are a healing delight. I enjoy the interaction with all the servers there always so sweet and the place is always busy and the food is great. I love the ambiance and interactions with other patrons"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM2ZfSXJzMi0tX2N3EAE",
            "text": "Upon entering, we were greeted warmly and given our choice of seating. (It was not that busy.) Waiter patiently brought water and waited. He saw we were enjoying the atmosphere and looking at the menu. Bread and some items of carrots, sweet peppers cheeze were placed on the table. We ordered a huge spread of shrimp, calamari, filet fish, scallops, and baked potato with sour cream. Salmon and jumbo shrimp, which also came with a baked potato. (On the house was a dish of sweet corn on the cob and yellow rice; delicious.) Delicious, delicious delicious. We could not finish. The shrimp delicate yet firm well seasoned. The salmon had a light bread topper succulent to pallet. The baked potato (would have liked chives, well cooked. We were not rushed or bothered as we sat to stuff ourselves. The mid day weekend 🙌 😎 👌. Doggy bag finished that evening, still full of flavor and joy. Sammy's, I'm so glad to have had the opportunity to experience good sea food cooking. Thank you for a great time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuc1pHelhBEAE",
            "text": "Consistently good food with generous portions.  Food is well seasoned.  Each table gets a starter with salad, garlic bread, a crusty loaf, cornbread and pickled vegetables.   Service is fast and in addition to standard sides, yellow rice and corn on the cob are also served.  Servers are pleasant.   There will be enough leftovers for a hearty meal the next day.  The bill will add up."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdVp6N3hBRRAB",
            "text": "If you're looking for a dining experience that delivers on quality, service, and great prices, look no further than Sammy’s Fish Box. Located in the heart of City Island, this gem of a restaurant consistently impresses with its standout dishes and a welcoming atmosphere.\n\nOne of their crowning achievements has to be the fried shrimp. I can confidently say they boast the best fried shrimp in City Island. Each bite is perfectly crispy on the outside while remaining succulent inside. It’s a must-try for anyone who appreciates seafood done right.\n\nAnother highlight on the menu is the paella, which is simply outstanding. While advertised for two, it’s reasonable to say it could serve a small army – or at least up to six people! The generous portions ensure you’ll likely have leftovers to savor at home, making it not just tasty, but also a great value.\n\nThe service at Sammy's is another area where they shine. The staff is attentive without being intrusive, always ready to make recommendations or ensure your dining experience is enjoyable. Sharing a meal with family or friends here feels like a special occasion, but it’s also casual enough that you can drop by anytime.\n\nA huge bonus is the free valet parking service. In a bustling area like City Island, this is a tremendous convenience that removes the stress of finding parking.\n\nThe restaurant’s spacious layout is impressive, seating around 300 guests, so you never feel cramped, even during the busiest times. This makes it a fantastic option for both small gatherings and larger celebrations.\n\nHaving been a regular patron for years, I can confidently say that Sammy’s Fish Box never disappoints. Whether you’re dining in or opting for takeout, the quality and taste remain consistently high. If you’re in the area and haven’t yet stopped by, you’re definitely missing out – I don’t think you will be disappointed!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaFZVSnRkRWhtY0VwT2MxUnpaRTVqWTA5UlQyYxAB",
            "text": "First time ever going here & I enjoyed it. Food was delicious and fresh.  The portion sizes are huge. Liked that they gave us a nice cold salad, garlic bread, half a loaf of some good Italian bread, a wedge of cheese, & some cornbread when we were seated. I went here at 12 on a Saturday afternoon and got seated immediately as we were leaving it was getting busy in there. The server we had was great he was so nice & friendly.  We really enjoyed it here. Will definitely be going back again & would definitely recommend it here especially if you are looking for good fresh seafood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aWUtRWFBEAE",
            "text": "The staff is really what has me coming back to this location few time,  and has a great set of people, they are wonderful and so sweet and always working hard!!! It wasn’t super busy at this location on Thursday and the employees are just so darn nice and great! Thank you!!!! it was my sister’s birthday and employee treated my family very nicely. He was calm funny and energetic waiter. He also gave us recommendation about to eat, and everything was delicious as always."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReklPRHNnRRAB",
            "text": "My wife and I had the king crab legs and lobster tail combo. It was seasoned to perfection. The butter was a bit salty, but an employee went back and melted some small packs of butter for us. Honestly, the way the food was seasoned, the butter was not needed. Other times I've visited, I ordered large 4 and 5 lb lobsters, which were extremely delicious. Sammy's is one of if not the best seafood restaurant on City Island."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbXVMSnJnRRAB",
            "text": "Work lunch on a weekday.  I think we were the first customers for the day, so things were a little quiet but we had someone with us soon as we sat down and we probably got some extra attention since they were not busy.  Maybe summer is a different story.  Menu is heavy on the seafood side, but they do have other protein options and combo meals.  We were given a cold veg dish, corn bread, and garlic bread for the table to start while we were going through the menu.  3 out of the 5 of us went for various piri piri dishes, which everyone seemed to like quite a bit.  I went for tilapia, which came with Cajun seasoned rice and a side salad.  The fifth person got salmon.  All the food that I tried was good (not great) - though everything was fresh.   The portions are large, so you do get good value for your money.  The service from our waiter Jeff was very good - he took care of us very well.  Made good suggestions and was honest about his selections and why.  No one had space for dessert.  There are parking options - dedicated lot for Sammy's and street parking.  There is also a Sammy's Shrimp Box diagonally across the street - the same ownership."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbTZDdHpnRRAB",
            "text": "It is unfortunate that the Shrimp Box is now a Smoke House, but at least we can get all of the favorites at the Fish Box. Same great taste with better service. Our waiter Benito was very informative and very pleasant. I hope we can get him again next time."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfX2RxZGxRRRAB",
            "text": "This is a great seafood 🦞 place! Plenty of food ! To start your table is brought veggies, a loaf of bread and garlic bread and cheese! All this before you even look at the menu! Lots of cozy seating options. The place is decorated sweet for the upcoming holiday ❤️. Plenty of parking with Valet. Portions were large. My lobster 🦞 was cooked and seasoned to perfection. Plenty of cocktails and wine to choose from. My first time to City Island and I would love to see it in the summer. You are practically at the end so you can see the LI Sound."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVlgyVmphelJoZFVFM1NGZDFhako0UTBab1prRRAB",
            "text": "I love crab cakes I get two dinners from Sammy's and now they have cilantro in them they taste horrible. I still have them picking out cilantro. I'm not finished picking. This was a takeout order."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLXRxc2VoX2NxOTlnRRAB",
            "text": "First time trying it now I’m hooked, The food is delicious and the area is gorgeous,Definitely coming back for sure,I can see why this place is famous"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcUp6My1BRRAB",
            "text": "OUTRAGEOUS SHRIMP 🥇🥇\n\nCycled 45 miles here. Saw the $15.95 advertised poster and got drawn in.\n\nWOW 🤩 WOW 🤩.\n\n10 Jumbo sized shrimp lightly fried. Succulent & seeping with flavor. Came with extra large fries, a coleslaw salad & pickle slice.\n\nTremendous value 👍👍. Good for 2.\n\nI must applaud the quality & size of the shrimp. Very impressive !\n\nToday was my lucky 🍀 day"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNVNHVlZkMnRxYzFOT1JWRnBha3BoVTA4eWVsRRAB",
            "text": "My 2nd time here , so good the food and nice atmosphere ❤️😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX2RldXJRRRAB",
            "text": "I had dinner here with a group of family members recently and were seated at our reserved time at 6:15. We were waited on by Ahmad, who was very helpful, gracious, and accommodating. I was thoroughly surprised by the food portion!! It's a good thing we didn't order appetizers lol Our meals were paired with complimentary side of cornbread, bread roll with a slice of cheese, a small tray of olives, cauliflower and roasted bell pepper in a vinegar marinade as well as corn on the cob with yellow rice. In addition, we ate a standard salad with a choice of dressing.  Like I mentioned earlier, food was plentiful and presented beautifully. Well fried, not overly greasy but bland in taste. If the batter that was used to fry the food were well seasoned, I would've been over the moon! Also, although shrimp were extra large, I dislike it when they aren't  de-veined. No amount of breading can hide that. The drinks were good, and we all had a great time."
        }
    ],
    "reviews_count": 79
}