{
    "name": "Scavello's On The Island",
    "place_id": "ChIJKfjwEoaLwokRNUNkhoXlvZ4",
    "grid": "BX10",
    "address": "101 City Island Ave, Bronx, NY 10464, USA",
    "rating": 4.5,
    "user_ratings_total": 506,
    "phone_number": "(718) 885-2570",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVFscFhRMkYxTld3NFluTTRibWxSY1hsRFdGRRAB",
            "text": "Cannot express how happy I was with everything that Paul Scavello did to make our daughter’s dreams come true for her wedding. Paul and staff were very professional and accommodating.  They listened and went above and beyond making sure…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac2EwbG5SV3R6UmxrMlRVVkVPRXRYWlRBek1rRRAB",
            "text": "Food and service was outstanding. I highly recommend this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWVduTkZlamhIWlhGa2VUZFVjVTVvUTJSM1NGRRAB",
            "text": "The food was phenomenal and the staff was incredibly nice however there seemed to be a communication issue with the gentleman who was taking care of our table. We ordered 2 glasses of Prosecco which never came. Thank you for keeping $30 in my pocket. I also asked twice for my lamb chop bones to be packed to go and the guy kept nodding and laughing and my mother noticed he wasn’t doing it and called him back over and asked him if he was packing them to go and he said no. We asked for the dessert menu but all of the selections were too heavy after such a delicious meal so we said we weren’t having anything and asked for the check. I was hoping for a chocolate mousse or a crème brûlée but the only thing that didn’t sound like it would be too overwhelming was sorbet and I’m not paying $12 for sorbet. Ever.\n\nNot a complaint but a heads up for patrons, the dining room is upstairs and the restrooms (George Costanza would approve) are on the ground floor so if you have difficulty with stairs this isn’t the place for you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWFNUTjBSRGw2UW1weVdVY3lTVFZFYWtOcFRWRRAB",
            "text": "Disappointed by Miscommunication and Billing Issues\n\nI was told in advance that the restaurant could split the bill across up to six credit cards, but upon arrival, the waiter said only three were allowed. I asked him to double-check, and he said he would—but never followed up. At the end of the meal, he ran everything on one check without consulting me, which created confusion for our group.\n\nWhen I questioned him, he claimed that whoever gave me the original info denied saying it, referring vaguely to a “lady or man,” which made it clear he hadn’t actually checked. On top of that, several menu prices didn’t match what was charged, and he blamed it on the system—another excuse that didn’t sit right.\n\nThe staff seemed overwhelmed, and while I understand busy nights happen, the lack of communication and accountability was frustrating. If you choose to dine here, I strongly recommend double-checking your bill before paying."
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaVZISmlUVzlUUlRGQ1p6ZEdhbEZEYldOc1NXYxAB",
            "text": "اشي متكتك"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV00wTXhOazVYU2xndGFXVjBXR3hETTJsa2JrRRAB",
            "text": "Great food."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cm9lRU5REAE",
            "text": "Best Restaurant on City Island AWESOME Food  Great Servers Family"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NelNsaG9aM1F4VjJsUWRtaHFPVEZSZUV4SmVYYxAB",
            "text": "Muy bueno"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeVg3Xy14MTd6TWV3EAE",
            "text": "Great food great service. Everyone was so friendly and the foods are the best of the world."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMWDVoUF9wdXJQcTFnRRAB",
            "text": "Amazing, just superb!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJMjRfdGIxdk9PQW9BRRAB",
            "text": "Celebrated my nephew's wedding. Nice updated, facility, good Italian food and lots of it. We had a great time celebrating Derek and Abena."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHVuZjVRRRAB",
            "text": "Food was very good and wait staff was excellent!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaTVMWnVRRRAB",
            "text": "I got married in Scavello’s on 04.26.25. Can I say from the beginning, Paul and Michaela made everything absolutely stress free. They were always one phone call away and always attentive to every detail. They literally took care of everything so beautifully and literally made our vision come to life. From the first moment we started planning and till the very end when the event ended and even after! They were absolutely amazing. I’ll always recommend scavello’s to everyone! Now the night of the wedding? My goodness. EVERYONE loved it and everyone can’t stop talking about it and the food was phenomenal! Every single bite of food was a god sent! Please if you’re looking for a venue for your special day? Do not hesitate. I promise you, they will take care of you as if you’re family. Thank you Paul and Michaela! ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMmR6UHJ3RRAB",
            "text": "Foods good. Service was horrible restaurant was empty yet we waited a long time for everything and there’s only one waiter that does everything for all the tables and bar"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa3ZXcUZnEAE",
            "text": "A.K.A. Lido Restaurant. Amazing food and attentive staff. Always have a great experience here and a full happy belly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNnJlbG1BRRAB",
            "text": "📲👀…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ODhUNnp3RRAB",
            "text": "Food and atmosphere were excellent.  There was only 1 bartender so it was slow most times at the bar.  The music was wayyyy to loud but that's not their fault"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dzUzZ21BRRAB",
            "text": "Great venue to host an event! Service is impeccable. Staff is professional and accomodating."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MG92RGNBEAE",
            "text": "I love it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOE5XODJRRRAB",
            "text": "Food is ok but nothing fancy that you can't get at a regular pizza shop"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua05UNWxnRRAB",
            "text": "The server was very nice! Now to the interesting part. I went to an event here and wasn't told how something was prepared. The food was brought out and to my surprise it wasn't prepared the way it was said to me. I did ask for another option and was told yes. It could take some time. The manager than came over 20 minutes later and said no. We can give you some grilled chicken instead. She continued to say they are about to serve dessert in an hour.\n\nThis was my first time here and I have to say, I really wanted to love ❤️ this place because of the decor and the chandeliers. I was looking forward to celebrating my wedding anniversary here. Unfortunately it will be my last time here. I pray 🙏 the service improves moving forward."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIODdHLVdREAE",
            "text": "It was sooo nice!! A beautiful place to have an event, birthday party, wedding reception, family reunion, etc.\nWe had our first day back to school orientation day. It was the best one yet, I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINElqZm5RRRAB",
            "text": "Seafood was fresh. Pizza good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cHVMc3lnRRAB",
            "text": "FOOD WAS EXCELLENT. I WOULD GO AGAIN."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMXZQYXNRRRAB",
            "text": "Great food Great staff."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0c3ZXNWZREAE",
            "text": "Excellent catering hall. Food and service where amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb3VpaVZnEAE",
            "text": "The atmosphere of the restaurant is ok. If you bring someone here who have problems walking or going upstairs it might be difficult. There is no elevator to get to the restaurant. Also the restrooms are on the first floor. You have to go…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OW9YNXVRRRAB",
            "text": "Management & Staff were outstanding.  Had my friend’s 60th surprise birthday dinner. Food and service were amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcWV6MllREAE",
            "text": "Excellent place and wonderful staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdE1tY1pnEAE",
            "text": "Excellent food and service. Great place for dinner with family or friends. Also, good place to celebrate events in ballroom wing of the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Mi1UbWlnRRAB",
            "text": "Expensive for what you get!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaDRESUV3EAE",
            "text": "A good friend of mine had his wedding here. Classy , clean , excellent food , great staff , oh and I had a great time I'm sure everyone else did also . Nice place highly recommend if you have a family event . And I was told they are…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeTVYNWRREAE",
            "text": "Very nice place...service was great...was there for a bridal show with the company I work for....the men's wear house ....had a great time.....that is one place I would highly recommend for any Occasion........great staff\n.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaU83NFhREAE",
            "text": "This was a Union Event for me and let me tell you the place was nice and clean. The ambiance was beautiful. It started with the chicken and waffles, Spinach rolls and a few other appetizers. That’s when I said ok we got a winner. The dinner…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkME51TFpREAE",
            "text": "Professional courtesy is\nAlways spontaneous . I find this place to be my comfort zone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0Zzl1YzFBRRAB",
            "text": "Great food!  Beautiful location on City Island!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeV9EaHl3RRAB",
            "text": "Nice atmosphere and food is good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWOWVEcXdBRRAB",
            "text": "The place is beautiful. Staff was very friendly and helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaUlEV0JBEAE",
            "text": "Food was decent service was good but took very long"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsX3ZyWkVREAE",
            "text": "Food was excellent. Service was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNXRiWC1RRRAB",
            "text": "Great. Easy to set up events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd3JINnNBRRAB",
            "text": "A beautiful well-kept park, a gorgeous view of the river, friendly staff, interesting for all ages."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa2VHLWJnEAE",
            "text": "Always great food and service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUM1bGVZVRAB",
            "text": "The ambiance was very nice and the food was very good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMk9LZ3Z3RRAB",
            "text": "We visited Scavello’s last weekend for dinner to celebrate a birthday.  The experience wasn’t what we expected.  This was our second time dining here.  The radio played 106.7 with commercials every so often.  The ambiance was dull and boring.  I don’t think I would give this place a one star for ambiance and I’m forcing myself to round up to an overall three stars.  Our server was somewhat pleasant, couldn’t tell because of the mask but was overall a bit inattentive.  The food was a hit or miss.  For example, the calamari was spiced and tasty but my king crab was blah.  I’ve had better king crab, especially when they wanted to charge us $75 for 1.25lbs (this was later addressed once we brought it to their attention).  The stuffed shrimp was mediocre when compared to other restaurants which used 90% crab meat to stuff the shrimp.  The shrimp scampi was basic.  Again, most of the meals were disappointing.  Our cocktails were sub par as well.  I had to add ice cubes to my mango martini since it was barely chilled.\nThe up side was the desserts with the exception to the cappuccino which was mostly milk.  You can barely taste the coffee in the cappuccino and it’s mostly milky in color.  I think the staff should be trained in making cappuccino and cocktails.\nUnfortunately, there aren’t many good restaurants left in City Island.  Costs seem to go up while quality keeps dropping.  In NY, it seems the chefs are now the cooks who somehow graduated to wannabe chefs.  I’ve been visiting City Island for over 25 years now."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNTZYUWJnEAE",
            "text": "I completely recommend this place for delicious and amazing food with outstanding service. It is a very quiet small restaurant upstairs and the opposite of the busy and rowdy atmosphere you usually get at City Island. When we first entered the dining room I was a bit confused because it looked like we walked into an event/party because there were two very large parties seated. I almost left but we decided to stay and so glad we did. I went for my birthday with one other person and had a very enjoyable time with great great conversation since we could actually hear each other. The only thing I would recommend is some background music since it was a bit too quiet. I can’t stop thinking about my meal and can’t wait to return. I also ordered raw clams on the half shell which I did not take a photo of."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMGJPbmp3RRAB",
            "text": "Been here once during the week, it was quite, with one other table seated but service was still great, and the food was good. Staff is attentive and food comes out in a timely manner. Feels fancy"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbXZQb193RRAB",
            "text": "Our wedding reception was November 2018. It was everything I dreamed of and more. Paul the owner was there every step of the way and went above and beyond. He made everything special. The venue looked stunning and the food was absolutely…"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDbnBQYnN3RRAB",
            "text": "I love this place! I totally recommend it. The food is spectacular, so delicious menu and the service amazing, so good so far. Last night, I went there for the first time and I really want to go back there. Jenny, (an excellent waitress and bartender) was the person that assists us, and she was nice and kindness, she makes it a wonderful experience, her specialty are mojitos so don't forget to ask for it. In this place, you will find good quality, quantity and also very good prices. Usually, I don’t write reviews but, in this case, I really want to do it.\n\nAme este lugar! Lo recomiendo totalmente. La comida es espectacular, el menú delicioso y el servicio increíble, realmente muy bueno. Anoche fui  por primera vez y tengo muchas ganas de volver allí. Jenny (una excelente mesera y bartender) fue la persona que nos atendió, fue muy amable y gentil, ella hizo que esta sea una experiencia maravillosa, su especialidad son los mojitos así que no te olvides de provarlos. En este lugar encontrarás buena calidad, cantidad y también muy buenos precios. Yo no soy de escribir reseñas  pero en este caso realmente me nació hacerlo."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNTVXZHh3RRAB",
            "text": "Es un lugar donde puede disfrutar el momento, con tu familia, esposa eh hijos, excelente servicio al cliente y comida, agradable nivel de música, personal altamente cualificado y esperar excelente sabor de comida. Si de mi dependiera sería una estrella Michelín."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaFlEMHBRRRAB",
            "text": "This restaurant was a super super nice the food was delicious the staff was so humble and nice the restaurant view was espectacular the lights the chairs the table were so elegant aww I loved it best birthday celebration I had in years I was turning 41 on Saturday June 5th and it was epic"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCM0tPLWxBRRAB",
            "text": "I had my graduation party at Scavello’s and I had the greatest experience from start to finish! Paul was a gracious host and executed my vision perfectly. The venue is beautiful and the food was soo good. Scavello’s will be my go to venue in the Bronx from now on. I highly recommend it to anyone looking to host a party or event."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbWJtMTl3RRAB",
            "text": "Good food and service, very friendly staff.  We had a birthday dinner here and everyone was happy with their food.  Portions were generous enough to take some home. This place is a refreshing change from all the deep fried seafood on the City Island strip."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMUwzcDhnRRAB",
            "text": "My friend and I went because we had a Groupon ticket. Food was delicious and authentic. Think we came early because it was very empty. Drinks were nice and strong! Oh and I had the penne Al a vodka with shrimp...Amazing and very big shrimps."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMnNUM2tRRRAB",
            "text": "I came here for a wedding ceremony. Their service was very professional. they served us with everything that we needed water, drinks, food and in a timely manner too. The the place is beautiful as well, it's right on the island in Bronx the environment is cozy and welcoming. I would say that I enjoyed the 2hrs I spent here."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0dHNxb2VnEAE",
            "text": "We held our HS prom here last week. The decor was elegant, we did not have to decorate too much. The food was delicious and plentiful and the place was large yet cozy enough for 80 students and chaperones. The service was excellent, they really kept our needs in mind."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OS1qRzF3RRAB",
            "text": "This place was the bomb omg first we got there late and they still let us in, then we get in and they automatically start giving us things to eat, omg and they\nare so friendly and nice the  food was out of this world I loved every moment of it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbkxqNzFBRRAB",
            "text": "Nice and quiet on a Sunday good service the food is fresh I did not detect any artificial cheese on my eggplant Parm Ihad Lemon butter chicken was tender and delicious . Broccoli Rabe was good. They sang happy birthday to me 416/2023"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOTdhTHVBRRAB",
            "text": "This place was nice our waitress was very nice and attentive to us the food was good we ordered the seafood combo delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eWFfVDBRRRAB",
            "text": "I enjoyed my food 😋\nMy boyfriend didn't 😡\nI'll be back 😊…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLN1pTMnFRRRAB",
            "text": "The food here is absolutely amazing! Extremely fresh, well seasoned, and super tasty and authentic. Their crab cakes are the best I HAVE EVER had. Came here for my husband’s birthday and our expectations were blown out the water. I love…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeHE3Um9nRRAB",
            "text": "The restaurant is very comfy. It has a nice decor and relaxing atmosphere. The waiters were so attentive and pleasant. The food definitely Amazing. We both ordered the lobster ravioli, it was delicious! The tartufo desert was so good, loved…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMWR2Y2V3EAE",
            "text": "We had a phenomenal retirement party at Scavello's On The Island. The service was superb! We can’t thank the team at Scavello’s enough for a smooth and friendly experience. The space and service were impeccable. Thank you for making memorable moments for our retiree, health care workers and everyone that attended ! I highly recommend this place if you’re looking for a catering venue with good food, and even better service!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM0pDeHl3RRAB",
            "text": "I celebrated my 3rd wedding anniversary here and it was absolutely amazing. The food was incredible. Our waiter Luis was so friendly and provided us with excellent service. Will definitely be coming again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNlb3M1NhAB",
            "text": "Fantastic place for either a step-above sit down meal or a quick grab-and-go (thanks to the lower level deli-style quick mart). Food is consistently yummy, with expected City Island prices. I utilize the quick mart weekly for par-cooked oven full dishes or daily essentials. Affordable wine and beer available. Kind and courteous employees round out the experience for a 5-star location. Love it! (Download the rewards app!!!)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbnNMRkt3EAE",
            "text": "Location, staff and service was stellar. Best night ever. We were treated like royalty👑👑👑. The 💍Santiago's 💏approve. 👍👍👍…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRa3BIaXF3RRAB",
            "text": "I had my Baby shower there last year 2016 and it was amazing.\nBest place for a family / friends gathering or event. The food was great and the service was on point. The servers were attentive to all of my guests. The owner is very reasonable with the price and negotiable.  Overall it is a great place to plan an event."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OXJpMVR3EAE",
            "text": "Food was great, cozy, intimate setting. Servers and bartender was excellent!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZ2RiYml3RRAB",
            "text": "My family and I came out for lunch. We saw on google that the restaurant opens at 1pm but when we got there the restaurant was closed. We found out that the restaurant actually opens at 3pm. The restaurant owner paul, was beyond phenomenal, he decided to accommodate us at the restaurant despite they won’t opened as yet. Service was impeccable, food was delicious and fresh. My family and I enjoyed everything. Paul was so pleasant, kind and patient. This by far has been one of my best restaurant experiences in a very long time. I highly recommend and I will definitely come back again!!! Give them a ten star rating."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNzdDZoSBAB",
            "text": "My husband and I met another couple for dinner last night at Scavello’s - such a great evening. The food was delicious, the presentation of the food was beautiful and our waitress - Jenny, was amazing. I have a good allergy, she totally ensured that I did not have a reaction. Overall a great evening, can’t wait to go back."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5Nk5tZG1nRRAB",
            "text": "Delicious food and great vibe. The staff very friendly and accommodating. We didn't have a reservation for Valentines so major Dee was very friendly big smiles and very accommodating to our needs. Great drinks . Food and presentation top notch. Definitely coming back"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNna1puN0N3EAE",
            "text": "Our wedding was just amazing, the owner Paul assisted us every step on the way. The captain and her staff were just spectacular. They catered to all out needs to ensure our night was perfect. The place and the food exceeded all of our expectations. Thank you for a memorable night"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdHBLSWp3RRAB",
            "text": "Delicious, huge portions, and friendly staff. The atmosphere is cozy, so it's great for family dinners and birthday dinners. The zuppe de pesce was great! Everything was fresh. Their lobster bisque was also delicious. The wait staff were so friendly and sweet! The owner came to greet everyone! I had a wonderful experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcmNDRlBBEAE",
            "text": "We invited our son(son-in-law) and his girl friend.  It was an important dinner and Scavello's didn't disappoint .  The food was sensational and beautifully presented.  The floor staff was abundant and efficient too and the food, served…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaFlySlJ3EAE",
            "text": "Mixed Bag: Food was good. Service had strange moments and was slow. The stuffed lobster was fabulous as were the filet minion and stuffed shrimp entree. The appetizers were also fantastic we had stuffed clams and spicy fried calamari which was crispy and tender and spicy as advertised. The side dishes however  left something to be desired as the mashed potatoes were cool to the touch instead of warm or better yet, hot so we had to send them back to be heated.  The bread for the table was bought out late and also should have been warmed especially on a cool evening right by the shore. We were all stunned that we (at first) got plastic cutlery and had to request silverware. Service although friendly was very slow. We waited nearly 15 mins for the bill. All in all this was ultimately a good dining experience but like many places not accustomed to outdoor dining as the norm, they have some work to do toward improvement."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJczZfYXd3RRAB",
            "text": "Great place on the famous City Island to have a party. I have had baptisms, communions and other parties there. Food and Service are great, plenty of parking. The plave has been recently renovated. The owner Paul will treat you like family. For your next big event, give them a try. You will be happy you did."
        }
    ],
    "reviews_count": 76
}