{
    "name": "LNE Bar & Restaurant",
    "place_id": "ChIJCT9SKG7zwokRt_-xnno2CPQ",
    "grid": "BX7",
    "address": "390 E 204th St #1, Bronx, NY 10467, USA",
    "rating": 3.6,
    "user_ratings_total": 535,
    "phone_number": "(718) 653-0788",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFZHdHFjRFpLVFVKMmFWTnlURmw1TmpFdFkyYxAB",
            "text": "Horrible, horrible service.\nThey are loud and unprofessional\nThey also lie about their prices\nOnline order says $28.00 but was upcharged to $38.00"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWlpXaHNYM1p3ZVRaVGRrbExUa0phVWtaSmRIYxAB",
            "text": "This place has bad service the skip you or completely ignore you until you speak up then they want to take you order not to mention that they speak about costumers in Spanish not knowing that some people understand what there say never again overall not good at all don't recommend 👎…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKeUY2ZkNnLXU2cF9BRRAB",
            "text": "Extremely poor customer service, everyone is not treated the same, mistreated my friend, acted like they didn’t want her business—how you a restaurant and you treat customers poorly?"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VON0xxNS01anRIZTNRRRAB",
            "text": "Ordene dos platos de beeftec guisado uno con mofongo y otro con ensalada de coditos y la comida que llego a mi era nasty la tire a la basura porque era donde deberis estar un mal servicio el dia 15 de mayo 2025 a las 5 de la tarde,deben tener mayor resposabilidad con\nel cliente que gasta en su restaurante y lo menos que pide es disfutar de su orden."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNYWx3cG5YbVluUVl3EAE",
            "text": "Inside they have bad customer service I will not be going there again due to the bad customer service the ladies need to be trained on professionalism when running a restaurant"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTZqR0RREAE",
            "text": "Les vengo a comentar mi experiencia con este lugar. La verdad me parece muy desagradable y asqueroso que venda comida daña. Hice un delivery y me trajeron una ensalada de macarrón daña, su sabor es agrio, y huele horrible, la verdad no podria explicarsu olor exactamente. Y como pueden ver en la imagen se ve como la mayonesa ya está cortada. Llamo al restaurante para hacer queja sobre eso, a lo que ellos responden que no era problema de ellos si a mi no me gustaba, según ellos la ensalada \"estaba buena\"  y que su sabor es así. Como puede un restaurante ser ignorante de lo dañino que puede causar un alimento dañado y que no tenga el cuidado con esto. Por eso yo les dejo esta experiencia para que POR FAVOR NO COMPREN COMIDA EN ESTE LUGAR."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaS1la1Z3EAE",
            "text": "En mi experiencia, me dieron un aguacate duro y una pasta de macarrones dañada, decían que no era problema de ellos y que no les importaba"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbkxtSjF3RRAB",
            "text": "Los Delivery dan mal servicio y las damas que sirven comida le hablan mal no tengo buena experiencia en ese restaurante le pido al público que tenga en cuanta ante de ir a este local a comer"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb2IyTUh3EAE",
            "text": "Deben entrenar más al personal que contesta las llamadas!! Y a las que atienden  también."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc3ZQSmh3RRAB",
            "text": "Amazing food, music and vibes! Will definitely go again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bTZHZFpBEAE",
            "text": "I visit this restaurant all the time and I always say I’m going to stop going due to they prioritize other Latins before anyone else, but it’s really the only thing to eat over here besides pizza or bodega food.\n\nMy experience tonight was one of the worst because I just got out of the hospital a few hours ago due to pneumonia/flu and high fevers, so they gave me some antinausea meds so I’m finally able to eat and I decided to have Spanish food delivered to me. I’m literally 5 mins away from them (one block away LITERALLY) and it took an hour for my food to come. I called them they said it was on the way, and took 30 more mins for it to come, so of course the food was cold. I opened it and it wasn’t how I asked for my order to be. So being weak, with cold sweats, AND a broken elevator, I was now  forced to walk to the restaurant after calling numerous of times bc of course they began ignoring my call. I was praying they were just busy bc it’s Saturday and I was going to let it be…when I got there it was only one couple and everyone standing around doing nothing with the manager sitting RIGHT there allowing them to ignore calls as he grilled me like I was in the wrong. I asked them to remake my plate so I can have hot food along with the condiments I asked for on top bc I don’t like dry rice. Of course they spoke their native language so I didn’t understand what was being said, but they went to remake my plate, not caring enough or having enough energy and now sweating under my coat, I didn’t watch and I ignored the fact that when the girl and guy was putting the chicken on my plate she said “careful she’s right behind you”. They bagged my food up and I left bc I just wanted to get back in my bed, praying I don’t make myself sicker. I got home and of course I have the oldest, driest piece of chicken on my plate so I guess that’s why they were huddled up and saying to be careful. What’s the purpose in sabotaging my meal because of y’all mess up? I will never eat there again and they will be lucky if I don’t decided to call 3-1-1 on them daily. Any time I’ve ordered my food has never been correct unless I’m standing there watching their every move. I miss when ppl had integrity, morals and values. I paid, I didn’t ask for anything free, I wanted fresh food and they still gave me stale chicken that’s been on the grill all day just to be spiteful. I should’ve coughed uncontrollably in there 😩 and that bs line they reply back with “everyday they strive to be better” is BULL CRAP, they are not and they do not care about their customers and since the lady manager left, it’s gotten even worse, not that she was the greatest either but she ensured the food was at least fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydDVlLURBEAE",
            "text": "Food is great and the staff is fantastic. This is my go to spot when I visit my sister. I live is GA and we can't get food this good in GA."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MU9pSmZnEAE",
            "text": "Love it"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MDliM0NBEAE",
            "text": "Terrible customer services. 1 hr and 20 minutes waiting and no communication.\n\nDespues de meses, siguen con el mismo mal servicio.  Que pena"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaEltbm53RRAB",
            "text": "Waited 3 hours for food then they forgot to give us an order then waited another 3 hours and never got the food then called and they never answered the food was not good either"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENXBQMEx3EAE",
            "text": "Como ha perdido calidad este restaurante.. parece q cambiaron de dueños o algo porque el cambio es terrible.. hasta los tragos son malos y la comida ni se diga.. Antes era excelente no se que pasó"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMjdHMXlRRRAB",
            "text": "The service was horrible, over priced lunch. $80 for a small steak encebollado and tostones- make sure to check your receipt. They include their own tip."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOVl6OFdREAE",
            "text": "Good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1LXRYdEtREAE",
            "text": "Took my GMA here for her 80th bday party this sat had reservations and all, grant it, it was only 2 servers but most of my party never received food and the other half of the party food was cold they never tried to come back out with hot food nor plates that ppl never received kids didn't receive food drinks was nasty a can of soda was 5 bucks just a horrible experience and everyone is not from the city so ppl drove for this and we didn't receive a sorry just attitude all the way around the suckiest service ever"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MHFfOGV3EAE",
            "text": "Waited 2 hrs for cold food. I sent it back twice. And still it was cold. I told them forget it I don’t want it. Still got charged for food I didn’t even touch. Then they tried to charge me for food I never got. I m so disappointed I traveled 5 hrs to celebrate my grandmother’s 80th birthday. For me not to eat and still get charged. Then on top of it the server had the worst attitude. If I can give it 0 stars I would."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdmRTTVV3EAE",
            "text": "The best sancocho I have had from a restaurant.  The steak and grilled 😋 chicken. Oddly, I am not fond of their beans. I wish the steak had onions and peppers.  Wi)l return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ0t6OFZnEAE",
            "text": "I ordered a lunch with a side salad and the salad was soggy and old."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMHZhbDl3RRAB",
            "text": "Hoy estuve llamando a pedir un Delivery,llame más de 5 veses y me dejaban en espera ,cuando por fin me contestas pregunto que tienen y me lo dicen rápido que no entendí ,puse mi orden cuando llega,llega a mi casa me envían las cosas que no ordene,se lo repetí dos veses a la persona que me tomo la\nOrden y aún así cometen error,llamo para atrás a noticificar los errores la respuesta es la que te tomo la orden ya se fue 😡 pésimo servicio ,un 0 horrible"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM0lQd0hBEAE",
            "text": "Venía de un viaje largo con mi esposo y me detuve en el bronx a saludar una amiga y mi esposo que es americano tenía mucho deseo de comer comida dominicana, no sabíamos de este lugar nos detuvimos en el primer restaurante que vimos.. la comida estába deliciosa, pero la joven que nos atendió fue muy grosera, luego de que pagamos le pedí un container para llevarme la comida y me dijo en un tono muy fuerte que debía comprarlo por $2 dólares y le dije ok no tengo problema lo compro, pero cuando nos dimos cuenta que no teníamos cash mi esposo le dijo que iba al carro a buscarlo y ella tenía una actitud muy mal.. es lamentable que pasen estas cosas solo por un mal servicio y mala actitud no nos interesa nunca regresar a este restaurante."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eW9UVFRREAE",
            "text": "Food was nasty! Rice was hard beans were not tasty and meat was nasty also food was cold the manager is rude and nasty, manager stated “if the food was cold you should have asked for a new order” we asked for a discount and she stated that. Very nasty service never again and also they talk to their other workers about you since the moment you step in"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaDl6aGZnEAE",
            "text": "I dont know about the atmosphere because I've never fined in,. The delivery service was super fast and the driver was very polite.  However the order was incorrect because the website and the paper menu don't match. I ordered based off of the website menu because i dnt have a paper menu and got the wrong food. I dont know what it tasted like because I didn't eat it."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMDhuTjdBRRAB",
            "text": "Servicio ineficiente del la barra tengan cuidado al consumir ya que te cobran de más.  El ambiente es bueno me gusta el lugar.   Se precavido."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMW8tcm1RRRAB",
            "text": "Pocos profesionales, mal educados, le cierran el teléfono a los clientes cuando llaman a reclamar el mal servicio. La manager una “Tal Maria”, es una persona grosera que no busca la vuelta a los clientes..\n\nGroseros y poco profesionales"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeWUyOWV3EAE",
            "text": "The food is garbage. The beans had no flavor The chicken was dry. The service sucks...I was the only person there with 3 women behind the counter and all they did was talk to each other and act like they were busy. This place sucks. Don't waste your money..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMEtDRC1BRRAB",
            "text": "the food is fine... the service is horrible, nobody has hospitality in that place.  They don’t know how to treat a customer... everyone looks angry and moody."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNTc3Z0pBEAE",
            "text": "Un bonito lugar muy buen servicio fui el martes almorzar me encanto la comida muy buena atención se lo recomiendo"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNTQ3S2JnEAE",
            "text": "Fui a comer un buen servicio las chicas muy amable"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocF9mY2x3RRAB",
            "text": "This beautiful place is my favorite in NY.  The employees are very accommodating and above all the atmosphere is the best.  Thank you Soranlly the host for such a good service.  I recommend it 100%."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaDVYcmpnRRAB",
            "text": "First of all,  the music was too loud for such an early time of the day.  Second,  the service is really bad. And third, and most important, the worst food I had ever tasted.\nOn top of that, their prices are too high for the quality of food and service they provided."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobmJIZFNBEAE",
            "text": "Don’t waste your time here, the food is atrocious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOWVHdVJnEAE",
            "text": "The food is so delicious and the lady was really nice to me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNocFlaVhAB",
            "text": "Very good service specially morning service I love it, Very kind 10/10 would recommend to go especially in the morning."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodm9QSnN3RRAB",
            "text": "El turno de la mañana un excelente servio siempre las chicas muy atentas"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodnVHbVJnEAE",
            "text": "Muy buen servicio, fui a almorzar y me encantó, esas mujeres son un amor y la comida excelente🥰👌…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodnBLb2Z3EAE",
            "text": "Muy buen servicio en la mañana y muy buena la comida, y las chicas son un amor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodk52Y1hBEAE",
            "text": "This Dominican restaurant is alright great food. But the ladies attending you have the nastiest attitude serving your food. They look at you like if you disrespected them or something. Like you can come in tell them what you want but if you…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaWYzYVRnEAE",
            "text": "Food is always amazing and service always loving."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaWFHNzl3RRAB",
            "text": "Food is great. Service is hit or miss."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbnFULTBRRRAB",
            "text": "Excelente me encanta la comida … pollo preferido.."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjbTRTNDRBRRAB",
            "text": "Food doesnt seem fresh. I ordered fried plantains and they came out soggy. The music is obnoxiously loud, and you need to scream to have the waitress hear you."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdnRHcTNnRRAB",
            "text": "La comida es excelente, todos los días yo compro comida ahí, pero hay una mujer blanca, pequeña de estatura, ella es latina pero blanquita de piel,  cuando le toca atenderme siempre tiene mala actitud para atenderme y me pone casi puro…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdklMaDVBRRAB",
            "text": "The food is amazing as well as the service. And when I call for food to get delivered one of the host that answers is named Hillary. That young woman is very pleasant and helpful. She is always a delight to speak with, she answers all my questions makes sure my order is always made correct. She is very sweet and always makes me laugh on the call. Other restaurants need there own Hillary I swear. She's just great I hope that she is always blessed and gets what she deserves in life."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMnUyUjRRRRAB",
            "text": "Muyy Bueno!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcFB5NUFREAE",
            "text": "I could have sue this restaurant. This place should inform or educate their employees on what a service animal is. One of the employees said no dogs were allowed so I showed proof that my dog was a service animal however, the employee said…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNExDaVl3EAE",
            "text": "Nice and fun place to have a good time"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDX2NUSmdBRRAB",
            "text": "I came here to grab a drink with a friend. But we ended up ordering some food as well. The service was ok but the food needs help. We ordered Beef Mofongo and Fried calamari . Their presentation looks Amazing, but disappointedly they tasted so Horrible ☹️. Both Orders was very Cold, The Beef Mofongo tasted like old pork(minding again it was cold). I gagged with just a bite because the meat tasted very old and Im way far from being a picky eater. But I would never recommend getting the Mofongo. My fried calamari was very rubbery and most of it was soaked with oil😔. But the order came with fries so I was hoping I would at least enjoy the fries, but sadly it was also soaked up in oil, it tasted like the fridge n again it was very cold. We couldn’t eat the food so we just asked for the check. Our waitress notice we didn’t eat so she asked how was the food. At first I didn’t want to tell her because I didn’t want to sound rude. But she kept insisting so I had to be honest with her, which she understood me. But Im not sure who to blame the chef or the waitress for not bringing the food on time. Idk but I would never come here for food. Cuz I almost threw up a couple of times. Im not gonna say not to go there because they have other food to order, but I wouldn’t recommend the Mofongo or the Calamari. Good Luck!!!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMlB6MUxBEAE",
            "text": "Pedí un mofongo de churrasco y el plátano parecía mangu. El churrasco sabía como que estaba un poco dañado y el morí soñando tenía un sabor muy malo. No valió la pena pagar $35 para esto."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NUwzNUZREAE",
            "text": "Why I ordered a henny colada and it had blue stuff in it. I go to tell the lady who served us and she like Yo no sé. Like what on top of that she didn’t even want to remake the drink. They definitely must not have clean the blender. Mind you the drink was $25  Like never again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxd3FXN0hnEAE",
            "text": "I ordered for delivery just for myself and got mofongo. It had to be the most dry, unflavorful mofongo I've ever had. The chicharron wasn't even fresh.\nTiny portion for 15 bucks. It's ridiculous.\n\nThe delivery guy doesn't go upstairs either.\nI'll try going in person maybe the food and service is better but there are many options around."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpbXFEV1FnEAE",
            "text": "Pedi una orden para llevar y fue una decepción ademas de un precio exagerado la comida mala pues los madruros que pedi no se  apetecía comerlos soy cocinero y saque la conclusión que el aceite donde los cocinaron era viejo oh se les paso de cocinados he ido 3 veces a comer al lugar y no he tenido esa experiencia no vuelvo a pedir"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbExQMmhnRRAB",
            "text": "It is one of my favorite spots for brunch simply because of the fixed food, drinks and ambiance. I love it when I can go with a huge group of friends and there is no hassle of having too much of a large group. Not only that, the food is AMAZINNGGGGG! I also love the staff, they are attentive and constantly checking to make sure everything is fine. The music is always popping. Definitely geared towards a younger crowd in the weekends and I absolutely love that. I can literally enjoy great food, with great company and great music!! I absolutely love it here and I travel 50 + minutes just to come here! Definitely recommend !"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDOTg3ZU53EAE",
            "text": "The food is amazing! The waiters are very sweet and understanding, they attend guests quickly and check up on us frequently to see if there is anything we may need. The food presentation is very well put together and the drinks are so good! A nice place to bring your family or to have fun with your friends."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcjhpeElnEAE",
            "text": "Loved the ambiance here — the hosts were amazing. The renovated outdoor seating they created felt very cozy and was a great idea since we’re approaching colder weather! The presentation of my food looked just as good as it tasted (delicious by the way)!\n\nIf you’re going with a few friends, the “Get In My Belly” platter paired with their new “formula” drink... definitely worth the hype, thank me later!\n\nI would definitely recommend this spot to anyone, especially if you’re looking for another hidden gem in the Bronx :)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4dmNYX0V3EAE",
            "text": "Just don’t.\nI came to this place today and was not greeted nor welcomed. I had asked for seating and after I was seated, I wasn’t offered any drink or any menu to look at.\n\nAfter a few minutes more of my guest arrived and then they waited for me to flag them to bring me a menu.\n\nAfter that we ordered some waters and beverages which took some time to arrive to the table which then we ordered our food which took 45 mins and our birthday boy was left waiting extra for his pasta. (So was I) besides that.\n\nThey charge you a mandatory 18% tip fee. No matter how terrible the service is. Hence why they don’t try to personalize or give you an experience at the restaurant.\n\nLastly this was the only time I had been to a restaurant, ordered a meal, & never received it. After an hour of waiting I had decided to just cancel what I had ordered, & came right home.\n\nSave your money and just cook at home, or if you really wanna eat out. Try their competitors next to the salon 👍🏽."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcTZ6S1FnEAE",
            "text": "This place has gone downhill. Prices up, less food, no attention from the waitresses. I wasn't offered dessert or coffee. The waitress never came back to check if I wanted anything else. I waited for my bill and eventually had to get up and go to the front to obtain my bill. Also, beware of their tipping technique when you use a credit card. Don't place a tip on the bill. Wait until you get to the payment terminal to place a tip. Otherwise, you run the risk of authorizing a double tip."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJMmZ6QklREAE",
            "text": "0 stars!! Ordered at 5:40PM today and at 7:15Pm I called to cancel my order because of the long wait. The lady on the phone said she can’t return my money because it was a credit card and I had to understand that it was only one delivery…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNOHZTN3RRRRAB",
            "text": "Horrible service , I ordered food\n1 1/2 hours now and it still hasn’t been delivered. Now that I’m calling them they refuse to answer and sending my calls to voicemail. DO NOT BUY.\n\nUpdate on 12/26/19: So when I finally got my food an hour and a half later, there were two delivery guys sitting in the car. The total was $17 and I handed them a $20. At first they were refusing to give me back my change and when I asked they said “my friend, my friend, assuming they starting insulting me in Spanish, they handed me the $3 and drove off”. I opened the food to eat and there it was cold rice, the beans started to clump together because of how cold and the top of the soda can was rusty and dirty. Mind you, I’m at t a job site and I don’t have access to a microwave or any of the sort so the food was inedible. I ended up having to go to the local pizza store for a slice and soda which was under $5 and under 5 minutes which was worth it. Again, don’t buy from these people, waste of time, money and expectations."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNhNDU1TBAB",
            "text": "The food is pretty good and the lounge/bar has great music. But the problem with this place, it’s they’re thieves. Either the waitress/cashier or manager over charged our credit cards $15 each. We were a group of ladies for girls night out. We came to this place at the recommendation of a friend. Our dinner was a total of $125 with tip included. We have the waitress $10 cash extra although the tip was included. But when I checked my credit card statement, i was charged $140 for dinner. Our bar tab later was $370, tip included and my gf was charged $385. It was the same waitress that took care of us during dinner. So it hard to tell whether is her or management. But that really ruined an otherwise good experience. The amounts are small enough that, it is not worth disputing, but BEWARE, you might be overcharged. Too boot both time we gave the waitress extra tip in cash. This place has to sort out their thieving staff. Maybe they felt that since everyone is drinking, that it’s ok and no one will notice. Of course except for the sober designated driver (me).  I’m not saying don’t go to this place, because the vibe was awesome, but do beware of your charges. Or just bring cash."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpb3VYT1pBEAE",
            "text": "I’m going to start off by talking about the workers and the scenery. They make you feel welcome and you even create a bond with them. The outside dining is just beautiful and comfortable. The food is amazing and they’re affordable. My…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbjVlbFNnEAE",
            "text": "By far La Nueva Estrella is one of my favorite places to go. The music is awesome, the service is so welcoming and the drinks are so bomb. I love how they always come up with new menus and drinks for each special occasion. It’s always a…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMHFpeDl3RRAB",
            "text": "Decided to post my review today after 2 opportunities to change my mind about this place. I agree with other patrons that if you a Male you get better and faster service here.  Waiting for delivery was over an hour(lunch time at work was…"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbEpuZzJRRRAB",
            "text": "I'm not sure about the other reviews.. I go there at least once a week.. fried pork chops are amazing.. the boneless chicken chunks are amazing. And the staff are attentive. . . Can't ask more than that for the price.."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDNzliTkJBEAE",
            "text": "LNE is my go to spot when I’m either hungry, want to have a drink, or trying to brunch. The service is amazing, the food is just as amazing, and the staff is very attentive and caring.\n\nThe brunch in my opinion is something you just cannot beat anywhere else! I personally get stuck between choosing the Caesar salad and sancocho as my appetizer (you would think otherwise but trust me that EVERYTHING is good here). After that I’ll get their churrasco and eggs which is always cooked to perfection and served beautifully next to white rice and red beans as my entree. While the food is absolutely amazing, if you like to drink then be prepared for their bottomless mimosas and sangria!\n\nI have been a frequent customer for over a year now and I cannot say that I’ve had one negative experience. You will not regret your visit. LNE will always ensure a great experience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpc09URVVREAE",
            "text": "I love going to LNE. Their outside dining decor is so cute. I had my birthday brunch here and I was able to enjoy the prefix menu. Their food is amazing and their mimosas have a twist to them. Everything was really yummy for a great price.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDal9UTllnEAE",
            "text": "One of the best restaurants in NY. Great atmosphere, amazing food, and very attentive staff and host, I must say. I went last weekend with my boyfriend, and ordered their chicken empanadas, mofongo with fried chicken chunks and their new…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjd0llYkR3EAE",
            "text": "Customer service is horrible, first time I ordered a mix salad and got potato salad drenched in vinegar.\nYesterday Mother's day my friend treated me to diner we ordered rice,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbFlfTzNnRRAB",
            "text": "Steak sandwich with fries is amazingly good.  Seafood soup is very delicious.  Chicharon de pollo sin hueso with white rice n beans and a side of mojo is very good too.  Can't wait to taste more food.  Went to eat was very loud but food is very good."
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbUxiQVJ3EAE",
            "text": "This was the worst Spanish food I've ever had and took an hour and a half to get delivered. I received rice with no beans which I paid for, my mofongo dressing was way too oily and had bits of bone in it which In cause made me crack a…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMVlXT3lnRRAB",
            "text": "The food is ok but the girls are lovely. Very attractive. I go there even when I'm not hungry. Just to drink and chat with pretty women. (Even though most of the time they don't understand English)"
        }
    ],
    "reviews_count": 74
}