{
    "name": "Bedford Gardens",
    "place_id": "ChIJqdEJl-pZwokRBDhYkP_ocL0",
    "grid": "BX7",
    "address": "172 Bedford Ave, Brooklyn, NY 11249, USA",
    "rating": 4.8,
    "user_ratings_total": 312,
    "phone_number": "(347) 844-9008",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM2RFZHZkemhYYVhCMFZWOWFZMmRwY21aUFNrRRAB",
            "text": "I love food and atmosphere here，would like to come back again！"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ1h6RlJVa1p0V0dvMWRGcGhjVkZzU25WTU9VRRAB",
            "text": "Some of the best pho I've had!\nThe broth was delicious\nHuge portions for a good price"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Rk5EZFhkRE5XTjA1T2FTMU5ZbXhXZW1OMFMzYxAB",
            "text": "Bedford gardens is hands down my go to place in the neighborhood for Vietnamese food. Their pho is great, their noodle salads are delicious... The backyard is beautiful and their service is amazing. I recommend it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRE1GZEpPSGhPZEdJd1kwbHhTbXhJVkRsbmJuYxAB",
            "text": "It was my first time trying banh xeo, but it easily became one of my favorite vietnamese dishes I have ever tried!\nThe chashu ramen was not too heavy and thick, but that was just the way I liked it! My only complaint was the quality of noodles."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205YU1VSnpaWEJwZG1Wb09Vc3RVV00wWDNFMVluYxAB",
            "text": "Celebramos un cumpleaños, al frente compramos el pastel, y nos colocaron el cumpleaños, los triste fue que cierran temprano"
        },
        {
            "date": "3주 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1puWkdZMUZ2WlZOVVJGSnpiR3BGY1dsRFEzYxAB",
            "text": "O Pho é uma delícia! Gostei muito da comida, o ambiente é uma delícia."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUGNXZHhPRzFFUmtSR09GSmFXbUp0TWpCbVEwRRAB",
            "text": "Incredible atmosphere. Bahn mi was delicious and the soup dumplings were steamed perfectly."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNk1sRkJVSE41YlhOWVJUQTFRWFZ0YkRCdmNYYxAB",
            "text": "We had a really good time at Bedford Garden! The vibe of the place is cool and relaxed, and the food was honestly great. The pork spring rolls were a total highlight – crispy, tasty, and definitely worth coming back for.\n\nThe only reason I’m giving 4 stars instead of 5 is that one of our dishes took longer than expected to arrive, and it broke the flow a little. Still, once it hit the table, it was delicious.\n\nOverall, if you’re into Vietnamese food (or just good food in general), this spot is 100% worth a visit."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocFkyTTNUVEZNVjJGd00zbFFiVnB2WkdNMVIzYxAB",
            "text": "Truly satisfied with this."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVWExazJNM0pZTjBscFJpMXhNSFZVUlVjNFdXYxAB",
            "text": "Beautiful spot with warm, inviting energy and fresh Vietnamese flavors. The banh mi was delicious. crisp, savory, and perfectly balanced. A lovely place to relax and enjoy a comforting meal."
        },
        {
            "date": "1달 전",
            "language": "ko",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKU05FNHdha1F6ZDFNNFlUQjJOVTlsYmxsQ1IzYxAB",
            "text": "맛은 그냥 그래요 ㅋㅋㅋㅋ..\n한국이랑 유럽 쌀국수랑 비교 안됨.\n매운거 땡겨서 갔는데 매운고추 없어서 스리라차 넣어서 먹음. 분위기나 위생은 깔끔하고 좋아요\n쌀국수가 2.8만,, 헤헷"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWWVEUlFkRll0YmtSblQwRkVRbmd3YTBNM1prRRAB",
            "text": "So delicious! Came here with my friends and definitely will be back. The Pho is delicious!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKS2NEZERUM056V2pBNU5sTkdXRTQwU0dWWk9HYxAB",
            "text": "The pho was great with generous portions. The rolls were also fresh. Will visit again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMVYzSktkRWRyTURGNVZHZ3lXakZDVm0xMWFYYxAB",
            "text": "Food delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bk5uTlFUVEpuTjJwZmJXUXRNa1ZNWWxKNFlXYxAB",
            "text": "Such a beautiful restaurant with lots of plants which provide the best atmosphere for all occasions. Food was super delicious too, got both Japanese and Vietnamese food to choose from."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWWFHcDRNVXMwVVVWbk9Gb3RUREl6YjE5ZlpsRRAB",
            "text": "Beautiful place, especially the garden at the back. The food is less than average. The servant s don't always understand English"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oU2NGOW1aUzFXYjJwdldUSXdUMVZtUlU1Q2FVRRAB",
            "text": "friendly staff and very yummy food. great lunch deals and fish was very fresh!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSak4xRXhSVmw2TTBwWmFFb3lObmhMUVhsaVFVRRAB",
            "text": "They did a great job."
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNVoxcGpVbDl4TTA5bE9HVnBlazVHU1d4TWIwRRAB",
            "text": "Google Haritalar‘ın tavsiyesi üzerine geldiğim harika bir ortam,sunulan hizmet çelışanlar ve yemeklere kadar çok memnun ayrıldığım bir mekan herşey için teşekkürler👍😀😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMk1VSnFjVmd6VGxselNVNUdibkZxWDJGNVRtYxAB",
            "text": "Loved the garden in the back of the restaurant! Plenty of japanese/vietnamese options on the menu. We got pho, and noodle/rice bowls with plenty of papaya haha"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSc1lVOVVSREpHUjJKTVZXVkxRMWRNVWxGZmFXYxAB",
            "text": "everything about this place is fantastic and the pho here is out of this world!! some of the best pho i’ve ever had.\nambience, food and service all exceeded expectations.\nplenty of vegetarian & gluten free options, a great place for plant-based eaters.\n\nperfect place for a delicious romantic date 😋🫶"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORVFtRkdWMEowT1VadFoySkVTelprY2tnemVuYxAB",
            "text": "One of the best pho’s I’ve had in a while! I had the ribeye pho, the broth was so flavorful , ribeye was perfect . The shrimp summer rolls were of course delicious as well. We sat in the back portion of the restaurant which had a really nice ambiance and atmosphere , makes perfect for a nice date night . I’ll also add that I liked that it wasn’t loud inside so it wears easy to have a conversation without having to shout, big plus for me .\nI highly recommend this place, I’ll definitely be coming back soon !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQmEyWjZNa3BQYVdkbVdraHJjemt4VWt0SVkyYxAB",
            "text": "Waited over an hour last night to receive broth which had no beef or noodles nor the egg I ordered with it, even though the menu states that's what the soup comes with and the tea was so water down. After hard day of work to receive this NOPE! Right in the trash DISGUSTING!!!!\nHow do you guys even have a high rating? First timer and last never ordering again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWGRuQnpXRVZNZW5KUU0zQjJRbkJYYmxacExYYxAB",
            "text": "Every single dish was phenomenal. Pretty blown away with how delicious the meal was. Cheers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeWJFbG5Wbll5Y2pCUGIwRjJlSEU1Y1V4amJFRRAB",
            "text": "I came here every Sunday in the summer and was always comforted by the amazing food and super kind staff, specifically Angie. I’ll be back when I’m back 💕🍣"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMlpXbFhTa2M0VlZGV2JHbHdXRkZSV0U5NlprRRAB",
            "text": "Top 3 Pho’s of my life! And that is saying something. I’m sure the normal pho bo is excellent as well. But the short rib is a must if you are a fan and want a uniqueness in experience.\n\n100% recommend this place. The Japanese food is a different chef & team so know the cuisine is genuine in authenticity."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMU5uQm1WMWRZWmxkdlFub3dTVzlzTkhveWVtYxAB",
            "text": "My friend recommended this place and he did right. The food is absolutely FANTASTiC, and the prices are super affordable. It is a very nice quiet place to spend time with friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNFMwUkdjVkF3U1ZGWVkxTlBSR0oyU1dOa1pWRRAB",
            "text": "me and my mom ordered plenty of food and everything was absolutely delicious, with some great drinks to go along with it.\n\nalso the interior is beautiful - especially the back indoor garden, which adds so much charm."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNFdYZEVMWEJXUTFkaFNGTXhhMnBOY1VKc1owRRAB",
            "text": "The ambiance here is amazing. Really loved everything we ordered. The prices are reasonable too.\nService was great too.\nHonestly loved everything here. We will be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wemVXdFFjSEJvWmtOcmJHcG1aVkJhU1dWM1ZuYxAB",
            "text": "Went in and ordered a classic vegetable pho with added beef brisket. Loved the fresh ingredients. Portion was sufficient. Great ambience in the garden"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaVRWTlNVek5FTmw5S1pGQk9TMmxhYWpGYVIyYxAB",
            "text": "Best grub in Williamsburg 🤌🏻🤌🏻…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQlJXWlBhVFpXWVhCa1ZVOUdWbkJ4TW1wdVYxRRAB",
            "text": "Tofu summer roll and AAC hand roll simple and filling, with flavorful peanut sauce as expected. I would return to try other dishes !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFgxZElaM1pHTnpBNVUzZExTMGR6Y2xWdFVuYxAB",
            "text": "Staff was friendly and made me feel welcome."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWWFETnFaVVJFU1hoTU0zaFJjblJOWlhOR1ZFRRAB",
            "text": "Nice vibe! Usually for this type of restaurant I would not expect too much about the food, but to my surprise, the food is good. I wouldn't call it authentic, or beyond great, but definitely good and solid. Recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cWVFTkZOa2hsVkhRMldUTjNXSEIwVFV0c1ZWRRAB",
            "text": "Nice one to have if you’re around."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ2FuVlRZVkZhTjJscFdsZHhUa1pHVDNkNlNrRRAB",
            "text": "Ordered for pickup at 8:30 and waited 30 mins for my order. walked over only to find they were completely out of chicken, which is what my whole order consisted of. What’s crazy is that I had to wait extremely long to even speak to a hostess & there was no phone call ahead of time to let me know??????\n\nThey asked me several times if i wanted something else, obviously so they didnt have to refund me. we went back and forth on it even when i said no multiple times. if youre going to ask me that, at least offer to comp something on top. Why would i wait another 30 mins for something i did not want and eat my dinner at 10pm. the worst service ever wouldnt even give it a chance again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dFpWWkpkalpQT0dGc1pGYzRka1ZETURWV1RWRRAB",
            "text": "So good. I ordered the fried tofu pho and it was so delicious and at $17 it was so worth it. The atmosphere is lovely and the back terrace is beautiful with all the plants. We will definitely go back for more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM1IzQkxVemcwUjA5YVZETjBjR055VDNkbU0zYxAB",
            "text": "Beef Pho is delicious. Lunch specials are great! I added a toro hand roll. Hand rolls are 20% off for lunch special."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSDk4ZVA3NEtmT1RREAE",
            "text": "Live the vibe"
        },
        {
            "date": "4달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZnp2Wm5qMjd2ZnlnRRAB",
            "text": "Het eten, de service en de sfeer: perfect! Sushi supervers en de Pho heeft een heerlijk getrokken bouillon. Aanbevolen!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdjNfNGJUMHUyZkZREAE",
            "text": "Really loved this place. The push button service is great - wish more places had this. The back patio area is very nice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdThrT21DdU9hNUZBEAE",
            "text": "Beautiful atmosphere throughout. Great service. Outstanding, super fresh food. We had steamed shumai, brisket pho and noodle salad with fish tofu. Can’t wait to return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJU2Q3c1MtNkpmd3hBRRAB",
            "text": "Nice dining environment!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYTM4dS1Ldkk3MVZnEAE",
            "text": "10/10 dining experience! We dined in and ordered the Vegetable Pho and Beef Pho. Both were absolutely delicious. To top it off, the crème brûlée was phenomenal. Honestly, it could rival the best we’ve had at French restaurants. It's rare to find a place that excels at both traditional pho and desserts like this, and we consider ourselves food connoisseurs!\n\nThe garden seating in the back is lovely and adds so much charm. I especially appreciated the innovative bell system for getting your server’s attention — such a thoughtful touch that enhances the dining experience without awkward interruptions.\n\nEverything was a solid 9.5 out of 10. The only minor feedback would be to encourage servers to smile and engage a bit more. A little warmth goes a long way. Still, it's a fantastic spot we’ll definitely return to!\n\nOh, and in terms of ROI when it comes to Pho, it's great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbVNtb3ptOE5PTkhnEAE",
            "text": "My friend and I had lunch here yesterday and the food was absolutely delicious! We shared the lemongrass chicken summer rolls and both ordered the ribeye and brisket pho. Beyond delicious across the board! The ambiance is so relaxing - we sat in the beautiful enclosed space with all the plants. I loved that the music wasn't blasting either. I highly recommend Bedford Gardens. We'll definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMeXNyNGJRZ09ERzBRRRAB",
            "text": "Great ambiance for lunch middle of Williamsburg"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPTHhtUEhUeV83ck1nEAE",
            "text": "Love the food here but wish they articulated on their google maps hours listing that they close for dine-in at 10pm. Made a special trip to eat here but could not. Anyway fyi they close the dining room at 10pm"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNzB5WkdNakwyU1FBEAE",
            "text": "I carry out, everything was prepared on time. Food was delicious 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeWdzYXZreHVTOEpREAE",
            "text": "You can’t get this quality pho + kind service + great atmosphere at this price anywhere else. A gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT0QydTY5dDdyQmt3RRAB",
            "text": "My go to Vietnamese food in the neighborhood. I hope they can bring out more Vietnamese food items on the menu."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud0wtWUZREAE",
            "text": "별점이 엄청 높은 이유가 있네요... 정말 맛있습니다. 저 쌀국수 진짜 많이 먹어봤는데, 제가 살면서 먹어본 쌀국수 중에 첫입이 가장 맛있다고 말할 수 있겠습니다... mama pho 강력 추천합니다! 분짜도 곁들여 먹었는데, 파파야가 들어가서 너무 신선하고 맛있었어요... 여기는 모든 음식이 맛있을 것 같네요ㅠㅠ\n\n+바깥 자리는 정원으로 꾸며놔서 분위기까지 미쳤습니다. 로맨틱한 분위기는 덤으로 가져가세요!"
        },
        {
            "date": "8달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbThPSGp3RRAB",
            "text": "인스타 비주얼에 맛까지 잡은 포집이다"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk16YmVBEAE",
            "text": "This place is awesome. Vast menu without sacrificing the quality, you can have sushi and pho all in the same place. Even Cajun seafood boil.\n\nThe backroom is beautiful done with a brutalism touch and scattered plants. That combined with the service is going to bring me back.\n\nFor food the highlight of course was the short rib pho, not only was it delicious but absolutely huge and three people could comfortably share it. We enjoyed the beef Bahn mi as well and dunked it in the pho."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LXZuMW1BRRAB",
            "text": "The menu is pretty extensive. It’s like a Japanese-Vietnamese fusion. There’s sushi, pho, and other staples. Soup dumplings weren’t on the menu but we were able to order it. Everything was good. Also happy we were able to get seated on a Friday night as this place doesn’t have a reservation system."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJb3YzSXVBRRAB",
            "text": "Walked in here curiously post thrifting & I was pleasantly surprised by the atmosphere this place has. The plants are absolutely beautiful in the back part of the restaurant & the lighting gives an intimate atmosphere. The chef is very generous with their servings of protein in their ramen & pho bowls- this is the best pho I have tasted in Brooklyn! Great place for birthday dinner, girls night out, or catching up with friends. I really recommend the peach jelly tea, it was so fresh and delightful!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJazl2bENREAE",
            "text": "Went here on a rainy Saturday afternoon, perfect vibe at the back where it feels like you're in the middle of a rainforest.\nGot 2 vegetable hand rolls, they were so good, we got a repeat order of the same. Quick service since there weren't that many people there around 330PM.\nWill 💯 come back soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaFo3Q2d3RRAB",
            "text": "Tranquil, delicious, perfect restaurant. Indoor garden! Cozy booth seats. Extensive menu with creative and classic Vietnamese and Japanese dishes. You can’t go wrong!\n\nMiso soup was so so so good. Warm and flavourful. The spicy trio Japanese tacos were also amazing!!! Loved the mango one especially.\n\nThere are so many things I want to come back to try — noodles, sushi, pho, banh mi, dumplings, soups. Will be coming back often!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDhtOGNnEAE",
            "text": "Lovely food and atmosphere! There’s a beautiful backyard seating with tons of plants, and also not too loud, great place to have a conversation.\n\nThe restaurant concept is also interesting - they have two separate kitchens making Vietnamese and Japanese food, under the same house"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeUxEdE5nEAE",
            "text": "Scallop special roll was SO yum. Food tasted fresh & was very good! Service was kind but I feel like they start to ignore you when u press the button more than 2 times. But we ordered a A few items and ended up needed extra napkins , eel sauce etc…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c3BxYzJnRRAB",
            "text": "This place is so incredible! From the street it doesn't look like much, but the \"Garden\" in the back is gorgeous. Peaceful, and serene. And all the food is so good.\n\nThe pho is phenomenal. The sushi is supreme. Soup dumplings are so delicious. Normally I avoid places that offer a variety of foods because \"if they do lots of types, they make them all badly\" was my conventional thinking. Bedford Gardens has proven me wrong.\n\nIt's so good. Every meal I have had here had been delicious. High quality. Service is prompt and friendly. There's a button to press when you want service, otherwise they let you enjoy the relaxing space. I kinda don't want to tell you how good they are, because I want this as my little secret. Don't come here. Lol. Just kidding. So good. Enjoy"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNWNuY0VBEAE",
            "text": "Went on a Saturday during lunch hours and was able to get this awesome Chirashi lunch special bowl for only $18. Looks amazing and went great with the high quality soy sauce that they provide!! Also ordered the mama pho bowl and everything was great! The broth was flavorful and didn't need any additions, except for some siracha for extra spicy flavor.\n\nAtmosphere:The garden area in the back of the restaurant had a calming atmosphere with plants all around and plenty of natural lighting to make it feel as if you were in an outdoor garden!\n\nService: The service is quick and easy due to buttons on every table that you can push, alerting the server, making the experience much faster than waiting for a server to pass by and getting their attention."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbEw3eXB3RRAB",
            "text": "I had a pleasant visit here. The ambience alone is very welcoming and picturesque. I could see this as a nice spot for most occasions. I came with a friend and we stumbled upon this place. The vegetarian dumplings were very tasty. The pho was loaded with sodium so I didn’t finish it but my friend really enjoyed his and left nothing on the table. I would come back to try the sushi. Everything looked appetizing on the menu, its definitely worth a try.\n\nUpdate: I came back to try the sushi. Im saving this place as a favorite. They really have it right here. I love it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNDV5VkpnEAE",
            "text": "Honestly really good i was surprised because we just picked it randomly. I was born and raised in Asia so my bar is pretty high but I was satisfied with everything! We got the lychee and passion fruit teas and jelly (10/10), soup dumplings (8/10 YUM), shrimp shumai (6/10, the wonton wrap was a bit soggy but still really good), and scallop ramen (8.5/10). Great option for good for quality food and cravings, I would definitely go back to try their other options!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdTdXVjhBRRAB",
            "text": "Ring your table button for friendly service at this Pho, Banh Mi, and sushi spot. The lychee sweet tea is refreshing, and the unagi lunch special is great value for the price. The lemongrass chicken pho comes hearty and hot. Solid variety of Vietnamese dishes plus fresh sushi. Pleasant interior with calm vibe. Williamsburg price points."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeDdHZ2lRRRAB",
            "text": "Amazing plant vibes in the back and even better ribeye/brisket pho, the broth was unreal. Sushi was excellent too. Also, little buzzers for service were so efficient. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXBtem93RRAB",
            "text": "The service and ambiance is very welcoming. I ordered the Bun Mang Ga noodles and Pork Soup Dumplings, highly recommend both items were very flavorful"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMHZ5V1pBEAE",
            "text": "Great modern Vietnamese restaurant,\nSpicy crab taco, pork soup dumplings and Pho were really good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Mk9qcmNREAE",
            "text": "Popped in here during a rainy afternoon and didn't expect much because I thought it was a generic Asian food court and there weren't many people.\n\nBoy was I wrong. This place is delicious.  Dumplings were so good.  The meat ones kind of all have the same taste but you can definitely tell what type of protein.  The veggie potato dumplings reminds me of a samosa and is spiced really well\n\nThe crab roll was also really good.  Shellfish rolls can be very hit or miss and this place does a great job. Would definitely come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocmZtS1lREAE",
            "text": "This place needs a better name but is awesome :) Really like the fresh wasabi here in addition to the food itself.\n\nFor lunch: their two roll combo is well-priced and comes with miso\n\nFor dinner/chill date night: Definitely get a seat in the back patio. We liked our sushi platter.\n\nLooking forward to coming back here often!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHemJxeEpBEAE",
            "text": "Fantastic seafood boil and sushi rolls. We have been back a few times for  the Cajun prawn boil bag. Tasty, fast, fresh and big enough to share.\n\nThis place is on Bedford and right across from the subway exit but somehow seems hidden and hard to find. The decor does not match the cuisine which is a shame since the food is excellent. The menu is a mixed bag which is fine since it’s a good hall but I wish they did more to promote that its a food hall. Seems to have an identity crisis."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dE83OEhREAE",
            "text": "Whoever said this place is a hidden gem was right. I went early to avoid the happy hour rush. That said you get a discount from 4-7pm so if you’re not picky on seating that’s when I recommend paying a visit. Attached is the photos of what I ordered."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0LUpiR0dnEAE",
            "text": "Really good food. The only downside is the food took forever the come. 5 different restaurants in one. Would recommend if you’re going there for 3 hours."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ2VHaGR3EAE",
            "text": "Fue nuestra primera vez en un restaurante vietnamita, pedimos opinión a la camarera, y pedimos una sopa vietnamita que estaba tremenda, buenísima. Después pedimos un roll de cangrejo, buenísimo también, y unos dumplings, que si fue más prescindible.\n\nEl ambiente era chula y tiene un jardín muy acogedor. Añado foto de la sopa, nos costó todo 52$."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dGVIM1JnEAE",
            "text": "Cool place to get lunch or dinner! Really photogenic hidden garden in the back patio, and a variety of different Asian kitchens to satisfy groups with different tastes. Great gluten-free options too. I got a bamboo chicken noodle soup from the weekly rotating menu, will def have to come back to try their other specials."
        }
    ],
    "reviews_count": 74
}