{
    "name": "Enzo's of Arthur Avenue",
    "place_id": "ChIJK-WbWIf0wokRWPsJsVTeOfQ",
    "grid": "BX7",
    "address": "2339 Arthur Ave, Bronx, NY 10458, USA",
    "rating": 4.4,
    "user_ratings_total": 1854,
    "phone_number": "(718) 733-4455",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMlpGaDZabDl3Y21kcmJqYzFiSGRTTFhWU1MwRRAB",
            "text": "Food was delicious! Loved the fresh pasta and pizza. Every bite was yummy."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSU4wSkNNRlYyT0c4d1EwaFZaazlFTmpCbWRsRRAB",
            "text": "Went tonight for dinner with niece. We were going to NYBG Nightmare Before Christmas.\nGood food, good service,  nice menu!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRmREVjBOM2hNTTFjeVNrSnZRbEpZTVZGcVEyYxAB",
            "text": "Wonderful meal- old school Italian at its best. Very Gracious server, instantly felt like part of the family. We order a variety of pescatarian dishes including gnoochi, pasta with fresh sardines, Caesar salad (only fair), their Chianti selection was impressive. Fresh crusty and olive breads were excellent. As was the eggplant roloni.."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bldVdFRPWFZrU1U5UGFXbG9lRlJoWkdaT1lrRRAB",
            "text": "Didn’t enjoy the food.Food smelled"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NGRrRmxZVFJ2UjJwWWVrTjBPVzVZVURGdGFtYxAB",
            "text": "Never had a good experience at Enzo’s. This is a frequent spot for Fordham football families to visit after games. Parents will call in reservations months in advance to get a spot. We had a 6:30 reservation, food in by 6:45pm, and did not get our food until 9:30pm. At this time, half the restaurant was empty as everyone had left. Our waiter was extremely rude, never checked in on us, no updates, and got snippy with us. This has not been our only bad experience. For the price of the food, you expect the staff to be more respectful on the phone and in person, and to have your food within a reasonable time. Not the case with Enzo’s anymore."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQk1uUlZNR2xrYzFremMzUnZiRXRITVZKTlgzYxAB",
            "text": "Visiting for work. Got the margarita pizza with garlic, bread, chicken parmesean with penne pasta, olive oil sherbet and tiramisu. Super good all of it. Staff is very nice"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twa05reE1Na2h1VGpoUmRtRTFZV2xtYTNwdk5uYxAB",
            "text": "One of my favorite restaurants to eat at. We’ve been coming here for years and it never disappoints. Depending on the time of day parking may take a little while but it’s totally worth it. Try the vanilla gelato it’s amazing. And the kids love the Nutella pizza. The bartender make the perfect dirty martini and the stuffed artichoke is just how my mom use to make. Feels like Sunday dinner. Go you’ll love it!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca2RYTTVSbEU1VUdGblpreExjbW8wWkRCM1dGRRAB",
            "text": "This place used to be good but in the last couple months the quality has dropped significantly. I got the eggplant parm and it tasted like rotten eggs! Then the tomato sauce on my spaghetti also tasted like the metal of a can. Awful food, I should’ve gone to Frankie’s across the street instead"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveWJuaG5PRzFDTjFkTU5saG5iM3BZUzB4RmRXYxAB",
            "text": "Nice restaurant benefitting from the Arthur Avenue hype. We waited at least 30 minutes between our first course and our main course. Disappointing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTGNIUk9PWEZmZFhveU1EZGZWRTVEYTNjNFUwRRAB",
            "text": "Food is always fantastic. Just be prepared to wait a little bit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTk4wbzBZV2QzV1hsM2RVOUxNME42UjBSemIyYxAB",
            "text": "Excellent clam and mussels appetizer! Pasta and chicken stagione and salad were all very delicious!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNExXZEVSV05WUVc5WFlVZElVbXR1ZWxwVlEzYxAB",
            "text": "I had halibut with polenta and livornese sauce which was tasty, fresh and perfectly cooked. The service was excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMFgxSkNSVGMyUzJWcFZqSjZiMWxNV0ZWMVduYxAB",
            "text": "So so good- got some arancini during a festival. Really can tell the quality and absolutely delicious. Service was quick and able to get food fast. Really recommend as you can tell the flavoring"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZk1rSmpOMmxUY0ZkMVMwcExRMFp5YlU5WU1IYxAB",
            "text": "such a nice experience! the food was delicious, the staff super friendly and open to conversation! if you’re looking for a great italian restaurant in the bronx, enzo’s is a place you can’t miss!😌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSWR6bENMVlF6V1hORGNIQkVXbkpXVEhveVIzYxAB",
            "text": "Legendary! 🎉"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbmFuN1B3EAE",
            "text": "Great food great staff. Vibrant atmosphere, a great place for a night out or special occasions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcFRUUXphemR6ZWtJNVVtbGFVME4yWm1Kc05FRRAB",
            "text": "One of my favorites on arthur ave"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGclJtZFhXbnBJVEROVFNXdGZTVTFhYWtJMVYzYxAB",
            "text": "The decor is nice but it is IMPOSSIBLE to have a conversation with your table mates"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFQyaHVMWE5DWkhGbFRsOTJObGhqYnpCWWNGRRAB",
            "text": "Food was good,  a little overpriced but the experience was great will recommend for sure"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdWJGZ3phMmRmVFc5WmEwUklRVFZpVUd4SlltYxAB",
            "text": "First time in this restaurant.\nService and food was very good.\nI will go back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONVNXOTNWSEJTU0ZaM2FHVlRXREp1YmtGU1YzYxAB",
            "text": "A beautiful restaurant with outstanding food. We had a larger party and had made the decision to come on short notice so we didn't have a reservation. They were still able to get us in without much of a delay. They were kind, attentive and considerate. Every meal we had was outstanding. It was the best long island iced tea I have ever had. Cheesecake was delicious as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcGRrMVRTV2RUUTJac1ZucFBaVFJFVTBrdE9XYxAB",
            "text": "Solid classic Italian staple on Arthur Avenue. We had a steamed clams dish that was excellent. My friend said the chicken francese was top notch... And I had a very fresh and delicious branzino."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac2FrUk9jRjlCZEZsalNtSlFMVmR3VlhKdVprRRAB",
            "text": "Disappointed with the service from the manager, who made us wait for an exceptional amount of time after taking a table away from us that hostess was seating us at because we were two woman.  Best Sangria drinks in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVZVbHNlVmRCTkZKcGExRnVRM2xrY25OSFZFRRAB",
            "text": "Great place, good food, and service. Will definitely go back"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNGNVeHFjbTkxVEZCa2FYcDZaWGt5UmxCMlYyYxAB",
            "text": "Abbiamo oranzato insieme ad amici italo-americani che ci hanno vivamente consigliato il ristorante. Gli amoci sono 35 anni che frequentano il locale"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTlVWUm9WSGN5ZDJKeGJIWmpTVTVhUlVKTWNsRRAB",
            "text": "Absolutely loved this place!! Restaurant was beautiful, clean, comfortable and classy. The food was delicious with a capital D."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWWFrcHhVVmxqU0RFM1FuSmFNa3hUWlVGcWVGRRAB",
            "text": "Stuffed artichoke appetizer was fantastic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSVUybHZlVUpHT1VjeWRGcExOVlZRWnpRdGRuYxAB",
            "text": "Because of the recent reviews.  I cant take a chance of being disappointed on my special occasion."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMFVYQkpRakZ6YlRGM1VYQnRkRGhIWDIxSVNIYxAB",
            "text": "We had an amazing experience. We went as a group of 8. We got a variety of foccacia, burrata, chicken parm, pasta with vodka sauce. It was all fantastic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVVZUSkhObTF4ZW1WMGMxb3lia3BIZVhGUVltYxAB",
            "text": "Sat at the bar and was given fantastic service.\nFood was authentic and full of flavour. Make sure you listen to the specials. I think they ate more interesting than the regular menu.\nHighly rated."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xYVRqQkZaWE5CV0VkNk1sb3lORFZzYmw5clMwRRAB",
            "text": "I had an amazing experience at Enzo’s, easily the best restaurant on Arthur Ave. The food was authentic, flavorful, and absolutely delicious. Our server, Liliana, was incredible: so friendly, attentive, and welcoming that she made us feel right at home. From the appetizers to the espresso, everything was outstanding. If you want to experience real Italian food, Enzo’s is the place to go!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd1VERlBNbXRJVDNWbFVEbGFRVFJEUjNaRE1WRRAB",
            "text": "Great food!! We had the grilled pulp delicious.😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMWIyTXdOWEIyTldjMlNUbHNNMmsxZURoUlpXYxAB",
            "text": "Awesome food and great service, beautiful scenery ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU1lrRXljVVpKUVV0SmJqbGZUREZsWWtSbFIyYxAB",
            "text": "My wife and I visited the Bronx Zoo today, and the day ended perfectly when we found Enzo’s on Arthur Ave in the Bronx.\n\nI used to think of the Bronx as not the nicest place—but Enzo’s truly changed my perspective. The restaurant was packed, so we sat at the bar, and honestly, it turned out to be the best decision. We had the chance to interact with Xiomara and Andre (forgive me if I got the name slightly wrong). Watching this team work was a highlight of the night: preparing drinks with precision, professionalism, and always with a genuine smile and attentive attitude. Their energy and enthusiasm made the experience unforgettable.\n\nThe food was excellent too—tasty and beautifully prepared. We shared a pizza (amazing dough, rich sauce, truffle oil, mushrooms, and cheese all perfectly balanced) and an octopus dish. Even the plain bread, with some olive oil, parm cheese, and some black olives was delicious!\n\nWe would have loved to stay longer, but with the crowd waiting we gave up our seats—though we left with the firm idea of coming back soon. Next time, I’m definitely trying the pasta.\n\nThank you to the team at Enzo’s for giving us such a memorable evening. We’ll be back!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WFkwNVRZa3hoVTFWVmJuSlZUakJRVGtOVFVuYxAB",
            "text": "La vera little italy di new york ottimo cibo porzioni abbondanti titolari simpaticissimi."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeldXMDJaWGhrTFhRd1FUVk5lbmxmU1V0SVpVRRAB",
            "text": "Food And service was good.  Only issue was the heirloom salad, which was very small and quite overpriced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbU0zTk5ORlpDUm5wM1draHRUVkJPWldSUmIyYxAB",
            "text": "Great family dinner. Large portions. Friendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVFNrNTNVMVF3WmtGWVpVcFpSRWRzVkVGRFNHYxAB",
            "text": "Not what it used to be. I think the owner is not paying attention to at one time used to be an excellent restaurant. The food was bland and of low quality. Most people were walking out with full doggy bags. Our waiter smelled of cheap strong Cologne. Excellent espresso. We will mourn it's downfall."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcFRra3RWeTFMZFZKSE5qYzNZVWR0WldkVWNtYxAB",
            "text": "Delicious food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMlZUSjJiak5qYVZsUVptaE1iM2xwUm1WSkxXYxAB",
            "text": "Delicious authentic Italian food in a lovely setting. Worth the trip up to Arthur Avenue"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR2VHaENjV04yZVRCV1RFOWxkekZUU3pabWJIYxAB",
            "text": "Great food love the servers everything about Enzo’s of Arthur makes you feel at home !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ2QzVjBabFpLZGtWaWJrRm9TVGhwWTI5M1VsRRAB",
            "text": "Appetizer and main dish were flavorless"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od1dGUjJkekkzUmxwTVNsTlVaVVJMZW1STFNuYxAB",
            "text": "Very nice and good appetizer"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFNscDNXRnBtYUd0d2JWbE5iSEZ4Y1hGVlIzYxAB",
            "text": "Top notch Red sauce Italian\nYou can see why it’s been a mainstay for years and is packed at lunch on a Monday in August.  If visiting the Zoo or Botanical garden go have lunch.  If going to a Yankee game go have dinner.  I judge a Red sauce joint by its chicken parm and this was perfection\nStuffed Artichoke is a lost art and they are Picasso of Artichokes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSVEzY3hSMGhJTFRaeVJUWkpiM1Z1ZG5NelJuYxAB",
            "text": "The best in the Bronx!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVFVOUlaa1J3Ymw5NFUyaEJOMmwxV1RNMU0wRRAB",
            "text": "I’ll start by saying I will be going back to Enzo’s because I love it there. It is a beautiful place and the service is always fantastic. The last time I was there however, the food was not as desired/ordered. When I called this to the server’s attention, he agreed and brought it back. When he came back, he kind of had his tail between his legs because the cook didn’t agree. I didn’t want to go back and forth but as a return patron, I expected better. It was also a special occasion and they refused to accommodate a request I made before arriving (placing a bottle of wine on the table)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbVptWXhjMDE0V2pKR1Mwd3lTSFJJUVVaM2JXYxAB",
            "text": "Fabulous."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFVYQnVMV2xMYWtaSlgxaE5XbnB2TldSSlNVRRAB",
            "text": "In the heart of little Italy Bronx , this place exists. If you are in this area try their cuisine and of course drinks , we ordered oro de bronto Pizza, and it was amazing. The soft crust the pistachio pesto and mortadella all these combination were amazing. We also had a green salad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NU1HSkRTR2QxTURaa09VbG9ORFJ2VUc1R1ozYxAB",
            "text": "I am extremely disappointed by the treatment of my friend here at dinner last night. I have been here a handful of times and faced zero problems regarding the dress code. I wore a tank top. My guy friend wore a similar tank top and was told that men cannot wear tank tops inside the restaurant. The staff did not allow him to sit outside either. I have seen older Italian men eating in white tank tops, football players after practice in athletic gear, etc. This seems targeted at him specifically (likely as a queer man of color)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vM2RIQXdkVmd5VDNaMGJUVnNjMnBUUVc4NFYxRRAB",
            "text": "I entered Enzo's on 8/5 with a group of friends to celebrate a birthday party. I was wearing a black tank top and corduroy shorts. Immediately as I entered the restaurant I was told by the waitress \"sorry no tank tops on men\" \"its a restaurant policy.\" There is absolutely no dress code in writing on their website and in addition multiple people within the restaurant were wearing sed garment including guests in my party were wearing spaghetti straps. I felt isolated and embarrassed and I could not only help but feel targeted. Especially when there is nothing specific on their website or posted near the restaurant that says this \"rule\". I am a Fordham student with close ties to the university and I have recommended this place to many patrons of my university. However the attitude of Enzo's seems haughty and unprofessional with target practices and mediocre Italian food. I would defiantly not come here its not worth the unprofessionalism ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNFpXSjNlVlpwVmtOeFIwaElhRGRJYkVGb1VIYxAB",
            "text": "Decent Italian spot in the heart of The Bronx’s Little Italy. Our large group was well accommodated at a nice round table in the corner. I was not impressed with the food the same way I have been at other places in this neighborhood. The dishes were good but nothing great. Unfortunately the desserts really left something to be desired. I would choose a different place to experience the Italian food culture of this neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeVZ6aGtOelI2Vm5kaFNrZElTMmt3Ylc1aFdtYxAB",
            "text": "Great causal restaurant with very friendly service.  The plates are very large, which can be shared family style.  Their very large stuffed artichoke was beyond delicious.  I will come back  to enjoy this artichoke!!!  We came for inside  dinner on Wednesday and a late lunch outside Thursday.  Both days, the service and food were consistent and excellent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3M1kzUE5REAE",
            "text": "What a little gem on Arthur Avenue! Believe it or not it was my first time to Arthur Avenue and Enzo's did not disappoint! The restaurant makes great use of its space and the slightly industrial look along with the copper tiles on the ceilings. The wait staff was phenomenal and attended to all our needs! One of the people in my party had an ankle injury and we made an odd request to get a bag of ice. The waiter said let me see what I can do and in 5 minutes was back back with the bag of ice. This most definitely will not be the last time that me and my girlfriend and her family visit Enzo's!\nWell done!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dzdtSXZ3RRAB",
            "text": "I had an amazing experience at Enzo’s in Little Italy! Typically, you need to call ahead for reservations, but we decided to take a chance on a Monday, and we were lucky enough to get a spot. We did have to wait for a table, but the bar area was a great alternative, and we ended up sitting there. The bartender was fantastic, and the whole staff was incredibly friendly and attentive. The wine selection was excellent, and I enjoyed a few glasses of delicious, well-priced wine.\n\nThe restaurant itself is small but beautifully designed – cozy, yet sophisticated, and perfect for a family meal. My only complaint was being seated near the door, as the smoke from people outside filtered in. The food was outstanding – everything was fresh, flavorful, and beautifully presented.\n\nI can’t wait to return with my kids next time! Highly recommend Enzo’s for a fantastic meal in the heart of Little Italy!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMkw2RlVREAE",
            "text": "Enzo’s is a rare find. From the time you first arrive until you finish your gastronomic adventure, everyone treats you like family. Ardi is an old school host. He knows exactly what to recommend each and every time you visit. I highly recommend the grilled octopus, fried meatballs, mussels in white sauce, burrata and any pasta. It’s homemade. Treat yourself and your loved ones to something special. Go to Arthur Avenue and visit Enzo’s today. Tell them Sweet Lou sent you. God Bless Blue & Gold! God Bless America! Remember Everyone Deployed Everyday!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOHBmb29nRRAB",
            "text": "OMG their branzino is like the best one I’ve ever had. It was today’s special, so was not on the menu. And I always love their grandma’s recipe pasta(try it with bucatini!) as it is super delish.\nI finished my meal with their orange sorbet, which look so cute and pretty.\nOnly thing was that their service was super slow on the day I went, which was Monday. We sat down at around 5:30pm, got our appetizer around 6:25pm, and our main came out at 7:15pm. My brother couldn’t finish his meal because his baby’s bed time was up around 7:30pm.\nBut I would def come back to eat again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNUtqOEdnEAE",
            "text": "Traditional Italian in the heart of Little Italy Arthur Ave in the Bronx. The food was delicious. The homemade gnocchi pasta was so light and amazing that we had to buy a pound to bring home!! The pizza was PHENOMENAL. I recommend the mushroom truffle and mortadella pistachio! The sauces for the pasta were really spectacular. The fresh mozzarella and fried eggplant appetizer were outstanding. The mozzarella was so fresh and light. We finished the meal with canoli and tartufo. Both tasted homemade. The canoli cream was not too sweet and delicious. Service was perfect, and the host and manager were very friendly. This is a must try if you are looking for delicious Italian on Arthur Ave."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUldtTndWVTEwYkdNelprcFJPRTl3ZGtNeWVVRRAB",
            "text": "We were really disappointed with the food here. Not sure what the hype was about. The pesto was mostly oil and barely had any basil. Would sadly not recommend."
        },
        {
            "date": "4달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQ09GQlVSR2x6Ym5sZllsVjVRM2g2ZHpsU2RGRRAB",
            "text": "È un posto che consiglio davvero a tutti, si mangia bene e tanto. Il servizio è impeccabile e il locale molto carino."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYW9fOExtNzhtd0JnEAE",
            "text": "Really was fantastic. Meatballs were great, the seafood was fresh and vibrant, and the specials were outstanding. Everything was cooked and seasoned well. Absolutely would recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanRPcU9BEAE",
            "text": "Big place; got a table for four right away. Great food, prices seemed reasonable, staff were wonderful. Kept the water glasses full, friendly, quick service. No complaints (except maybe the frosted glass on the bathroom doors)!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNzRDdXhRRRAB",
            "text": "I've been visiting this restaurant in the Belmont area of the Bronx for over 15 years, and it’s definitely my favorite spot in all of Bronx Little Italy. The only downside is that the servers can be overly friendly or occasionally a bit curt. Every dish is delicious, so you really can't go wrong with any choice. Interestingly, they only serve lasagna on Sundays. Their appetizers are consistently excellent, and my top pick is the Chicken Rustico with hot cherry peppers. But you'll love any of their dishes on their menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZ2MyU1hREAE",
            "text": "Classic New York Italian food just the way you always remembered and wanted. Our hosts were charismatic and mindful, as well as knowledgeable of the history of AA. The atmosphere was perfect, exactly like i remembered growing up. The food was excellent, the sauces and desserts familiar and delicious, sweet and spicy, every bite a piece of nostalgia. Enzo’s is a gem, a bastion of tradition, and a place worth visiting when you need a classic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaTdmdmFnEAE",
            "text": "First, I would like to thank Melady P, who waited on me while working behind the bar. Second, I would like to thank the owner who personally got me a seat when I mentioned there was a wait to be seated.\nA wonderful atmosphere.\nFor an appetizer, I had the fried meatballs with peppers and onions.  This could have been a meal unto itself.  They were cooked perfectly,  juicy, with a great flavor.\nMy main dish was the veal sorrento.  Veal is one of my favorites,  and this didn't disappoint.  With the prosciutto and melted cheese,  this dish has a great taste.\nFor dessert was a slice of Chocolate Mousse cake.  The flavor was truly decadent.\nThey also offer many other Italian dishes as well as pizza.\n\nI forgot to mention I bought 2 bottles of their sauce ((Vodka and Marinara) and a pound of gnocchi.\n\nIf you ever get the chance for good Italian food,  Enzo's is a great choice. Give them a try."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOGVTbGhnRRAB",
            "text": "I had been scoping this place out before but never took the time to come here, until tonight that is. A dear friend of mines and I finally linked up to catch up with one another and came here for dinner. He knew about this place and their outdoor dining (which he enjoyed 👍🏽), but had not dined indoors. Needless to say, we both had a splendid time. We shared our appetizers; fried calamari and the rice balls, both were delish (I really enjoyed the calamari though). I had the lobster ravioli and he had the chicken marsala; the portions alone were plenty, he took a to go box and I got full fast. The service was lovely and the atmosphere was bustling with people, family and friends of all kinds. They do not l charge separately so keep that in mind for those who come in parties of two or more. I'm really glad tonight happened, we were long overdue to catch up. I definitely see myself coming back here. 😌🍝 💕"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReTlQTlFnEAE",
            "text": "Was very excited to go here and try the food. We shopped around the Bronx Little Italy area for a while before and were stunned by the huge selection of fresh meats, seafood and baked goods. At the end, we went to Enzo’s for lunch and were very happy with the delicious food, quickly made and the service was truly perfect. Great place to eat! 🙌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMFp6TllYMFU1VjJaekxWQnJSa2MzUkV4c0xWRRAB",
            "text": "We had a great experience at Enzo’s. Dinner reservations for 5 after heading to Bronx Zoo. Our server was outstanding; friendly and knowledgeable. She had unbelievable recall, impressive. The vibe amongst employees was really good, and the general ambiance in the restaurant was warm and comfortable. Food was very good, especially the pasta dishes. Menu was broad enough to warrant many multiple return visits. Highly recommend a meal at Enzo’s."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM0syZ1hBEAE",
            "text": "Overall I would rate this place as \"mid.\" I got their chicken parmesian with Spaghetti and meatball, calamari, pizza and a dessert. Chicken was a bit soggy, Spaghetti was very good homemade pasta and sauce was pretty good. Calamari was not great and only rings (i want whole ones not just rings). Dessert was ok. Not something I would rave about but not bad either."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdTRUamZnEAE",
            "text": "Stopped by after spending a night in NYC. This Roman style was out of this world. I got the soppresatta. The crust was excellent .  Nice crunchy underside yet soft and tender with a great open crumb.  Hydrated and salted to perfection. Sauce was flavorful with out being sweet or acidic.  The cheese appeared to be a high quality whole milk mozzarella. Nice cheese pull with a nice even melt. The slices where huge. I only planned on eating 1/2 the slice, but I couldn’t stop.  Oooppss…. Oh well. So worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bGJtMlV3EAE",
            "text": "I came to Arthur Av because I haven’t been to any of the restaurants in Little Italy just the markets so I was very excited to try Enzo’s. And I would say the food is pretty good. There bread is alright, the calamari appetizer was delicious but for $20 the portions wasn’t even enough for 2 people and the grilled polenta wasn’t very good. My chicken parmigiana entree was very good but not the best I’ve had. However the desserts on the other hand are top tier. The panacotta and tiramisu were better then most bakeries we were very impressed. My biggest complaint is the service. The staff are polite but not attentive at all I had to ask for my bread 3 times before I got it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPeUFrLTJicy02STZnRRAB",
            "text": "Great atmosphere but the food doesnt match the ambiance, rice balls as they call it were ok but the pizza well nice presentation but the lock of taste of the crust and having a big fat border which reminded me of eating a kiser roll ...sorry no dice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaGNtX2NREAE",
            "text": "Stopped by here before going to Gene. Very good service, complementary bread, including the olive bread was very good. Just very solid, traditional Italian food. We got some specials which included squid ink pasta and the seafood salad.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWbjkyV2JBEAE",
            "text": "We were so thankful that The hostess sat us right away on a busy Saturday afternoon. It was our first time going to Arthur Avenue. Enzo’s is the best Italian food I’ve ever had. While EVERYTHING was delicious, The chicken scarpiello is freaking amazing. I’ll remember that dish for a long time."
        },
        {
            "date": "4달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab1NWTldhRFJIYTAxalltcHdialJTYTJ4dFNHYxAB",
            "text": "マンハッタンではなく、わざわざ行くべきイタリアン。とても美味しいだけでなく、見た目も感動。\n\nこういう店、マンハッタンではほぼ消滅してしまったので、この店は末永く経営して欲しい。"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiX2JiSE5nEAE",
            "text": "Was hoping for food as good as Campania region. Rice balls we outstanding as were the bread options. Lasagna sauce lacking the depth of flavor, sausage did not taste good and noodles were overcooked. Pizza dough was just like Neopolitan style, but sauce again lacked the flavor. It felt like we were a burden to the waitress, but the manager was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eEs3THFRRRAB",
            "text": "Worth the trek to The Bronx! The food was absolutely incredible. The vodka sauce is WOW! Also, the shrimp scampi with risotto was probably the best I've ever had! It was to die for! The lasagna is so, so delicious. The place is beautiful with gorgeous brick and large windows. The service was on point. We will absolutely be back! This place is incredible! Order the shrimp scampi risotto. For real. So much flavor and cooked to perfection 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYb3E3cDFBRRAB",
            "text": "This was our least favorite place on our recent food crawl around Arthur Avenue. Their claim to fame, the fried calamari was decent but if their carbonara is anything to go by, I’d be very wary of their pastas. It was one of the worst carbonaras I’ve had, which came as quite a shocker at an authentic Italian restaurant such as this. The egg was overcooked with bits throughout and while this might be a matter of taste I’m really not a fan of caramelized onions in carbonara. So while I highly recommend a visit out to Arthur Avenue I’d skip this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRejZfUFp3EAE",
            "text": "Our go to restaurant when visiting Arthur Avenue.  Everything is always spot on.  I forgot to take a picture, but the clams oreganatta were spectacular."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdmJTcWNnEAE",
            "text": "Warm, inviting Italian in the heart of the Bronx. We arrived with a huge crew (10 people!) and it was no problem with a reservation. Food was excellent and service was top notch. Highly recommend a stop in! Will be returning."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNWNqTURnEAE",
            "text": "Absolutely incredible. I got spaghetti bolognese, and I have to admit, it’s the best pasta I’ve ever had. The noodles were perfectly al dente, and the meat was perfectly cooked. Before we ate the pasta, we got the antipasto, which was immaculate. The assortment of cheeses and meats were incredible, and they were very high quality as well. The atmosphere felt very homey and warm. I then got tiramisu and crème brûlée, which were both delicious, and rounded off the entire meal. The service was great, but i can give one point of advice— come early, because the place fills up quick."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMG9ydkJBEAE",
            "text": "Pretty good, nothing special. We had a couple good glasses of wine. The stuffed artichoke was an interesting dish you probably won't have elsewhere, but it's not clear if any of the edible part is actually artichoke. It was tasty, if a little too salty. The rice balls were good, could use a little more non-rice filling and more sauce.\n\nWe got gnocchi with vodka sauce. The gnocchi was very good. I'd choose a different sauce next time but there was nothing wrong with it necessarily. The ravioli is the only thing that really fell flat. It was both undercooked and had very thick dough.\n\nThe pistachio tartufo was really good and the tiramisu was grocery store like, just fine. Overall, a safe spot to stop if you're hungry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeEp2bXlBRRAB",
            "text": "Service attentive. They are more patient and friendly to customers compared to nearby Italian restaurants. The interior sort of reminded me of a scene from the god father. Pizza and pasta were great! Decent portion. The deserts were disappointing and expensive. Go get tiramisu at a dessert specialist place nearby."
        }
    ],
    "reviews_count": 82
}