{
    "name": "Love & Soul Food",
    "place_id": "ChIJEUUWIQDzwokR0-AKLc3M12Y",
    "grid": "BX7",
    "address": "4 E Gun Hill Rd, Bronx, NY 10469, USA",
    "rating": 4.1,
    "user_ratings_total": 31,
    "phone_number": "(347) 202-4900",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCU1NYUmhTMEpsYVVwSmJTMUpOSFYzTjFBMFZIYxAB",
            "text": "Delicious food. Friendly staff. Cleanliness."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNmNXbDZSWEJYTm1OQmQwZHVlRzVhVjJVdGMxRRAB",
            "text": "First time coming and the food, service, and atmosphere was amazing... will definitely be coming back!! I highly recommend this spot if you're in the area."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVlZqSjBSVGs0V0UxRFprTjRhMlYzY0hadFJuYxAB",
            "text": "The owner are from Africa. So you will enjoy food from there and American. So far each food has a great taste and seasoned well. Mt husband loves their lamb chops and collar greens. It's a must try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMVpIUkZNVmhrYmxOWkxVdFBiVVl0TUZsa2RVRRAB",
            "text": "Great food i can eat their food everyday"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1ZGZFJNWGxJYldGdFQzVjRkRFpGWDFoS2FYYxAB",
            "text": "So far I came here 3 times. The first 2 times food was excellent until I decided to try their fried chicken wings. I can tell immediately after 1st bite they were cooked in old reused oil. Disgusting!  Food went into trash. You can't play with people health like that. Now I am nauseous and have nasty taste in my mouth. Not the experience I was looking for. Don't be cheap offer quality, raise price if you have to but dont use poor quality old ingredients"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUVJWSkhabm96VjB4S2JHTXdTbkpWTkRkaVZGRRAB",
            "text": "They are very clean and the food is really delicious. I love their food. And the prices are great. The oxtail and salmon are weighed the same as every other food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdlEyODNRalJrYTFsTk1UUkxkekZKZEZCWGJYYxAB",
            "text": "I have given the place couple of tries, but the food is straight up bad 😞. How do you even mess up salmon?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T1VGY3RWWFZyUm1kSU5VdEVVR0ZPVkZGVlMyYxAB",
            "text": "food straight up not as good as it looks yams 0/10 , chicken looked like it had been sitting, was dry and unseasoned.\nwould only recommend mac n cheese and the jerk chicken."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNWJreDVkMEpKTlVrMGRtUXhWemROYXpCRGJGRRAB",
            "text": "The place is very  tidy and the young man behind counter was very  friendly.  The food was just bland , caught me by surprise it look so good,  but as the saying goes looks can be deceiving and deceiving it was. I had the peas and rice along with the candied yams and macaroni and cheese. All four items lacked flavor and the salmon was extremely dry."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUzYxZkdaLWVfOFR3EAE",
            "text": "Had a wonderful time i appreciated  the love and the hospitality , such great integrity  god bless"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcWV4NHVtc3ViVUVREAE",
            "text": "Salmon was absolutely wonderful! He handled my order with excellent customer service — answering all my questions and confirming everything with great care. My food was prepared and ordered in a timely manner, and the whole experience was a breath of fresh air! I will definitely order again and again. Highly recommended!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLWRfYmlBRRAB",
            "text": "The food was so delicious I forgot to take a picture to post it with this review!! I honestly regret that I did not try this place sooner. I got a two pound plate of food (Jolof rice, macaroni and cheese, four barbecue and three Parmesan wings, some cabbage with carrots, candy yams, corn bread, and a Brisk) for only $24!!! Before leaving, another customer commented, “you won’t be able to finish all that lol” and she was right! I had it for lunch and dinner and wasn’t the least bit dissatisfied. Will definitely come again!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaXRxUmRREAE",
            "text": "Made me sick avoid"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbnVMVFRBEAE",
            "text": "Best food around the city. Home cooking everyday, fresh never frozen. The workers are wonderful and pleasant to talk too. I eat here almost every day because I miss home made flavors like this. Keep up the great work."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvamVhcVVREAE",
            "text": "Love the food me and husband often go on break here .. no complaints"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcHU2OG1nRRAB",
            "text": "Great food, can be pricy. More so because of the array of options, easy to start stacking a lot if you’re hungry. The place was clean and they make everyone wear gloves. I’ve went 3 times, all different people, all were nice. One of my go too spots if I’m In the mood for “real food”."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHNURTRRRRAB",
            "text": "Not for nothing the food is not delicious. It is OK. It looks a lot better than it taste for starters spent almost $40 for nothing. I would’ve enjoyed myself more at Burger King."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQakk3QVNnEAE",
            "text": "Well I noticed this little restaurant as I was going to work and said I was going to try them out one day I finally did today I must say the atmosphere and store in general is very well kept and clean the owner she seems very respectful and engaging , although the food didn’t give much “soul” it wasn’t horrible it was decent the greens were more sweet than expected the Mac and cheese was also sweet but I will say the bbq chicken and the fried chicken was really good …. I will give them another try with a different variety one thing I will say I loveee that it’s a black own business thriving"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbkxYSFh3EAE",
            "text": "i eat around the area before work sometimes, decided to finally try this place out. at first i was kinda surprised my total was more than i had thought but after actually trying the food i didn’t really care cause it was worth it.\n\nvery well seasoned, food was hot and plentiful. very very yummy. if you’re picky it’s perfect!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaWNPT3B3RRAB",
            "text": "my food was cold... they should do a better job of keeping the buffet hot.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX3ZiVU53EAE",
            "text": "The staff gives a nice friendly service, the food is amazing and coming from North Carolina to visit, the food is worth an arm and a leg. They got all kinds of food: soul food, Spanish food, African food. They got different food daily, I’ll be back soon for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYME1iOThRRRAB",
            "text": "The food was so delicious the atmosphere was great some light skin lady she was so kind she told me everything I needed to know and she showed me the drink fridge and she offered me some cake I can’t wait for my birthday I can order some catering"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd01md2VREAE",
            "text": "Love & soul food ❤️ was one of the best place in the bronx ny. Special we all use gloves to serve your self. I come from Richmond, VA to get the food I'm so happy still for for my third time. The lovely lady helped you tell all the details about the food 👌 delicious 😋!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuZ0tXMVVnEAE",
            "text": "The staff was very friendly. Especially Mohammed and Abraham that was there sometimes in the afternoon and sometimes at night. I would like if they tell us that oxtail was only served three times a week. Other than that amazing food and amazing stuff.Not to mention, they don’t mind explaining to you what dish is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNmU3SFZREAE",
            "text": "I was highly surprised to find this new soul food/caribbean fusion self-serve restaurant on my way home. It’s a very tight spot with all the food selections lining the side and rear walls. They have an array of beverages available and although only have banana pudding as a dessert option, are working on expanding their dessert selections.\n\nThere are signs asking that customers put gloves on and not talk over the food. Food is weighed by the pound, a little pricey for the residents in the community but most likely optimized for the large hospital presence in the area. I tried the Mac n cheese, fried chicken, collards and yams. The chicken was fried and seasoned well, the  collards were tasty, not overly seasoned yams had a slightly heavy clove taste and as beautiful as the Mac n cheese was presented there was a buttery taste to them.\n\nSo overall it was ok, and it’s definitely the only eatery of its kind in the area so it will definitely gain momentum as word spreads. I will go back and try their other options before determining if they would be a go-to option for me when I’m in the area."
        }
    ],
    "reviews_count": 25
}