{
    "name": "Mar Y Tierra",
    "place_id": "ChIJveGV-3LzwokRFKhvU6GVDGk",
    "grid": "BX7",
    "address": "3236 Bainbridge Ave, Bronx, NY 10467, USA",
    "rating": 3.9,
    "user_ratings_total": 345,
    "phone_number": "(718) 655-7764",
    "reviews": [
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1JWRm5lazk0TjJ0U2RFbEpXbTB6VmtONGVrRRAB",
            "text": "La comida es de lo peor y mucho cuidado con pedir servicio a domicilio, te mandan lo peor y comida que parece que tiene días, no lo recomiendo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNVZtSktlalJKTlU5SlExRTJMV1UxYWpNM2VXYxAB",
            "text": "Half of the space is setup as a dance place. Romantic lighting, a bar, and dance music.  It seemed very nice if that's what you want. But the music was very loud- if you were just there to eat.  The food is delicious and the staff is extremely nice and professional."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbzlYWU1nEAE",
            "text": "Everyone in the Neighborhood Knows that Nelson and Wife, are Hands on, Attention to what the Good Cooking , that results in Word of Mouth , always fresh and clean, I am sure if you ask Anyone that's been there, They Left Satisfied, and returned, hey, Drop by and taste for Yourself, F Carlo,"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aXZtVkVBEAE",
            "text": "The food is good, but I don't like how they change the menu items after you order and don't even realize until you get home.  Combo's say, large rice, medium beans, salad or sweet plantains or totones, and a 2 litter soda.\nBut if you pick rice mix with beans, they take it on themselves, not to give you the medium beans, and still charge you the $36 for the full combo.\nNo where on the menu does it say if you pick rice with beans, you don't get the full combo n still will be paying the same price. That's a false advertisement . The beans are not a big deal, but paying for a full service and not even being told or given a different price is. Stand by what you have in writing. Not by what you decide to do to customers."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX19lYzdRRRAB",
            "text": "Lunch special was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudjRISTlBRRAB",
            "text": "I’ve given this place a few tries, food always seems to be cold & overly salty. Staff can be rude at times. Would rather spend the money on other restaurants in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNkpXS0hBEAE",
            "text": "I filled great with all my friends, sound music is great, prices are too high, and they offer price on a fly label at a price and endly they charge you an other price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cnBfT1RBEAE",
            "text": "The people serving my food was very rude gave me very little of meat but mosly fat and lots of rice the place is quit didn't see much people but it's clean in the front ...don't think I want to go back to get food tho"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMV9hZUV3EAE",
            "text": "Fun spot, great pernil and beans"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLVBqSlpBEAE",
            "text": "Exelente lugar para divertirse muy cómodo chicas muy amables y serviciales, buena música"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ016UVVREAE",
            "text": "Buen lugar para alimentarse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNV9XUEh3EAE",
            "text": "The food and service is really good the only reason for a 4 start is because every time I call for delivery there is a lot of noise and you could barely hear them and I’m pretty sure the same happen with them. But the food is good and that’s all it matters."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eVo3clJnEAE",
            "text": "Chill place to eat in. Very family friendly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOTU3V1pnEAE",
            "text": "AMAZING food, friendly service, bar side is chill. Live music is great on the weekends. Don't sleep on these guys. Winter, summer, spring. Good vibes all year long."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcjh6aElBEAE",
            "text": "Very private and quiet.  After 4pm bar opens"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1bm8yVTRBRRAB",
            "text": "Como bar nocturno, es de esencia dominicana. Grupos musicales, buena música bailable."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadm9xbkdREAE",
            "text": "Me gustó la comida gracias"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd3RyU3B3RRAB",
            "text": "The decor is lovely and the was ok. A little pricey."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweGJXdlpBEAE",
            "text": "Me gustó el lugar la comida es deliciosa"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNHRpcE1REAE",
            "text": "I've purchased food here on several occasions, and it's pretty good depending on what you order. Their beef stew is delicious, but their roasted chicken, particularly the breast (even though I requested thigh/leg), was very dry and not that flavorful. Also, for what they serve, their prices are a bit too high. For instance, an order of maduros is $6, but they barely fill the container as other places do."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z0x1ZlBREAE",
            "text": "El mejor lugar"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNmJPWS1nRRAB",
            "text": "It was a great place to enjoy music and watch sports"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdU5DeGpBRRAB",
            "text": "Fresh & delicious food alp year round, PERFECT DOMINICAN FOOD! This place NEVER disappoints! I will continue to come here & recommend to everyone."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaDgzNnZ3RRAB",
            "text": "Es 👍 bueno"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaWJlU1NREAE",
            "text": "Delicious, typical Latin food. Not modified for our preferences."
        },
        {
            "date": "2년 전",
            "language": "gn",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeGZyM2F3EAE",
            "text": "Muy Buen Lugar Para Pasarla Super Bien Captas 😉 Oyeloooo 🇩🇴🇵🇷🇺🇲🏳️‍🌈✅  Weeep@!!!\n#Captas #Weeepa  #MorenaCongaYSusChicasUnisex  #morenacongapromocionusa\n#MorenaCongaProducerAndPromotionUsa #morenaconganet #Sitabien  #SiguemeyteSigo\n#MorenACongAArtEYOcio"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNzRUX1B3EAE",
            "text": "Divido el lugar de lo mejores"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlc2MzMzVBRRAB",
            "text": "This is a Restaurant and Lounge in the Bronx."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtX08yby1RRRAB",
            "text": "The music is to load"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOEpQNkRnEAE",
            "text": "Worst place ever they added charges to my bill that weren't true"
        },
        {
            "date": "수정일: 7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnZzhlWW5nRRAB",
            "text": "El mejor Lugar para comer y pasarla bien the best restaurant out here👍.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNMy1IZndnRRAB",
            "text": "My coworker introduced me to this place and got me Mangu from here ever since that I get Mangu for breakfast here all the time!! I  don't mind driving half way across town to get it from here that's how good it is!! 😋😋…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbWNlSlZnEAE",
            "text": "1st Covid-19 indoor dining experience and it was a great one! Will be back and their breakfast is great too, wonderful choice in wine!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMU5UTWlBRRAB",
            "text": "I love this place I don’t know why the people that left a bad review are complaining. I been coming here for years. The food is awesome as well as the service. All the staff & the owner are Amazing. I moved to upper WESTCHESTER & I travel…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdWZIeTRBRRAB",
            "text": "I went there in july for my birthday. This place. The bar tender over charge me for my drinks. She and the ladies there working are trying to run games on male customers. I never had a bill for almost 400.00 dollars . Not even downtown. Be careful. Every time you buy one of the ladies a drink ,  the bartender gives them a chip . And when you get your bill its going to be crazy. When I talked with the owner about my bill , she said that I treated everyone nearest to me ...smdh...just watch out for this place. Until the owner gets rid of his untrustworthy staff , this restaurant/ Lounge will always have a bad rating . Be careful fellas...The owner was understanding enough to give me a percentage of my money back, which was nice of him, if there wasn't guilt , he wouldn't given me back anything. . I would've love to have gotten all of my money back meaning the over charge cost ...but this is truly a lesson learned...Be careful...."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbUpId0d3EAE",
            "text": "Service was absolute garbage and the waitress was wearing flip flop, so anti-hygenic. The table was falling about, the ambiance is dark and dated and on top of all this the food suxed. The bistec was hard, the white rice looked old, the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROUppZ1l3EAE",
            "text": "Horrible service! Horrible pricing for a rinky dink corner restaurant. They charge $27 for a chicken chunk combo (even a 5 star local rest doesn’t charge that much). They don’t accept credit card on combos but they do on lunch meal and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dGVHQlFBEAE",
            "text": "This place is horrible shame that is Dominican because dominican food is delicious. The cook here can't cook. The food is salty presentation is messy the waitress is horrible and restaurant is dark and has no ambiance. The owner needs to close it remodel hire a better staff n make it a place where one can eat there more often.\nHorrible y la comida no es Buena el cocinero no sabe hacer un sancocho. Y las carnes son dura porque la cocinan por largo tiempo."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJdnZhdXZBRRAB",
            "text": "Also, for the people that post that this is good food must have never experienced delicious & appealing food. At dinner time, the chicken stew was brown & dry.. they rice was cold and hard, and the beans were dry as well and thats why my parents never returned to eat."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMXYtT3BnRRAB",
            "text": "Place is horrible, food don’t have constant portions size, I had lunch there 3 times last 2 times ordered same food beef stew with French fries. Got less beef then it was day before, lady who served me is the same in both times, price is same for food. I asked waitress why have less meet? First they act as they not speak English, and she is not the one who served me???, they weirdly act with payment not accepting card payment on lunch, not giving recipes after payment made in cash after I did ask for recipe they act as I asked for impossible action and handwriting me some piece of paper with random price.\nDrinks is another topic first time I got snaple which was frozen before and bootle is broken I figured out it after opening it, it started to leaking out. I did order lemonade which never got.\nNot recommended this place at all\nReckless customer service\nDirty\nOverpriced\nRude waitress and workers"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3X3NET0N3EAE",
            "text": "They aren't really receptive to anyone outside their own kind.\nI like to order their fries because it's real potatoes.  But when I do,  they ask if that's all i wanted in a tone that's suggestive of a waste of their time.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMUxTMW1RRRAB",
            "text": "Best place I’ve been too. Food is great and the service  is immaculate. You could even have a decent conversation cause the music is to a min. I highly recommend Mar Y Tierra!!!!!!! Two thumbs up!!!!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwODdmUWF3EAE",
            "text": "The food was amazing. It was well prepared and seasoned right. The waitress was really friendly. The bar tender needed to know how to make drinks, but it was a great experience today."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb2JXZDh3RRAB",
            "text": "Horrible!  Ordered something simple and traditional a cheeseburger and fries.  The fries were recooked and disgusting.  The burger was extra salty and bun burnt.  Not recommended.  I added a picture in gallery."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbFppbXd3RRAB",
            "text": "Excelente restaurante bar dominicano, para pasar un rato ameno. Tomarte unos tragos en compañía de grandes selecciones musicales, de todos los generos, actuales y clasicas. Me gusta muchos sus DJs.  Creo que hacen un buen trabajo en la…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5djZUcVlnEAE",
            "text": "I went Saturday 2/13/2021 and ordered a Sancocho to go.    What I got was one big chicken leg a chicken thing and 2 chunks of green plantain,  WTH that's not Sancocho 😡😡.   On top of that the soupy part was so salty I felt 😣my blood pressure raising.   Food is not good.  They should know what's a Sancocho.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbnZMOEd3EAE",
            "text": "IT GETS \"BETTER\" PEOPLE... First of all the food is not all that, you're better off going to El Caribe on 2 E Gunhill road(at the corner of jerome) more varieties, better service, and what you want - GOOD FOOD. I've purchased a small mangu, plain no meat, for 5 dollars several times before, and now when i send my English speaking daughter they tried to milk her for and extra 3.50 telling her they only have a large. Little did they know i was outside waiting, so when i went in the same server cut her conversation short on the phone to prevent another server from taking our order. Then i asked for the small mangu and the same server who's previously sold it to me for 5 dollars several times now says they only have a large for 8.50. However the small containers are right on the shelf where they ALWAYS are. So now not only do they have crummy food and service they also are BOLD FACE LIARS. They just lost a customer and now have ANOTHER poor review. Question.. was it worth trying to scam my daughter for 3.50? Happy New Year <3"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVME42d0V3EAE",
            "text": "By far the worst pernil I have ever had in my life and the bake chicken was dry. Who ever said this place is great has never tasted quality and good tasting Spanish food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMm82TE5REAE",
            "text": "Absolutely horrible, Orderd a Seafood rice also known as a paella, salty above and beyond salt, one tiny piece of lobster tail split in half no crab as this dish should, only mussels and clam a small amount also it was a portion for a…"
        },
        {
            "date": "12년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcmFTMTl3RRAB",
            "text": "Like a gentlemen, I sat in my chair and ordered my drinks, I didn't give anyone a problem. Then, I asked for my bill. I thought everything was find and there was no problem.  As I walked out the door, the owner said to me \"you own us about $35.00 more dollars\". Not wanting any problems, I gave him $40.00. I'm still waiting for my change. Be careful everyone, these people are \"rip-off artists\".  I would advise that you pay your bill in advance.\n\nComo un caballero, Yo sentada en mi silla y ordenados mis tragos. No quiero nada problema. Entonces, cuando yo quiero mi cuenta, yo pensando todos estas bien y hay no problema. Mientras, mi voy a salir de la puerta, y el jefe dijo a me, \"Usted nosotros $35,00 más dólares \". Entonces, yo no quiero nada problema, le di el  $40.00 más dólares. En este momento, estoy esperando mi cambio. Ser cuidadoso mi gente, esta gente son \"rip-off artistas\".  Pagar sus cuentas cuando obtienes sus bebidas."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRajlhN3ZRRRAB",
            "text": "I have never had a problem with the food here, I just think it's overpriced. It might be because they don't have much competition but I would gladly hold my hunger and go to Burnside and find cheaper food for the same quality"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbllPMU9nEAE",
            "text": "This place is really good. They take long to serve but it's worth the wait. I have been here several times & enjoyed it every time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvd2RXOEtREAE",
            "text": "We went there a group of about 15 of my family memebers to celebratey sister and nephews Birthday we got there about 10 pm and we had bottle service with two bar ladies serving us drinks the ladies from the bar were so nice and took very good care of all of us (cause sometimes the ladies at the bar r not nice to other females but these ladies were dope ) we didnt eat there well i didn't lol but the place was poppin could've played a lil more English music but it was awesome we had a great time owner is great person\nSee ya next time Mar y Tierra 😘"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0bEsyT19RRRAB",
            "text": "Pedi mofongo de camarones al ajillo y estuvo riquisimo. Las chicas muy simpáticas, precios normales. La decoración y el mobiliario si son como de hace como 30 años."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeWUtb05REAE",
            "text": "The food is good and so is the woman at the front counter, she’s great. But the guy at the front counter who is there in the afternoon has an attitude for no reason. He needs to work elsewhere."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMlBEMFh3EAE",
            "text": "The food is very good especially when you order a meal that is not already made. The waitresses are very nice and helpful."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndU5pR2tnRRAB",
            "text": "Food is fair to good,had chicken soup Chuck full of veggies,my quest had tripe soup absolutely delicious but slightly salty. I would recommend it for lunch."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4djVYSVdBEAE",
            "text": "Turn down your music or I will contact the local government offices to shut you down. This is a residential area and you’re playing music too loud. Turn it down or i will have it shut down by the fullest extent of the law."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4ejVXV2l3RRAB",
            "text": "Bought a lunch plate. Chicken was hard tasted old. Rice was also hard probably reheated. Horrible customer service the guy making my plate had an attitude."
        },
        {
            "date": "13년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOTlXTTZBRRAB",
            "text": "Fui a una actividad en el segundo piso del Restaurant y fue una experiencia acogedora buen servicio, buen trato, un lugar que vale la pena visitar...... Excelente salon para ocasiones como cumpleanos, bautizos, baby shower, fiestas, encuentros......etc......"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbGZ5b1RREAE",
            "text": "Food is tasty when its freshly prepared and not just sitting there. Service sucks but food is good."
        },
        {
            "date": "수정일: 11년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNzVlaEVREAE",
            "text": "Exelente atenciones Buenas comida. Todo. Enfamilia. Un. Trato. Amable x. Su. Administradora ESTELA. Y las jovenes k Mexican el cien x ciento. D ellas. Para atender. A las clientela. Con respeto y humildad"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJX2FhNzZnRRAB",
            "text": "The food is great and so is the staff just wish they had more specials for breakfast"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c09YRGNnEAE",
            "text": "Lunch specials are great!! Customer service is excellent. The servers are friendly and attentive."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBLTgyWEJREAE",
            "text": "Good food , nice people, far price for rented, location has two floor , first floor holds 50 people and second floor hold 100 people , plus AC a plus and decorations"
        },
        {
            "date": "13년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdlo2VXl3RRAB",
            "text": "The best food in the area.      diria que en lo personal es el mejor la atencion y preparacion de la comida por mi amigo nelson no tiene igualdad en toda el area lo recomiendo y se lo garantizo. Le doy. 5 estrella pork no hay mas."
        }
    ],
    "reviews_count": 66
}