{
    "name": "The Bedford",
    "place_id": "ChIJC9ZN6VxZwokRQD2Rzzd5DlQ",
    "grid": "BX7",
    "address": "110 Bedford Ave, Brooklyn, NY 11249, USA",
    "rating": 4.3,
    "user_ratings_total": 1163,
    "phone_number": "(718) 302-1002",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod01tWkVValZXVnpGWlRFZEVWM2hQVkZKVWJYYxAB",
            "text": "Was able to walk in on NYC marathon day which was nice\n\nFried chicken sandwich was really yummy but you gotta ask for hot sauce\n\nOur waitress was really cool and friendly\n\nBathroom was somehow out of soap and toilet paper, I know it’s a crazy busy day but c’mon now…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeE5sSlVZVEJxTVRORVlVdDRVRjlyTWtOV1JVRRAB",
            "text": "Nice place but a little chaotic"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb1NrOTFTemxuYzJWRlR6YzBjblZsYzJOaVQwRRAB",
            "text": "Stopped in here before a show at Brooklyn Bowl. I had a very tasty burger, and my friend had a delicious looking fried chicken sandwich. Service was solid too. I'll be back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKc1JURXROMHBKUVhabVMzbDRhVUZsUjFObFpGRRAB",
            "text": "Brought a large group here. Service was beyond fantastic & accommodating. The lobster pasta was completely missable. If you're looking for Italian - the pizzas are a better choice. The brussel sprouts were a great starter."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQllVUjBUblJGTkhKVFZIVnFWMTlPTTJaeU1GRRAB",
            "text": "Perfect but expensive"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUVZYYzJZVzVFWld4aFJHSXhUMjR4WldwaFJsRRAB",
            "text": "Solid spot good chicken sandwich"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWVZsTXdOWE5PU0c5RlFtOWtjVnBxY2t4WWFrRRAB",
            "text": "We really enjoyed the Chicken Parm Pizza and the Prosciutto & Arugala Pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMU5WSmpRUzB5YjFOcFNIazFVM2RXWVdodFkxRRAB",
            "text": "Such a gem!! Delicious food, great service..will definitely go back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcllWWmtWMncxVjI1bVprdDRhR0ZhVmpsUExYYxAB",
            "text": "Was a great vibe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWmFGVXhZM3AxT0ZkWU1USlJibVJ1UldSTE1IYxAB",
            "text": "Had the best brunch here on a Friday! Bloody Mary was *perfect* and don’t forget to get the French Toast Fritters. Will be back🩷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWmJFVlJjMHBFTm1oSFJHRmlaRlJ2UW1kYWVWRRAB",
            "text": "Too much sugar too expensive, never again"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU1NHdDBZek0zYUU1M2MxUndUakJzTXpOVGJXYxAB",
            "text": "food was fantastic, service was great. Came here for dinner with my family. I had thespinach/kale pizze,. My son had the mac/cheese burger (crazy!!), wife had the steak. All food was good, drinks were outstanding. Might be my new go to place in the neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQmVIVnpPREZ0Y1ZSaFZGbG5VVkowWm1SV2JFRRAB",
            "text": "OMG, the Mac' n cheese burger is delicious. The burger is excellent and filling, and the fries are crispy and well-seasoned. I have no complaints about the food. My friend stated that the shrimp appetizer was good, too, and filling. I gave the service four stars because the waiter who helped us was excellent, but the second waiter who came to cover the bill made us feel rushed and uncomfortable. He looked like he was in a rush and wanted us out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeVIyNTNibGQyYkVaWFNrUnVPRXhrWW04MGJXYxAB",
            "text": "The food is sooo good!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psc2NqZGpOMlowWTBsVlYzbGZUemQzU21aSFIxRRAB",
            "text": "Amazing place, great food and friendly - and competitive - staff!\nVery comfortable, cozy and cool place to be."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNU5uRkhMVTVpTFRKU1puRXpPV0YzZVdoNk5uYxAB",
            "text": "Great pizza and crab dip. Yummy mini martinis too! Came during happy hour, and did not disappoint. Food came fast and servers were very attentive. Would recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa2FWQkZRVkZ4VW5OYVpIY3hSMWxwZUZjMVoxRRAB",
            "text": "We were there for brunch. Loved everything…the food, service and cocktails. Portions were a great size. Had the stuffed French toast and pulled pork hash. The stuffed French toast is more like dessert but was worth it! Great vibe playing classic like Sinatra style music but low enough to have a conversation which I appreciate"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeVZqUlVXak5rUmtOSFVHWnpNMDQ1YjBkRVowRRAB",
            "text": "Great food, nice atmosphere, good service. 👍 My cocktail seemed a little small I guess? But generally had a nice meal with a family of 6."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMVVFeDBVVVpWTTB4TU1sQkhXbmt5ZEcxVlQwRRAB",
            "text": "The restaurant charged an additional 3% fee for using a credit card and $1 for so-called jam for toast. It wasn’t even jam."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dVJHRXdWbWxLTVZNdFVVRkVNRkpFTWtWd2RtYxAB",
            "text": "Happy hour at Bedford was one to remember absolutely amazing! The espresso martini really hit the spot, shoutout to the bartender for crafting such a perfect drink. Big thanks to the brunch guy for the recommendation too.\nGreat vibes all around!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMUp6VzdBRRAB",
            "text": "They didn’t have like 1/4 of the menu available but I was able to order the tomato and grilled cheese—it was great!\n\nNew review: You can indeed get Girl Dinner here—a Caesar kale salad and old bay fries. Yum. 😍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbVJ4YnJxMEoyYS1RRRAB",
            "text": "Delicious lemon ricotta pancakes, cool place, not crowded. Seems underrated to me!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPTzQ1cG4tNGZlQmdnRRAB",
            "text": "Seemed to be understaffed as it took for us to get our food and the place was not full.  Food was decent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQcXZwWmVHdFBiZE1nEAE",
            "text": "The burger and fish and chips were good- standard American bar food. However, the service was abysmal and we had to wait 1 hour to receive our meal. It was clear someone dropped the ball but they did not even apologize us for the inconvenience. I won’t be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLXJqTVRsNktfLVJREAE",
            "text": "My favorite pancakes in Williamsburg! Underrated spot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbV9qT2ZREAE",
            "text": "place was in a great location and the service was amazing but unfortunately, the burger that I got was super dry and the bun was not fresh. Don't think I'll be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTRHTmhRRRAB",
            "text": "One of my go to spots. The atmosphere is very cozy and the staff is polite, quick service. The hangar steak and fries is a must!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveWFDTFRBEAE",
            "text": "Worst service ever, the server was very rude and the bartender as well. It’s unacceptable how they can get a expreso martini right."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveVlDRlBREAE",
            "text": "Muy mal servicio al parecer ahí un mesero latino en la noche ,que al parecer se enoja si le hablas en español , realmente pésimo servicio , una persona realmente grosera"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcWNMWWd3RRAB",
            "text": "Everything was great! Food was amazing service was great too and the drinks were phenomenal but the reason I’m giving this place a 4/5 is mainly the 3% up charge for using a credit card rather than using cash. The gratuity was included which I don’t mind but you would of expected that the restaurant would if been taking care of the Credit card fee and not expecting a cc fee like how a deli would charge if a minimum spend. I’ve worked in the industry for a decade and none of them had customers pay for the cc fee. So just be aware of that. Overall nice cozy place with delicious pizza."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWVXcWFnEAE",
            "text": "3% tax for using my credit card and 24 for small 12' pizza not worth."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eWJXVmFnEAE",
            "text": "Friendly staff, nice vibe. St Paddy's Day grilled cheese was fun after a long day."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReDdMaHZ3RRAB",
            "text": "We had the meatballs with tomatoe sauce and the mafaletta both very good peach martini excellent in a old school martini glass delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndjZLMGhnRRAB",
            "text": "I look forward to coming here and bringing people here. I love their French toast"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXRqYWdRRRAB",
            "text": "The atmosphere is impressive, featuring dim lighting and plenty of space that guarantees a comfortable experience for couples. While I personally did not enjoy the music, that is a subjective matter. The service, however, needs improvement. I had to repeatedly ask for several items, and at one point, I received a nearly empty container of pepper flakes. Although the server was friendly, she spent an excessive amount of time chatting with a gentleman at the front instead of checking in with us or other tables.\n\nOn the other hand, there was another server with curly hair and an average height who was much more engaging and provided excellent service. The food was outstanding—definitely as delicious as it appeared, and I have no complaints on that front. However, our experience started off feeling rushed due to one of the staff members.\n\nIn summary, the venue is excellent, but there are clear areas that require improvement."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMXRXX2V3EAE",
            "text": "My favorite part is when the lights inevitably fade to utter darkness as I eat my tomato soup + grilled cheese.\n\nI am an out of towner, but this is a place my friend and I visit every time I’m in town without fail. The risotto balls are divine, as is the kale caesar and the thing that brought us here in the first place: the tomato soup and grilled cheese appetizer. Great cocktails too!\n\nThe staff is kind and the atmosphere is really nice. I love it here and look forward to the next time I’m in the area!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMUt2QnVnRRAB",
            "text": "Portions were a little small but food was great. I do wish they'd give more light."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbzlHdnRnRRAB",
            "text": "The Bedford saved our wedding! Our first venue sold the venue out from under us and The Bedford jumped right in and took amazing care of us and was far more beautiful than our original choice! Jillian was amazing by providing quick communication, great ideas and resources, and personalized service. We loved having our wedding at The Bedford! It couldn’t have been more perfect and seamless."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcFpLUHFnRRAB",
            "text": "Went for brunch the pancakes were great but the burger and fries I got were SO SALTY which was a shame because the burger meat itself was high quality."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMU52V3l3RRAB",
            "text": "I prefer the dinner menu to the brunch menu. I was shocked that they don't even own pickles to eat alongside the pickleback chicken."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLUtXXzl3RRAB",
            "text": "Oh I like this little cozy place! 😍\nVery nice outdoor seating, I’d definitely come back in spring! Very good brunch menue, AMAZING cocktails, professional staff, the dishes came out quickly and the waitress was extremely kind and friendly. The food is delicious, every bite is full of taste. It does not taste like American food at all, more like Italian or French, very tasty, diverse flavors, delicate and sipid"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcTVlalFBEAE",
            "text": "There is just something not appetite when you enter this place for brunch and you get hit in the face with strong odor of Fabuloso floor cleaner and fresh cooked breakfast. Please work on more pleasant smell inside the dining room. There is plenty of organic floor cleaner choises."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNmRfOGFREAE",
            "text": "Absolutely incredible brunch spot! Exceeded expectations. We started off with the lemon ricotta pancakes. They were the perfect amount of sweetness and so fluffy. Also ordered the Carolina Pulled Pork Hash, great ratio of potatoes to meat. Pork was tender and not fatty. Eggs were perfectly fried. My favorite was the Truffle Egg toast. A fried egg was buried under fontina cheese on a fluffy roll. If you don’t like truffle, don’t order this because it is alllll truffle and so delicious. The service was fantastic too. Our waitress was a petite, kind woman, forgot to get her name. Would love to come back to try the dinner menu!\n\nUpdate: came back for brunch again and got the breakfast BLT and burrito! BLT was delicious 5⭐️ the burrito was ok. Lacking a little flavor.  Also got the lavendar margarita and Bloody Mary😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MU1ITXd3RRAB",
            "text": "Great bar vibe and a killer pilsner (can not draft). Chicken burger was solid with a lovely coleslaw. Wished I got the Mac burger but couldn’t see a hospital close by."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcXRIUjRBRRAB",
            "text": "Love this restaurant so much! Great food, great service, great ambiance. But they shouldn’t have gotten rid of the Mac & cheese :( it used to be an easy 5 when that was on the menu!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQamNfTmpBRRAB",
            "text": "Good place to grab a bit after a night out. Friendly staff and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOHBMUVdREAE",
            "text": "Great drinks, food, and vibes. Leoni was outstanding too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX19mRmN3EAE",
            "text": "The stuffed French toast and ricotta pancakes are amazing (French toast especially is the probably the best ive had in the city). Usually no wait and pretty quiet inside. Other brunch items are alright."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaXNTekhBEAE",
            "text": "Had a great meal at The Bedford recently ! The food was fresh and flavorful, with good  portions and great presentation. The staff was friendly and attentive, and the atmosphere was cozy and inviting. Perfect spot for a relaxed meal. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYck5IbWlRRRAB",
            "text": "Stumbled upon this place and it was amazing food and drinks"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMm8yUHp3RRAB",
            "text": "플랭크 햄버거도 맛있었지만 같이 먹은 고구마튀김과 디저트로 먹었던 French toast fritters는 정말 맛있었습니다"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOE1uajRRRRAB",
            "text": "This place has better food than people give it credit for and it's a consistent standby in my rotation. They do more than burgers! I had the hanger steak with chimichurri the other day and it was incredible. Their old bay fries are a delight. The grilled cheese and tomato soup is also one of my longstanding faves in the hood. For brunch, the lemon ricotta pancakes were delicious with bruleed apples on top. Yum. Even the vegan kale pesto pasta was shockingly good. I wish it was a bit brighter inside, but for a date night it's really cozy and has a nice ambiance (wood, wrought iron, that kinda vibe)!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcS0td2xnRRAB",
            "text": "We had no trouble getting a reservation for a party of 7 for Sunday brunch. Service was excellent and the staff were very attentive.\n\nI got to try the Mac n Cheese Burger, the Pulled Pork Hash, and the Lemon Ricotta Pancakes. The burger was solid and tasted exactly how you would expect it to. Like Mac and cheese with a beef patty. The lemon ricotta pancakes were nice and fluffy but it definitely needed the flavor and sweetness of the syrup. The caramelized apples were just okay, I think other fruits are better suited for pancakes. The pulled pork hash was a little disappointing. It tasted like all the ingredients put together, but without any seasoning.\n\nOverall, it was a good experience. The food wasn't amazing, but the novelty of items like the Mac n cheese burger or risotto balls is fun and interesting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKd0tDX3pnRRAB",
            "text": "The food was good, the price makes sense. We ordered the Mac N Cheese burger, the beer salad, and the risotto balls.\nThe Mac N Cheese burger was so big! It's extremely dense and served with two patties - it's definitely not hand food. We shared it which was great, and it was very tasty. It's a bit of a novelty though, definitely try it if you're feeling adventurous.\nThe beet salad was one of the best salads I've had in Brooklyn, at least in the modest category. I'm from the west coast where these salads are easier to come by, and this one was so good. The candied walnuts add a nice dimension of flavor.\nI don't remember eating the risotto balls. So they weren't memorably good or bad. My wife says they were good.\nThe atmosphere was chill and laid back when we went, although it wasn't very busy because it was raining. The vibe is very cozy and the seating is roomy and comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdU9paVFREAE",
            "text": "This was a delightful discovery! A hidden gem. The cocktail and wine selections were very good, and the prices were reasonable.\n\nThe food was fresh and delicious. Nothing we had disappointed. The duck confit? Amazing. The lobster ravioli? Divine. The Arugula and Apple salad (sorry no photo of it) was delicious,  balanced, and big enough to share as an app for two.\n\nService was attentive, friendly, and professional.\n\nThough I live in Queens, this meal is definitely worth a trip. Can't wait to go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELXFHcVJBEAE",
            "text": "This place was a good little spot to grab some brunch. The food was good, but our server seemed new and was not on her game. She actually dropped coffee on my wife. Thank God she had jeans on and didn't burn her. She was confused a lot with our orders, but thanks to the manager for helping out. But overall, it was ok."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaXRLbFVnEAE",
            "text": "Street parking is available, but limited. Indoor, and outdoor seating are available. Vaccinated Cards are checked here. It has a rustic vibe inside, and more of a casual atmosphere. The staff are both polite, and attentive. I would definitely recommend the Mac & Cheese burger. Unique in it's own way, using the Mac & Cheese as the bun instead of bread. I really enjoyed it. For dessert, the Drunken Cookie is a very good choose. No, it won't make you drunk, but it does come with a syringe of Blueberry alcohol on the side. Couldn't really taste the alchohol, but the taste was amazing overall. The Shrimp Scampi pizza, I got it to go. Even when I heated it up at home, I enjoyed the seafood taste. It's not the best pizza I ever tasted, but it was good. Try it while your there, and enjoy the experience. Overall, great spot for a casual date night."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNWYzU2lRRRAB",
            "text": "This place is pleasant surprise. We tried mac and cheese truffle, mac and cheese burger, mediterian quesadilla and pasta. For desert we got drunken cookie. I am speechless regarding mac and cheese burger and cookie. That is a must! Quesadilla is okay but I feel like they could work on the ingredients so they could taste better.\nThe service is phenomenal! Ryan is so sweet and helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLVBHVFNREAE",
            "text": "We had dinner on a Friday night. The food was pretty good.\nWe had the crab dip, fennel and fig pizza, kale salad and ricotta meat balls. All were delicious. The pizza had a great combination of flavor and the crust was thin and good.\nThe dip was a great starting !\nThe wine pour were great :) !\nFor dessert we had an apple crumble, it took a bit of time to be served but it was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiazdDNzJ3RRAB",
            "text": "Had a great time! Service was quick and nice. It wasn't busy at all on a Thursday night from 6-7. It was hot, hence the four stars for atmosphere, but the ambience and music was good and cute. Food was good, and I enjoyed the Hibiscus Lavender Margarita."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcDdTWkdBEAE",
            "text": "Get service and recommendation. Everyone is attentive and friendly. Erick and the other waiters had great customer service. The food was amazing i had the ALT with the amazing tomato soup. I highly recommend. Some other great choices are the chicken and waffles or the burger."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwanEzZjJBRRAB",
            "text": "My friends and I chose this place for brunch on a whim and we were blown away. Everything was plated so beautifully and every bite was heaven. Been craving a chicken sandwich and their pickle back fried chicken sandwich hit the spot and more like, definitely craving another already. Not to mention my roommates stuffed French toast was mouthwatering and massive!!! We must go back."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNNnJyWTJRRRAB",
            "text": "The food is delicious, it is a unique blend of Light Italian meets Brooklyn American fare. The Brooklyn Benedict and the Mac’ & Cheese Burger were fantastic. The cocktail menu, could use some work and the service is hit or miss. Definitely worth the visit for the food though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd0x5TTN3RRAB",
            "text": "This spot was ok. Here are the pros:\n-The plank burger was perfectly cooked exactly as we asked.\n-The fries are ABSOLUTELY AMAZING!\n-All the food was pretty great from the risotto to the mushroom pizza.\n-Lots of outdoor seating.\n-Nice size indoor bar.\n\nCons:\n-The service was ok. They forgot something & took so long to check in on us we didn’t bother to ask for it.\n-The wait staff were lowkey unprofessional w/ some of the things they said/did like assuming a black girl sitting near us was part of our group when she wasn’t facing us & actually wasn’t that close to us.\n-The temperature inside was unbearable. I know it’s been warm & it takes a moment for AC switches to be flipped but on this 80 degree day there was no way to sit instead with AC.\n\nHonestly if the service was better and the AC was working I’d give a higher rating b/c the food was great."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNdC1MTUVnEAE",
            "text": "I came here with a bunch of my friends because this place was on my bucket list of places to try for brunch. The food was fantastic and the atmosphere was very comforting. The only complaints I have would be that the plates that were given…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOGRfS1VnEAE",
            "text": "We had a large party, and while the food was good, the service was really variable. I think a small party would have been fine. The drinks were good, but getting refills was iffy. I will try again with just one friend not 20. I really liked the music and the vibe."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bloyMVpREAE",
            "text": "The Bedford is a fantastic restaurant located in the heart of Brooklyn. One of the standout features of this establishment is its incredible food. The chefs at The Bedford are experts at crafting delicious dishes that are sure to satisfy even the most discerning palate.\n\nThe menu at The Bedford is diverse and features a wide range of options, from classic American dishes to international cuisine. Everything is made with the freshest ingredients, and the chefs take great care to ensure that each dish is prepared to perfection.\n\nOne of the most popular dishes at The Bedford is the burger. It's made with high-quality beef, cooked to your desired temperature, and topped with your choice of toppings. The fries are also a must-try - they're crispy and perfectly seasoned.\n\nIf you're in the mood for something lighter, the salads at The Bedford are also excellent. They're made with fresh, seasonal ingredients and come in generous portions.\n\nOverall, if you're looking for a restaurant with great food in Brooklyn, The Bedford is definitely worth checking out. The menu is diverse, the ingredients are fresh, and the chefs are skilled at preparing delicious dishes that are sure to satisfy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLWYtVHhnRRAB",
            "text": "Had a fantastic meal here. Everything looked amazing and everything tasted just as good too. The risotto balls were excellent. It had great flavor the perfect crunch and an amazing garlic aioli. The pizza was delicious it just lacked some shrimp in the scampi pizza. The drunken cookie at the end was perfect. Super chocolaty and warm. Made for a perfect end to the night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaTZyZGR3EAE",
            "text": "Very quaint eatery, excellent service and great food. If I had to have a negative, it would be that the Mac n cheese burger was too greasy, and although I had asked for medium the patty was more rare, still delicious though. My friend had the lobster ravioli which was divine."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbWNfeHpRRRAB",
            "text": "The most chic and and trendy place I’ve ever been to. The food is evidence of a chef taking their time making these impeccable creations. Whatever negative reviews you read about this place please report them as spam. This establishment is life changing, not to include our waiter with corduroy pants. He served us water like it was champagne. Please come here and spend all your money on this place. You’ll thank yourself later."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbWJTeFd3EAE",
            "text": "Went for brunch. Great atmosphere and handle the large flow of customers relatively well. Drinks are good and come out quickly/ I got the chicken and waffles which were chicken tenderloin strip that are the size of clam strips and the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1OUlqV3FnRRAB",
            "text": "My girlfriend and I came here to get breakfast food I ended up with the max n cheese burger and my girlfriend got the breakfast burrito and let me tell you guys WOW AMAZING!!!! We all got the French toast fritters they are from heaven. Our…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUM2ZiSUx3EAE",
            "text": "Our first time here. We got the pickleback chicken sandwich (my husband attacked it before I could grab a picture), the lobster ravioli, and the grilled oysters. D.E.L.I.C.I.O.U.S!!! Highly recommend. We will be coming back again soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkczVYN1hBEAE",
            "text": "We had such a fabulous time celebrating my husbands birthday here.  We ordered the Mac and cheese burger & thankfully there was a delicious vegan option for me (I was pleasantly surprised how good it was). I could talk about the pizzza for hours, but my husband absolutely LOVED the Mac & cheese burger & fries.  He ate every bite. Which is not the norm for him.  Wanted to mention how kind the staff was especially Marie.  She is so sweet, warm & attentive. Had a great time xoxoxo"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NW92MDdnRRAB",
            "text": "First time eating here and I can honestly say that I expected more, although the servers were attentive and nice. The food was not for me, my pizza wasn’t bad but wasn’t great either. Was really hoping the Mac n cheese burger would pull through but it didn’t. The fries were too over seasoned and the burger was a bit overcooked but would love to come again to maybe redeem my experience from this one."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNcGV6UGx3RRAB",
            "text": "What a great place to eat and chill!  I love the atmosphere.  The food was fabulous!  The service was awesome and they catered to our table effortlessly.  I definitely recommend this place!  We had the ALT, macncheese burger breakfast burrito, bacon cheeseburger,  and black bean burger.  Yum!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTLWRtclRnEAE",
            "text": "Summary: the bedford is the worst restaurant in Williamsburg\n\nAugust 2024 update: got the meatball pizza and the fried chicken sandwich. The sandwich was cooked perfectly, but lacked in seasoning and flavor. The pizza was over seasoned and was sooo salty I couldn't finish it.\n\n2021: 1/5 stars the smash burger is bland and flavorless"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlanJmaEp3EAE",
            "text": "This place is a fantastic pub 🍻 and restaurant! 🍽️ The Bedford offers a large selection of comfort food, drinks 🍹, homemade pizza! 🍕 Definitely try the Mac & Cheese 🧀  Burger 🍔 and Fries 🍟 and the Chicken 🐔 Parm Pizza! Staff 👨‍🍳 is super friendly and the service is quick! I wish I knew about this place earlier!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aGVMQzN3RRAB",
            "text": "Home of the famous Mac & Cheese burger, so I obviously had to try out the restaurant when I visited New York.\nI came in around 3pm, so it was quiet, but that was alright. Everyone there was nice.\n\nAnd let me tell you, the burger was absolutely amazing. It very much lived up to my expectations. The fries that accompanied the burger were very tasty as well. I recommend every burger lover to visit this restaurant!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndmE2c0xREAE",
            "text": "Really disappointed! Came with high hopes after seeing their mac n cheese burger on IG and what the rave was over it, you've got me!! It was SOOO GREASY, flavorless and disgusting. The fries were terribly dry as well. The brussel sprout appetizer was probably the only good thing of all the food we ordered. The waitress was seriously SLOW and inattentive even though the place was dead. My BF and I left so mad that we wasted our money (and calories!!) on this place. Sadly we left STILL HUNGRY  because the portions were so tiny! We literally left and went somewhere else to eat because we were that disappointed. DONT WASTE YOUR MONEY, TIME OR CALORIES HERE!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeGREVnlBRRAB",
            "text": "This was my first time eating inside the restaurant and it was beautiful! I ordered the stuffed French toast which was sweet and doughy (the way I like it)! Also tried the mac and cheese burger which is unique! All around great meal with outstanding service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtd2NqU213RRAB",
            "text": "The server was either extremely exhausted or just didn’t care. Extremely inattentive and never brought out the juice we requested upon our arrival.\n\nMenu is very limited with a good price point. We didn’t get to see the inside of the establishment because we ate outdoors but the outdoor eating area is unattractive. Lacked outdoor decor and life.\nI suggest going elsewhere for brunch unless you’re in a rush and seek to grab something rather quickly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OHRfZDN3RRAB",
            "text": "Well... was disappointed about the location itself, for some reason I was expecting a better ambience. The were playing heavy metal music which felt odd. The service was all over the place.  Not really sure why they were running like…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtc2I2RERBEAE",
            "text": "This restaurant/bar is a hidden gem. The have great vibe for brunch especially when you sit next to glazing. Love their benedict eggs, there is mashed meatball underneath so the whole thing come together. Their staff are nice and cheerful. Very pleasant brunch experience."
        }
    ],
    "reviews_count": 84
}