{
    "name": "Aman Halal Pakistani Restaurant And Catering",
    "place_id": "ChIJG7t9Tw7zwokRJr1MzMGVSY8",
    "grid": "BX7",
    "address": "3594 Jerome Ave, Bronx, NY 10467, USA",
    "rating": 4.2,
    "user_ratings_total": 400,
    "phone_number": "(718) 708-5853",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObVVXTmpTVlJTYnpGVVNFNXdkR1JaUm1SQmFsRRAB",
            "text": "Had the most amazing experience here\nThe service and food was out of this world. Really appreciated the quality of Pakistani food that i got here. Even came from queens because it was highly recommended !"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRFNGQnphRVZmZVV4bFEyeHhXRGRxWm05aFpuYxAB",
            "text": "Had the Palow rice and tandoori chicken. The chicken well seasoned and juicy. And friendly team member especially Faiza."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdWVWVTRjVTl0UlVKbFVIQmFZamt3ZURkRWRHYxAB",
            "text": "Went with my mom and sisters and my cousin to try the butter chicken, we ended up ordering sooooo much amazing food ☺☺😊😊😊😊💕💕💕💕"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRk9DMUpWalV6VFdGUE1raGtWV2RGVDFsTmVHYxAB",
            "text": "Foods are delicious tasty yummy\nTheir Biryani excellent chicken Biryani\nTheir halim excellent tasty yummy less oils\nNaan with halim fresh serve\nBangladeshi server taking good care"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUlJrSlhaVmcwZDBoaWFVTTRkMlpIT1VOek5IYxAB",
            "text": "The food was amazing and reasonably priced! It was my 1st time in the restaurant and the young lady serving me was extremely friendly and helpful.  I had the chicken biriani and a side of okra. I could taste the spices with every bite!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRk5rTlBSV3h6YXpSSGRVbHpkelJQVkZwNU5uYxAB",
            "text": "Y'all need to get down here and get some of this good old food this food is awesome thank you very much you'll never go sad 💯😁❤️🙏🏽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vd1JUUTNObXcwTUhwTVNXMVRielZvV0hGNFYwRRAB",
            "text": "Experience here was lovely, From the young lady to the cook. The young lady was really helpful with food decision.  The food was fresh , delicious and hot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVIyNVdOME5PWkhCWFpUWTJOV3hGWkdKa1VuYxAB",
            "text": "best food in the bronx !!!! ☺️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMFNFZzBNbU5DYVhOeldqSlNaMnR1VkhwR2RFRRAB",
            "text": "for me, this is the peak of pakistani food in new york. it feels like a proper, home-cooked meal, made with love and skill. they have a rotating set of dishes, so each visit is an opportunity to try something new instead of re-ordering the same thing. each of their dishes has a unique flavor profile as opposed to a lot of desi places which copy and paste the same masala.\n\nthe people here are lovely. they’re friendly and offer recommendations. the elder gentleman working the tandoor must have magic hands because every naan i’ve had is the right mix of fluffy and crisp textures (and he always offers a warm smile when i visit). i love their chicken salan, chana masala, and shami kebabs. last time, i had a goat and karela dish that was delicious. their kheer is the best i’ve had anywhere. chai is good too. anytime i’m in the area, my dinner plan is aman’s."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM2VDMVpZMGhyYUZaNVRrNVNSVTVwY0doV1RVRRAB",
            "text": "\"Delicious food, good service, excellent staff & reasonable price!\""
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb1QwbHViVTVuVEU1QmVWQlJSSEZSYWpCWVIwRRAB",
            "text": "I ordered haleem and behari kebab ..1st they'd identical put haleem side condiments in my order and 2nd behaviour chicken kebab was old, hard, dried and chewy ...👎👎"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNi1PU3h3RRAB",
            "text": "Great food. Yummy rice pudding! Samosas fresh and delicious. Very professional, caring and understanding. Hard working team."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeU0ycEVNV2hKWTBwNU0ycFBRVTFMUmxjMlJsRRAB",
            "text": "If you really wanna eat Pakistani in the north bronx I can a-sure you this is the best place must try there mutton karai"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc1JIRmljV1UzZGtOU05GRlZWV2xwTXpCTWQyYxAB",
            "text": "Amazing food, super fresh naan, and the best naan you can find in the city. The service is awesome, recommended me to try ginger chicken and it was super good. The atmosphere will make you feel cozy, comfortable and relaxed. My favorite spot in the Bronx!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWk9FbDVSWGxUV2xwbVNXVndXVFpHTW1OUVNVRRAB",
            "text": "Look, if you're in the Bronx and craving real Pakistani/Punjabi food, Aman Halal is the spot. I've been coming here forever – seriously, the chef here's the first one doing this kind of food in the borough, and you can tell. The vibe is totally authentic, no superficial/fake stuff, just good food. And the prices? Unbeatable. Whether it's their nihari, chicken curry, the biryani, or some juicy kebabs straight from the grill, everything is packed with flavor and reminds me of home. It’s consistent, delicious, and honestly, the best bang for your buck for genuine desi cooking. You gotta try it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeGEySldielJXU0VoYVJXd3hMVVpNUjNNMFIzYxAB",
            "text": "Lovely desi decor && amazing food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTlFuUTVObmhQYnpkd1pXNWpOV1pCWldOd1RGRRAB",
            "text": "Placed a large group order. Everybody loved the food. The staff was fantastic and I will definitely be using them again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSlQyVTBSV2RZVW1Sc1pqTldaSEExV1doS2JVRRAB",
            "text": "Very very nice and good customer service it’s amazing, and the food especially the biriyani rice is to die for and the nann😩. Best Pakistani restaurant ever in the area!!!!! ❤️❤️❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZkMwcC1DOTd1U2F3EAE",
            "text": "...I love the Naan and the butter chicken is very good..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGRMMVd3EAE",
            "text": "Tried Aman Restaurant in the Bronx great ambiance and authentic Pakistani taste. The biryani was outstanding, 10/10! Haleem was also very good, 8/10. Highly recommended for anyone craving real Pakistani flavors. Give it a try 💞💞"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveHF5eG1nRRAB",
            "text": "Overall ok"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTRTdmRnEAE",
            "text": "Nice staff"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bWFHM2R3EAE",
            "text": "AMAZING! The food is delicious and the people inside are very friendly. I wish we could've sat down inside the restaurant to eat because it is so pretty. All of the food smells and tastes fantastic!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMzh6enJRRRAB",
            "text": "Very very good food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNHAyTWR3EAE",
            "text": "Hands down, one of the best Pakistani restaurants I've been to! The food was mouth-watering, and the staff went above and beyond to make us feel at home. Can't wait to come back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQa3E2TVhBEAE",
            "text": "Chapli kebab is the best thing here and it’s so good but man do they gotta add some more lighting it’s so depressing in there"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGNpUWl3RRAB",
            "text": "Love their chicken samosas are the BEST!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc3ZEUmd3RRAB",
            "text": "Food is either hit or miss. Atmosphere is very poor, they really need to renovate and add some light bulbs. Staff is super friendly and helpful."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NzR6N2dRRRAB",
            "text": "They have stepped up, best food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaXVxbEZREAE",
            "text": "food is good but seating for big family is not good. And most importantly only cash option they have."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId0lLNWFREAE",
            "text": "Good food, good price, good service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOXFySEJnEAE",
            "text": "The food is really good. However the many times I ordered the portion size was small. It’s a bit pricey as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibXNtRnFBRRAB",
            "text": "The food is excellent! The Achari chicken is my favorite dish, but everything I've tried was delicious. Service is fast and the staff are very kind. 5/5 for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOE9YbnlRRRAB",
            "text": "First time here\nThe food is really great and full of flavor\nThe price is good\nStaff are very friendly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOUpXWVdBEAE",
            "text": "Excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMlBfZ2ZnEAE",
            "text": "Quality good and fresh Bangladeshi and Indian food  🥘 I love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdlA3YktREAE",
            "text": "Tandoori chicken skewers are outstanding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOGJqS0l3EAE",
            "text": "Nice people with Quick service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEd3VMQnJnRRAB",
            "text": "You can dine in, but I think they do more take out. The chicken biriyani is incredibly flavorful. Everything has a building heat, which I thought was fantastic, but if you are a little iffy on thatn keep that on mind. The was a bit of a licorish taste which i found a little much (maybe star anise?), but so good I didn't mind. The chicken and vegetable samosas were really good.\n\nThe naan is made fresh. It was a amazing as you'd imagine from that. Oh, and you will need cash. They don't take credit or debit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dUlxNkFnEAE",
            "text": "Great pakistani food. Place is a little dated but more than makes up for it in taste. Biryani was fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NktHRHJBRRAB",
            "text": "After craving Indian food one day, I looked for a place that was near me that I could go and buy food myself without traveling too far, I found this place, I’d say Kind of hidden. Thank you for google! I’ve been eating their chicken tikka masala, the garlic naan, halwa, and chicken biryani and if just hit my craving on spot! I’ve bought from them twice already and I know this will now be my go to place especially when I want rice meals. Pls support small businesses like these. They need us too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOemVqeTZnRRAB",
            "text": "One of the most authentic Pakistani restaurants in the Tri-State area. Chicken quorma was actually quorma and daal mash was spot on. And to finish it off, kheer was perfect. Excellent!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeE92SlN3EAE",
            "text": "I had Visited Aman Restaurant for Having Chicken biryani the biryani taste is so good I loved it Must Visit Restaurant if anyone wants to try Authentic Asian Food\nRecommended Dish: Chicken Biryani"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdllEYl93RRAB",
            "text": "Truly a hidden gem in the Bronx. Food is as authentic as it can get. Every piece of food taste homemade and they even cook delicious naan bread in front of you. This my favorite place to get Pakistanian food, prices are reasonable considering the huge portion of food given. I highly recommend everyone to come and give Aman a try, you wont regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsNDVmMkVBEAE",
            "text": "The food is very interesting and the customer service is very good, the infrastructure inside is very nice, anyone who spends money will be satisfied"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNmRHN0NBEAE",
            "text": "The berinee's and tea excellent at Aman. I didn't eat ever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NDRhQTV3RRAB",
            "text": "Delicious food."
        },
        {
            "date": "2년 전",
            "language": "hi",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa3FyNm93RRAB",
            "text": "Bohat mazay ki chai aur samosa"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa3RMcHpBRRAB",
            "text": "Beautiful family running this cute restaurant, ppl were friendly and attentive to help choose my vegan dishes and were resourceful. I had the Chana masala, aloo palak and dal with whole wheat roti. The girl at the counter educated me on what had dairy or eggs in their products. It’s a must go for vegans"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad3FydkZnEAE",
            "text": "Very Bad Store. Extremely poor customer service, manger was very rude to me and cursed me out. I waited 30 minutes for my food only to find out they take CASH ONLY.\n\nFood was extremely soggy and tasted awful. Poor restaurant and staff was very slow. Over priced. Manger is Shia and does not give the satisfaction to its customers.\n\nDO NOT COME HERE."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNveU9MWkRREAE",
            "text": "Pakistani cuisine , restaurant, not that much clean or yummy food, but roti/ garlic nan big size. Kabab 6/10, environment 6/10, cleanliness 5/10, only cash received which is really disturbing, staff behavior 5/10, overall not recommended for good food, Tea is not good also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdzdYcFh3EAE",
            "text": "This place had AMAZING food. The naan was the best I've ever had and the sauce for the butter chicken has no rival"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdDhibUh3EAE",
            "text": "Food is good\nThe usual Pakistani style restaurant which you find in NYC\nThey usually microwave the food to heat it up\nBut Hussain is a honest guy he told me that the food is not fresh and they make it the day before\nI highly appreciate the honesty of the restaurant owner Hussain.\n\nMy suggestion for those customers who don't know what Pakistani food is can try the food at this restaurant and go with their platter options so you get to taste the meat and vegetarian dishes.\n\nWill visit again to review other food items\n\nPerfect for those who don't know how to cook or are visiting Bronx, NYC for a short period."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbkxQMHNnRRAB",
            "text": "Worst Halal Restaurant. Don’t order anything , they leave the food sitting for days. Asked for a salad and they gave me this.\n\nManger is a Shia & left his daughter to work there 24/7 without any marriage. If the management is reading this just know what’s going happen to your restaurant.\n\nYou deserve 0 stars."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaXRMd25nRRAB",
            "text": "Really like their options and their food is delicious. Prices are really responsible and location is really convenient."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbUl6MUV3EAE",
            "text": "We take away today very first time! Haleem, chikar chole naan and kheer is to die 4, seekh kabab are spicy like make you skull sweat spicy!!! True panjabi would love it ! We 30 miles drive but will come back every chance we get ! Prices are reasonable [ picture of menu not listed is loaded\n\nLastly review will not be complete if did not mention sister on counter is very polite and sweet !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcy16Q19BRRAB",
            "text": "I found myself in the area and remembered that some friends had told me about the great food there so I popped in.  First thing I noticed was all my favorite kebabs displayed . Under that was a small array of curries.  Kabobs did not disappoint, they were as good as I ever had. I went for a lamb curry with nan.  Beautifully spiced and perfectly cooked lamb.\nVery friendly helpful staff and very fair prices.\nI’m a fan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dC1uelBnEAE",
            "text": "Love it food excellent clean great hospitality"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OS0tLUxnEAE",
            "text": "Most awesome home-made Pakistani food in Bronx.\n10/10 taste.\nBudget friendly.\nStaff was really supportive. You can order on phone. They keep it ready and remain in touch with you."
        },
        {
            "date": "2년 전",
            "language": "ta",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dEktUmZnEAE",
            "text": "I love there garam garam Naan.  Naan chanay . Nehari and the delicious kabab ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxN05uOEpBEAE",
            "text": "Tried all the vegetarian dishes. Excellent! Well spiced and very flavorful. The folks who run the place were very nice and even gave me some pudding to try while I waited for my food to get prepped. Best Indian food I have had in the Bronx."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMjRiTV9nRRAB",
            "text": "Ordered here twice in 3 days, my girlfriend is obsessed with this place. I love it too, haven’t tried the rice pudding yet but the main dishes are very flavorful and delicious. The beef is amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNnNmdGpnRRAB",
            "text": "Amazing place!!!!!!! Been coming here for the past 4 years.they have really good food like kheer, chicken biryani, and chai. I would give the atmosphere 1 star according to American cleanliness standards, however as we know real tasty food will always come from restaurants that are like a roadside dhaba and according to that standards I would give it a 5. My only complaint is they only take cash, I wish they accepted cards and Uber eats, it would just be so convenient for the customers and for them."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJc3RQZXJBRRAB",
            "text": "I ordered 2 trays of Chicken Biryani for an event and it was super delicious.  The food was well cooked, chicken tender and juicy and the dish had a nice little spicy kick to it.   It came with a tray of salad and yogurt chutney. Food was ready on time and one of the staff even helped me out to my car.  Highly recommended."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bUlQODNBRRAB",
            "text": "Great little spot for Pakistani food, the goat curry and nihari are my go to. The bihari kabob also has great flavor but has had some insistent cook (sometimes over or under cooked). In a city filled with many mediocre and sub par Desi food places this definitely shines especially for options in the Bronx. Also helps that the owners are really nice and courteous."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLXJLYzRRRRAB",
            "text": "I just wanted to add my review to clear some people complaining about the spices and all so definitely it's a Pakistani restaurant so food must be spicy because it's the original taste of the local food of Pakistan if you guys have any issues with the spices so go somewhere else if you are here so just enjoy the delicacy.\nMoreover, I also read the review of account Rolex that I already reported to Google as hate speech beacuse he was giving review on personal basis that is totally inappropriate."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MGJHV1VREAE",
            "text": "Me and a family member came in - the food looked cold and old, we figured we give it a try being that we were looking around for a good local indian food spot. The lady said they mainly sell Pakistani food which is false advertising because…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtLUlEblFBEAE",
            "text": "The customer service is top hospitality yet swift. The naan and kebabs are incredible! The kheer/rice pudding is such a treat to have once in a while. It's sweet and has hints of rose water; mouthwatering!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNFp6LURREAE",
            "text": "There won’t be no next time for me.My chicken was raw in the middle,when I returned it they gave me the same chicken making it well done. So far I know, a return food shouldn’t enter in the kitchen because customer already touched…"
        }
    ],
    "reviews_count": 69
}