{
    "name": "Georgie's Pizza and Restaurant",
    "place_id": "ChIJ0clEGjPzwokRFLj4GgrGzuM",
    "grid": "BX7",
    "address": "3167 Bainbridge Ave, Bronx, NY 10467, USA",
    "rating": 4.2,
    "user_ratings_total": 67,
    "phone_number": "(347) 202-9901",
    "reviews": [
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLVHk5WTJIOGJHN2d3RRAB",
            "text": "Under new management, I am updating this review based on my last visit. I was disappointed in the apparent lack of awareness this establishment has for its neighborhoods residents and thier own staff. Please take a closer look at who supports your business and simply do better. If this review appears \"vague\" then thats exactly the awareness I am alluding to. Thank you for reading, a long time resident."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdGEzVlNSMjV4YTNwdk5rcHVMV2hHUVRCQmRIYxAB",
            "text": "Completely Wrong, Undercooked Order - Terrible Resolution from Both Restaurant and Uber Eats.\n\nThis was my first and absolutely last time ordering from Georgie's Pizza via Uber Eats.\n\nI ordered the Penne à la Vodka but instead received an undercooked Spaghetti Alfredo. This was a complete error on Georgie's part.\nThe resolution from both parties was unacceptable:\n\n-Uber Eats offered a mere $2.00 credit for a completely incorrect order.\n\n-I then contacted Georgie's Pizza directly about the $30.00 loss, hoping for some accountability. I was simply told there was nothing they could do.\n\nThe lack of basic customer service and decency from both Uber Eats and Georgie's is truly astonishing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMmJWRmZSME5JTFU4MFpFRklXRmxDWDJOS1pXYxAB",
            "text": "Good pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeVNGTkdSVVY2T0cxRlEwWlhhbVpsTVRKUFJrRRAB",
            "text": "Food is good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQk1HOXBMVFZpVjNaWFkxbExaVVkzUVdkZllrRRAB",
            "text": "Great food, friendly staff and I actually enjoy sitting there to eat. Its a nice spot to grab a quick bite or to order a whole meal for dinner. I hope they have a catering service too. (Helpful for the holidays to have good food around)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sb2QzSXdjMnhSVWpCblpXUTBiakpJUlROaFNVRRAB",
            "text": "A warm and welcoming place! The food was absolutely amazing, the space was spotless, and the atmosphere felt genuinely friendly. Everyone was extremely helpful throughout our visit. I highly recommend this spot to anyone in the area. It’s truly worth a visit"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMVNVNU5XVWM0TVdaaWMxZDFTR3R1YTBvelgwRRAB",
            "text": "Pizza suck tasteless very bland no flavor at all"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMWRrWm5NUzFWTVY5VmNVWllWMWQ0Vmxaa1JuYxAB",
            "text": "I was there for my lunch time on June 25, 2025,  the old man who wear glasses was so rude and take my order in bad manners and serve the food in a tray that had pieces of French fries , he made me felt so bad.\n\nHe have to change his bad attitude, special with Spanish women,  because I saw him do the same to another Spanish woman. 😡"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TmNtbGhSa3B2UVhCSFFubDFTVkZVWDJoS2RFRRAB",
            "text": "The food was TERRIBLE, I called and ask to make the chicken crispy. They didn’t tell me the chicken would be cut up and drenched in sauce. The pasta tasted unseasoned. Very terrible food, a waste of my money!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5T1dHdExVM040U1RSalExZHBaRVZRYld4bVgyYxAB",
            "text": "My son loves this pizza and he has autism and is he’s very picky. They’re very nice with him and treat him with kindness. I’ll order ahead and he’ll pick up or he’ll go in and order in person they’re awesome with him. So to him this pizza is top tier!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVZUUjFiamxmTlhsVWVsbFBUVVJWV0RabFNWRRAB",
            "text": "Back in the day it was sals now it's Georgie's and the pizza is absolutely delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbk1UQTNOMjAzWlhoblRrZDNkRzR4WlROeVkxRRAB",
            "text": "Their Plain cheese pizza 🍕 is so delicious!!!! I HIGHLY RECOMMEND THIS PLACE!!(*I got it with oregano*)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKXzNuX0M1X3NMUXN3RRAB",
            "text": "I’m sorry, but this place is horrible. The pizza is OK. The subs are garbage was way better when Sals was open."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJT0E4Y0h1eUltSXRRRRAB",
            "text": "Marone this pizza hits the spot just like sals did."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaV9mQXRnRRAB",
            "text": "I was born here in Norwood when it used to be known as Sal's but when I saw the restoration for it a few months back I actually was excited. Finally got around trying their food first on Uber Eats with Salmon Alfredo and it's. Absolutely. Delicious. From the freshness to the presentation and food quality, it really brought back if not better increased one of the iconic pizzerias here on Bainbridge. Please come here, every dollar is worth it ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdWUyMEpREAE",
            "text": "Excellent choices to choose from"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJZ1BqVk93EAE",
            "text": "My order was placed via Uber Eats. The one star is for The Sicilian slice. That was good. The baked ziti with meatballs, however,  was burnt and inedible. And they also tried to be slick by turning the meatballs upside down to hide the burnt side. Wow… some great guys you have working in that kitchen. I didn’t even bother to call the restaurant. If they would do something so sneaky like that, why would I trust them to give me more food to replace it ? NOT a welcome new addition to the neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaTVldTd3RRAB",
            "text": "The people here were extremely rude and UNPROFESSIONAL!!!!!!!!!!!!!!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dHQyR0hnEAE",
            "text": "Our new go to place for pastas . They are so delicious and the portions are great to have for the next day ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NXVIZVRBEAE",
            "text": "I love the pastas 😍 and the service is great. Totally Recommend 😉😉😁😁"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NVBlRjVRRRAB",
            "text": "I order a few plates of pasta and a few slices of pizza to try a variety of things. All of them were very good. The vodka sauce was really good and probably my favorite. The price was good for the quantity and quality of the food. Fair. I will definitely come back for another vodka pasta."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneDktdThBRRAB",
            "text": "Good and fresh. Pizza was satisfying. Overall good experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdC1lemZREAE",
            "text": "Pizza back on Point !! Has not disappointed since opening !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOGRTcGJnEAE",
            "text": "Had Georgie’s for lunch today! Pizza was good not the best. Good crust, average sauce and cheesy cheese! Looking forward to trying other foods on their menu!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeHVHaVJ3EAE",
            "text": "No good need tocoledown"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OWNtRDJ3RRAB",
            "text": "Their cheese calzone is SO GOOD!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bmJTLVZREAE",
            "text": "The place looks aesthetically pleasing but the food on the other hand is terrible. I ordered a slice of pizza & it was not the best, also ordered French fries…the French fries were still drenched in oil it was disgusting & customer service was not that great they walk away before you can even finish ordering…. Sorry but not coming here again!!! Everything went to the garbage."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aGQzandnRRAB",
            "text": "This pizzeria  just opened up and it is great !!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eE9USlF3EAE",
            "text": "buffalo wings are amazing, 10/10 and so tasty and much flavor"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX191aTNBRRAB",
            "text": "Definitely not Sals pizzeria I regret ordering this"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNi1IX2FBEAE",
            "text": "New pizzeria! Amazing food, service & atmosphere!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQZzZEZS1RRRAB",
            "text": "Very good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdmRXY2h3RRAB",
            "text": "I got the Mediterranean Delight,  seafood dish, with a side of broccoli sautéed with garlic. The Mediterranean Delight was perfectly cooked with a splash of Ouzo which stands above many of the other offerings in this neighborhood!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX3ZLZG9BRRAB",
            "text": "Amazing pizza & amazing atmosphere, everyone is so nice and friendly."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeTh1TnN3RRAB",
            "text": "El lugar es muy bonito,los trabajadores son muy atentos muy amigables ni se diga de la comida y pizza son riquísimos y el delivery llega muy rápido……"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzXzZfTF93RRAB",
            "text": "Really want to like this place..but have had 2 bad experiences..ordered meatballs and ricotta..when home found scorched sauce..overcooked meatballs..like when you scrape the bottom of your crock pot after reheatiing twice..this is unacceptable on a not busy sunday morning..."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOC1EQ0dBEAE",
            "text": "Absolutely delicious. Definitely recommended and will be coming back here again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzemEtQ0t3EAE",
            "text": "This place is amazing not only the food is good but the people treat you great as well. Their chicken wings are phenomenal and the pizza as well I recommend the wings all day. We love George’s and so does the kids!!!! -Nelson and kaylor"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzamZxaVh3EAE",
            "text": "It’s hard to find a good Italian food around this part of the Bronx and let me tell you this place has not disappointed me whatsoever. Great food and the service is amazing, they legitimately care about the service they offer. Super happy they opened this place 🥳"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHJfUUd3EAE",
            "text": "I will say while the place looks amazing and the food is good I do have one complaint or critique. I bought Alfredo pasta with breaded chicken. I’m not sure if they use this chicken for other dishes but the breaded chicken tasted like frozen school cafeteria breaded chicken. I wish they would actually use real fresh chicken it would be amazing. I know it takes more time but I don’t mind the wait for actual real fresh breaded chicken. Other than that the pizza is great and the service is 10/10.👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYa0tpcjRBRRAB",
            "text": "Pizza was excellent, cashier girl has excellent customer service skills."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM2Izd3RnRRAB",
            "text": "Very good food, very tasty pasta, delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdzlxQWdRRRAB",
            "text": "The Best Pizza and Pasta!!!!  Simply Delicious!!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYak9yOWt3RRAB",
            "text": "MUST TRY!! ALSO OPEN SUNDAYS! AMEN! Touchdown! Win!! Beautiful Classy upscale, clean New pizzeria. Try the “Regular Plain Slice”, its GREAT PIZZA! The Recipe is the old school Sicilian Italian New York Way! Just right!  Also, Staff is classy and Attentive. Been waiting for this place to open. its Very hard to find good traditional Italian Pizza in this part of Bronx. Yes, They Can compete with Louie and Ernies of Throggs Neck. Thank you George for opening this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuXzhlajFBRRAB",
            "text": "Amazing service. The owner is such a cool dude!!! Very welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURub3J5Szh3RRAB",
            "text": "Amazing pizza and service if there was 10/10 I would do that this place this is amazing must try  and don’t even get me started on the pasta I had the Alfredo and the penne Ala vodka which was by far one of the best pastas I’ve ever had in definitely coming back next week especially with the amazing service and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub3FLSVRnEAE",
            "text": "Honestly I’m so excited to have a a 5 star pizza back in the neighborhood… The pizza crust itself was amazing 🤩 I can’t wait to try the whole Menu… If you haven’t grabbed a slice then run don’t walk….. 💥 🔥 🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudU43QU9nEAE",
            "text": "Good pizza. I’d like thicker pepperoni slices then that would make it great. The sauce, the cheese, and crust had great flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMk5qMmJ3EAE",
            "text": "The Best Pizza Is Back Again In Norwood. The Pizza Is Amazing. Sauce is perfect. The Cheese is the perfect amount. Definitely a go to spot if you are in the norwood section."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX3NyeVVnEAE",
            "text": "What a great change not only inside the place but also the pizza. Thin crust that’s so light and airy, along with the taste of the sauce makes you want to eat more. Atmosphere is warm and pleasant and everyone is super kind and courteous. We are extremely happy to have a pizza spot where they cater to the community. This is truly a place to take a loved one for a pleasant evening to dine in. I can’t wait to go back. Highly recommend this place. ❤️❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNm8yTkdREAE",
            "text": "The food is delicious, very good quality products, the flour is unbleached, the sauce is AMAZING,  and the cheese is not greasy! As for the atmosphere there is nothing like that in the neighbourhood! The best !!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOXJ6RUhREAE",
            "text": "It was exactly what I expected from George!"
        }
    ],
    "reviews_count": 52
}