{
    "name": "The Bedford Stone Street",
    "place_id": "ChIJk08ILuVbwokRKBW-ON446RQ",
    "grid": "BX7",
    "address": "55 Stone St, New York, NY 10004, USA",
    "rating": 4.6,
    "user_ratings_total": 60,
    "phone_number": "(646) 346-6366",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RlF6RnNPVmN3VTFaTVlscGtlSFJOVW1KTmNGRRAB",
            "text": "This place was amazing. We went on an incredibly busy evening (Halloween weekend) but had reservations. We were seated in a sectioned off space and proceeded to LOVE everything about this place.\n\nThe service. The music. The decor. The food. All of it such an A+"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOS1YwbEtURjlyT0hwS05XcG9TemxCYVZSSlZGRRAB",
            "text": "For a bar they don’t have very many options for drink. Also a single beer was 16 dollars which is insane even for nyc. Bartender tried to gaslight me into thinking I was crazy for asking for a shot at a damn bar. Total ripoff!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NeWEzUlJkMnd4Tm1RNE5XbERURE5DTlV0dFlWRRAB",
            "text": "This place is genuinely good, I has an impressive collection of spirits and if you are a Mezcal fan you are in heaven"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCbFIwOVdaa295TkVRME1qVXhNblZ6UlVwd1ZrRRAB",
            "text": "Crab beignets were tasty, as were the Old Bay fries. Ordered a burger: neat, meaty, delicious. Recommend the Key lime brûlée. Drinks were fun and creative, perfectly strong. Will definitely be returning!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM2JqbDJjamd3ZGxjM01YZDJjazVrWlhWUVpWRRAB",
            "text": "Alright, I loved this place. The atmosphere...oh so cozy, the drinks...oh so crafty.  The food...a bit salty! The shrimp toast (buns?) were delicious, but the risotto and the brussels were just too salty. Don't get me wrong, we ate them...we were hungry, but I would introduce something sweet to the sprouts to balance....they were perfectly cooked and crispy though! The risotto and particularly the shrimp on top of it, were perfectly cooked as well, but soooooo salty.  Seriously worth mentioning again is how good the drinks here are. I had a clarified cocktail first and then the french quarter which is like a Veux Carre with tequila or mezcal I think....both were awesome. Service was excellent...we shall return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaWRVaFJTSHBCVWpCRlYwNURVbVZyTjJ4elRWRRAB",
            "text": "The food is excellent 👌🏽👌🏽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Qk9EaHZWMEp2ZFhsVlVFeHNXa3BzWlRWclJXYxAB",
            "text": "Nice bar restaurant. Nothing crazy with the food but prices are reasonable. Vibes are great. It’s like a cocktail bar in a middle of a crowded street. Staff is very friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMlJGaGZVRWRQYlRoWVpqZzRSakJaUjBoV0xYYxAB",
            "text": "First time here and everything was perfect! Great location, beautiful little spot and the food and cocktails were both outstanding! I was waiting for my boyfriend to arrive from work and the staff were so kind as to help me time the arrival of his cold drink and food right when he walked in! Theo, our server, admittedly made the entire experience even better! He was wonderful!! Will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWFRUTmZXVGxSU2sxNVNrazNRVFJNT0RsMk1WRRAB",
            "text": "Loved the food, ambiance and service. Theo and the manager (didn’t get his name) were great. The burger was delicious as was everything else. Love this street and will come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TlVsRktXazlLVFhwWGQyZExWMWxLZFRZMGJuYxAB",
            "text": "Nice food and drinks! Theo-who served was the best, friendly and funny:) Must visit if you are in NYC:)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWVgxRnhkVTlCTURCb2RTMVdURkJuVWxKdmFHYxAB",
            "text": "Lovely and unique date night menu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zM2NuaHVjMDlEUmt4R1VpMDBSek01U0dwelZFRRAB",
            "text": "Stopped by The Bedford on Stone Street and was seriously impressed. I had the Mole Painkiller—a smoky, spiced twist on a tropical classic—and it was one of the best mezcal cocktails I’ve had in NYC. The blue crab beignets were rich and perfectly crisp, and the Greek disco fries were pure comfort food with a Mediterranean punch. The mezcal selection is impeccable, clearly curated by someone who knows their agave, and that someone is Chema, the bartender and manager—easily one of the most knowledgeable figures in the mezcal world. Great energy, killer drinks, and a standout spot in the Financial District."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205clNtOXBWVXBzTVRjeU1VTnZjVWRGVGtKb2NXYxAB",
            "text": "Got a couple good cocktails. Great vibe!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUllYQm9YMGR1Y1V4VVV6WjNPV0ZHU0hSWldFRRAB",
            "text": "Love this new place on Stone street, incredible service, even better cocktails, and perfect date night ambiance. Will be my new go to in the neighborhood! The bartenders are literally the best"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeFNGWTNkelpSTTBsdGJYTkVWR0o2Y1RSVWIxRRAB",
            "text": "Loved it there"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPS044c21KNTVfMklBEAE",
            "text": "Minus one star for the 3% credit card fee. For a venue at this price point, cocktails are $1 shy of $20, it's truly a service charge.\n\nOtherwise, the Negroni is good, and the chicken is also very good. The other caveat is that the food comes with a very long wait.\n\nDo not recommend the Tuscan focaccia: it's actually a few small slices of bread with butter (tasty though). The risotto balls are more risotto dots (small)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmRqLU93EAE",
            "text": "This was a great experience and I loved the drinks. Elaine is an amazing bartender and she knows her stuff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNWVtdmZREAE",
            "text": "This place is amazing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNkxpb2d3RRAB",
            "text": "The food is so bad it’s actually crazy — went w six people not a single good bite of food. Felt sick after actually."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDhMZVZnEAE",
            "text": "Biggest selection of Mezcal in the city and the best food on Stone Street by far! Not only do they have the best selection, the bartenders will give you an education on Mezcal and sugarcane spirits."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRb3ZPUjZBRRAB",
            "text": "What a lovely surprise. I found this place by chance. It was Sunday night and it was not crowded. The atmosphere is great and the service is top notch. The food, not being amazing, is good and the wine was good too. The price is not that bad for NYC. A great place to have some bits and drink a good wine or cocktail."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaEl2d2xnRRAB",
            "text": "I finally came in to visit and the cocktails were all beautiful + the whole team took such good care of us. My favorite was the Sirenuse— fragrant and bright + the bursting lychee pearls at the bottom were a sweet surprise! Elaine, Miguel, and Chema were so kind and present and the tiramisu was the perfect way to finish our night. Thank you for a lovely evening !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRa1pTZTl3RRAB",
            "text": "As expected from mixologists like Chema & Elaine, the drinks at The Bedford are delicious, and their liquor selection is impeccable — very creative cocktails with amazing spirits!\n\nI showed up late with a group on a Saturday night, as we were mostly there for the drinks, so I can't advise on the cuisine, but, again, the cocktails are top notch, and the service was great. We hung out at the bar and had a great time.\n\nDecor is beautiful and Stone street has a whole thing going on, so if you're truly looking to explore not just Mexican spirits, but rum — from funky agricoles to mushroom-infused charandas — this is the place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnejV1NVJREAE",
            "text": "Incredible cocktail program, beautiful decor, and extremely kind staff. My favorite go-to spot on Stone Street."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM2Q3bkxREAE",
            "text": "Beautiful bar, great for groups or just a friend date or date night. Loved their cocktails and extensive agave list which is hard to find in Lower Manhattan. Definitely recommend the old bay seasoned fries- I couldn’t get enough!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdi0yemxRRRAB",
            "text": "Good cocktails"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNGQzWGlnRRAB",
            "text": "Outstanding place and the staff is welcoming every visit. I’ve lived in NY for nearly 30 years and don’t impress easily but this place is great. Also one of the most knowledgeable bartenders I’ve  experienced - you basically get a tutorial on any liquor on their shelf."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBenV1WVR3EAE",
            "text": "We came for the wine and stayed for Elaine ❤️❤️❤️❤️ cannot wait to come back.  Great drink, food and service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMEozMnpBRRAB",
            "text": "I tried so many delicious dishes tonight and everything was a first, it starts with the blue crab beignet, refreshing salad, world class steak that was melting in my mouth and fun service. The drink that I really love was the red margarita, you wouldn’t have expected it, but I will tell you first and, do it.!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcGE2VnhBRRAB",
            "text": "Came here yesterday after work, January 7th around 445pm.  Nicely greeted by the staff as he accommodated us to enjoy the beautiful upscale ambiance.  Relatively new restaurant, great decor and excellent cocktails! And the service was impeccable with all staff we encountered being professional, yet warm and friendly! The music added to the experience and I am sure you will enjoy this tasteful, warm and beautiful restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMHRUU0JREAE",
            "text": "This is an exceptional cocktail bar with great food. Came with my wife and a friend before seeing Life & Trust and it was so good we returned after the show.\n\nThey had some of the most interesting and delicious cocktails I’ve had in a while. Their Painkiller was mole fat-washed and had an excellent silky mouthfeel and delicious fruit flavor without being too sweet-I was worried it would taste like corn, but didn’t find that to be the case despite the corn noted in the description. La Isla Bonita was another highlight, which was a clarified milk punch where the Rooibos and apricot flavors complemented each other well.\n\nFood highlights were the crab beignets - more like crab cakes vs actual beignets but the accompanying remoulade was really good - and the fried chicken sandwich, which was possibly the best I’ve had with multiple thin layers of fried chicken.\n\nAmbience was also very nice, dark, and intimate, and service was great. I appreciated that the staff entertained my cocktail questions, for example, the bartender came to our table to explain how one was made.\n\nHighly recommend, and I’ve saved this to my Google Maps favorites."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dnFpLUtBEAE",
            "text": "What a gem. Finally Stone street has a cocktail bar worth traveling to. A lot of the bars on that street are same-same but different - this spot is another caliber. The only reason I gave it 4 is coz I didn’t try the food yet. Standby on that"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b3JxeDlBRRAB",
            "text": "Disappointing second visit here last night, to the point that I wont return.\n\nAfter dinner at Fraunces Tavern my group of 5 decided to finish the night at The Bedford since I had previously been there a week prior (and spent $200 on drinks with a couple of friends). We all work in the area and were hoping this could become the new after work spot.\n\nMy friends ordered four cocktails and I ordered a glass of wine (cabernet franc). When my glass arrived it was noticeably a small pour. I politely asked the bartender “is this a full pour,” to which they replied “looks like it.” It wasn’t. Instead of just adding a bit more he went over to someone else, said something and came back with measuring tools. He poured some water at 5oz into another wine glass using the measuring tools and then compared it side by side with my glass. As I had suspected, it was short. It was around 3 ½ oz (which is just over a taste) instead of the industry standard and expectation of 5oz. If you’re a bartender and can’t tell the difference between those two pours then you may want to recalibrate your career, and putting on this spectacle to make a point (which flopped) was just embarrassing for the entire establishment.\n\n“I’ll top it off,” he said. What? Top it off? You mean finish the pour? No apology or anything. Instead, it was some big show with measuring cups and side by side comparisons. As if that wasn’t enough, after he “topped it off” he went over to other bar staff and began talking about it. People would look over and quickly go back to talking to him and others would join in. Each person that would come to the bar he’d mention the ‘incident’ to. It was very off putting and went on for the entire duration we were there.\n\nMy friends and I had hoped to stay until close (we arrived at 9:30) but decided at this point that this was a lack of professionalism and that we would take ourselves somewhere else (we went to the Dead Rabbit and spent $400 there between food and snacks).\n\nAs someone who plans 20-30 happy hours a year for the Wall Street tech hub I was hoping that this would become a new favorite go-to for my employees. And since I’ve followed Charlie on social media for quite some time now I was hoping he may perform there and I could take the office for crooners and cocktails.\n\nI had planned to bring some folks in for drinks this Friday after an office holiday party but we’ll go somewhere else now.\n\nGood luck.\n\n🍷"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M09xZGJBEAE",
            "text": "Great place! Amazing cocktails and Amaro selection! Highly recommend Brussel sprouts and Bucatini. Kevin was awesome 👌"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbkpEVk9REAE",
            "text": "Absolutely banging list of agave and sugar cane spirits. Phenomenal cocktails. Beautiful space. Great staff. A clear high point down on Stone Street."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMWVieWNnEAE",
            "text": "Amazing addition to the dull bars of Stone Street. Food is fantastic and cocktails are equally delicious, the Mole Corn Pain Killer and the Green Margherita with Chartruse were the favorites.  The Blue Crab Beignets were the highlight of the apps. Oysters were super fresh and shucked well. Will have to be back for full dinner soon."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbnJHWGFnEAE",
            "text": "LOVE this place - so cozy and welcoming and very stylish. They make amazing cocktails and we also really enjoyed our meal - recommend both the hanger steak and the Murray's Farm Free Range 1/2 Chicken and for dessert we had the creme brulee which was amazing. We started with the burrata which I found underwhelming but otherwise everything was fabulous. I also didn't care for the $5 charge for using credit cards. That aside, however, I will definitely come back here when I'm in this part of town."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaHFhU1V3EAE",
            "text": "Delicious cocktails and amazing selection off Mexican spirits."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ1o2bDF3RRAB",
            "text": "Really cool spot.   Food was great.  I am torn on the rating though.  I think it has potential to be a 5 but my experience almost makes me want to give it a 3.   I landed on 4 because the food was very good and the service was very friendly.\n\nFood: we had the Blue Crab Beignets which were very tasty.  I really liked them.   For mains we had the Sea Bass and Hanger Steak.  The fish was cooked perfectly and the sauce paired perfectly. The steak was also excellent.  Cooked rare inside but nicely done on the outside slightly charred.  I think the portions were a little small IMO.  I am not one who wants huge portions.   I think that is a waste.  But I was still hungry after eating the meal.\n\nService was friendly and prompt.\n\nMy issue was with drinks.  I wanted a scotch and they didn’t have a big selection.  The first I chose they only had the 25 yr which is very pricey.  The 2nd I chose they came back and said they were out of it.  The 3 rd I chose from a few they named, they brought the wrong one.   And when they finally brought what they said was the right one I am pretty sure they just gave me what they originally poured because it didn’t taste like the one I wanted and the bill confirmed that.   This is why I almost want to give them a 3.   In the end, What I was given was still fine and would be about the same price.  And by then I was done with the back and forth.   I would think they would have a better selection of whiskey though.\n\nI would give them another chance.  The bar looked like a great place to sit as well.  And Stone Street is neat area to check out.\n\nIf you found this helpful follow me for more reviews."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMjkzVTd3RRAB",
            "text": "Excellent service and food, as well as a beautiful selection of agave and sugar cane distillates, not to mention the incredible, unique and interesting cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd3JHbHVRRRAB",
            "text": "Love, love, love this place! From carefully crafted, complex cocktails to the au fait, friendly staff, The Bedford Stone Street is the perfect place to enjoy your evening :) I will be coming back again and again!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYelpDVW5RRRAB",
            "text": "Was so happy to stumble on this gem. Rarely review but with drinks that good, staff that knowledgeable and attentive, and food that hit the mark in every way, how can you not. Maria was the perfect bartender and the vibe was literally just right. Food was not the typical cookie cutter blah. Everything was different, interesting, and hit the spot. Mescal selection also great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURYeXN3SxAB",
            "text": "Not all chic NYC bars make good drinks. But their drink with Mezcal and Rum were both unique and good. Chema the beverage manager explained the cocktails very well and our bartender Kevin made us very comfortable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa3E3QU53EAE",
            "text": "This is a very nice and solid place. Had a drink late night recently and it was awesome. Was with a group we all enjoyed the specialty cocktails made by the really friendly bartenders. Lots of great ingredients. Check this place out..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdU1ub2RBEAE",
            "text": "Wonderful new spot on Stone Street. The cocktails and food are fantastic and a little more sophisticated then what the rest of Stone Street has to offer. We had the Risotto Balls, Shrimp Roll Sliders, Arugula & Granny Smith Apple and the Old Bay Fries. Everything tested excellent, but the Shrimp Roll Sliders were our favorite. For cocktails we tried the Ondatropica and the La Isla Bonita, both were well composed and delicious. Our waiter Abu was a delight and very attentive. Highly recommend visiting this new spot. I will be back for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNjkyTXJBRRAB",
            "text": "New kids on the block!\nAgave and sugarcane spirits with great cocktails 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcWV5QXFnRRAB",
            "text": "New spot for a happy hour with excellent cocktails"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeHJXazB3RRAB",
            "text": "*A Must-Visit Epicurean Delight on Stone Street!*\n\nI recently had the pleasure of dining+drinking at this new gem on Stone Street, and it exceeded all expectations! The ambiance strikes the perfect balance between vibrant and cozy with a mix of creative and bold flavors. From the craft cocktails to the small plates, every bite and sip was an experience.\n\nAttentive and friendly staff enhanced my experience making excellent recommendations for my visit. Definitely a new favorite on my list that is walking distance from my job, will be back!"
        }
    ],
    "reviews_count": 48
}