{
    "name": "Wai Kang",
    "place_id": "ChIJZ0L8LXbzwokR4KEm8nWR2oI",
    "grid": "BX7",
    "address": "39 Bedford Park Blvd, Bronx, NY 10468, USA",
    "rating": 4,
    "user_ratings_total": 176,
    "phone_number": "(718) 933-2797",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kS1VYTnVia1JrYkhoaFNYbzVZemRTZDFOSFNtYxAB",
            "text": "Everything is great except the fact that everytime I ask for soy sauce and hot sauce it’s literally only 2 for a 2person order like I express it all the time can I get a good amount of soy sauce and hot sauce"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM1oyUTJTbHA1VERKNGIzZ3RiQzFXV1RkdGVuYxAB",
            "text": "I Found hair in my chicken & broccoli 🥦, an there response was to laugh! I'd never eat there again, THERE DISGUSTING.…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPZnFuZFczbElLbi1nRRAB",
            "text": "Food has changed alot over the years but still overall good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMcWZvODNDdnVtYmtnRRAB",
            "text": "Food was oily and old the chicken was so hard you can barely even bite on it."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcWEtVFhREAE",
            "text": "At the time of my visit it was very good food, clean, have seats and owner turned on the heating system. Nice place to eat."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNEpLV3J3RRAB",
            "text": "Great place great food can't complain."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMDRmbXBnRRAB",
            "text": "If I could give them 0 stars I would, for terrible service + the food was terrible. I'm so mad I wasted my time with these ppl today. I don't usually give bad ratings. I'm very lenient with when it comes to things like this, but not this time. Not only were they rude while taking my order (that shouldve been red flag #1),  but they don't follow instructions and they're cheap. I asked for 3 condiments... they add the wrong condiments and only add 1 pack of each with the exception of soy sauce. They generously gave 2 packets of those 🙄. I specifically asked for ketchup. The food arrived oily and messy. I asked them to cut up my chicken wings. Chicken wings were not cut up and looked old and were in the rice messy. The food wasnt even hot like they just prepared it. The onion rings were soggy like they were placed in a microwave and heated up. The egg roll had shrimp with doo doo still in it.  Never again will I order from this place. I ended up throwing everything away. 😡"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTVMQ0x3EAE",
            "text": "I have been eating there for years already,  the chicken noodle soup is great, also the Chicken MeiFun is delicious, they are very nice and friendly."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a2J5UEpnEAE",
            "text": "If you compare it's much cleaner inside than other Chinese restaurants and they constantly wipe the table after use. Also their price is a bit cheaper than other similar spots"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNXZ5SzBnRRAB",
            "text": "The guy on the phone was really rushed and rude. The dumplings tasted undercooked and slimy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMHV6VXZBRRAB",
            "text": "The food is decent"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdUpfa1ZREAE",
            "text": "I ordered the beef noodle soup, and it really was not that good. The beef tasted like it was mixed with some foreign substance and tasted like rubber. My friend ordered the fish and fries, and the fish tasted undercooked when I tried some. The lady working at the counter wasn't mean, I don't know why everyone says she is. I really do like family run Chinese restaurants, but this one definitely isn't one I'll be revisiting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdXZ1V2RnEAE",
            "text": "I Oder food from here and my food tasted funny and made me feel drowsy never again will I order from here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaE1Ha0JnEAE",
            "text": "Small place but food it's soooo good. I know they may not speak a lot of English but customer service in the counter (by the lady) needs to improve a little. Delivery guy is very friendly and nice. I always make sure to tip accordingly."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydDhfTmVREAE",
            "text": "Recomendado ese lugar 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaHFfOWdnRRAB",
            "text": "Good and affordable place. And it’s right by the train! Call in your dinner order after work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaTZDR0hREAE",
            "text": "Everything about this place sucks....from the food to delivery time it all sucks!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNzlfZC1nRRAB",
            "text": "They took too long and I don’t live far the food taste like old oil the chicken was hard and the fries taste old just like the chicken 🤦🏾‍♀️ Never again…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaG8zeU5BEAE",
            "text": "If you are into fancy dishes. They have all the typical Chinese menu items. Plus lobsters and Chinatown Chinese noodle soups, Thai Chicken wings etc."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcXJqN3p3RRAB",
            "text": "Great Chinese food cleaning establishment professional customer service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dW9DT0dREAE",
            "text": "There food in general it's the best tasting around ,, my specialty it's there lobster cantonese style it's superb , it's the regular small size 1 -1 1/4 lb size , but there willing to accommodate you for a pre  deposit to order a 2 , or 3 lb one as well."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0ZzRIN1h3EAE",
            "text": "El pato rostisado, 😊 con su arroz blanco / vegetales bueno 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURON1lEYWl3RRAB",
            "text": "Good food for the price.\nService good. It's worth the visit"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNFllNEdREAE",
            "text": "Great Chicken wings!! I know Chinese takeout spots are infamous for their chicken wings but this spot hands down has the best I've had in the city!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZzlyUktnEAE",
            "text": "Excelente trabajo"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNXNQY0N3EAE",
            "text": "Malísima la comida me enviaron una orden que no era lo que pedí y cada vez que llamaba para devolverla me cerraban el teléfono tuve que botar esa comida y comprar en otro lado"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLTZYLWNnEAE",
            "text": "I ordered 3 meals from this restaurant and an icetea for delivery. I don't live far from this restaurant . THEY NEVER CAME!!!!!!!!! after an hour went by, I decided to give them a call just in case maybe they got my address wring idk They answered to say that they were very busy today, but my food was already on its way, so I thanked her and proceeded to wait. Another hour went by, and at this point, my kids were upset and hungry. I had to get food from my local deil. VERY UNPROFESSIONAL!!!!!!!!!!! 6:32pm. was the time I placed my order. I'm in bed it's 11:45 pm, and I get 2 calls from 2 numbers that were not the restaurant. One number processed to text me to say, \" Hi!\nThis is the Chinese food, sorry to bother. Please call back at your earliest convenience!\" ............ THIS IS A BIT SCARY 😨\nI have never ordered from them before, and I will never again what a waste of time for me and my family. I feel like this restaurant really needs to get their business together. DISRESPECTFUL!!!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsN2FQakZBEAE",
            "text": "Fast service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaTltS3RnRRAB",
            "text": "Waited 1 1/2 hours for my food. Every time I called they would say one minute. It was frustrating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbnJQeVdBEAE",
            "text": "A Hidden gem just off Grand Concourse by the D train station in Bedford Park Blvd. Customer Service was quick and very responsive i'll give them that. However I ordered off the menu A.23 Braised spare ribs combo with pork fried frice and got Nightmare on elm street in a container basically received rib tips with mixed vegeatables drowned in red sweet sauce. The only thing good on this dish was the pork fried rice but tell me guys does this look like braised spare ribs, I don't so. Overall i like this restaurant and will order again but not as often as i hoped i would so if in the Bedford bronx area and looking for a quick bit for under $10 then this a sure location to come to just don't order  A.23 you'll end up in the boiler room lol!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaU1IMlRBEAE",
            "text": "I been eating food from this Chinese restaurant like since they opened up it's been so long I can't even remember, it's the only place I get Chinese food from my family also and it's the only place we trust the food it's next level,they don't deliver to were I live at to my family place either so we get it once a month or every two months because we have to go in the car but I get mine delivered by my family 😂,the lady that takes your order is so nice we known her for so many years and you can eat inside it's so clean I recommend this place."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOExDbjhRRRAB",
            "text": "During a time of inflation, food costs along with gas prices, Wai Kang will cheat you. I've purchased shrimp egg fu yung only to find 1 shrimp in the omelet. I ordered extra shrimp  and bean sprouts only to find 1 bean sprout. Either someone ìs not listening or someone is purposely doing this. Either way, it needs to be corrected. And as I have said before, they are using water from the street to mop their floors where customers eat!!!  They need to improve in following orders to the customers satisfaction!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKamRYamlnRRAB",
            "text": "The best Chinese food in the hood. Hands down!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdGJEOGNREAE",
            "text": "They where not friendly, it could have more cleaner, & too hot, get air conditioner"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMElmQlBREAE",
            "text": "The best on bedford park blvd\nTheir fried rice is delicious!\nI love it ♥️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCX2I3QWNBEAE",
            "text": "This place is in the BX, i live 25 minutes away sometimes 30 when to much traffic. One hour back and forth worth every penny best Chinese food in the Bronx and Yonkers.\nHighly recommend!! Thanks to the cook's they make their food with real Love."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMnJXdjJRRRAB",
            "text": "The fried rice wasn't bad but the chicken wings were a bit salty still my favorite in the local area"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQta2FDWElREAE",
            "text": "The food is great and they have so many different options compared to the traditional nyc Cantonese/Schezchuan spots but God help you if the guy answers instead of the girl. You might not get what you ordered but it will be delicious.\n\nGet the wings, any of the soup bowls, any of the shrimp dishes or any of the steamed dumplings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtb2NLN2FBEAE",
            "text": "This place . Is great good food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLXR5TVZnEAE",
            "text": "I ordered pork fried chicken rice but the rice was raw. This Chinese restaurant cooks very hard and raw rice. Never come here if you are looking for a Chinese restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldjcyR3NnRRAB",
            "text": "Worse restaurant ever, the worse customer service , rude unfriendly and non professional employees, not clean at all eat while cooking, no mask , no gloves. Would never buy food again or recommend to anyone else."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcDl6TlhBEAE",
            "text": "I really love this place. The ambiance is really nice and it’s family owned. Been coming here for twenty years and will continue to come."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OF9uTmdBRRAB",
            "text": "The female that is usually there when I go there in the evenings is so rude. I like toppings such as maybe hot sauce or barbecue sauce. When I order ribs. They always close the container before you get a chance to tell them to and then get an attitude when you ask him to open it to add the sauce that they probably should have asked you in the beginning if you would like, other local takeout Chinese restaurants ask you. If you don't ask for anything, you just don't get it! They are cheap with giving sauces like duck sauce, soy sauce, any sauce as well and no napkins. Unbelievable. The food is average."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOXNlc2lBRRAB",
            "text": "Comida es muy bueno."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNUs2T2ZnEAE",
            "text": "The fried rice is very hard,not enjoyable to eat"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya0pqTDhnRRAB",
            "text": "Isn't good that bad taste food and raw dough. I don't like this food service isnt good rush cooking and lady attitude rude. Bum foods 🤮…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdFBXRFpREAE",
            "text": "honestly one of the best takeout restaurants in the neighborhood. reasonable prices for a huge portion that's absolutely delicious and tasty. definitely give it a try if you haven't already!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcHRfZGp3RRAB",
            "text": "Great food. And good prices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteXBLWm9BRRAB",
            "text": "So good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdEpPeUpBEAE",
            "text": "Ordered the General Tao's tofu lunch special, it was very tasty. There was an ample amount of food for only $6.50. I would have given them 5 stars if they had the donuts they lost on their menu but they don't have them anymore 😔"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2OE5XZ2xnRRAB",
            "text": "I  ordered shrimp with Chinese vegetables. But the sauce was so salty. I had to throw it out. I had such a craving for a good Shrimp Pad Thai. I’m Spanish I make a better Shrimp Pad Thai and I make it healthier also. So now there’s no healthy restaurants around here. Such a shame."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxM296ZmR3EAE",
            "text": "The food is gross. They used to be the best, but I recently ordered chicken lo mein and shrimp and broccoli and was shocked.  I don’t know what was in the lo mein but it was NOT chicken it was smooth no texture and made my kid sick.  The…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxOU5ia2NnEAE",
            "text": "Got really bad food poisoning from this place for a week.  I ignored the first bad sign: I often found food that wasn't supposed to be in my order.  When a restaurant cross contaminates, it means they are careless.  Also, the oil tastes old…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJenJ6cEtnEAE",
            "text": "The noodle soups were awesome. Definitely recommend, also I recommend the dumplings. The dumplings were on point, the dough and meat ratio was perfect. Also, the scallion pancakes were spectacular, the dough is crispy and the filling is really appetizing. The teriyaki chicken, or known as chicken on the stick were juicy and the chicken were tender. Customer Service 10/10. The Springs rolls,were also very savory and enticing. I’ve been to this restaurant for 5 years already, and I’m never disappointed by its food.\nOther Suggestions:\n-Ma Po Tofu- spicy,but not overpowering.\n-Shirmp Toast- the toast is very crispy, and I usually get it with some tartar suace, which is 10/10.\n-Fried Fish-crispy\n-Boneless Spare Ribs\n-Crispy Chicken"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdmRfeVhREAE",
            "text": "I order from this place all the time. The food is really good, some of the best Chinese food spots in the area. Their cheese wontons are awesome! Their General Tso can be off some days but still tastes great. Fast delivery as well, they'll…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd3BIeC13RRAB",
            "text": "Nah man, idk why this place has so many stars. I moved to the area recently, ordered orange chicken with pork fried rice and it tasted gross. The chicken doesn't taste like chicken idk what animal meat they used but it's disgusting. Even the meat in the dumplings tasted suspicious. I'm not ordering from here again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJMnJLbEdREAE",
            "text": "It was the most delightful fast food restaurant I ever saw. The lady was nice and they even gave out calendars. It was a nice experience and I loved the Chicken Pad Thai.😏…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4al9XbDlnRRAB",
            "text": "Nothing special. Just American style \"Chinese Food.\" After eating Chinese food in Asia, this is just food. Nothing has wowed me. But the place is clean, bright and does not smell of rancid burnt oil."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnb1lMUjNnRRAB",
            "text": "I suggest the seafood or roast duck noodle soup. It was delish. Fried fish was on point very crispy, definitely recommend the fried chicken dumplings. This resturant has a wide variety of food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaTdELWdRRRAB",
            "text": "I was here yesterday for the first time and fell in love with this Cantonese shop! the food is delicious, the staff is friendly, and the space is well kept. Will be returning again! Definitely recommend."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURva09ldDBRRRAB",
            "text": "My first time purchasing Chinese food from this restaurant,&from the taste of the food,,It taste VERY WELL done.ALSO the CHICKEN WINGS Are Also Good/BIG like this\"CHINESE RESTAURANT Back in the 80s/90s,,Called(MAYMAYs)2nd AVE-SPANISH HARLEM…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ajZHdi1RRRAB",
            "text": "Love the food, and the people at work love it now too! They'll deliver over to Monte. Service good, orders correct, fast and yum!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4OFpqNVdREAE",
            "text": "This is the best Chinese food in this area! They are family and treat you like as if you’re family! Great service,food and service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHODluZEhnEAE",
            "text": "Best take out Chinese restaurant. House special soup and beef szechuan are awesome. Highly recommended!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bTRxSGxBRRAB",
            "text": "They’re  the best, we have been ordering there for years, nice people, delicious food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5aFl1U05nEAE",
            "text": "My favorite fast food Chinese restaurant outside of Chinatown.  Food is fresh, and very tasty."
        }
    ],
    "reviews_count": 66
}