{
    "name": "TACO INN",
    "place_id": "ChIJiy1RH6rzwokRAxYnHK86OuM",
    "grid": "BX7",
    "address": "9 E 208th St, Bronx, NY 10467, USA",
    "rating": 4.3,
    "user_ratings_total": 39,
    "phone_number": "(917) 693-0121",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseWVXdGFYMjVPTWpCTWREQTJkMHhRUTJsbWNuYxAB",
            "text": "Wow the best clean música excelente highly recommend. Server amazing 10/10 Klk con klk"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVptbHNaa2hDVDJGc2JXWlNTWEl4ZEVGblRtYxAB",
            "text": "I called to make a delivery and the person on the phone was extremely racist over the phone for no reason and hung up on me"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1ZXTlFPRzFaTUZNeE0yNUdhblUxU0d4bE1WRRAB",
            "text": "I'm not the type of reviewer that likes to embellish and overemphasize a review of a restaurant. If the service is good I recommend it as good. When the food quality is outstanding and the order is out in record time I usually just say it without overstaying the obvious. I'll make an exception for Taco Inn only because they so deserve it (and then some). Im a huge foodie and a restaurant fanatic. I love to eat good food specially when there's an atmosphere that makes the experience a wonderful moment. This place rocks. Everytime I've come here I've been wowed (which is not easy for a critical mind like mine). It has become my favorite local restaurant and will remain so as long as they continue to work hard to make every visit a memorable one. I HIGHLY recommend this place if you're looking for the absolute best bang for your buck. I still don't know how they stay in business with the quality output vs low prices that they currently have. Happy dining!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVmNqSk5RVEJuT0ZveFVHWXdTVGxKZFdoelJsRRAB",
            "text": "I don’t know if the female server was having a bad day but she was extremely rude to me for no reason I didn’t have any interaction with her other than her handing me a menu then walking off. After about 15 minutes of waiting which wasn’t an issue for me at all because it was a little busy the bartender took my order and served me my food and drink. At some point I asked for a fork because I was sharing a meal with a friend I kindly got her attention and asked her for a fork and she looked at me with a nasty look and literally shoo’d me off with her hands and nodded her head like (a yeah yeah type of thing)and stood standing there for several minutes I was confused I waited like 10mins then walked to the bar and asked the bartender for a fork he then asked her to get me a fork and she gave me a stank attitude again and shood me off again telling the bartender I already have a fork. It’s unfortunate because the bartender who is the owner was very nice and professional."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaWFHZFhZVTQ0TWxST05WSjBUMnRMYlVnd1RWRRAB",
            "text": "Food was excellent and the restaurant looks very nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oS2VsaEtSRTR6TUhSYU9USXhkM0pWTlVoMVRsRRAB",
            "text": "Not interested."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKMnd2WUxhNlpmdUFnEAE",
            "text": "What a strange experience. I recall having a rather long wait time for our food, and the waitress asked if \"everything was okay\"...while we were still waiting for our food. The music that they played was just the same song on a loop, over…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOLWlfOXF3cUphQW1RRRAB",
            "text": "Tacos were dry and bad. Salsa was tomato sauce. Service was slow. 10% tip added automatically and then asks what more tip you wanna pay."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaXZvWnFnbk12UHR3RRAB",
            "text": "Amazing place always go there with my mom for happy hour lol"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk4zbFp3EAE",
            "text": "It was my husband's and I first time and will state we will be back. The service was great..did not wait long at all. The drinks were delicious. We happen to go during happy hour and yes we were happy. The place is clean...music playing in the background but not too loud.  The food was delicious...we were impressed. I usually do not eat the rice and beans with my main dish but we end up eating that too and enjoying it too. I love Mexican food and this place will become a favorite spot. ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODdld3NBRRAB",
            "text": "Best tacos I've ever had in my life!!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU5QT0NBEAE",
            "text": "Muy buena su comida, lleva el estilo y sabor mexicano"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN3BMUFpBEAE",
            "text": "El mejor restaurante mexicano del área sin duda alguna! Aparte su personal muy amable, siempre atienden muy bien y ni hablar de su happy hour y Tuesday taco simplemente lo mejor! Trato de ir al menos una ves a la semana por esas margaritas tan ricas!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOUtYYTJnRRAB",
            "text": "Gusto mucho ir a comer ai buen aviente"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOTd2MHJRRRAB",
            "text": "It was great"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcVk2Z2VBEAE",
            "text": "Buena comida buen servicio y las tortillas recién hechas ojalá y siempre sea así el cervicio oh y las bebidas preparadas me gusto la que yo pedí que no recuerdo el nombre"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOU9ILWxBRRAB",
            "text": "Tacos was nice tasty and juicy (the person below me cappin!) Drinks were good and just right. services was nice and fast. Salsa for chips was underwhelming but still had a nice experience."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaTk3VlJREAE",
            "text": "Excelente lugar, buen ambiente, comida deliciosa, tragos geniales.!!\n\nExcellent place, good atmosphere, delicious food, great drinks.!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MmZpZzJnRRAB",
            "text": "The food it’s was amazing I recommend 100%"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2a2JIWHFnRRAB",
            "text": "The chicken burger tastes so good. It was juicy, creamy. The fries was good too. Most probably the best chicken sandwich i have had so far."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN196Y1dnEAE",
            "text": "We were in the neighborhood and just wanted to grab a quick bite. We saw they had taco Tuesdays and each taco was $2.50 so we thought would give it a try. Our server was nice enough and the decorations on the walls were also nice to look at, but unfortunately, the tacos sucked. I ordered one pork, one chicken, and one beef. They all tasted the same…DRY. The best thing there was the green sauce and even all the green sauce in the world couldn’t cover up the dry cardboard they called meat. Their homemade chips were pretty good, but the salsa wasn’t, tasted like tomato sauce. I also didn’t appreciate that they had a 10% service fee without saying anything. I understand it, but didn’t appreciate it. However, we still gave them an additional 10% on top of that but only because it’s not the server’s fault the food wasn’t up to par."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc3BUeTVnRRAB",
            "text": "Pésimo, tardan demasiado 😑 en preparar la comida fui orden pechuga ranchera tardaron casi una hora en entregarme mi orden 👎👎👎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuem96ckNnEAE",
            "text": "Happened to come in after walking past a few times and I'm not disappointed at all!!! Sal is great!!! I missed the happy hour from 12-6 but I'll be back for that for sure. $7 drinks & $20 buckets of beer!!! 2.50 TACOS on taco Tuesday!!!!! I'm in here!!!! I'm having some taquitos fritos with my Goose Island IPA. Real chill & Kool vibe and atmosphere for the Bronx. I love it. My new neighborhood spot."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIejRuVjl3RRAB",
            "text": "Excelente servicio, se los recomiendo la comida esta deliciosa,  el ambiente ni se diga."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINGRUbWFnEAE",
            "text": "Quick service and great food"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMXNUR1N3EAE",
            "text": "Visitamos este Rest para mirar la pelea de Canelo vs Berlanga⭐️⭐️⭐️⭐️⭐️servicio, precio, y ambiente!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIenFTblZREAE",
            "text": "Pedí delivery y me sorprendió la rapidez comida tiene buen sabor y precio considerable pague $35 por unos nachos de bistec una quesadilla de pollo y una horchata pequeña tendré definitivamente a  comer al restaurante"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINEplQnZ3RRAB",
            "text": "Beautiful modern mexican decor, classy elegant, safe! great customer service, fast service, good drinks, nice place to go on a cute date or meet with friends after work to catch up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MWZIbERnEAE",
            "text": "Excellent food!!!!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3X1B1NE1REAE",
            "text": "Muy buena atención,  la comida sabrosa. Las bebidas frias y dulcitas."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMV9PRmxRRRAB",
            "text": "Ordered a burrito and requested it be quick, server was nice enough to relay the message. My food came out quickly and it tasted great. I would definitely come again to try other dishes on the menu. The restaurant was clean, it was a bit empty ( I went after the lunch time rush ) and the prices are good. Overall I had no complaints."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaEtLYnNRRRAB",
            "text": "Excelente servicio"
        }
    ],
    "reviews_count": 32
}