{
    "name": "Emilio's of Morris Park",
    "place_id": "ChIJOwc5k6X0wokRuoqLo5MLonE",
    "grid": "BX7",
    "address": "1051 Morris Park Ave, Bronx, NY 10461, USA",
    "rating": 4.3,
    "user_ratings_total": 1288,
    "phone_number": "(718) 822-6758",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeVgwcG9RbVJ1ZDI5QmNFSlpWV0ZXU1ZGcU9IYxAB",
            "text": "Dined in and out...WHITE SLICE PIZZA"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1FYWXlOV3BVT1djMFVXcGtZa3AzYms1eE5rRRAB",
            "text": "Ordered a chicken parm with spaghetti. This was the driest chicken parm and spaghetti I ever seen. Smh. My kids slices tasted bitter. Patricia’s or Patsy’s from now on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xd1N6VTRkMDFPTUU5S2VtTlNUM2QzUkROa1pYYxAB",
            "text": "Good options for a quick run in. 10$ minimum for card. Food wasn’t bad and tasted fresh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKak0zQllla0ZUVGtsaGNIRkRTVGhpUmpBNWMzYxAB",
            "text": "Great pizza option for a quick slice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweFNVOTFXVlJpV0ZseFpGZE9TRVZJWTFJeE0zYxAB",
            "text": "After seeing their advertisement on TV, I had high expectations. Food is pricey (ex: slice of pizza was $4.50 for ordinary size). Many choices on menu. Mini canzone was barely warm. Pizza sauce tasted sour. Unfortunately I was very disappointed and doubt if I'll return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaWIzbFFVWEJzU1ZaNWNtdE9TbUY1WTBwR1QyYxAB",
            "text": "Food pizza everything is A mazing!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRWRFZE1VaTA0U20xeldWWm9hSFJNUTE5elVYYxAB",
            "text": "They fell off. This is one of my favorite pizza spots but after my last few visits I detected the quality of the pizza was changing. Then on my last visit this week, my suspicions were confirmed. I ordered 2 slices and a meatball roll. One slice with pepperoni the other with sausage. Both were tasteless and lacked sauce and definitely not enough cheese. The roll was the same as the slices. ZERO sauce in it!!! Bland. It had the same \"sausage\" that was on the slice! Just a waste of money. This place had the best slices you could get in New York, forget the Bronx. Regardless of the higher prices it was worth it. A staple of Morris Park Ave. Don't know what happened but I hate seeing iconic restaurants like Emilio's fall off. Hope they can fix whatever is going on. Sad way to go out. I probably won't be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRFFWUnpTMHQzUkVkVWFDMVBTV1ZaUW00dFlXYxAB",
            "text": "I was in the Bronx on a work trip and the hotel recommended Emilios. I ordered a few slices, and it was like ordering a pizza from 7/11. Pizza was cold and the margarita slice didnt even bother with . I was really looking forward to authentic NY pizza too. Maybe its better to eat there in person. I was very dussappointed"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1VuRm9kMjkzVW5BemNsaEtZVFZqV1ZWcWIwRRAB",
            "text": "Update:  came back to try again.  Ordered two salads and pasta fagioli.  $62 bucks.  Are you kidding.   Will never be back.\n\n1st review. Grew up on pizza in the Morris Park area of the Bronx.  There were so many pizzeria you could not go wrong.  This was my first time at Emilio's, which was highly recommended.     I was disappointed at how flat the pizza tasted.  No depth to the sauce at all.  The crust was crispy though.  Also had a rice ball, which was an impulse.  It was OK, but nothing of note.  Overall, I was not impressed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcVduZFVhWGN0Vms1cWJGaGljRVZ4TkVKVFRIYxAB",
            "text": "Pizza is amazingly delicious"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeTUzdlV3EAE",
            "text": "The food is great. However, the service is not much better than the pine. They cancelled my order prematurely, simply bc I requested to deliver the order to the person's hand in the Lobby. When I requested a discount for the premature order cancelation, the evening manager was very nasty and refused. First they cutoff the UE discounts (main point of ordering via UE) and now they cancel orders simply over delivery instructions. They shouldn't be so nasty, especially when I've ordered and went there many times, and have recommended them to several ppl. Thing is that I mainly order for a disabled person, and that person can't go outside to pickup the orders; and can barely make it to her door/the lobby. It's not a matter of laziness; ppl will never know the difficulty of basic functions until they've been around a disabled person with mobility difficulties."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvelRubEtjVVE1ZW14SmNIbHBSM2hhYlZCelprRRAB",
            "text": "I’ve tried all the cult classic spots like Joe’s pizza. They’re good but honestly Emilio’s to me is better. Out of all my favorites are their award winning white and vodka. They have the best vodka sauce out of all pizzeria in NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrelRIcEJVRTE2TVcxUlFUTXRSa3haTlZWMGJXYxAB",
            "text": "I'm sorry I have to say this because I have been coming here since I was a kid and the food used to be so good. Now Emilio's is just a glorified overpriced pizzeria. It's not the same as it used to be. half of the time the pizza is cold or have hot half cold or a little burnt and the prices are ridiculous and to actually put inside above the food prices are subjects to change. I mean come on. Emilios ain't the same. it doesn't hold the same flavor it doesn't hold the same family establishment that it used to be And like I said again Emilio's is a glorified overpriced pizzeria. Don't get me wrong The staff are good people , respectful and nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSaWVpMUVTbTlDWVRsRlMwaHFkakJRYTNGa1ZWRRAB",
            "text": "The pizza was really good. However, Not the best costumer service .. they are not all that friendly, a little mean and like to rush. Just calm down a little And be more friendly And welcoming especially for the high prices you guys have! Unacceptable.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUFJHMHlhREZuVDJZdFNVODJhV2xDVnpGeU4wRRAB",
            "text": "We ordered sandwiches\nBread was stale\nIngredients were bland"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNVZuaHplV1J5VldwdFUybEZhRnAyV1VKQ1NIYxAB",
            "text": "Tried a couple of slices over the week while I was working in the area at the recommendation of one the guys at Einstein. Great pizza, great staff. The restaurant has new toppings everyday. Vodka chicken was very good. Bronx pizza isn't to be underestimated."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcEp2VVpnEAE",
            "text": "Highly disappointed 😔, spent 35 dollars for cheese pizza and garlic bread , but all i received  was was garlic bread I was starving at the moment . I tried to call but was not able to receive help . Wouldn’t recommend delivery if you’re hungry."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oak5ubGtSVFZSYTJGMGVqYzRaRmRTWXpGTGVuYxAB",
            "text": "Some of the best pizza I've ever had. Always comes fresh. I would really like to try their pastas one day. Also best tiramisu in the area by far. Everything is authentic and the staff are patient."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcU1IYzBUWEJPWjNONlpsYzBMVzFZVFVoTFlrRRAB",
            "text": "The Food Amazing!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVdWTlpWVkp1VVRodFVHMWhNM2hNYW5KUGNIYxAB",
            "text": "Honestly the food wasn’t all that good? I expected it to be way better but it was frankly disappointing. All of the staff dismissed me entirely. Don’t waste your money here. Go somewhere where it’ll be well spent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS05sTk1NV2hOTkRSQlVUTk5OVzFtTlV0WlpuYxAB",
            "text": "The staff were incredibly rude to me, the pizza had a big bug in it. I don’t know where it came from but it sure as hell did not come from me. This place is disgusting and they need to get reevaluated again. DONT COME HERE"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNGMyeEpOR2RhZEVORFkyeFlkelpRVkdSbVZtYxAB",
            "text": "Large assortment of Italian food to take out. They will prepare for the customer any special orders if you want something that is not on the menu. There are tables for customer's but tightly placed together. When full very noisy. I recommend taking the food out. They also deliver."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScldXNHdRMEp6WlVORE1FWlZXVzFYYVdOcU5uYxAB",
            "text": "Vodka slice and rice balls are out of this world. Not to mention the chicken and tomato slice is an actual slice of heaven."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMFlVZzFRa3hHV1dnNVJXOVVTbU40ZVd4algwRRAB",
            "text": "The drivers are amazing. Fast and super helpful with my elderly parents but the food gotten worst. The pizza is either too much sauce and cheap cheese or hard as a cardboard. Unbelievable how they raised prices for this food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMWMybEtaM0J4YlRWeU4zQXlXa0pRY0haaGVHYxAB",
            "text": "New to the area. Went here a couple weeks ago. Food was ok, service was good and respectful. But the prices insane. Is this hollywood?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wak9YUm5lRGM1UTJKSWNsUklOakZMYjFaa05FRRAB",
            "text": "great pizza. informal, comfortable..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdlVqZzNSRmw1WkRoWlNuQkRhMDFMV1hablUzYxAB",
            "text": "Pizza was fantastic as always."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMlJtUnRhMFl6YVVKdWRFTTNWM0Y2ZVV4SE9XYxAB",
            "text": "I love Emilio's I come here once a week with my best friend gazpacho and we ordered the most delicious tomato paste on bread ever."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQlJHcExkMmwxWldaemJHUmpXRXd3TnpKamRGRRAB",
            "text": "Cant bring a electric scooter inside while waiting for your pizza that’s ridiculous took a 10 mins ride from my house to go buy a pizza in this hot weather for my son and couldn even go inside and get a little cool air"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlJIUjBMV2xKVGxGYVgxWkNjbEp6Ykc5aFpFRRAB",
            "text": "Best pizza in the Bronx, my personal fav is the famous chicken vodka slice! 1-2 slices will fill you up and it’s definitely worth the money!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM1Z6SktVRXBoVmtsb2MxTlhiRmwxTmxOd1dGRRAB",
            "text": "Can't argue here! What's more to say about a place where you can get good old regular pizza pie at 11:30 pm. 👍\nThanks guys!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU00wTjNibEZITkdOWFZGUjZZbFJ4Y0VSTVpFRRAB",
            "text": "Give me that 🍕 Not to hot now"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMmFuVkdWV2RIVWxwT2NtcGFjbU5uVkZoWE5uYxAB",
            "text": "My visit at Emilio’s I came in for two slices to go who has served me was a Mexican. They was all working there. A few of the employees was polite. However, it was one Mexican worker that had a nasty look on his face when he saw me came in the pizza shop. I felt little uneasy, however, they need to take that up with the president not me. I’m just a customer at the end of the day supporting a business not for your personal issues. Other than that, the food was really good.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eU5YVkJUM1V6TjFWR1pVSlJhR05GTlhGVWJHYxAB",
            "text": "Mid pizza, wouldn't recommend. Vodka sauce is good but they treat it like it's gold. Over price fast food quality. Great service and good if there's nothing else opened."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRU4yUk5halZwUm0xVU9WOUtlRXRsUTJRemJXYxAB",
            "text": "Friendly employees. Great food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVldrbEtSMFZ2WldaMVdsTTRXSEJHZUU1ME5XYxAB",
            "text": "I’ve had food from this location various times, but it was my first time actually going to pick up an order for my coworkers’s birthday, staff was courteous on the phone and upon arrival I was automatically greeted in a timely manner. Definitely will be returning in the near future."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOeVc4Y1RJc2FiY3hnRRAB",
            "text": "I ordered from a place that gets a lot of their business from where I work and I am very  disappointed with the delivery of the Food. The slice of pizza came in on top of my french fries that were all soggy the paper bag to the pizza was all wet. The slice was cold and soggy. I called to speak to somebody they said that’s how they send their pizza and acted like I was fighting with them. They didn’t offer no refund or anything just thank you will try to do better.  And they were highly recommended NEVER AGAIN."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNmFwZkdhdTZleWR3EAE",
            "text": "Chicken vodka pizza is the best! Great food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJYUU0S19JdU5xZDZBRRAB",
            "text": "The chicken Parmesan was awesome.  I was a little disappointed in the chicken vodka slice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLS2RxLWJuM2J1TGlRRRAB",
            "text": "Fresh slices"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOTdiYlVnEAE",
            "text": "Chicken Marsala pizza is to die for. Absolutely delicious and amazing 👏🏾 🍴😋"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKR2I2TEtGMWFYcllREAE",
            "text": "Buenisima ,rico"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ3V1cm9nRRAB",
            "text": "Love this place, great selection of pizza and Italian food goodies. Guaranteed to love, no matter what you pick. Great service too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvME02b3RnRRAB",
            "text": "If you want good pizza or specialty pizzas this is the place to go in the Bronx."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN3RMQjZnRRAB",
            "text": "Classic pizza spot, vodka slice is insane!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNlp1NFlnEAE",
            "text": "The best place"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3JYSS1RRRAB",
            "text": "I highly recommend it😁"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3BEQ25BRRAB",
            "text": "Love coming here for a good slice of yummy pizza!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUltQVJ3EAE",
            "text": "I’m disappointed in the system they have for delivery first a slice costs around 9$ and on top of that there is a delivery fee even tho I’m 2 mins walk from the shop and to top it all off there is a”gratuity tip” that you have to pay because the 2-3$ I used to tip “wasn’t enough and they complained” 💀 literally blew my mind I realized today that I was paying  that after a few months of buying from this place"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNkpmbVBnEAE",
            "text": "They make great pizza! The delivery took longer than expected. But the pizza was still hot n delicious.The delivery guy was nice. I’d recommend it ."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ0x1SWZBEAE",
            "text": "I Love the pizza…I am coming from manhattan where a slice is $3.50 but almost $5 for a slice and $22 for a small pie here is CRAZY expensive for a location in the Bronx…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bEllOXdBRRAB",
            "text": "The food & the service is amazing!!! But a tad pricey... I ordered 5 slices, 4 specialty & 1 cheese, plus 3 sodas and it came out to over $40. It's a tight fit if you're dining in or if a crowd builds to wait for their order.\n\nHighly recommend for the flavor, but not if you on a budget, since a cheese slice is almost $5.\n\nBuen Provecho!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROOEt5RTJBRRAB",
            "text": "I ordered the chicken Parmesan with pasta. Not gonna lie it taste really good. Just as I was eating it, I’ve noticed a little strand of hair inside of it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeGVYZzF3RRAB",
            "text": "Came in for a pie 🍕 of vodaka chicken and waited with a pepperoni roll . I been living in Morris park for the last 5 years and had heard about the place but never took the time to order from here. I got my pie went home and I can genuinely say I will be back . My wife was full on her second slice so if you order just know they load it heavy with toppings ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aXB2N2hRRRAB",
            "text": "Terrible! All the cheese and toppings slid right off the pizza. The taste is terrible too. NYC is known for pizza! This is top of the class trash! You charge so much for 0 quality. Only the garlic knots left me to give only 2 stars ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdmNia3BnRRAB",
            "text": "I had their famous chicken vodka slice & I must say it was pretty good l. I've never had one before. I will definitely be back to try some of there other slices"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bW9YZWJBEAE",
            "text": "Est. 1989\n\nLayout/atmosphere\n*Six tables; video board menu above counter; one TV\n\nFood/drink\n*Regular slice - good; slight flop but still had a crunch\n*Chicken Vodka slice - good; heavy (signature slice of the place, including a black t-shirt with #chickenvodka)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdE8zWFlnEAE",
            "text": "Pizza is good, there is absolutely zero parking on the area, which makes it difficult to get to the restaurant.\nThe food is very good., very small eating area, makes it difficult to have a…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONllYWXhBRRAB",
            "text": "This place is definitely a go to spot for pasta, Pizza & also the desserts. 1️⃣of the🔝best in the Bx. & NYC. 🍝🍰🥄🍕😎👍🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NVBEbWt3RRAB",
            "text": "I took one Cajun Shrimp slices.. it was very delicious but the price was 7.50$ for one slices.\nSo before you get in there. Make sure you check your pocket 😛"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaFo2TEtnEAE",
            "text": "Picked up the chicken vodka and plain slices, along with a potato coquette today. Delicious. I also didn’t know they had such an extensive menu, I’ll be ordering again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOTdYX013EAE",
            "text": "the white pizza and the eggplant parm roll are both really good! my boyfriend likes the chicken vodka pizza too:) i love that they have plenty of vegetarian options here"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5by1pYjZnRRAB",
            "text": "Their specialty pizzas are awesome! I especially love their chicken vodka pizza , actually I drive there from outta state just for a couple of their specialty pies. Or have someone I know pick them up for me!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNXJqR2hBRRAB",
            "text": "Great pizza with some unique slices, try the chicken vodka slice or the vegan vegetable slice. These two are my favorite here.  The vegetable slide is filled with garlic vegetables, it feels sudo healthy to eat it. The other typically slices are good too.  Busy during the lunch rush, but you can get in and out in an hour no problem. Bathroom is kinda gross. Staff nice."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMkk3eEZBEAE",
            "text": "I stopped by on a Saturday around lunch time and ordered the Margarita. It had to be hands down the best slice I’ve had in the past 35 years. I heard about Emilio’s from other people and that’s what prompted me to give it a try.\n\nThe guys are quick to serve you and  they have everything you could want. A little pricey but other than that Emilio’s rocks out solid pizza. Dave Portnoy did a review here in the past and goofed, this place gets a 10 in my book."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bmRDTlpREAE",
            "text": "Ordered catering for a retirement luncheon with Rafael and he was awesome. He ensured I ordered the best food for the budget that would feed the expected amount of people-and it did.  Everyone loved the food and ask that we order there again.\nOnly two things would have made it better: the ability to pick it up earlier and assistance in bringing the 6 full trays to the car. But even with this, worth the trip."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM1ltd0RBEAE",
            "text": "Service was off the hook, huge slices🍕 delicious food, very good prices. The place is really clean.😋.  I recommend it 👌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdHRqY2hnRRAB",
            "text": "Still waiting for that phone call . My experience going there on a Sunday was horrible !!! I ordered a garden wrap I got a Cesar wrap . I got a garden salad with chicken and they put a pound of lettuce with a handful of crotons and one small piece of chicken the whole order was 56$ I called the manager said the owner takes care of compliments I called twice and nothing . The men are miserable there they don’t care for customer service and I won’t ever go there again ! This was my favorite place to go to on Sundays to get away from my kitchen and this is what I receive so sad needless to say I won’t ever spend my hard earn money there again . Don’t bother !! The men also think it’s funny when u have complaints … Emilio’s isn’t what it use to be"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuODl2WENBEAE",
            "text": "I called in an order for a large chicken vodka pie. When I got to Emilio’s to pick it up, I was hit with a whopping $41.71 charge for just one large pie! I mean, don’t get me wrong, the pizza is tasty, but $41? That’s just crazy. I can’t believe how expensive it was. It’s good, but not that good. Seriously, who charges that much for a pizza? Not to mention the menu has it listed at $27 which is definitely more reasonable but 41 is just ridiculous."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNnJDV3N3RRAB",
            "text": "My friend and I came here after a day of hiking in Cold Spring, NY and we came here for one reason only. Chicken alla vodka slice! I don't normally go for fancy pizza toppings... but this was very, very good. A must try!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBck83d1JREAE",
            "text": "So good! The bacon chicken ranch pizza was the bomb! Would eat here often if I lived in NYC. Not too much seating inside, but enough if you have a small group of people."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOHRQT1RBEAE",
            "text": "Chicken Francese Slice is really good along with Al Vodka slice. The Sausgae Roll was great, sliced thin meat."
        }
    ],
    "reviews_count": 72
}