{
    "name": "Halal Bros Grill Bronx",
    "place_id": "ChIJJef2E07zwokREfiXqeskUuY",
    "grid": "BX7",
    "address": "3476 Jerome Ave, Bronx, NY 10467, USA",
    "rating": 4.7,
    "user_ratings_total": 877,
    "phone_number": "(718) 676-4648",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS1QyVk1NRXBDVG5jd1kxZ3ROV0pET0ZOak4wRRAB",
            "text": "Food here is amazing i love the mixed platter salmon is fire as well and they not skimp the portions they give"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbDZfQXhBRRAB",
            "text": "I ordered food here and it was horrible the food was all burnt. I will never order from here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M1pFWnpSRzgyUldGUldGcFBPVzVhV1VGT1JrRRAB",
            "text": "Apparently they think this is okay to serve customers. Burnt burger looks like it was on an unclean grill and wilted old lettuce.  Disgusting!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFMxZHpjV3hJVWtGelYzRmhZVlpaWWpSR2IyYxAB",
            "text": "I just ordered the bogo on uber eats whoever made that chicken needs a raise !!! … 🔥🔥🔥🔥🔥🔥🔥"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMVlXOUdhek5xVVY4dFduWlBXV3cyZURseVJVRRAB",
            "text": "Great food will be going back tomorrow!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNFprRnRWazltY3pVeFEwVXlXa0pXWlZKM2NIYxAB",
            "text": "Went in here on a late night some weeks ago the cashier was super nice and very good food👌👌👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZmVUWnFWR2xDV2tsNmRFaEphbU5tTVRKRFgwRRAB",
            "text": "Halal Bros Bronx Grill is a must-visit for anyone craving delicious and fresh halal food. With a massive variety of dishes, from wraps to platters, there's something for everyone. The commitment to quality is evident in every flavorful bite. Plus, the manager's exceptional customer service creates a welcoming atmosphere, making each visit a delight. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcGJ6UlVhMkZ2YURkMlNVWndSRVZ2YjJRM1FYYxAB",
            "text": "Ordered jerk chicken over rice , it was so dry , burnt and bitter. Didn’t give me any sauces with it whatsoever. I bit my lip 4 times because i had to chew so much and had a hard time to swallow with how dry it was."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QmVYTmZlRWhxWW5CWU1UQjFlVTkwZVdoNVIyYxAB",
            "text": "The food is good. My favorite is the loaded fries. The service is good and they are courteous"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVFVHUk5ORkpzV1VNNWRWOXBUbnBpU1hOd01FRRAB",
            "text": "My brother and I purchased two orders of Salmon over Rice\nand Salad. The cashier asked would lettuce, cucumbers and tomatoes be fine we both asked for just cucumbers and tomatoes. Took awhile to get the orders. Because they had no tables and chairs to sit and dine we took our platers to the local park. Once we started to dig in to our meal I saw the Salad was mostly lettuce (didn't order lettuce), first I went for the Salmon but couldn't break a piece of the Salmon with my plastic fork, I had to stab into the Salmon in order to bit off a piece at a time. I remarked to my brother \"It's over cooked\" he remarked \" Way over cooked\". The Salmon was hard and dried and overseasond.\nAs a side bar the staff seemed to me like they didn't want to be there, one guy looked like he was in a hostage situation, I felt bad for him.\nWill I ever go back there. Absolutely Not."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVJ5MXVSRlJyV1VkUWFEVnZWamRrYkhKb1JWRRAB",
            "text": "Delicious 😜"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NGJIUlpkekpIU1ZkdFFqZzFjak5OYURaWU9WRRAB",
            "text": "Taste like shit ,chicken was like shit"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeVpHUkZUazVUTjBkbFRreGZkRXRHUzAxbU5FRRAB",
            "text": "I took advantage of the uber eats buy one get one free deal . I got the chicken over rice and veggies meal . It was tasty and fresh . They also gave me a lot of food in each plate . For 15 dollars plus tax for to meals you can’t get no better than that . Good deal ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTFoxTnJXRXR3YWpCQk1qSkNSWE5HZUVseFRGRRAB",
            "text": "Love their jerk chicken over rice!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSmJrcElXVkZZVFZweVkwcGtVSFZxZWtWZlFYYxAB",
            "text": "The pate plate was generous and well done.  Dessert was presented in a fun way with a chocolate cake with a bit of cream, ice cream, and some fruits. The staff is particularly friendly and helpful, there seems to be a very personal sense of ownership amongst those who work here.\nSuch a great neighborhood bar and restaurant, we discovered it Welcoming, entertaining staff great environment, wonderful food and beverages."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM0h3N3FFOEtUZVhREAE",
            "text": "The food is excellent.. 20 for single combo entree.. the front desk forgotten we ordered the combo and didn't provide bread and drink at first but gave us no issues after receipt was shown. Granted it was slow. Only negative is the price..  very expensive and small portion. I'd only buy few times a year."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKRGVpc2ZTdVBxOWV3EAE",
            "text": "Good variety of halal platters over rice, jerk chicken, wings, fries, burgers ETC.  A bit on the pricy side, cost $31 for jerk chicken over rice & a fried chicken sandwich.  Food wasn't bad, but have had better.  Probably wouldn't pay those prices again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKbXoxTGphaW9xS0ZREAE",
            "text": "I just received my food for lunch through Uber eats. I got the BOGO chicken over rice with spicy white sauce.  It's not good. I'm trying very hard to just suck it up n eat because I'm hungry but it's extremely difficult given the salt content. It's very very very salty!! Chicken has no real flavor besides salt and the sauce is so salty I find myself only eating the rice n salad.  Highly disappointed since this place has great reviews.  I think I'll stick to the carts."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc1ozTG9nRRAB",
            "text": "Not good food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LTd2djFBRRAB",
            "text": "The food is good and tasty. But it comes at a cost considering the competition in the area the prices are a bit overhyped. And there is also no dine in sevice. The competition around the area has a dine in service but they dont. So i say food good but expensive, service poor and no dine in service,"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bzRfaExBEAE",
            "text": "I order online through doordash but the jerk chicken is crazy it tasty smokey and the jerk sauce is sweet like barbecue but better than barbecue it’s quite lavisful"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNUtTa2JnEAE",
            "text": "Upon walking in I knew we made the right choice going there. The guys were very welcoming. The service was quick and efficient. And the recommendations for the white sauce were spot on. Definitely will be back again. Believe it"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd1AzSXhBRRAB",
            "text": "Cannot recommend this place enough, workers are phenomenal and so friendly. Food is amazing and they always have such large portions. Place is clean & everything is well organized."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaWJtTEp3EAE",
            "text": "This place is really good only thing they need is microwaveable plates for the platters I’ll still rate it 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneFBLZ0NnEAE",
            "text": "High price, portion not so generous. Taste okay, cleaness okay"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBa2FQcE9nEAE",
            "text": "Rafael had great energy & service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBODRLdlFREAE",
            "text": "Not a place you can eat in. However the food is quality and so is the service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBekt6TUpBEAE",
            "text": "Have eaten there a few times over the last two years and all I can say is it’s exceptional. Good quantity great quality.  Place looks very clean and the staff is personable, my go to when I’m in the area. Definitely recommend it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcGM3Vnd3RRAB",
            "text": "Lol bums"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMW9LR0t3EAE",
            "text": "Literally buy food from here once a week! Never been disappointed!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeWRmSm5RRRAB",
            "text": "Place did not feel very halal, service was bad , food was bad, the fries looked like they were fried in oil that hadn’t been changed in months. Would not go back if someone paid me to do so. Me and my wife both got sick after eating it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdWNLakR3EAE",
            "text": "Their jerk chicken…great concept and delicious. So jerky it almost tastes like beef 😂 pricing could be better though $16 too steep for the Bronx…"
        },
        {
            "date": "10달 전",
            "language": "fi",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OEl5dm53RRAB",
            "text": "Yummmy bussin bussin"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cTR5N3FBRRAB",
            "text": "Came here for the first time the other night & that was my last. The chicken over rice wasn’t good. They didn’t use the right chicken for their platters it was more shredded & salted than the traditional marinated chicken you would get at…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LWVQUnJBRRAB",
            "text": "Glen  really the best wrtmm"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2anRLVmtRRRAB",
            "text": "The jerk chicken over rice is the best"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN0xIOWN3EAE",
            "text": "The store is very well lit, and the staffing is kind and accommodating. But the food has taken a turn for the worst, in my opinion 🤔.\nTo start out on fire to now, just to be barely smoking is not a good look."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXZqdElBEAE",
            "text": "This is the second time I received burnt food. First the jerk chicken from a couple days  ago and now I bought 2 salmon and both burnt and nasty. Very disappointed. It was highly recommended so I’m actually very upset with my money spent."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbU1ETF9BRRAB",
            "text": "Great service, delicious food, very great customer service. Clean and very well maintained. Defiantly will be coming back here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOWJhYzBBRRAB",
            "text": "I went there for the first time today 10/29/24. I ordered the mix over rice. The process was so easy, order and pay on the virtual screen. The young men preparing the food were helpful, answering my questions. The food was delicious, a nice mix of lamb and chicken over a nicely seasoned rice and salad. Their sauces are very good also.  I will definitely order from them again. The only complain is there is no dining in option but it's ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLU1UeWdBRRAB",
            "text": "hands down my favorite spot on jerome. always good food and always taken care of by the staff :)\ntop tier bronx eats if you looking for a burger -Lucy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMl9xeGV3EAE",
            "text": "Food as usual normal but price is high."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaHFYRVRREAE",
            "text": "I went to this place with my mother, and got the loaded jerk chicken fries with Pico de Gayo and white sauce & red sauce. Their food was so good, I started mumbling, then my mom saw all the food on my hands and mouth. And it was very delicious, I’m gonna recommend this place to all my friends so they can all go. My mom plans to go back to get a meal herself, and she will rate it 5/5 stars. Also, they were kind enough to take away and add stuff from the meal—I don’t eat cheese and they were pleasant and polite enough to remove it and add what I liked. I will 100% go back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcUxDbHdnRRAB",
            "text": "Good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubDlUVE5nEAE",
            "text": "I got food poisoning from this place and had to be hospitalized. I know it was from this food because my husband got sick too and this was the only food we both had. Eat this stuff at your own risk!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaDlDRC1BRRAB",
            "text": "great staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubmNtUzBnRRAB",
            "text": "First time in and the guys were very helpful. Tasty food, the best jerk chicken I had in a while."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuelB6MlpnEAE",
            "text": "Emmanuel and Romario did a great job help take my order as well as introducing me to different sauces and variety of different foods I haven’t tried !! Definitely coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueTVqRUZnEAE",
            "text": "I recently had the pleasure of dining at Halal Bros in the Bronx, and it was an outstanding experience! I ordered the chicken over rice, and it was simply delicious. The chicken was perfectly seasoned, juicy, and served on a generous bed of rice that was fluffy and flavorful. The sauces added the perfect kick, enhancing the overall dish.\n\nHamza provided exceptional service, making sure I felt welcomed and taken care of throughout my visit. His recommendations were spot on, and he went above and beyond to ensure I enjoyed my meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueTVpRTF3RRAB",
            "text": "Amazing experience, the customer service is top tier. Nico & Alisha was very attentive & help me decide my meal! The food was delicious. 10/10 WOULD DEFINITELY RECOMMEND!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqZ05QTElBEAE",
            "text": "I ordered take out from here after seeing an Instagram post about the restaurant and food. Overall, the food was average at best. Even the jerk chicken which I had high hopes for was not up to expectations. The zinger sandwich which came highly recommended was also very dry. I wish I had a better experience, but really can't go higher than 3/5. That being said, you should definitely give them a try and see if your experience is any better!\n\nFYI: There is also no seating inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bjYtdXNnRRAB",
            "text": "This is hands down my favorite halal spot, I usually get the lamb combo and it never disappoints! Really good and keeps me full all day when I have it for lunch! Service was friendly, the vibe: it’s a takeout spot with counter service. Good value! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMUlHNm1RRRAB",
            "text": "I came in 20 minutes before close and received absolutely phenomenal service! The workers were really sweet despite my timing and gave me the amazing suggestion of getting jerk fries. They weren't too spicy but perfectly seasoned and with a good amount of sauce. I'll definitely be returning! Support black business y'all‼️ & thank you all!!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoZ2Z1NjV3RRAB",
            "text": "Update I’m taking out 4 stars for cheap tactics\nBe mindful while paying specially with the person who has earings . Has a attitude. he placed 18% tip by default and i had to pay extra assuming it was going to be 0. Very cheap tactics.\nI simply paid extra 10$ for no reason .\nI hope the owner looks at this . No one has ever played such cheap tricks.\n\nBe mindful while paying watch the screen\n\nThis hands down theee best over rice spot. Prices are a little high but the good is def. Exceptional. Jerk chicken over here is extremely flavorful it’s spicy and Smokey. Staff here is very responsive and attentive. Don’t think about this place just come down and try it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNnFfQTZBRRAB",
            "text": "we went last week for a school trip to NYBG and looked for a good halal place near us. the lady who worked there was super helpful because my friend and i were lost on how to order and we asked for extra white sauce and as you can see in the pictures, they gave us as much as we wanted lol. the food was pretty good, and it was a lot so we didn’t even finish it. the only thing is i wish there was indoor seating. other than that i give this place a 9/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodXZPN3hnRRAB",
            "text": "OMG love this place already!!! It was my first time here and the food is good! Full of flavor and just the right amount of spice. Fresh and filling. I Ordered the jerk chicken over rice,less rice, more salad, white sauce, and dragon sauce 😋😋😋Clean inside too. Ooh and the scoop off hummus I got on the side👌🫶🏽 I'll be back tomorrow to try jerk loaded fries.😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MFlhSmpBRRAB",
            "text": "I usually order the chicken gyro combo which comes with fries or sweet potatos and a drink and my husband the mix (chicken and lamb) over rice combo, which comes with some bread and a drink.\n\nIts one of my favorite gyros so far!\n\nThe chicken jerk fries is really really good as well! An awesome dish to share :)\n\nWe have tried other dishes, such as the falafel, avocado fries and the chicken quesadilla but we are stuck with the gyro and the mix over rice - they are we believe their best dishes 🔥\n\nTheir prices are very good - surprisingly good - today we got for example a chicken gyro combo with fries and a drink, a mix over rice combo with bread and a drink and an additional side of sweet potato fries and it all made USD$35 🙀\n\nThe ambience is alright - unfortunately you can only pick up or do delivery.\n\nWe keep going back pretty often and their quality seems to be pretty consistent\n\nWill continue going back and recommending them to others :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNFlQSDdBRRAB",
            "text": "Been seeing Instagram adds for the place so definitely wanted to try. Came late but the place was clean and fresh. The staff was kind courteous and very informative of the menu and what they are serving. I had the chicken gyro it was so damn good. Love all the different sauces to choose from. Definitely coming back this ishhh it goood!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcG8zcmZREAE",
            "text": "The food was out of this world I highly recommend the jerk chicken over rice with spicy white, & dragon sauce!! The atmosphere is on point too. Staff is very friendly and interactive. One of my favorite spots in the city.whatever you do don’t forget to try the cheese cake!.!.!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaW9LeGVREAE",
            "text": "First time trying this spot and I ordered the jerk chicken quesadillas. The flavor was on point & they were generous with the serving! The staff work quick and were super attentive. Would def recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMTYyYTl3RRAB",
            "text": "So I ordered the falafel over rice, overall the dish was very delicious. One of the employees name Jonathan prepared my food and it was great. Everything looked and tasted fresh. The falafel was a surprise for me the shape, it’s a patty type instead of a round ball and I find that to be so genius. Salad was fresh and tasted great, the white sauce feels home made or a unique recipe of theirs because this is not your regular white sauce for anything over rice. Overall my experience was great ! I ordered for pick up and I was greeted as I walked in and it was fast and easy ! The place is very clean and spacious.Highly recommend this location if you’re in the mood for some halal food ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoamZIa3RBRRAB",
            "text": "i got the avocado fries and a chicken salad, the fries were so good i couldn’t even get a picture. the salad has so much in it and it’s so filling. the environment is really nice too they’re very sweet and welcoming. this place is amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdU96b3BBRRAB",
            "text": "Great customer service! Rafael and Joel listened attentively and made my order to perfection! I got the Kofta! Going to try the jerk chicken over rice next! Make sure you get the Dragon and Spicy White Sauce too! My new favorite spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMGVDcFR3EAE",
            "text": "I got there when they just opened, but it wasn’t ready for customers for but They let me know and still taken my order got with me waiting 15 minutes for what he was ready to really be open and they serve me this place is immaculate clean I love ambience and the food made fresh in the restaurant.I love the vibe the food is oh my God is great you don’t know this definitely is a Bronx. 💎 gems will return to try something I had ordered the jerk chicken over with salad and pita bread and can sodas I most it hit the spot am big foodie who love trying new meal infusion and baby this Taurus love the spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ1BuYUNBEAE",
            "text": "The food is fresh, and the location is spotless. I kinda like the salad tossed a little with sauce or some sauce on the salad portion, but that me. Otherwise, check them out. Oh, I bought the lamb salad 🥗."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdHVqUDRBRRAB",
            "text": "10/10 Top service, all amazing employees. Food is delicious and full of flavor. Always an amazing experience. Glen, Melissa, Alisha & Musa were awesome!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOUtfSGtnRRAB",
            "text": "Ordered chicken wings and it came with feathers. Ordered for extra souces they didn't put any even though I asked if they put them in begs or not. Avoid this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZzVEV3dBRRAB",
            "text": "The service? They are friendly. Rafael hooked me up lol. I got jerk chicken over rice for my first time? BUST DOWN. I just came back to try Jerk Salmon over rice. & look how JUICYYYYYY!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOW9lZVN3EAE",
            "text": "I had a long day after school and work, classes stressed me out to the max and I needed something to eat. On the block there are so many new fast food spots and I saw this 1. I am a mixed island gal, so when I saw jerk chicken, I was SO happy! I ordered the jerk chicken over rice, and I was able to get delicious Oreo cake, which is my absolute favorite!! Maybe I’ll try carrot cake next time 😌 The manager and the other staff there that night were incredibly sweet and informative about the menu. Their customer service was very kind and welcoming. I was able to have a sample of the food and I chatted with the workers while I waited for my bus. I ate some of it that night and used the rest for school the next day for lunch. You guys know when food is good and it puts you to sleep?? 😂 but anyways, this place is great, can’t wait to go back! Thanks y’all 🫶🏽❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoc3RfdXNBRRAB",
            "text": "Great service, I ordered the jerk chicken quesadilla combo it came with fries & a drink  (I didn’t know the quesadilla didn’t come with cheese I guess I didn’t take my time looking at the menu) me & my coworker were saying if it’s called ques like queso it should have some cheese 😂 besides that the food was good. I will come back & ask for cheese next time."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeDdXQ1pBEAE",
            "text": "The food was okayy . I ordered four meals from doordash. So, first of all,  there were so many options for veggies and sauces. But all the food didnt have the customisation that were chosen.  However, the food came with little sauce on it.  Stingy with the sauce for 14 dollars worth of food. No drink came with it . Also , the red sauce was regular hot sauce ! and not Halal Red sauce that you normally get. Overall, It was overpromised  and Under-delivered. Thank you very much for your time and for reading . Have a good day .\n\nTHANK YOU for your kind response !  I am definitely more open to stopping by in person instead! Thank you again ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cUlQOGlBRRAB",
            "text": "So dope here. The food is fresh and delicious. And the service is top tier. I love coming here when I’m in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMGRxUlpBEAE",
            "text": "The energy is great straight when you walk in you can smell the food and the food is fresh we mistakenly ordered our food the wrong way and it was our fault on the miscommunication but they were very nice about it and fixed our order without any problem love it here will definitely be coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMW91V3JBRRAB",
            "text": "The place has dope decor, staff is very friendly and nice. Food is great! Will definitely be trying some of their other dishes. Jerk chicken over rice hit the spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LVllTkdREAE",
            "text": "Food was EXCELLENT everything literally was sooo good. We ordered around $100 worth of food and everything was soo flavorful and delicious. We came from upstate NY saw them on TikTok and decided to try. DEFINITELY won’t be the last time. Found my new spot👌🏾\n\nSB: the decor and atmosphere was great as well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNac2R5dU5BEAE",
            "text": "Seen all these 5 star reviews and had to give this place a try, but it’s all 🧢. I ordered off Uber eats food was bland af and I paid for extra sauce and I definitely didn’t get that. 10/10 don’t recommend, go to titos on gunhill road."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNXFfNDNBRRAB",
            "text": "The food is really good and the customer service is top tier and the price is fair and decent I highly recommend this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoazdPRWd3RRAB",
            "text": "The best restaurant in the bronx , clean environment, delicious food friendly customer service. You have to visit them you can also order on Uber eats.jerk chicken with French fries mouth watering best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab3IyYjlnRRAB",
            "text": "Food on point, good customer, clean,  spacious and lot of options to choose from."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbjludDdBRRAB",
            "text": "1.7.23 - 1st time eating here and worth every penny ( even the delivery to Yonkers) lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNWJYZ2d3RRAB",
            "text": "Great food! Great portions!  Abdul did a great job! Please open more locations in the Bronx! Thank you so much!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NElyTDZBRRAB",
            "text": "Tried this spot yesterday with my bf and I was soooo satisfied 🔥 friendly staff and great food. We had the jerk chicken quesadillas with dragon and white sauce :) and sweet potato friessss…"
        }
    ],
    "reviews_count": 82
}