{
    "name": "Nicky's Coffee Shop Inc",
    "place_id": "ChIJ70QHSHLzwokR1mSyuGTx30w",
    "grid": "BX7",
    "address": "3140 Bainbridge Ave, Bronx, NY 10467, USA",
    "rating": 4.4,
    "user_ratings_total": 591,
    "phone_number": "(718) 231-9516",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213ek4xcGtXa1ZwY1dwVU9IbzNRVjh6YmxWNGIxRRAB",
            "text": "It's the local spot to go to on Sundays! Lovely staff! Great diner food! My favorite meals ate the grilled chicken triple club and the waffle with strawberries and whipped cream."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScGNtOVRUWFJSTlVSSlNXVkpaa2RmVUVGaGVYYxAB",
            "text": "I went in gave the lady my order they took a long time and when the food came not everything i ordered was there and i asked about the rest and she said oh and told me i have to pay $8 more and i already paid $22 which i thought was for everything but was only for a veggie omelette and home fries"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcXQ2YndnRRAB",
            "text": "Excellent only the best is here"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUFdHcDRXbVZqVGsxNlNqZGlhV054WlZsTlZXYxAB",
            "text": "I went to buy a BLT on a roll. It was real grease and the bacon looked old. It was a take out order. I got up this morning at 4:30 A.M with Diarrhea I will never eat there or order anything from there again. I have never seen a BLT SANDWICH LOOK SO MUCHIE & MAD GREASE IF IT WASN'T THAT I WAS NOT IN THE AREA I WOULD HAVE TAKEN IT BACK BUT I KNOW BETTER TO BUY ANYTHING IN THAT RAT HOLE AGAIN.  PEOPLE WHENEVER YOU BUY TAKEOUT THERE MAKE SURE TO INSPECT THE FOOD BEFORE YOU LEAVE."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xT1kweHBRVVJoWDBNMFFWRTVUSGxLZVZaTFJuYxAB",
            "text": "Good diner food. Fast service and the employees are polite!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud2Y3Sm5BRRAB",
            "text": "Fresh food all the time. Best place to eat in Bainbridge for breakfast, lunch or early dinner. The paninis are so delicious and waffle with fruits are better than any ihop. Oh and the pumpkin pie ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTmIzaE5UR1ZNTlc5WlJGVktWMnA2VkU5MFZtYxAB",
            "text": "Been coming here with my family over the last year. Food is excellent, staff are friendly and we have no complaints. They recently upgraded and it looks nice.\n\nThey now accept credit and debit cards. Before it was cash or zelle only."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeE56ZHRZblJRVFZwQlVWQlNiMHhCYlZrelJuYxAB",
            "text": "A rare good restaurant in The Bronx"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZVg0OFBOOGJlZHNnRRAB",
            "text": "Highly recommended for anyone needing this kind of help."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRmVuVnZibmhGVEU0M1RWVm1jUzAzVlRSRldXYxAB",
            "text": "The Go to Coffee ☕️ Shop in the Morning.\nGeneration Owner,  And Continuing the Great Traditional Foods  That Norwood and Mosholu Are Enjoying For Decades!!!\nDedication is The Foundation of The Quality and Service That Mr. GEORGE  makes!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOckRvSWJEeUp2UFhnEAE",
            "text": "It was nice. The food was good the atmosphere was good it was a nice place first time there"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNTzF6Tk9iOGNEd0lBEAE",
            "text": "I’ve been coming here on the weekends for about a year.  The service and food has been consistent. The food is fresh and tasty. They are reasonably priced. In the entire year I’ve waited for a table about 3 times.  The reason for the 4 stars is because this is a Zelle or cash only place but there is no signage to indicate that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLUEo5X2U2LXQzakJ3EAE",
            "text": "Overall no complaints except one day the young waitress didn't want to clean my table her service was shitty and i stopped going for a while but its convenient so i started back going. I don't like that  They only take cash or zelle but its an decent establishment Respctfully"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV2wtcHlhNk9XUzN3RRAB",
            "text": "Friendly atmosphere"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTGM0ZXJab2NHZlZ3EAE",
            "text": "Nicky’s Cafe on Bainbridge Ave is hands down one of the Bronx’s hidden gems. Every time I go there, the food is served fast and efficiently — no long waits, just great service. And the taste? Absolutely amazing. You can tell they put love into everything they make.\n\nThis place has been around for a long time, and I’ve been coming here since I was a kid. I used to live not too far from Nicky’s, all the way up through my mid-20s. Coming back now, it’s incredible to see that it’s still just as good as it was back then — maybe even better.\n\nGreat food, great people, great vibe. If you’re in the area, do yourself a favor and stop by. You won’t be disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM1pzY1N2eFkyQVRnEAE",
            "text": "Great place, the staff is very friendly and the food is very good. The only downside is that they only accept cash, but there is an ATM inside anyway."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPLTE3djd6cGZPZmxRRRAB",
            "text": "DO NOT SUPPORT! Since purchasing, renovating, and reopening the pizza shop across the street, this business has gone cash-only at their diner, which feels like a calculated move to avoid properly reporting their earnings to the IRS. By doing this, they can potentially dodge paying their fair share of taxes – the very taxes that should be invested back into the community they profit from. It’s frustrating to see them siphon money from a neighborhood they don’t truly support, choosing to pad their own pockets while living comfortably elsewhere. I’m done supporting businesses that exploit their customers like this. That Pizza shop formerly Sals got renovated off the backs of the community because they’re making us pay them back for it. Why the change now if I’m not right? When I asked the owner she told me to mind my business"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VMZmVvTksxckxCVRAB",
            "text": "Excelente"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN1pESjRnRRAB",
            "text": "Cash only spot.\nYou can Zelle\nYou have to ask for an itemized receipt.\nFood OK nothing major\nBe prepared to wait."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWRMR1lREAE",
            "text": "Cash and zelle accept but no cards food was delicious and it came out fast great service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb1k3LWZ3EAE",
            "text": "This place is a pretty straight forward diner. It is a cash only establishment. They offer payment by zelle and have an atm located in the diner. Ther is also capital one bank across the street. The food is solid with my favorite dish so far being the tuna salad with egg and sweet potato fries. The fries are never greasy or burnt. They give excellent portions, and I have never left there wanting for more. Everyone is always polite and respectful. They can use some updating, but it is always clean inside. The true downside of this place is it is super cold. It has been a cold winter this year, and they never have on any heat that can make sitting and eating here uncomfortable. The prices are average and I am a repeat customer. Maybe it will be better during the warmer months, but for now, I suggest ordering takeout."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MGU3WmRBEAE",
            "text": "This place is amazing im upset I've lived in this neighborhood for so many years and haven't been here until last weekend. They make the best iced coffee & bacon, egg, & cheese."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NXBIZEx3EAE",
            "text": "Love the service at this diner!! The food tastes so good. Recommend the Nicky’s omelette 😍…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NXA2MjB3RRAB",
            "text": "The food is great 👍 totally recommend the workers are very nice 😉"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eHRYUEd3EAE",
            "text": "The worse service ever. Owner was very rude. Food was very salty. Order wasn't correct. Will never eat here ever again. Don't waste your money go some where else."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z0picGFnEAE",
            "text": "Nice St George Icon inside!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbk9YVWJ3EAE",
            "text": "The phone receptionist sucks\nThey always pick up and say give me a second and never answer back.  I don’t know why I’ve waited for them clearly they don’t care."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncS1YS0N3EAE",
            "text": "Loved this diner!! I would go again. Food was on point,  Service, clean. Everything was great.!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXNpemRREAE",
            "text": "The place is relaxing,  to have a great simple breakfast, befire starting my day. The owner and staff are friendly and respectful. Their food is comfort and good and inexpensive. My go-to place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBb2RmQjhRRRAB",
            "text": "Nice comfy old school diner love it"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbExtNkVBEAE",
            "text": "A decent spot for the neighborhood."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudHUyNWlRRRAB",
            "text": "The best place to get food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaXFfOVJ3EAE",
            "text": "Good hole in the wall spot very hard to miss. Ordered my food and it came in less than 10 minutes and everything was delicious 10/10 would come back again"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cDhYQVNBEAE",
            "text": "Pésimo lugar solo efectivo aceptan y los trabajo desde meseros unos pésimos mal mal servicio uno llega comer a comprar no a que le den consejo de vida"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dGRXNnh3RRAB",
            "text": "The food and service were amazing. Great choice and Gem in the Bronx"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aGRYRENnEAE",
            "text": "Great place to eat and sit down! Great servers and very fast. The owners are great people as well!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaFlLT1NREAE",
            "text": "Great neighborhood place for comfort diner food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNl83eUJnEAE",
            "text": "Delicious food, amazing service & atmosphere!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzanVpbjFRRRAB",
            "text": "Cute little diner in the neighborhood! It’s been around before I was born and it’s a gem to have! Amazing breakfast platters and bustling on a Saturday and Sunday morning! Love their Mexican omelette with home fries and buttered toast!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdzYyaTZ3RRAB",
            "text": "The food is good, I'm not going to lie to you. The only problem is the people who serve people (very important fact, they don't accept cards, only Zell). The man who serves at the cashier has an attitude as if he didn't want to serve customers. When I received my food I asked for the ticket and the man instead of serving me just made fun of me and another woman who I imagine was the manager did the same. Very bad customer service, the only thing I wanted was my ticket to see why they were charging me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN092R21RRRAB",
            "text": "Best place in my opinion definitely my new favorite spot 10/10 without a doubt !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OU0yWEhREAE",
            "text": "Located in the heart of Norwood bronx this wonderful little coffee shop nestled right in the corner of D train station is a diamond in the rough. This was my first time eating and will not be last i really enjoyed not only the delicious food but especially the quality and speed of service. So if you are in the bronx on the last stop of D train station do yourself favor stop by and have an authentic greek diner experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwMHMtdndRRRAB",
            "text": "My husband and I loved this diner for several months UNTIL yesterday!!!!!!!! I found a piece of the silver lining from a plastic ketchup or mustard bottle at the bottom of my Grilled Chicken Caesar Salad (Which is ABSOLUTELY DELICIOUS!!!!) My advice to them is to be INCREDIBLY CAREFUL!!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5M2RHa2pnRRAB",
            "text": "Das Essen war mega köstlich....alles mit frischen Zutaten und das Personal sehr sehr freundlich"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndXNxY09BEAE",
            "text": "Great spot. I like to dine here alone and think.  Food is always fast. It's cozy. I like that they don't play music. Overall it's a calm place to kill time or chill at  before getting on a long D train ride."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eExMd2dRRRAB",
            "text": "I love coming here on sundays for breakfast or rather anytime of the week.\n\nFirst time trying their Greek chicken salad and I must say I'm freaking impressed! Not only are the portions huge but it was fresh and delicious. The chicken was perfectly cooked, seasoned and moist. The greens were crisp, the amount of feta cheese was just right and the olives had no pits!\n\nI highly suggest this as it will fill 2+ people up. Maybe a side of onion rings or fries if you're feeling brave.\n\nThe coffee is always hot and fresh. If your're opting for decaf, expect to drink Sanka though it tastes just fine. You might want to also try the fresh pies they bring in.\n\nI come here for the friendly service and you can see the cooks live so theres nothing to hide. These guys are fast and precise!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdTZyQU53EAE",
            "text": "Great shop ! We enjoyed our breakfast and lunch ! Everything we ordered was exceptional !!! The coffee was great ! We hope to visit this place again on our next trip to New York !!! See you guys soon !!!\nExtremely recommended !!!!!!!!!!!!!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aDh5U2x3RRAB",
            "text": "My fav diner! Quality is always great, workers are friendly and attentive. See for yourself.  Grilled chicken wrap is my Go-To!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM2FDRUx3EAE",
            "text": "Ayda Place is must see. Best 🇵🇪 Peruvian restaurant in White Plains.\nAlso Italian restaurant stone oven 🍕…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNDhmUEVREAE",
            "text": "All around A+ fast delivery and the food taste great 👍 and enough for 2 but not this time it's all mine. Merry Christmas and good morning to all"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeDdpaE1REAE",
            "text": "Their chicken and waffles was very yummy! Could of had more chicken, but the cutlet was juicy! I will come back to this place to try out other dishes!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dmZ5R2ZREAE",
            "text": "This spot never disappoints! The food is good every time. I hadn't had a dish I didn't like."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkclBlQ1VnEAE",
            "text": "I've only ever ordered delivery here and I'll continue to do that. This is one of the best places in the Bronx for breakfast. It's affordable good food. And whoever decided to start wrapping up the drinks to protect your whole order when customers use the delivery services, God Bless You! This is one of the only places I order from where I get to drink all of my coffee and not find half of it flooding the paper bag. I really appreciate that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROb29uTXR3RRAB",
            "text": "Great little 'old school' neighborhood coffee shop in Norwood. Very good breakfast! Generous portions, tasty and fresh. Lunch options are also very good. Staff is always friendly. Love to come here on my days off and have a big breakfast. It does get crowded, especially on weekends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad3ZYQXV3RRAB",
            "text": "I genuinely love love love diners and this one has become an instant staple in my rotations. Home fries were bomb, over  medium eggs were just right, and the service was awesome. Not as big as other diners but that adds to the atmosphere. More chance to get actual service. 10/10"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzanJfaE1REAE",
            "text": "Best diner in the area! Food is always fresh and  service is prompt and friendly.  My favorite breakfast spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyaWVMWkNREAE",
            "text": "Updated as a response and a more descriptive review:\n\nFor the past decade this has been THE place to get breakfast on weekends.\nMy favorite breakfast is their classic egg any style w bacon and home fries. For lunch, my go to is the chicken salad club sandwich w fries and an iced coffee. I unapologetically spend about $40/ week here 😅😅 The portion sizes are fair, the quality is good, the food is always fresh, and the staff are always kind.\nIf im not ordering delivery then I come in every once in awhile for a pumpkin spice ice coffee. It's a seasonal flavor BUT they have it YEAR round. The staff are super friendly and they take the time to get to know you. I love how they treat people.  I didn't show up for a couple months and they noticed my absence and even remembered how I like my coffee. They always make it exactly how I like it. When I'm at home ordering it I tend to order it black w pumpkin and fix it myself at home to spare them the complications during rush. Yes, there are times where they messed up or misheard, but it was ALWAYS fixed w/o any issue.\nMy sandwich always comes out good. I never had a sandwich that tasted or seemed like it was a couple days old or even a day old. You could definitely fool me! I usually take tomato off my sandwiches but the tomatoes here are so good. My FAVORITE is their fries. Unlike other coffee and breakfast shops it's not soggy or plain ol greasy flavorless floppy fries. It's the GOOD fries, they either are or similar to beer battered fries, thick and crispy. Sometimes I forget to add salt.\nIndoors/dining in is not fancy, which I love. It's comfy and homey. You can actually relax here. I find myself sitting at the stool for a moment before leaving when I order my coffee because the atmosphere makes me want to sit down and hang out for a bit. The proof is in how relaxed and comfortable other people there are as well when they eat and chat. You don't feel overwhelmed.\n\nIn regards to affordability, hey, maybe it's not a responsible decision of mine to spend as much as I do here, but it's my choice. The portion sizes are fair, the quality is good, the food is always fresh and good, delivery is fast and the staff are always kind. Its worth it to me. Its all about what you choose and i happen to get stuff on the more expensive side. With everything rising in price these days Nickys has maintained their affordability. Sure, prices are different than 5, even 10 years ago, but nothing outrageous. I 100% believe like everyone else they were affected by the economy and had no choice to raise some things just so they can maintain the profit amount they were alreasy making. In other words, they (unlike most businesses) are not taking advantage of the community and making MORE profit from raising the prices over the years. It's not all THAT different from a couple years ago.\n\nTo be more informative, they only take cash but they have an ATM inside. If someone comes in to beg they don't let them harass the patrons, so it's a generally safe place to be. They are conveniently located right beside the train and the bus stop. so if you need a bite or snack or something to drink FAST on your way somewhere they're there. However there is no parking specifically for the restaurant.\n\nIn response to the person who took the time to respond to my Fry outcry ( this is an updated review the previous review was to ask what happened to the fries) THANK YOU 🤣🙏🏻\n\nThat's 100%  understandable! Thank you for taking the time to respond to my question, to explain,  and to reassure me. It's a relief to know that it's temporary and that you're not permanently changing your fry supplier. Thank you thank you thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NGR2OVFnEAE",
            "text": "This is a small coffee shop I've been going to for over 20 years. Nicky the owner is enjoying retirement, but his son is running the place as if he was still around. Still we'll priced, plentiful and fresh, my favorite veggie orzo soup this side of the BX."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcC1mTk1REAE",
            "text": "We've been here a few times, it's very small and gets crowded but the servers are super fast and efficient so you really don't wait long to be seated or for your food to come. The food is classic diner food, huge menu. The food is very inexpensive and you get good portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdjlYeEZBEAE",
            "text": "The food here is amazing, the grill chicken is very nicely seasoned. The atmosphere is very friendly and the staff is so nice and diligent. The boss is so nice and makes everyone feel like family! I love this diner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeWJMN2lnRRAB",
            "text": "I used to order uber eats here earlier last year and forgot to write a review. The food was amazing the few times I ordered, but the last time I had ordered I had what looked like pube or armpit hair that was cooked into the egg (like stuck to the underside of it) and vomited up the food entirely.\n\nWill never order from here again on principle. Disgusting"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSXzZUV2hnRRAB",
            "text": "They never disappoint, delicious breakfast for great prices."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMDVIcXpRRRAB",
            "text": "Muy agradable la Comida, Buen Servicio 👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYam91SW1nRRAB",
            "text": "The people here are super friendly and service was great. Food was good, I recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdTgtR1RREAE",
            "text": "I used to come here often when I was younger and the service was nothing to complain about but now it’s awful. One of the male waiters is very rude. He just slams things down on the table and walks away. Such as a syrup bottle or the menus. Not very friendly at all. I even had to ask for water.. I come to this place because it’s close to home and a convenient place to get breakfast but if this keeps up it might be worth it to make the drive to somewhere else."
        }
    ],
    "reviews_count": 65
}