{
    "name": "Marconi’s Pizzeria&Restaurant",
    "place_id": "ChIJFxAlVtvzwokR7OucYUHe-Mc",
    "grid": "BX7",
    "address": "181 E Gun Hill Rd, Bronx, NY 10467, USA",
    "rating": 4.3,
    "user_ratings_total": 98,
    "phone_number": "(718) 798-4970",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WWVFSTFMVXN5YVhGVlJuaEhjWGh1Y0U1M1VuYxAB",
            "text": "This pizza is incredibly delicious, with all the ingredients being super fresh and good prices - I highly recommend it!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMVJ6ZEhUR2RqUjA1UVVXeFlkbVU1TldsVGRrRRAB",
            "text": "Marconi’s pizzeria is my favorite pizza spot in the area! By far the best pizza and all the other food they serve there is absolutely amazing ! I love their customer service!, always on point! Always smiling and soo attentive! The grandma pie, penne vodka, chicken Marsala  ! So so good! Must try!\nHighly recommended this place in every way!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abFFVVlVkRWwxU0RsbGFqUjBhMlZpV25GSVJrRRAB",
            "text": "If I could give six stars, I would. It’s not just pizza—it’s happiness served on a plate."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Jd01GTjVaVmRxWm1wcU1XOUtSbWhtVlhkVmNGRRAB",
            "text": "Solid neighborhood spot for pizza. Has been around for years."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1ZqRmlhVmxPYjIxelpERmliVGhSUVZneGVYYxAB",
            "text": "Randomly stopped in and tried their Sicilian, I’m eternally hooked. It’s the lightest, perfectly crispy, unbelievably delicious Sicilian I’ve ever had"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdFRXZEtlRWRIYzJOTGRIWk5WV050ZGpocFJuYxAB",
            "text": "Pizza and calzones are fresh and delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUVRHTnpSVzFLVDFGVGJqaHdZMFk0VldWcVpGRRAB",
            "text": "Great service great food great atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM2RtWklkMlY2VDFnM1NqaFpRVzVtTWpsamIyYxAB",
            "text": "Place is always clean, food is delicious, friendly staff, and they get my vote. Thank you for serving delicious pizza for my family. Garlic Knots OMG!! So GOOD!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNlEwOXRNbTFwU1MxcVpIUnJjRmwxV21GVVJYYxAB",
            "text": "The spaghetti with chicken parmesan is delicious and plentiful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oelgweE1aVUpyT0Y5M1VGVlJWMFpHZVZOcFFuYxAB",
            "text": "I ordered from uber eats and when it arrived it was the completely wrong order I told the uber eats driver and he said to contact the store because he just picked up what’s labeled with my name. When I called the store they tried to tell me they saw the uber driver switch tickets 🤣🤣 these store is a joke."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvamVyNk9REAE",
            "text": "Classic NY slice. Tasty. Perfect cheese to sauce to dough ratio 🤭. Friendly service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChNDSUhNMG9nS0VJQ0FnTUNvdGxNEAE",
            "text": "Been coming here for 15+ years. Marconis never disappoints!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cDduVVFnEAE",
            "text": "My husband was having surgery in montefiore so while I waited I decided to get pizza, I use to live in the bx and bought home upstate ny, honestly pizza there sucks, so anyways my friend and I enjoy the pizza was delicious, so after I finish I went to them and I ask waiter a Spanish guy that what time they open tomorrow because I wanted to buy a few pies to take upstate, so we were talking and then this rude man I’m guessing manager said the hours and days are outside, I said EXCUSE ME? I said I don’t live nowhere near here and I wanted info because I wanted to take pizza home which is upstate, I told him no need to be rude this is the first time I come here, I was angry how he came out there was no need for that, now tomorrow I don’t know if I should waste my money on 3 large pies because he was so rude and that was no way to talk to me that way, I’m a grown as women and should be respected, I now don’t know if I want to go somewhere else and get pizza, their lost not mine…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdFBPQ0F3EAE",
            "text": "Chicken parm was tangy and not enough parmesan cheese. Chicken francese was not lemony. Meatballs were good. Salad was good. Powdered donuts were chewy. Overall, food was not authentic Italian compared to Arthur Avenue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudU1fNnJRRRAB",
            "text": "Good place quick  easy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb3ZTZGtnRRAB",
            "text": "Pizza is always good from here. Chicken parmigiana had soooo much cheese, I was in heaven. A little pricier than most pizza places but they make up for it in quality and quantity of food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cW9lVVN3EAE",
            "text": "This pizza is amazing nuff said"
        },
        {
            "date": "1년 전",
            "language": "iw",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeWMyVW1RRRAB",
            "text": "פיצה טעימה מאוד, הכל בנדיבות רבה."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULVBfaGd3RRAB",
            "text": "This was my first time at Marconi’s and it didn’t disappoint. A Montefiore employee (& local) recommended. It was lunch time. But, my husband and I ordered dinner because we were really hungry. We received our meal in lightning speed, with all the fixings and it was delicious. We’ll definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOE1PYkp3EAE",
            "text": "We ordered 2 Chicken Parmesan dinners at LUNCHTIME (& while across the street from Montefiore hospital) where people and traffic are a constant.\nBut, these guys came through with our order right away. It was hot and delicious. The cheese and sauce were to die for.\nWe’re NOT from the neighborhood. However, the locals steered us right. Marconi’s is the local joint to get DELICIOUS 😋 Italian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUa0lMSDRBRRAB",
            "text": "Fabulous"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ05MQnB3RRAB",
            "text": "Great slices!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNTl6N3NRRRAB",
            "text": "Best Pizza in the Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbVkzbE93EAE",
            "text": "I love there chicken cutlet sandwich 🥪 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOFA2UWt3RRAB",
            "text": "Marconi's are updating the menu prices ... so ask about the new prices (if confised)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeUlienFRRRAB",
            "text": "Great pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkM08ySWR3EAE",
            "text": "My favorite in all of Tri State & Westchester my apologies but they rock."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0N3V5bW9BRRAB",
            "text": "The food at Marconi’s is definitely a great pick in the area. Everything made fresh to perfection, and your met with a kind ear whether in person or for delivery. Keep in mind fresh in person is a little better but you wont be entirely disappointed  with their delivery services"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaThQNmp3RRAB",
            "text": "Come support your local bronx pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWX19lcUZREAE",
            "text": "I like the salads and the soup. My mom likes the pizza. Not the best pizza on the planet but it's OK. It's the closest pizzaria to my mom's appointment on Bainbridge."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZzRXbTVRRRAB",
            "text": "Pizza here can be really delicious at times. Prices a bit high lasagna slice is good so is the grandma about $17 for 2 specialty slices and 2 drinks. You’ll get your order quickly and there’s usually space to sit. They give you hot marinara when you ask for sauce on the side and that’s always a plus"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3A3ZFZnEAE",
            "text": "Greats flavors in there dishes , I can complain about it . I was over 4 days my baby was admitted to hospital and this spot was my fav spot to buy ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseExxRktnEAE",
            "text": "Never had a bad meal here. Great food, great people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c1lUZlB3EAE",
            "text": "If I could rate the service zero I would. Cashier and another worker were both clearly sexist. They didn't want to help me but were gung ho to help my male companion. I paid and went to collect my food. The cashier looked my companion in the eyes but refused to acknowledge me and thanked him for his patronage."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NG82bElREAE",
            "text": "I love this place i wish they delivery where I live . Food is always great and the staff are always respectful  and helpful ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MU1iOHRRRRAB",
            "text": "I only had garlic knots and it was yummy, it tasted a tad sweet which I liked, it was crunchy. My only issue was that it was a tad cold. And the marinara sauce was delicious. You get 6 for $3 and some change, sounds like a good deal to me. Lovely looking restaurant too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaXzRYb2dRRRAB",
            "text": "I like to call myself a person who knows good pizza. THIS PLACE HERE HAS GOOOOOD PIZZA !!! Good Sauce, Great Crunch, NOT OVERLY GREASY !!!! The Fellas Was Polite and It Looked Like The Community Loved The Place !!! This Place Was A Gem To Me !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNzU3OWtRRRAB",
            "text": "I gave Marconis Pizzeria a low score the last I ate here and decided to give it another try but,  this time around I wish to give this place half a star if available. This time around the owner of Marconis Pizzeria turned out to be difficult with customer satisfaction and told me that if I didn’t like his pizza shop, I can go look for another one. The owner takes full court advantage by talking reckless because there is no other pizza place around the Montefiore Medical Center & Gunhil Ave.\nP.S.\nIf anyone goes to eat in the establishment please be mindful of the flys around your food.\n\nI hope someone else opens up another pizza shop around so we can feel like regular customers. I don’t mind paying, just give me good service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDhTeGd3RRAB",
            "text": "I ordered a dinner chicken francesa & the big board says $14.95 & they charged me $17.90 for the dinner before tax , I showed the dumb worker behind the counter the sign & he says the sign is a mistake, UNBELIEVABLE!!!  These people are a  over price rip off for their average pizza 🍕...  There customer service is Horrible!  Stay away from there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNzVxZUVREAE",
            "text": "The food is great but the service is terrible.  I was trying to place an order and the guy taking my order was repeating my card number out loud. I asked him not to repeat it but he did it a second time. Food is great but they treat you like they don’t want your business. I never write reviews but I just think this is a nasty way to treat your customers, especially LONG TIME customers."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa0x5NVB3EAE",
            "text": "Marconi is the best pizza in NYC. I walk out of my way for it.  Get the meat lover pie if you like that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOVlQSllBEAE",
            "text": "Best pizza in the area!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdDVtcXF3RRAB",
            "text": "I had a wonderful experience at Marconi's Pizzeria. The chicken marsala was delicious, tender and flavorful, with a rich and creamy sauce. The portion was generous. The service was fast and friendly, and the staff was attentive and helpful. The restaurant was clean and cozy, with a nice ambiance. I would definitely recommend this place to anyone who loves Italian food.👍."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbmFEME9BEAE",
            "text": "Best pizza in the Bronx, excellent and fast service… they never disappoint . The Sicilian pizza is also AMAZING"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbGZhbXNnRRAB",
            "text": "Nice and tasty pizza, onion rings are excellent 👌."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeWNhUS1nRRAB",
            "text": "It was excellent"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ1ktRE9nEAE",
            "text": "Unless you’re a regular or somebody they know from the neighborhood don’t expect them to be too enthused about making your order, especially if you call for pick up. Make your face known."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdHE3T01nEAE",
            "text": "I'm so disappointed with the phone service. I understand your busy but how you leave me on the phone for 5 mins and took every order in the store . Its one thing to be on hold 3 mins but 5 and you didn't even apologize . And I had to hang up and called back and was hung up on 4x . The food isnt even real italian I come here because I live down the block .but its ok 5 guys can have my business.  They may cost a but more but atleast customer service is on point ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cXZDQldnEAE",
            "text": "One of the best pizza spots in the bx"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MGJ2Nkl3EAE",
            "text": "Very good pizza! I’m from Napoli, recently transferred here in New Yo. Yesterday I tried this pizzeria and I have to admit that, if very far from Napolitan pizza, the slices are very tasty. Good price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdjhuRnJRRRAB",
            "text": "We ordered a pie of pizza and was really good, the workers are really nice, the prices are reasonable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMkx5eGtRRRAB",
            "text": "I ordered through Uber eats and I never ever ever write reviews but let me say that this place did not disappoint. I ordered zeppole and by far the best!!! It’s better than those greasy ones from the Sangenaro festival in the city. I also ordered the fettuccine Alfredo for my son and it was fresh and tasty. Lastly, I ordered a cheeseburger deluxe medium well and the cheese melted perfectly on the burger. It was cooked perfectly. I have had so many horrible experiences with local pizzerias and almost lost hope until I ordered from here. I’ve been living in the area for years and I’m unsure how come I never ordered before. How did I miss this place? This is my new favorite. They are also reasonably priced. Trust me when I say the food is fresh and delicious!!!  I wish I could give this a billion stars. These other local pizzerias cannot come close. Good job!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWFDdm1RRRAB",
            "text": "This place has the best pizza in the area and all the other food they serve is excellent.    Its a family owned place and you can tell in the quality....these folks care about making their customers happy.   Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtXzgyNTJRRRAB",
            "text": "The cheese 🧀 doesn't taste 😳 like its fresh mozzarella.  The sauce taste like can sauce.  It's reminds me of school pizza never getting delivering again.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoM3BDM2VREAE",
            "text": "Their menu is probably not recent. I paid 8 and change for a cheese calzone that said 5.95 on the pamphlet.\n\nOn the bright side it doesn’t take away the great service I received from the workers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOTctdnJ3RRAB",
            "text": "i order from here all the time but last-night look at how they delivered my pizza. Also the pizza is now coming super oily. idk its like a hit or miss with them"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLXZxNlRBEAE",
            "text": "Mejor servicio y mejor calidad no podrás encontrar en Nueva York mi experiencia Fue increíble en este lugar me gusta mucho todo lo que venden ahí"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOWY2cmZ3EAE",
            "text": "The food is soooo good you just want to slap your MAMA!"
        }
    ],
    "reviews_count": 58
}