{
    "name": "Popeyes Louisiana Kitchen",
    "place_id": "ChIJdzWpayPzwokRGNdi4IMB3V0",
    "grid": "BX7",
    "address": "309 E 204th St, Bronx, NY 10467, USA",
    "rating": 4,
    "user_ratings_total": 154,
    "phone_number": "(347) 427-2180",
    "reviews": [
        {
            "date": "수정일: 4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eUtycWtRRRAB",
            "text": "Muy buena el lugar impecable el servicio el mejor mi orden no tardo ni un minuto y con mucha amabilidad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUlpVcENTbXQ2WlhocmFrdGtPVlZMYlVjM01rRRAB",
            "text": "This is hands down the worst Popeyes. This is the *third* time they’ve messed up my order, and once again, I got spoiled coleslaw. This is actually the second time I’ve brought home sour, spoiled coleslaw from this location. When I called…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdFVqbEZPVFpGYW0xblRIRnlZbVV6YkhWaU5uYxAB",
            "text": "This store has the worst customer service. I ordered 15 cheesecakes and they didn’t put any cheesecakes; instead they offered apple pies. Also, they kept me waiting for an hour and 11 minutes. I ordered at 1:16 pm, I received the order at 2:27 pm. Worst customer service ever."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMVUwbzVTMTlmT0RWMk5YWlRkR3ByTjNjMFNHYxAB",
            "text": "This location was NOT customer friendly. I ordered a promotion they offered to, buy one get one free and they did not honor their own promotion. I only received one sandwich. I called them to let them know, however they refused to provide the other sandwich. I will NEVER order from them again or any other Popeye for that matter again. Treat customers better!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNlJsUldWV2R2T1d0aGQzTnZURkF3UTNoNFZuYxAB",
            "text": "This Bronx Popeyes is hands down the best one I've been to in the 27 states I've traveled,  several in which I've eaten Popeyes!! Big ups Bronx!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ1VtRk9MVmxSWldaek0wc3dhV1ZTWWpGVFVWRRAB",
            "text": "Fresh food,friendly, fast service! Clean!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoamVucE1WMk0yUTFKb1ZXbExjbDlqWXpWeVJHYxAB",
            "text": "Muy limpio y también atienden rápido, gracias"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MVdFMHdiMmRCV21FMWNWZ3RSalpKTmxCVVExRRAB",
            "text": "BAD BAD BAD SERVICE WAITING LIKE 1 hour for my order and have to pay for 2 honey mustard\nMY LAST TIME IN THAT STORE👎🏻…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMaUI0UGE4OHZURC1RRRAB",
            "text": "Manager Popy should how do customers service again. Today I went to purchase some sweet heat sauce . And we were only three people on the line . But two lady manager pay no attention to lobby . They were busy for making food but very very slowly. Manager Popy was taking with someone with earphone and making food very slowly. I used to work in Popeyes so I could even think how she became general manager with her poor performance of making food and customer service. ! I was waiting around 9/10 min . And observing their service which is very poor . Manager Popy should have take her business seriously. Or she can learn her lesson again. No shame !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQN19sNXFlNl8tc2NREAE",
            "text": "I was not restroom or wash my kids hands not serve nice chicken not all done. Everything was dirty not happy at all. I spent over $60."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMzVHMmhBRRAB",
            "text": "The staff talking  more than doing the Oder I did my Oder on the app and was waiting they finish order and kept it in a corner on the pantry and I was waiting like dummy and order was for dinning and they prepped it go with no napkins no condoms I had ask if in my Oder was received its nonsense there conversation was making there day and and me other costumer waiting like if there no tomorrow and they say fast food more like whenever nonsense"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dWZMbXRRRRAB",
            "text": "Lobby was very dirty , trash everywhere. I wanted a refill on my drink I was told 1.00 more after my meal was already 12.00. Employees left the building to get coffee but couldn’t change the trash."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN0lyZHhBRRAB",
            "text": "I love popeyes"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MTYtdllREAE",
            "text": "Fresh food and first service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MTlQaGFREAE",
            "text": "Nice place and service was first."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bDlLdFBBEAE",
            "text": "Food were delicious\nCool customer services\nneat and clean environment"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eDluT0NnEAE",
            "text": "Quickly service"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N19UeDhBRRAB",
            "text": "I spend Mondays and Thursdays there during my breakfast time and they have good service and the food is hot and fresh."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eDY2ZDBBRRAB",
            "text": "Nice service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dnRlV2FnEAE",
            "text": "Everytime you come to this location for anything it’s long wait times, not sure they understand what “fast food is” I came in today for a 4pc chicken combo the cashier was very rude and rushed my order after I told her 2 breast 2 thighs. She rung it up as a wing, a breast and a leg are you kidding me!? lol she had an issue when I said that’s not what I asked for after checking my receipt. I said: everytime you guys give legs and winds and they’re very small pieces that doesn’t seem right for $17.41 hopefully they work on their customer experience in this neighborhood I’ve seen so many businesses come and go"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d2NfYlJnEAE",
            "text": "This location looks like they recently opened.\nMy first impression was very positive. The place was very immaculate and the atmosphere was very serene,comfortable,and pleasant. The food is deliciously well cooked and tasty. Customer service is excellent and the employees are very cordial. I was very satisfied with this business. I give it a 👍👍👍"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbmJLaGhBRRAB",
            "text": "Quality service and cashier smile."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN2FIU1h3EAE",
            "text": "Nice"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbWF1Y0FREAE",
            "text": "Good!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbXNuMDJ3RRAB",
            "text": "I wish the big box deal allowed you to upgrade to a premium side like a Mac and cheese."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcWNpblBnEAE",
            "text": "I love the environment of this restaurant everything clean"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ0xqcnp3RRAB",
            "text": "Buen lugar, siempre está limpio y muy ordenado, las empleadas aunque no son hispanas, siempre tratan de hablar español, muy atentas y amables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZzdLRVNnEAE",
            "text": "Tried getting a big box for the price offered $6 any 2 signature piece 2 sides and biscuit, but couldn't because the employee wanted to over charge me $1 extra for wanting a breast and wing. The cash register machine even rung out 6.53 for the order (breast and wing) but she still wanted to charge me $6.53+ $1 extra separately, It made absolutely no sense and I saw right through that scheme, ya can keep that chicken nd make no $ from me."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNGRfcldnEAE",
            "text": "Was busy. Didn't wait long for my food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaWJ6UFFBEAE",
            "text": "September 26 2024. The manager named “POPY” i believe that’s what her tag said/picture shows . The cashier was nice, no issues. I paid for my food. Once I purchased my food , the cashier then tells me I have to wait 10-15 minutes because they just ran out of chicken. I said okay that’s fine. I went to sit down for literally about 3 minutes, got up to ask for a courtesy cup of water. The manger told me “ No , but you can buy a bottle of water”. I couldn’t believe she said that. I said “i don’t want a bottle of water, you aren’t supposed to deny me a courtesy cup of water, it’s a small cup of TAP water… come on Popeyes this was so wrong. She was so rude and mean. I explained about 3 times how can you deny me a courtesy cup of water when 1) I LITERALLY AM A PAYING CUSTOMER. 2) I WAS TOLD AFTER PURCHASING THAT I HAVE TO  WAIT 10-15 MINUTES FOR CHICKEN. How could you deny a paying customer a courtesy cup of water. she still didn’t relinquish over something so small . That’s when I asked for a FULL REFUND she said to the cashier “ give it to her “.\n\n* I LITERALLY NEVER EVER WRITE REVIEWS OR TAKE PHOTOS BUT I WONT STOP COMPLAINING ABOUT THIS UNTIL SOMEONE RESPONDS TO ME!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OV92eVFREAE",
            "text": "Great Customer Service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3X3VEX2pnRRAB",
            "text": "I spent $15 on 6 wings and a big box. Which was very little food. First they gave me five chicken wings, rather than 6. I had to tell them. They never put napkins in the bag for this greasy food. I saw a bathroom in the restaurant. They keep it locked with a double doors, so no one can use it. Yet the workers son used it without a problem, or some kid they knew.  The workers refused to let me son use. Most likely they did not want to clean it, so it is restricted.\n\nI will never give this place my business again: this is no way to treat reoccurring  customers who buy food to help them keep their jobs and to provide for their families. I would rather give the business to any other place around this area. Never again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aU9PZ2F3EAE",
            "text": "Ok.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieHZtOF9BRRAB",
            "text": "I will never buy from this Popeyes again! The manager didn’t want to change my drink and the drink was so sweet I got frozen lemonade!? I asked if he can change for mango ice tea and he said no! I bought a chicken wing combo and he put very little French fries in a bag and I was splitting the food with a friend. When we got home she told me he barely gave you fries and also no biscuit! So I called he said come back I will give you more fries then I get there and after he gives me the fries I asked where’s the biscuits?? He said it doesn’t come with the combo and I spent 32$ on 12 pieces of chicken with fries and no biscuit! Very expensive and the manager was cheap and no Napkins! Also they didn’t offer any sauce I had to ask ! So ridiculous!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNic1A2OHZnRRAB",
            "text": "Took Took long after I ordered only after I said I want my money back did the wings appeared from the back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMy1HR3JBRRAB",
            "text": "Food is always good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNzhHOFZnEAE",
            "text": "Buen lugar para comer pero eso si, no tiene baño y la mayoria de empleados no hablan español"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM2ZuN2tRRRAB",
            "text": "Do not order French fries in this location they gave me such a small order of fries for 2 orders. I called them on why such a small amount of French fries and they said that's the amount they provide.. all other locations are generous. Also the chicken was dry. The location was better run before now my family won't be ordering here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXN0wzYy1RRRAB",
            "text": "I ordered a three piece chicken with Mac and cheese and frozen lemonade,the chicken was so dry and a thigh was only breading,the Mac and cheese was delicious and the frozen lemonade was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb1ktWkZBEAE",
            "text": "They charge a lot of money and the orders are always wrong.\nEvery time I ask  the cashier why  charges me more money for the same food, she gets upset, she is not friendly and  is not the best Popeye, I do not recommend it. The\nHispanic men and the Indian lady  has attitude. Avoid being robbed every time they charge you."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeklPZWVBEAE",
            "text": "I have had a great experience every time I have ordered instore, online or via food service app. The food has been fresh every single time. The employees are extremely friendly and knowledgeable regarding upgrades or cost cutting. Also the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdGV1aDh3RRAB",
            "text": "Biggest feedback for the manager: please take care of your customers, dine-in, takeout, or mobile order. This happened to me multiple times:\n\n3/5 times i order mobile order, i'd expect it to be ready within 5 minutes of me stepping into the store, because mobile order is ordered in advanced. 3/5 times, i had to wait upwards to TWENTY (20) MINUTES to receive my mobile order. I stand by the \"mobile order pick-up\" sign, and try to get their attention, but every time, they ignore me (no eye contact and walk away quickly) or only serve the dine-in orders, and then not making eye contact and walking away quickly.\n\nPlease please please give the mobile order people your attention and don't deliberately ignore us or force us to walk over to the cash register to get attention. What is the point of the \"mobile order pick-up\" sign if it doesn't make a difference where you stand to get attention? Just get rid of it then. If we're not saying anything, then please ask. You never ask, ever. I know you see people entering your store, and if you don't check-in with them, how will you know why they're in the store? This shows a lack of concern and care for your customers, so please pay attention to people coming into your store, especially if they're standing and waiting."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdjdMYWNnEAE",
            "text": "The quality of food (Crispy Chicken and Tenders) is excellent compared to other local places like Texas Chicken & Burger.  It is also fairer in price.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOGZtNk1REAE",
            "text": "This is my first time I am writing review for any restaurant. I want to tell everyone to be careful when you are paying for your food. Sometimes they charged extra and refused to except their faults.Before you leave the store, please recheck your receipt."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbHJYT1ZnEAE",
            "text": "The woman manager doesn’t do her job at all. Every time a customer had a problem she would just walk away and not say anything to resolve the issue. And then the employees do the same thing and another employee comes to handle it. Why is…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHa2RYS0J3EAE",
            "text": "PROFESSIONAL and very ACCOMMODATING to me!! I spoke with MD (manager @Store on 204th at BX location) and he was a breathe of fresh air!! Made me feel like he listened and went over and beyond to fix the problem.  SUPER SATISFIED w his…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNHF6ekpREAE",
            "text": "The food was good but two many delivery guys just sitting there at the tables on their phones waiting on orders taking up seats not even eating beside that u get your food fast depending on how busy it is"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OFlESUV3EAE",
            "text": "Ther is a place to stay and eat but there's no bathroom , so how you want to sit on place you can't even wash your hands. 0 start they better add a restroom 🚻 😤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabElQb2ZnEAE",
            "text": "I wonder why store always look empty? Everyone shouldn't have to buy big meals just to get chicken. I have seen some walk out. Something wrong here ...,."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNDU3MDZnRRAB",
            "text": "The Spanish male employee is so rude and arrogant. Picks and chooses who and when he wants to serve and just will start talking and playing around no matter how busy it gets. This location needs new employees period."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGeHRhODdBRRAB",
            "text": "I went there the cashier name Lima order by her supervisor name popy refused to let me use the bathroom she told me the bathroom wasn’t working and my friends just used the bathroom before me.. when I asked to speak to a manager the manager never showed up"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcGVPeEtBEAE",
            "text": "Great service chicken is not special same as every Popeyes but it’s so good so it does not matter love this place yummmmmmmmmmm"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabXRfMXpnRRAB",
            "text": "The price and quality of the food has gone down ever since they reopened. New staff not as welcoming as before"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeHRMYk53EAE",
            "text": "Is frustrating most of the time you order online to pick up you still have to wait when coming in. Ether they haven’t start your order or excused that it doesn’t show up in there order’s screen."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla0tlMENnEAE",
            "text": "Went to the store mid day & received mid level chicken. Wz not the fresh & crispy expectancy. Thz happened b4."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNzR1VnlnRRAB",
            "text": "Attention!!! Very bad place.Not safe.Don't go there.Homeless drunk guy touched our food and bothered us but the staffs didn’t say any word.How do you eat there when the place is not safe and the staffs Just doing nothing??I want to give zero star but I dont have that option.very disappointing...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdE1mRWZnEAE",
            "text": "i love popeye and there services so good,the chasier behavior so nice and they’re so friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbXVpbmZREAE",
            "text": "Why is the store temporarily closed ? I like popping in here because the staff is friendly and the menu options is affordable and the food is good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ1Azb3R3RRAB",
            "text": "No recomiendo  comprar aquí,  no tienen personal para atender , se demoran demasiado 30 minutos esperando  para que me atiendan  , y comer sentado ,no tienen baño pésimo lugar"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM2V5NG13RRAB",
            "text": "Friendly staff - super clean and quiet restaurant -  food was hot fresh and very delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN2QyZ0lBEAE",
            "text": "The food was fresh . They offer their special items."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbm9XVHd3RRAB",
            "text": "I got 11 pic  chicken it was so good . Everyone was nice and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaGFTemdRRRAB",
            "text": "Cashier friendly service and restaurant nice and clean."
        }
    ],
    "reviews_count": 63
}