{
    "name": "North Star Cafe - Fordham",
    "place_id": "ChIJlY3lXoDzwokR256yNqa2x6c",
    "grid": "BX7",
    "address": "387 E Fordham Rd, Bronx, NY 10458, USA",
    "rating": 4.1,
    "user_ratings_total": 615,
    "phone_number": "(718) 295-8801",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzME5hSkx3EAE",
            "text": "I remember this location since I was young. I was in the neighborhood and wanted some breakfast. You order first and pay, and then they give you your order. You share tables with others if you want to dine in. It was pretty busy.\nUPDATE: There is a change of name. The location looks a little updated. The staff was quick with serve."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT1RVNW5jR1JoVmtaalIwNVNTR1JPWlhSa1pXYxAB",
            "text": "Okay food if you dont want junk food like fast food. Not as good anymore for the price they want it , overpriced with limited selection daily with virtually the same thing weekly . Good id you want a whole meal"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcnVPbk1REAE",
            "text": "3/26/23- Today I ordered the Super Mario on a roll.  This sandwich was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeFJrZDJRblZxTmswMUxYSlFNbWgzUTJzMWRVRRAB",
            "text": "I payed 10 dollars for a small cup of yogurt just for it to have moldy fruit on top btw they didn’t let me look at it …. Never coming here again"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUVJDMXRNVkp6WVhSeU9EUktVWGt0VVhkVE9HYxAB",
            "text": "North star café un lindo lugar y buen servicio"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xselZUQnlZMmRYV0VsaGNqUjNSSGxFU0dSVFNFRRAB",
            "text": "Always my go to on Fordham.     Great food.  Great price.. clean"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX3J6YkpnEAE",
            "text": "Todo bueno"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMXRxeXhnRRAB",
            "text": "Food was so bland I thought I had Covid. But I did taste the burnt oil from the deep fryer."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LWNuaEpREAE",
            "text": "So I've been ordering from this place for like 2 months no problems until last week so my building has two automatic locking doors and I have no way of opening the door from the 4th floor basically my apartment so every time that I order food I have to go downstairs that could be annoying sometimes but my building is usually busy people coming and going all the time one day delivery guy calls nobody's coming or leaving the building and I told him in 1 minute if nobody open the door give me a call go to the front of the building and I'll drop a rope with a hook with the money he never called me after 1 minute he called me like 5 minutes later talking about he's got other deliveries being all rude on the phone and I said yo my man I told you to go to the front I'm not coming down I'm dropping the Rope down I told you that why didn't you call me I guess he didn't understand me anyways basically I forgot to call the restaurant and complain about this guy's rudeness and basically told them he doesn't want to deliver to me anymore and make me out to be the bad guy and then when I call they will tell me we can't deliver there no more I explained to them what has happened and it was straightened out for a little bit and then today I call and now back to we can't deliver there anymore so I am beyond done with this place the food wasn't even that great"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2blB5RkJnEAE",
            "text": "if i could give zero stars to the food i would have. everything is dry, tasteless and overpriced. the only good part was the smoothie that i guess i can thank the farmers for making the fruit tasty because even the strawberries are frozen. the seating is chaos and its dirty. bits of leftover food on top of the strewn around tables and chairs. terrible. i recall this place 20 years ago and it was a nice mom and pop place to eat. now? a join of terrible food for exorbitant prices."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bk96NVVREAE",
            "text": "I went there today with my family. The food is all dry and bland. It was worse than Panda Express. The only thing going for them is the fresh fruit and even one of the mango pieces was hard as a rock. And the prices for this awful food.. a waste of my hard earned money."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeTctNGR3EAE",
            "text": "Wonderful staff, quick service, usually space to sit depending on the time. Buffet in the back, clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ19IWmlnRRAB",
            "text": "Food is very delicious !!! Enjoy eating here and quick service as well. Prices are pretty good as well. Love how clean the place is always and conditioned with AC!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydHVhRzZnRRAB",
            "text": "Fresh REAL food not boxes or pre-packaged. Clean and respectful. Fast and hot deliveries.\n\nTracy\n2501 Grand Concourse"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyckkzVjZBRRAB",
            "text": "The first place in New york  that sells food that I eat. Especially  the fried plantain and broccoli  I enjoy dining  there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcm92YzFnRRAB",
            "text": "Small space, there is no waiting area, which can be a minus in extreme weather.  Food is good, they actually have hash browns in their breakfast sampler and it’s a good portion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaEtpWm5RRRAB",
            "text": "I love Primavera Cafe, the staff, very friendly and polite.\nThe chopped salads, food bar, smoothies and especially\nobsessed with the Clam Chowder.\nWould like to ask for a special request.  I am sure others will appreciate it as well.\nPlease make a permanent day for Clam Chowder.\nMaybe Fridays :D\nThis way we know when we can order it.\nThank you guys"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZektxOGJ3EAE",
            "text": "Service and food are good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGb2Z6NUtREAE",
            "text": "La comida muy sabrosa 😋😋☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcXJqbmh3RRAB",
            "text": "Great food & a quick rest stop. This place would be rated 5 stars if reviewers wouldn’t drop a 1 star review a the drop of a hat. Order online since the place is busy & give them time to make the order, I’ve never gotten anything wrong & the staff has only been kind and helpful"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaczV1LWdRRRAB",
            "text": "I always order a baconeggandcheese in the morning but I tried out their chicken nachos and it was so good! This restaurant is amazing and the food is cooked to your order"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNThPdWdBRRAB",
            "text": "The food is not bad, but the cheese burger has a lack of cheese but I have a lot of fries with it. The place is good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadllfZnZ3RRAB",
            "text": "Stopped in while waiting for my train. Pleasantly surprised by this place. I ordered a Bacon Egg & Cheese, it was Excellent. Fresh bread, crispy pork bacon, eggs done just right. I will definitely be back to try other things on the menu!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacFpuMDlnRRAB",
            "text": "Always has fresh food that tastes great especially the bar where they have a bunch of choice. A little pricey for it but the quality makes up for it as you get what you pay for."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb2NTSWxnRRAB",
            "text": "Every time we call this place to order, never answer our calls"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbEllNV9BRRAB",
            "text": "Muy buen ambiente, me encanta la ensalada 🥗 de ahí"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OGN5c0t3EAE",
            "text": "The food here is delicious. I recommend you try their food if you haven’t yet. Now i will say the buffet part is a bit expensive its $10 per pound. Thats my reason for the 4 stars instead of 5. They offer delivery and you can pay cash, apple pay and even google pay or credit or debit. They also have juices and smoothies. You can either dine in or takeout. The customer service is good. Also the number listed isn’t working so if you are trying to call you will get a busy tone but they have 4 lines. So just change the last number on there to a 2, 3 or 4. Save that trip and call and order or order through grubhub you won’t regret the food from there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z0stSkNREAE",
            "text": "Gave the cashier $100 bill cause my food came up to $17 and I didn't have change, she ignore me  when I tried telling her something important then snatches the bill, and gives me back $33 out of the $100 I have her! I was supposed to get $83 back, she knew what she was doing she tried to rob me didn't hand me my recipt either! When I looked back at my change I told her\" 33 out of 100 when my foormd cost 17?! When she got caught being a thief she gave me my correct change, but had I not said anything she'd keep my money. But I would recommend going, them cashier woman are RUDE, AND CARNIVOROUS, They will steal your money(change.)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSellXekh3EAE",
            "text": "Best hot coffee around here!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbVB1WWpBRRAB",
            "text": "Exelente desayuno 🥣"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXZmTkd3EAE",
            "text": "Rico desayuno"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobVlUdTlnRRAB",
            "text": "Great eating environment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNS1YRktBEAE",
            "text": "I been ordering food at this location for almost two years. since 2022 they changed. They charged you for every little thing. I ask if I could add my own protein since the one they offer causes me gut issue and the staff blankly told me no.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCellPODVRRRAB",
            "text": "This place is a gem in the bronx..I have coffee and breakfast here at least 4 days a week. Staff and owner are very friendly .I recommend this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdXFuZ0tnEAE",
            "text": "Like most places, it's changed since the pandemic. It's okay"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNTdtU1FnEAE",
            "text": "Great place"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGNtSUZ3EAE",
            "text": "Es un poco caro la comida y la jente que trabaja ahí no son amables"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld1ozZTF3RRAB",
            "text": "This restaurant has the most delicious food omg to die for, bien rica la comida aqui lol recomiendo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNld2FLX0tBEAE",
            "text": "They failed to send 1 side of chicken and refused to rectify the matter. They said the only way they would consider providing the missing side is if we sent back the whole order. People were already eating so we told them we could not do that. When the lady that came to the phone wasn't helping I asked to speak with manager and they just left me on hold. I will make sure no one from this office never orders from them again. The office ordered $95 lunch tipped the delivery guy $10. Epic Fail, Never Again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dTl1TG1nRRAB",
            "text": "Very expensive for mediocre food. Also, if you order for delivery, be prepared to be asked for a tip by the delivery person - even though you tip on your card"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dll2cXFBRRAB",
            "text": "I love ordering primavera food always fresh cooked on the spot delivery guys are very courteous and respectful I highly recommend it"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPenJDcnZnRRAB",
            "text": "bueno"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOVBpeGFnEAE",
            "text": "The food there is delicious and so is the coffee I tried the buffet and it was so good. The service is excellent  I plan to visit again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyd3RPTTdBRRAB",
            "text": "The food and smoothies were great! Customer service was excellent! Very healthy food options! This was of my favorite places in Fordham Road! I recommend it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNmZQU09BEAE",
            "text": "Good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOEk2d1ZREAE",
            "text": "Great! Smoothie!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaWZDTk9nEAE",
            "text": "I got a bacon egg and cheese on a bagel and I feel like it was the best one I've had in a long time. The sandwich automatically comes with 2 eggs and enough cheese , the cheese was my fave part ,bacon it had just the right amount.Plus the price was not so high like other places i know."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcnBDTGF3EAE",
            "text": "I paid 26 dollars for the food and it wasn’t worth it. I had put at four small pieces of salmon along with the lo mein and Broccoli into my container thinking it was going by the price 8.99 per lb. When we reached the register the cashier…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzamNqbzBnRRAB",
            "text": "They are good, but  they need to lower the salt level on soups, its too high.\nother than that, food taste great; also their bread its crazy good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMkxuMlNnEAE",
            "text": "The buffet had some good food but the string beans were awful. They tasted like straw, chewy, no flavor and tough. Overall it is a good place to eat. I liked my smoothie, not the best because they had no plant milks like almond or rice but it was OK. The staff is very nice and helpful. I'd go back again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeDZmSWZ3EAE",
            "text": "Food tastes very good and they always have a great variety. The staff is friendly and work proficiently even at their busiest. The smoothies are awesome. Spacious cafe. My picky grandma, who never eats out, actually eats here, and gives it…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5eGRiN2d3RRAB",
            "text": "The best bacon egg and cheese around town! Hands down! Eggs are never burnt and the cheese always melts off of the sandwich. Delicious! Clean atmosphere, customer service is great, their polite and welcoming. Also very swiftly and…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX292VkVnEAE",
            "text": "Food is decent but I was denied delivery because I was one block away from where I normally order. The young lady on the phone was extremely rude and said she had four people ahead of me and wouldnt make them wait to bring the food to me.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdmFxNEZnEAE",
            "text": "Personally I think the food is a bit expensive for the area. That said they do try and provide a descent atmosphere. They have great salads and offer both buffet and off the grill. They need homemade desserts and specialty coffees and only then would I meet my friends there."
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdV9IWFFREAE",
            "text": "Although the food here is decent the management leaves much to be desired. I usually call in to have orders delivered to spare myself the walk through Fordham & today they flat out denied me any delivery services, without any explanations…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaTlpaXhnRRAB",
            "text": "My partner and I just love this place! The restaurant is always neat and clean. Their food is beyond appealing to the eye and I can tell that the cooks are very passionate about what they do. The customer service is great, which isn't as…"
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cTVyZ1FREAE",
            "text": "I originally had this place at 5 stars before for what the area has, the food is great. But today has been the last day I step foot in the establishment.\n\nI've been going there religiously for a couple of years, and though the food is great I would simply over look the things that would annoy me. I would ignore the overselling of the salad (which is per pound) making a typical salad $10-12 without trying to hard, the random price changes for items on any given day....but still, I overlooked it because most of the workers are super nice.\n\nToday I decide to get a salad and a piece of salmon on the side which clearly states 6.95 a pound mixed with other food. Yet they insisted that my salmon is by itself regardless of my salad purchased making the price of the salmon $10 a pound.\n\nNow I understand what you are thinking... It's no big deal and we are talking about 1 or 2 more dollars on my bill which I would typically would agree with, but even in stating why it made no sense and that it goes against what they have set as rules, they said it didn't matter.\n\nFor me It's about the principle. I've spent upwards of probably $5000 in about 3 years of being a customer. You would think they would say... \"You know what, you're right, but next time you know....\"\n\nBut they didn't.\n\nThey made me feel like me being a daily customer spending money is pointless and return customers have no added likeness. So now I will simply take my business somewhere else\n\nThanks for the few years. But the minute a business makes me feel that's it's all about the money... I'll go ahead an drive 10 mins north and go to whole foods for that and pay for the organic experience."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBXzl6YlBREAE",
            "text": "Horrible customer service!!!! I've been going to this place for two years now and after today I will never go back. Food is good but the store clerk and manager are beyond rude. I was buying salmon and vegetables and they tried to charge me…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMGREdklBEAE",
            "text": "One of the better food options in an area lacking in healthy dining establishments. Excellent smoothies and a solid salad bar/hot bar. The interior space arrangement definitely needs work - the checkout line setup is ambiguous and annoying and no one appears to know where they are supposed to stand in line."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNzdIeUx3EAE",
            "text": "Fresh buffet style food. They always bring out freshly made hot food.  You can order other types food, smoothies and salads. Everything is delicious here. Its a rare find in this section of the bronx. You can dine in or take out. The prices are reasonable. They have a restroom and its clean."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX3VmQm5nRRAB",
            "text": "This place has made my 6 wks stay in NY a joy. Fresh and wonderful food. Salads you design...to die for. Smoothies you create or confused, they will do it for you. All my people eat here,so I have truly been in heaven."
        },
        {
            "date": "수정일: 9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndjlLRkVREAE",
            "text": "You can train someone to be skilled, but you can't train them to be honest. I go to this place a lot since I'm a Fordham Student, but not anymore. One bad apple ruins it all for everyone. I ordered food and they charged me twice the amount when I wasn't looking. Is that how you treat your customers? It isn't about the amount that I'm pissed. It's the principle of doing the right thing and they didn't.\n\nYou can train Pokemon but you can't train people to be honest.\n\nTL;DR= Don't come here if you have any respect for yourself. These people don't respect your service."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMUt6U2JnEAE",
            "text": "Always polite and swift with service.. The food is amazing, i love the salad bar the most because they have all the toppings you would ever want. Theres indoor seating with enough room to bring a group of friends or family. Try this place you will enjoy"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaDd6QldREAE",
            "text": "Dude with the yankee fitted blessed my day , excellent customer definitely recommend"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Z3YzdUtnEAE",
            "text": "Not so happy with customer service. Word off the Wise ( check your order Chances are they making a mistake and you’ll be disappointing when you reach your destination. My argue I place an order I was told I was gonna be there about a half…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdU16TmNREAE",
            "text": "Stopped going here because the prices are a bit too high nowadays and they received a C!!! Not cool when you consider what's factored in to such a low grade."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJNS1pMkJBEAE",
            "text": "Food is pretty expensive since it is charged by the pound, The tables and chairs are too cramped not really a place to bring a family of more than 4 for dinner. Good things about this is that the food varies in culture. It's not really a bang for the buck."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbGN6Ny1BRRAB",
            "text": "Food is ok. But highly overpriced for the Bronx, especially if you're eating off the buffet, a very small plate of food can run you $15+ (per lb) Guess they're catering to the wealthy students at Fordham Univ because literally u walk one…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcnRqcWxBRRAB",
            "text": "On several occasions I noticed that the dates on the Rice puddings are expired.\nTheir prices in comparison to the other food places are too high considering their taste.  The supermarket Cherry Valley food is delicious in the area."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneE0td3R3RRAB",
            "text": "They need to add more variety to the salad bar, all they have is chiken. Some days i wanna eat my salad with strimps or something else. Primavera Cafe has Excellent customer service very friendly staff. Good for Verity buffet and delicious shop salad bar."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcHNiYXlnRRAB",
            "text": "Great food always a pleasure however I strongly disagree with them for taking my food back just to throw it away when they messed up my order to begin with.... why ask for it back to throw it away just bring my new order admit the mistake…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBajl5NldBEAE",
            "text": "I give this place a shot every once and a while. I won't anymore the food is not great some of the staff clearly could care less. The last time I went in I asked for a salad and the young man who just Fijian putting out the salad toppings…"
        }
    ],
    "reviews_count": 72
}