{
    "name": "Yummie",
    "place_id": "ChIJNy0QXRPzwokRn0XtLNaij-s",
    "grid": "BX7",
    "address": "376 E Gun Hill Rd, Bronx, NY 10467, USA",
    "rating": 4,
    "user_ratings_total": 4,
    "phone_number": "(347) 641-8033",
    "reviews": [
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndl9uaFdBEAE",
            "text": "First time trying this place, the ox tails was great. I ordered the $10.00 plate I couldn't finish it. I will order food there again."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bWZqWmNnEAE",
            "text": "Yummie is where you go for home cooked Jamaican meals in the Bx if you're ever near Bedford or Kingsbridge or on Gunhill, hop on that 28 bus and go to Yummie. Sometimes they don't ave certain foods, but that is because they're breakfast meals like dumplings and rice and peas or it is just that popular. Their business just opened in January of this year, but I am already a regular customer and have been here at least 10 times. There sauce is ALWAYS on point and if ever your rice and peas is tasting a bit dry just ask for some more and they will gladly add some more. The owners, Lloyd and Latricia (I hope I spelled their names correctly) are very friendly and I always have a great experience when I eat there, whether I am solo or with friends or my boyfriend. They already know my order, which is stew chicken with plantains. Come here to get lost in the sauce."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnb1pyMjdnRRAB",
            "text": "Great food and great service"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3c09pdzJBRRAB",
            "text": "Their food is disgusting and under seasoned. They need to be shut down immediately. They never have the food they advertise. Food wasn't even hot. Shut this garbage of a restaurant down."
        }
    ],
    "reviews_count": 4
}