{
    "name": "La Casa De Frida",
    "place_id": "ChIJyXC4ourzwokRIBqDwStRlJ0",
    "grid": "BX7",
    "address": "307 E 204th St, Bronx, NY 10467, USA",
    "rating": 4.2,
    "user_ratings_total": 198,
    "phone_number": "(347) 202-7126",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WmVHUnJiVUpFUm01dWEzQkNiRWR5T1ZGcFNFRRAB",
            "text": "such a nice place. Good energy and good people. You can tell they are committed to making everyone’s experience great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNek1XczJkalJtZEhsZmQwTjRZbmRwT1U5dmRsRRAB",
            "text": "I went there with my daughter, she love this place, it was my first time there. The food was very good and tasteful. I had grill pork chops black beans and white rice. I am plain Jane I don’t need alot of seasoning. I was impressed that the owner was taking care of us at the bar. I do not speak Spanish she even put on English videos. I love it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdmNGbEhWR0U1VVZGQ1drdGtkWE15T0dKM1NHYxAB",
            "text": "Well last night was not very pleasant, I went with my 11 year old daughter to buy a taco since there was no one there and the music was not that loud, we decided to eat at the restaurant, I ordered a “jara” in confusion with another drink that I like, when I saw the waitress with that “jara so big” I said “honey that is not the drink” to which she spoke to me so badly and in a raised tone and stepped on the menu in my face, she did not respect that my daughter was there, she told me that was what I ordered and I responded very politely that I would pay for it but I did not want it and she spoke to me again rudely and said that it was already on the computer and she could not remove it, I said perfect I will pay for it but now please I want to take my food I do not want to stay here anymore, in short she had no empathy she was rude and did not respect my daughter. His face looked very angry and I think that is not a way to treat people, especially in front of children."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJMzlodXYzaFlhZWJREAE",
            "text": "I wish I could give zero stars for the service. Let me start by saying I USED to love this place. The food is amazing and the drinks delicious. It was my boyfriend and mine go to place in the neighborhood. We loved it so much we named our cat Frida after it.\n\nI’m not sure if there’s new owners but the last two visits have been terrible. And we will not return. Our service clearly doesn’t matter but I needed to get this off my chest.\n\nWe went in February. Waited almost an hour for drinks, we asked the waiter twice and he kept saying it’s coming and it never did. Another customer walked in and they took his order and brought him his drink. I spoke to manager she apologized brought the drinks and comped them. But it was already a waste because we were done eating.\n\nToday we walked in and sat at the bar. We were not greeted and not acknowledged. Another couple walked in and they were sat and given menus. The terrible service is not only unacceptable but also disappointing.\n\nWe will never return here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKMjQ5Nl9aOHFiZHlnRRAB",
            "text": "Came in placed that took 100000 years and not only that it was wrong . Then I came back placed the order AGAIN and they missed it up AGAIN . I would never come nor order food at this place."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcmZXV3dRRRAB",
            "text": "Excelente comida pero no entiendo porque ponen esa música tan Alta en un sitio donde\nNo se Baila la gente quiere conversar y es imposible.. es lo único malo que tiene este sitio"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NDhHN1lBEAE",
            "text": "Food was ok and they tried to over charge me music was to loud i was not able to have a conversation"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cEtiRkZREAE",
            "text": "Service was great, environment had great music, everything was delicious from the chips on the table to margaritas ! Can’t wait to come back soon.\n\nSo we walked into this place by chance because I remember seeing it on TikTok and it did not disappoint. The food was amazing and the margaritas made you wanna lick the rim of the glass 10 out of 10 would recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3RYSEh3EAE",
            "text": "Been living on Norwood for a few years now and randomly decided to drop by Fridas on a Sunday evening, great service and amazing drinks. I recommend the Mango Margarita w a Tajin Rim ! you won’t regret it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbzVLNXFBRRAB",
            "text": "WORSE PLACE EVER & POOR MANAGEMENT!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ00yNkdnEAE",
            "text": "Love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieF9xc2FREAE",
            "text": "Amazing energy and staff thank you"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNXU3cC1BRRAB",
            "text": "Excelente servicio.\nBuena comida,\nAmbiente buenísimo para una tarde de sacar el estrés de n.y.\nLes recomiendo , comida ,bebidas  y los postres delicioso"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOXA3N3dRRRAB",
            "text": "Fish tacos are awesome but man, why do they play music so loud you cannot have conversations while eating. Ridiculous"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicU9DeFBnEAE",
            "text": "La Casa De Mexican restaurant in the Bronx offers a wide variety of delicious dishes as tacos, enchiladas, and burritos, all made with fresh ingredients and authentic flavors. The cozy interior design and friendly staff create a welcoming environment for diners to enjoy their meal. Whether you're craving a spicy salsa or a refreshing margarita, La Casa De Mexican restaurant has something for everyone to savor. Visit us today and experience the taste of Mexico right in your own city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMjd2NFVnEAE",
            "text": "Atmosphere was cute, server was good.. I didn't get the rude experience others spoke about.  The food was very disappointing especially coming from a Mexican restaurant, the food was not bursting with flavor.. the guacamole was MEH!! the quesadilla was MEH.My husband told me his steak fajitas did not have any flavor and he didn't finish his food. My husband never complains! The drinks was trash, I ordered a frozen margarita and I felt like I was drinking juice. The margarita was flavorful but the alcohol was non existent, and I'm a light weight!!! It was not Worth the amount of money me and my partner spent!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMN3V5QWh3RRAB",
            "text": "If you have a few drinks be aware that the very rude lady behind the bar might add extra drinks to your bill.\nWent twice and both times this happened to two different coworkers.\nPlace is cute but the service in my opinion sucks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb1BlZENBEAE",
            "text": "Great service,  food, & ambiance.  Owners are very friendly too."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqajRHd0tBEAE",
            "text": "Poco profecionales me hicieron perder mi tiempo llame para saber si estaba abierto me dijeron que la cocina abre  3pm llegue 3 :25 pm y resulta que la cocina esta hasta las 5 pm solo me hicieron perder mi tiempo y el de mi familia (soy de Catskills ny a 2 horas de dicho lugar)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaWZxaTJRRRAB",
            "text": "Victor is incredible! Amazing drinks and wonderful energy. Highly recommend  😘"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc2JfbF9nRRAB",
            "text": "Great place\nGreat happy hour drink menu"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOWRLNW1nRRAB",
            "text": "Horrible ! Espere20 mins  por una copa de vino 🍷 , y dos cantaritos ni el menú de la comida me ofrecieron , menos servilletas $ 150 dólares.   Y cobran propina como si deveras atendieran bien ,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkd3RlM2l3RRAB",
            "text": "Drinks were fantastic, food was great. Bartender very attentive and friendly. Would definitely come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MEpmenNnRRAB",
            "text": "Great food. Great service. 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbU1QRVV3EAE",
            "text": "I was pretty satisfied with my experience at this establishment.  The food was decent, and the service was pretty good.  I was happy that their Quesadillas come with fries, that is my favorite side and was the selling point of me ordering that.  The Quesadilla was pretty good, just could have had a little more cheese.  The meat was pretty good as well, and I definitely did not have any issue finishing my meal.  I would have also liked to see a little more fries on the side, but what I had did taste good.  I was pretty impressed with the drink menu since they seemed to have quite the selection.  On the other hand, the food options were not too great; this is clarified as the menu states it is incomplete. The chips were also a bit dry, and the salsa tasted like it was from a can.  This is not a big deal since the chips and salsa were just the bread of the table anyway, but something to point out.  I ordered a soda with my meal and they brought out a can; in a restaurant's language that means no free refills on the soda.  I can not stress enough how much something like this affects the experience.  I was rationing my soda throughout my meal since I did not want to pay for can after can, and it just could have been better.  Adding free soda refills would go a long way for me, but I doubt soda on the priority list.  I would consider coming back here if in the area again."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bXNIaGVBEAE",
            "text": "Me encanto el sitio, un ambiente tranquilo y lo mejor es que tienen happy hour los domingos, Frozen Margarita por $5"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOHJfekFnEAE",
            "text": "Alejandro gave us excellent service! Very attentive and friendly. And the food was delicious! Def recommend :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNEtHZTVRRRAB",
            "text": "I was surprised by how pretty the ambiance was for an intimate conversation. The portraits of Frida made me feel like I was transported back to Mexico City. The food was delicious and the service was efficient. I enjoyed the large portion…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcHZfUzJ3RRAB",
            "text": "Good food, good service. The staff is very friendly. 💯% recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaDdDRWlBRRAB",
            "text": "The foods very good 👍"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN2ZheWRREAE",
            "text": "Great atmosphere, great music, drinks were a little weak but in all, had a great time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa1BXNER3EAE",
            "text": "Cozy and relaxing atmosphere. Service was outstanding and the HOT MESS drink beyond delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ZzdiYzlBRRAB",
            "text": "Such great drinks and the wines are amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dmF2SjFBRRAB",
            "text": "Amazing people and environment!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dTVieVFBEAE",
            "text": "Best drinks hands down lucero is a great bartender & very attentive . Food is great music is awesome, plus great place for a chill night ."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eU9fR2R3EAE",
            "text": "El mejor rinconcito de webster y la 204st waoooo excelente comida. Excelente atención, excelentes tragos, excelente ambiente."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OExpNXVnRRAB",
            "text": "AMAZING..FOOD Atmosphere was on point.Great prices on food and Drinks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Z0tQejZBRRAB",
            "text": "Went on Cinco de Mayo. Nice little spot that can get overcrowded. About 12 tables. Little bit of a wait to be seated. Staff are nice and pleasant. DJ was on point. Clean restrooms. Street parking. Food was amazing nachos grande, bistec encebollada, chicken tacos, chicken flautas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdHJTSE5BEAE",
            "text": "Amazing little spot\nStaff is great\nFish tocos are fabulous 👌 👏 👍 😍\nDrinks are worth every penny"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOThqM1VREAE",
            "text": "Great fish tacos"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSME9helBnEAE",
            "text": "Such great place to grab a few drinks and some delicious food. Frozen margaritas are the best and they have a good beer selection. Servers are very friendly and keep an energetic vibe."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX191QUNBEAE",
            "text": "Amazing service lucero , sandra ,Lori the bartenders was great bartender amazing food and drinks where on point would highly recommended this place for taco tuesday"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoXzZuV0NBEAE",
            "text": "The food was amazing. Service was excellent and host was extraordinary. The chicken taco reminded me of my sisters homemade pico de galle. Thank you ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocjlfcjBnRRAB",
            "text": "Love the atmosphere, love the food, and loved the margs. Great spot in the neighborhood for a good bite and/or a drink. My friends and I love the place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobDRYaWxRRRAB",
            "text": "The food  was delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoc3ZlcjhBRRAB",
            "text": "Sandra is really nice and great bartender 🙂…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobmVQM213RRAB",
            "text": "Great place, delicious food and very nice and friendly service 🤗. I definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobmUySXVnRRAB",
            "text": "Wonderful experience!! we came for my brother’s birthday and they treated us amazingly!! not to mention the DELICIOUS food! definitely recommend getting some of their fresh guac and chips as a starter!! don’t forget dessert: tres leches and churros, SO GOOD here! great atmosphere too!! such a party vibe :))"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoZ28zY0RnEAE",
            "text": "Lugar espectacular para los amantes de Frida Khalo."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCbW95dWJnEAE",
            "text": "Horrible saliendo del restaurante corrí al baño por poco no llego a casa todo porque la carne estaba dañada no volveré a este lugar de mala muerte"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2NDVxTGZ3EAE",
            "text": "Cutest little place with some banging drinks and food! I learned about this place through Google Maps and boy didil it not disappoint. I ordered a coconut Mojito that made me wonder why did I ever stop since it was so tasty! And for lunch my husband ordered the shrimp quesadilla that came with sour cream, guac, pico de gallo and fries. The whole dish was phenomenal, even the fries were seasoned. My chila quiles verdes tasted better than the ones I had in mexico a few months ago. I definitely tasted the authenticity and flavor behind the food, and the music had me reminiscing of when I was young! Loved it, and will definitely go back!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDM2JmcHZnRRAB",
            "text": "I went by today, and ordered the barbecue salad. It sounded good. I was pleased at how the salad looked,  and even more pleased at the taste. Delicious!!! Corn, black beans, lettuce, tomatoes with the barbecue chicken strips and a white sauce that was really good. Fast friendly service. I highly recommend. Almost forgot,  avacados too!!! I will be back to try the mango salad 👍\nI have to add, that I tried the grilled chicken Burrito, and I expected that grilled chicken flavor to enhance the flavor of the burrito. It didn't. It tasted liked it was fried on the flat grill. Not grilled. Its not the same chicken that's in the barbecue salad."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtM0tPUl9nRRAB",
            "text": "My friends and I wanted a place to go after work for a bite to eat and a drink, and after some brief searching, we thought that La Casa de Frida would be the perfect place. And it absolutely was.\n\nWe made a reservation because we knew we would be coming with a larger group, and when we got there, we were seated promptly at a table in the back behind the bar. To quote my friend, “the vibes are immaculate.” The decor in the restaurant was beautiful and vibrant. When we arrived, there was a DJ setting up, and he really made the evening feel like a party. The owner, Lucero, greeted us, and made amazing suggestions for both food and drinks. She is an amazing hostess.\n\nTo start out, we got a round of drinks (I got a passion fruit margarita on the rocks with a Tajín rim— Lucero’s suggestion) and they were all incredible. I especially liked the glasses/vessels in which they were served. We also got some appetizers to share— I highly recommend the nachos. We got two orders, but one would’ve been enough because they were so generous with the portions. I also got an order of the fish tacos, which were amazing – – three tacos with freshly battered and fried fish with a purple cabbage slaw, and a spicy mayo on the side. I’m still dreaming about them today.\n\nAll in all, I cannot wait to come back to La Casa De Frida not only for the food and drink, but also the amazing atmosphere and people who run it. Thank you so so much!!!!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb1lxNFNBEAE",
            "text": "Me encanto el servicio de adrian fue todo un placer la noche entera y muy atento. Gracias a el fue una experiencia maravillosa para mi y mi familia definitivamente regresaremos y recomendaremos\n\nI loved Adrian's service. It was a pleasure the whole night and very attentive. Thanks to him, it was a wonderful experience for me and my family. We will definitely come back and recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLV9YZ1RBEAE",
            "text": "Came for drinks turned into a party berry friendly me and my lady had a great time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNzdTZnZnRRAB",
            "text": "Stopped in for dinner and it was very good. We were a bit disappointed that they were running a limited menu - chicken or beef tacos, burritos, or one other option.\n\nWe were looking forward to trying some of the options on the menu; in the end though, we were still quite happy with the beef burritos we got.\n\nIf I had more time in the area, I'd love to go back on a night when they're running their full menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbHVTaVZREAE",
            "text": "It's a nicely decorated descent size bar/restaurant. It reminds me of like going to the day of dead type parade or something. Anyways the bar tenders were attentive especially the guy serving me. My first time ordering from this place had salmon burrito bowl of my liking (Mexican rice, corn, shredded cheese, pinto beans, salmon). I personally thought it would be full of flavors but wasn't any. Mexican rice dry no flavor, salmon super dry, corn I'll say that was the only food that had some taste to it. Only topping or sauce whatever to call it came with is sour cream. I am not sure if he thought I wasn't of Hispanic background or what cause of my complexion. But come on when trying other ethnicity you have to expect to have a pallet for trying to different textures, seasonings, taste, flavors. But where was this in this meal? Also no section on the menu showing a sample platter. He just showed me there's some appetizer or whatever to try that's like a sampler. I'll try this place one more time but sure wasn't worth $15.99 for salmon burrito bowl. Also a reason to charge a pricey amount for a flavorless meal is cause a lot of staff from Montefiore, as well as other people who don't cook eat anything. But when a little business opens up around here and gets doctor's whatever staff from hospitals what not they'll charge crazy prices in time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbjRYWGZnEAE",
            "text": "Absolutely gorgeous and cozy restaurant! I picked it to celebrate my Frida's theme birthday party and the staff went above and beyond to make my night memorable.  The menu is extensive and they make sure you're happy with what you ordered.. They were amazing and so so nice! Will definitely come back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2djRDSjVBRRAB",
            "text": "I spend so much money at this place, however, every time I order after 8 pm I’m limited on things. I order at 9, but they close at 11 and I can’t get rice or beans? I said ok sweet plantains you can fry them on the spot. Tells me the steamer is off. Kidding me? My guest decides to cancel the order. They say we put the items in - are you kidding me? You want to give sides they don’t want. Moving forward I get my order. Why is my food burnt? The service during the day is exceptional but evening it’s trash. Does the owner know what going on? If the food service ends before 9 then post that! Don’t say you’re open until 11 on the weekends.\n\nI will never order after 5 pm at this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpa3RxRld3EAE",
            "text": "When they first opened, I was impressed. The size of their servings, the way we were treated as customers especially since I was going in almost daily. Of course everything changes but the way you treat your customers shouldn't.  Maybe its…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeXFTMi1RRRAB",
            "text": "Thanks to seamless I got to experience La Casa de Frida and it was amazing I literally ordered three days in a row ! Of course each day it was something different but the drinks are always amazing ! The food ? Amazing !\nI can’t wait to feel the experience in person but since it’s a little to far , this will do for now.\n\nCompliments to the chefs and bartenders in case there’s more then one.\n\n* Updated same day * went from 5 stars to 3\nI had to place my order twice , and twice it got cancelled. the menus delivered here says it’s open 7 days a week - not sure how they suddenly closed when I was able to place mr order but it seams like they cancelled them and decided to close the store on Seamless over all\n\nBummer I spoke to soon"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcW82N2VBEAE",
            "text": "Great customer service. I feel I waited a little longer than usual for a lunch, but the waiting is totally worth it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvb1AzQVpBEAE",
            "text": "Excellent food! I’ve ordered a few times, and the food is fresh. I’ve ordered burgers and they actually make them medium rare, most places around this neighborhood overcook their burgers.\n\nI’ve also ordered their tacos, and they are a good size and  made with fresh ingredients."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhanZmVnRRRRAB",
            "text": "Frida's is usually my place to go for good Mexican/Spanish food.  Today, however, I had one of the poorest customer service experiences ever.   I ordered oxtails and there was a woman hovering over the server.  I asked for an extra piece because he had only served about 3 small pieces as part of the lunch order.  When I went to pay, I was informed by the same woman that I was being charged $4.00 extra for the extra piece of oxtail.  I explained that the price did not merit the very small portion I was receiving in the first place and asked her to forget about the order.  In an angry tone she agreed to deduct the $4 and also mumbled something I could not understand.  She then angrily slammed my change on the counter.  I was so taken aback that I didn't think to just leave the food and ask for my money back.  In addition, the oxtails were not even that good.  Not sure if she is the boss or employee, but either way, she should not be working in a customer service environment, especially the food industry. Unfortunately, I will NOT be ordering from Frida's anymore!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNGF5YUFnEAE",
            "text": "Not a lot of diversity in the beer options, but it's a very chill environment. It's a spot fo locals where most of the people already know each other. They play Mariachi and Nortero music with Bachata and hip-hop. I've never eaten there. I can't comment on the food. The bartenders will allow karaoke, wigs and sombreros to get people in the festivities."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdDhiaU1REAE",
            "text": "Didn't take a picture of the Green chicken Chilaquiles, Shrimp tacos and AL pastor tacos but they were 5/5. Amazing taste in all dishes. My kids has chicken flautas and they loved it a good portion of chicken was in it to. Drinks were also super good and yall have to try the house mezcal 🔥. Would come again!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvanZQNW5nRRAB",
            "text": "Awesome food with huge servings. Super fresh and great service to top it off. Came with my kids they loved it and we got to take alot of food home. Thank you Theresita!!! We will def come back! 💛…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtejdPTWx3RRAB",
            "text": "🚨🚨❌❌❌❌ ALERTA ❌❌❌❌🚨\n\nestoy muy molesto 😡😡😡😡 ya son tres ocaciones  que me salen con lo mismo, recomendaría al gerente del restaurante que cancele el servicio en delivery’s No es justo que uno esté esperando hasta más 2 hrs una orden, y lo Más molesto es que nunca les llaman a uno para avisar del problema que están teniendo con sus  sistema( es un invento de ellos). La comida es regular, el precio es muy accesible pero el servicio a domicilio es muy malo, malo malo malo, por favor a todos los consumidores de este lugar eviten esperar tanto tiempo, mejor ordenen en otros lugares.\n🤬🤬🤬 Nunca  más volvería adquirir sus servicios son pésimos!!!!\n😡😡😡😡😡😡😡"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dDdEVnZ3RRAB",
            "text": "Horrible !!!! fui a a preguntar hoy mismo si vendían lonche de comida dominicana  y la mujer que estaba ai atendiendo se enojo por que pregunte ya que mi idea era si no tenían lonche  comprar otra cosa y la tipa de ai solo torsio la boca y…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyb3NDM0pBEAE",
            "text": "It has become my favorite place. Their food is amazingly delicious and their drinks are very good as well.\nThe employees are very friendly and the decoration is cute."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNU9fU3J3RRAB",
            "text": "La dueña u manager estaba más borracha que los clientes  pedi mis bebidas y nunca llegaron y al final quiere cobrarme todo, al principio me dio risa pero al final salí enojado con una manager pasada de tragos con olor a licor que no sabe ni el número de mesa para cobrar. Viernes 18 de noviembre por la noche."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVOWZiSkV3EAE",
            "text": "Horrible! I placed an order for delivery and I got my food cold! First the delivery calls when hes downstairs so my husband went down to then call me a few minutes later to say the delivery person isnt even there. When I call the guy back he tells me the address he is at and it turns out that the lady who took my order wrong my address wrong. So the guy let's me know that he will just come up. Then he calls back a few minutes later asking exactly where is it that i live so I give him the cross street. Then literally a minute later the lady calls me to confirm my address then tells me I have to go down in 5 minutes with such a demand, so being that they have my food I decided to not be rude back and asked my husband to go down. When we get our food, it is cold! I had ordered tostones with the churrasco for my husband they gave him maduros instead. No one even called to ask if I wanted maduros if they didnt have tostones and give me the option of picking rice and beans instead. Never going to order from here again!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdjh2RGxnRRAB",
            "text": "Tengo varios platillos favoritos de La Casa De Frida... Las Roasted Tomatillo Enchiladas, los Rib Eye Tacos, lo Tacos de carnitas y el caldo de res son de lo mejor!!! Y de bebidas el Mr. Cantarito es muy refrescante, recomiendo lo pidan con mezcal. Muchas felicidades!!!"
        }
    ],
    "reviews_count": 73
}