{
    "name": "Jerome Pizza Pasta",
    "place_id": "ChIJjRnBJ3bzwokRl7iHX8BgrZI",
    "grid": "BX7",
    "address": "21 Bedford Park Blvd, Bronx, NY 10468, USA",
    "rating": 4.2,
    "user_ratings_total": 534,
    "phone_number": "(718) 933-3455",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aclFuaFJhRlV0VFV4WWRWbzRRV2RoT1VkRVlYYxAB",
            "text": "Come here often for lunch and from top to bottom great food.  The pepperoni slice is great,  they also have excellent variety.  Their pasta dishes are also excellent as well as the buffalo wings which are very reasonably priced.  You must try the made in house tiramisu it’s as good as anywhere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVU1YcE1SMnBKWms5emVtNVBTMGxpTVZCd2JYYxAB",
            "text": "Pretty good location. Clean place, polite staff and good food. Got the buffalo chicken wrap that came with alot of fries. Nice and crispy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1UwOU9SMlZLYTB4UVowMXZaSGgyZGtkbVJWRRAB",
            "text": "Everything was so good and the price is good! Recommend 100%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TVVqZzFUSFF6ZUhSR1VHWlZaSGwxV1U1Wk9IYxAB",
            "text": "The best Pizza Place Ever"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNWNUVXdhWGhaTW5KdGJFdHNTRFZsZEhkR09YYxAB",
            "text": "Love it! Excellent Pizza 🍕"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc2NHbDJlSEUzYjA1VVNYRmFSa0ZzTFdsTlNYYxAB",
            "text": "They're awesome. For pasta, pizza, beef patty. Any kind of slice is made very authentic and delicious. I strongly recommend when in the Bronx and Bedford Park area, go to Jerome Pizza Pasta for all of the above. Meatball sandwich, mama mia!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJV3FxYk9xazdlVUJBEAE",
            "text": "Customer service is terrible, one of the worst pizza spots in the Bronx, II Don't recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaVUydE5MV0pTYjBwdkxVSjZXbTFYWWpaVldIYxAB",
            "text": "I would give them zero if I could, ordered from uber eats for pick up a small simple chicken Caesar salad wrap with fries, literally empty when I arrived sat there for over 30 mins not a single effort from the guy behind the counter to…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbGFtZE1TV2h3YjJkV09VSlpiVkpvTmtWWlVGRRAB",
            "text": "Hear me out — this might just be the best pasta I've ever had. The portions were massive — I ate it for three days straight and loved every bite. I asked for something a little unconventional — a chicken parm and penne alla vodka mash-up (I know, sounds strange!) — but they nailed it. It was creamy, flavorful, and downright delicious. 10/10 — highly recommend and will definitely be returning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMFNUWnRabEZpTFhCdFNXeFhOM0ZNY2xCVlRVRRAB",
            "text": "I love this place, they treated us excellent, and the pizzas were very goood"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV2RucEpNMU14V1Y5VFRYRlBXRVJXU21ZeVpIYxAB",
            "text": "The best pizza and the greatest staff.!\nWe came from NH and they treated us excellent.\nBest service ever 🥰\nThank you so much !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMGNraExWblZCUldkblMxYzNlamhZYjNweFNuYxAB",
            "text": "Very disappointed.\nThis has nothing to do with a cheesesteak wrap. As you can see, I was expecting a cheesesteak wrap with melted, juicy cheese. Not even close. This looks like ground beef with lettuce and tomato in a wrap. I’m extremely disappointed and will never order this again in my life. Total waste of money and time. I drove about 15 minutes to pick it up, and by the time I got home, this is what I found. So frustrating."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRek1uWjVOMUE0TWtsaVR6RnZkVTUxUTJGNFduYxAB",
            "text": "Very delicious grandma slice and margarita best pizza in the area"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYVJrdDBZbGRwYjBobWRrMUxaR1I2UjJWMFFWRRAB",
            "text": "Sauce tasteless , Overrated & Not good overall  👎👎…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMTEY2TG0tcVpUbWZnEAE",
            "text": "Last time they give me cold pizza slice,did not say anything. Today i requested to make it warm, he insisted it's hot already. But when i started eating, i see it’s cold. It’s a poor customer service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNekRoc21SM3VLM2JnEAE",
            "text": "Waited 30 min for a small pizza cost $14 and it’s not that good smh"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS200NnpoMU1tUHdnRRAB",
            "text": "Great pizza"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPU0ZtZjcydGJYWWtRRRAB",
            "text": "Great people, needed to place a large order for delivery to a park, very flexible, very helpful and understanding when the date and location changed due to rain. Made it super easy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZekpUbHhBRRAB",
            "text": "Pizza was on the sauce could have used more flavor and they are a bit pricey compared to their competitors in the area my family pizza on 198 tastes better but they don't have the same kind of atmosphere or cleanliness"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMVkzcXV3RRAB",
            "text": "Essen topp, Tische leider sehr klebrig und schmutzig."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NDRfM05REAE",
            "text": "Para mí la mejor pizza 🍕 a mi hijo le encanta tengo dos años comprando pizza aquí y cada día, innovan más en el menú!! Muchas más variedades , y excelente precio. Le doy un 10/10 ✅🫶"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dE9LSFJREAE",
            "text": "Delicious food. Great atmosphere. Pleasant staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NHJxekF3EAE",
            "text": "Delicious is the word."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRai11eHFRRRAB",
            "text": "The ONLY place I trust and eat pizza or pasta from. They're nice, polite and professional. I've tried tons of pizz places in the bx but all were meh or disappointing. This place never disappoints and the food is always great. I plan on moving and I have to move somewhere within the delivery range bc I refuse to try another place that's gonna leave me hungry and homicidal. Definitely recommend this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnenByc3dBRRAB",
            "text": "Delicious pizza great atmosphere friendly service. I definitely will be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeXFDT3hnRRAB",
            "text": "Over 30 years of great service. My family's favorite pizza/restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d0xxLWJREAE",
            "text": "My family loves their food. And the pizza is great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d0xDd1dREAE",
            "text": "The food is really good, that's not what I'm writing this review about. The customer service is horrible. The employee threw a fit over how much was tipped and even yelled at my partner over it. Killed both mine, and my partners appetite after spend $60+"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMVpLTk93EAE",
            "text": "The pizza here is pretty good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYLXVQTF93RRAB",
            "text": "If it ain't eating Jerome pizza, you ain't eating pizza💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMWJDNVF3EAE",
            "text": "I am glad we have this pizza shop. Everything is delicious, and the people work here they are very nice and are the best pizza and all food. I give  💯 🌟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOXAzV1p3EAE",
            "text": "Definitely a place to stop in for a quick bite to eat. The food was good! I ordered a slice of pepperoni and margherita pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILWNmVWt3RRAB",
            "text": "Good place for a quick bite of pizza and other Itlaian dishes, such as pasta meatballs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bC03cXNBRRAB",
            "text": "Great local pizzeria, and awesome pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eFA3SHdBRRAB",
            "text": "Wonderful place to eat, food is very good especially their pizza. You can sit inside as well as outdoors. Clean environment. They need to work on a more friendly atmosphere,  customer service needs to be open and welcoming. Mostly working men and no women. You get  service with no smile."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MDVXOU13EAE",
            "text": "The staff is friendly and helpful. As a regular customer, they are very supportive of special requests I may have. Nice atmosphere, very nice dining experience. The best pizza around!!! 😊😊😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3djZ5Y0lnEAE",
            "text": "Rather pricey but good if your going on the road"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX05IWkRBEAE",
            "text": "Very good pizza, but unable to follow my instructions to make my slice well done"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaFA3SEV3EAE",
            "text": "Haven't been here in more than a year. Apparently it changed owners. Pizza still good. Wish customer service was better (white guy, Don't know if it was the owner, but wasn't friendly and was kinda rushed). Before, customer service was spot on."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMOE96dzVRRRAB",
            "text": "The best"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaE1TUWx3RRAB",
            "text": "Excelente las pizzas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMkpfNld3EAE",
            "text": "The Margherita Pizza was well done and delicious, The staff was very friendly, I was able to get a picture of him for class at Lehman College."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMmFYRy13RRAB",
            "text": "The best slice I've had in a long time . Great ingredients thin an nice crunch . You will not be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqM3NhMDd3RRAB",
            "text": "Their Pizza is always on Point. Especially their Chicken Parm & Pasta!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREc2VHcmdBRRAB",
            "text": "I take my daughter's there when we are in the bronx great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEa2JPbWJREAE",
            "text": "My go to pizza spot for years!  They are friendly and always make a good pie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MHB5cm5RRRAB",
            "text": "Pizza great tasting!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabDRLSFZnEAE",
            "text": "I had to come back to this review a 5 star rating all around. Been coming here for months now and I’m not gassing them up but this is really one of the best pizza places around. Weather we take out or order delivery it’s always great. I’ve tried several other pizza shops in the bronx and nothing even compares to the quality taste portions and most importantly price. I have paid more for worse in other places. My favorite here is the regular slice my wife loves the grandma and my daughter switches between the Hawaiian and the margarita. I must say I really appreciate this restaurant! Really is the best pizza in the bronx so far! I had plain slice, can’t go wrong with that. My daughter had the blasphemous Hawaiian slice and it was actually quite good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN1pmdWlnRRAB",
            "text": "Got chicken francese with linguine sem sauce and something else I forgot, the pasta was really good! And this is the first time I’ve been in this restaurant and it was great, good service and delicious food. 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkb3Bqbnh3RRAB",
            "text": "The food is good. But 6$ dollars for a tiny cheesecake that is only 3 bites. Thats insane. For 6$ you get two slices there. But for a small piece of cheesecake. That is disgusting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxamRfb1ZREAE",
            "text": "Excellent slice. Ample\ncheese and sauce on a chewy crisp crust.\nCheese, sauce and crust have great flavor.\nAnother slice where you want to keep going back for more. And at $3 for a good sized slice, you'll be getting your money's worth."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwc3ZqbkJnEAE",
            "text": "Been eating here for over 15 years and this place is straight garbage now. They want to charge City prices for nasty burnt slices. They never get your order right!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dGUyQkJBEAE",
            "text": "Do not order food from here they make u wait 45-50min and then when you finally receive your food  is Burnt when you ask for a refund they tell you that’s not possible"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMnB6YW5RRRAB",
            "text": "The best pizza around. It's always my first choice for pizza as they have the best pizza in the bronx. Their heros are great. The prices for food are good as well. Love the outdoor seating. The place is clean. The only thing that could use improvement is that they need a bathroom. And the delivery guys could do a better job. Other than that. The food is amazing."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLX3MzMHd3RRAB",
            "text": "Ordered from seamless I love this place but Everytime I get a pie is always a mess like the cheese comes off with all the toppings"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDdFlYaXBBRRAB",
            "text": "Best tasting authentic styled Marinara suace. Like what was on your pizza 50 years ago. Grandma's Spinach flat bread is the best I have tasted. Grandma's garlic was good but I expected more. If you just like old fashioned flavor.. its best to stay with the plain cheese slice it is what started me coming to Jerome's and now I am sampling other things and finding new favorites as I go."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDODh2blF3EAE",
            "text": "I have been a customer for over 20 years and it is amazing to see how this business has prospered. They have expanded their business space and now offer very beautiful outdoor seating. The pizza is absolutely delicious and I dare say the best of The Bronx. I am a huge fan of their slices that are very generous and large!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeF8yX0hnEAE",
            "text": "One of the best pizza shops in the neighborhood ever. The pizza is delicious n the service is great. If this place could hold 10 tables nobody would go. Very good atmosphere because these guys make u feel comfortable. Recommended to everyone"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a1BHMklnEAE",
            "text": "Margherita slice is tasteless. Sicilian slice is okay. They sent me a square spinach slice instead of a grandma's slice. Italian combo wrap is mediocre and came with soggy fries. Their only redeeming item was the beef patty with coco bread…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBc3BIQzVnRRAB",
            "text": "Grandma square slice of pizza was good. I had a second one.\nSomeone at a table seat offered to share other half of table with me so i didn't have to stand. Polite experience. Price for pizza was good too. I'd go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MmEyRlZBEAE",
            "text": "I highly doubt there's a better place anywhere nearby. And if there is it will cost more than $18 for a large pie for sure. They know what they're doing here and try their best not to skimp. Only improvements possible would make the price jump."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNXZlWm1RRRAB",
            "text": "As a native New Yorker, I'm picky about the pizza I eat. Jerome's pizza makes an honest to goodness NY slice. Their pizza is really good. They use quality ingredients and make a high quality pie. I would take their slice over many of the other \"top rated\" pizza places in NY. And the guys who work there are awesome too! Who could ask for a better combination!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRa2NiWmNnEAE",
            "text": "I like this place, go there like 4 times a week. Cheese slice is good so are the speciality pies, but I'd like if the buffalo and chicken bacon didn't always have blue cheese and ranch on them. Maybe if display pies had half half with and without the sauce. But this is a scruple. It's still good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocjQyV3dnRRAB",
            "text": "Accidentally ordered from here and it's by far the best pizza and pasta I ate in years.\nDelivery man very friendly and fast and the food was a reasonable price. 5 stars all day!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3dHJTLUFnEAE",
            "text": "Best pizza around the neighborhood. Decent prices their delivery is usually same as in store they don't try to hit you over the head with the price. Delivery times are also very prompt . I take one star off because they have no Pepsi!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybGZyeHJRRRAB",
            "text": "The food is good but the service is a 0. They never know what you talking about when you call them. And the guy is super f rude and unprofessional. I’m not asking to a free pizza, I’m paying MY MONEY so talk to me nice so I can be nice to…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aVlLSmJBEAE",
            "text": "I ordered here for the first time last night . I got a delivery the food was absolutely delicious, home made meat lasagna was incredibly delicious I also got traditional wings with Buffalo and bleu cheese on the side they were also good and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbnFTUkZREAE",
            "text": "This is the best pizza I’ve ever had . Great amount of sauce , when you fold the pizza it literally melts in your mouth . A lot of cheese , very very hot melted pizza . Crust is absolutely perfect !! Service is good ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOV9lRVZBEAE",
            "text": "This one of the most racist pizza places I've been to. And the crazy part it's in the bronx. If your black they will always serve you last if anyone white or Spanish comes in after you. You will order first but receive your food last that if they even remember that you ordered anything if your African American."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZejg3WHR3RRAB",
            "text": "The buffalo wings are very good. One time my order didn't come out as expected but Eric made sure my order was right next time. I was upset but he handled it extremely well. I'm glad I gave it another try."
        }
    ],
    "reviews_count": 70
}