{
    "name": "Bedford Pizza",
    "place_id": "ChIJqY-ilnnzwokR745O4UzYWuA",
    "grid": "BX7",
    "address": "380 Bedford Park Blvd, Bronx, NY 10458, USA",
    "rating": 4.3,
    "user_ratings_total": 295,
    "phone_number": "(917) 801-0770",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1IxWjRUbHBVV21NMUxYVnhaV1Y0Y1dWM05XYxAB",
            "text": "Owner is a neighborhood hero with a heart of gold! Love the free garlic knots!! Support this pizza shop!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVWEyUTRkWGhqT0hNeU4wTlJaMTlFY25oeGJFRRAB",
            "text": "This pizzeria is a joke. I called asked for the price of a small pie. I was quoted a 10.50 for a pie. The pie gets here burned and looks like they just took individual slices thrown together and burned them. They send another out just as burned and then I see a charge for 17.50 on my card for two of the worst pies I've ever received from any pizzeria without any indication that they were altering the charge. Never again will I call and give my card details over the phone to anyone. These people are thieves and are trying to sell garbage as food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsM05FRjRVRlZaUjNkVldITk1UbEpZTlhsamRYYxAB",
            "text": "The owner is such a sweetheart. He's always very kind to my three and kids and I. Always feel like family 2nd home. Thank you for everything"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNelVTMVlOblJDU1Y5V1NVOWhVbTlRZVZoa01VRRAB",
            "text": "Amazing crispy taste of pizza .\nYou can’t beat that ,it’s that good !!!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM2N1TG53RRAB",
            "text": "I've been eating great pizza here for 11 years. Mario is a good friend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaVRYZGhSSFkzWTJaVFpFRkxRVGMwUlVneFZFRRAB",
            "text": "I usually get 2 slices to go. The quality, taste, and consistency is always the same, excellent. The service is friendly and with a smile. 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMmNYTlVNV1ptWDNoWWVraG9hekprY0RCV0xWRRAB",
            "text": "The pizza and garlic knot were yummy. You could taste the fresh tomato sauce. 60s music was playing. Owner said they had been open since 1961. Will definitely revisit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQLTd0WnpKc19uWXVnRRAB",
            "text": "Excellent pizza, great value for money"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveV9Qa3ZRRRAB",
            "text": "Perfect"
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMXBfeWhRRRAB",
            "text": "Arretées pour visiter la ville, nous avons été très bien accueillies. Les pizzas 🍕 étaient très succulentes et généreuses. Je recommande !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNGJtaE9REAE",
            "text": "Pizzas goated"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NFBlamdnRRAB",
            "text": "I ordered a beef patti with cheese and its so hard around the edges that you cant bite the edges in fear of breaking a tooth."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncDVqQVdBEAE",
            "text": "How they have more the a 1 star is beyond me. I ordered 3 cheeseburger deluxe and large half pepperoni half Margherita pie, $63.50. The burger tastes like an abundance of sofrito, which i hate and the kids couldn't finish bc of the taste, the pie has old tomatoes and was burnt along with the inedible garlic knots that are dark and hard and made with cheap oil not olive oil. They have the audacity to tell me i ordered it well done. Even if i did WHICH I DIDN'T that's burnt not well done. U can definitely break a tootj on that crap they consider to be food. Of course it was some back and forth before finally agreeing to refund my $. 1st n last time customer."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZ2NMZ2FREAE",
            "text": "Pizza was great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMFk3ckJnEAE",
            "text": "Tasteful, warmth and hospitality are the words. I'm about to put in a delivery because its too cold out!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM0l5NV9BRRAB",
            "text": "Their pizza crust is always super hard or burned. We ordered BBQ wings & they sent us chicken wings covered in marinara sauce which tastes gross."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbVBPQ21RRRAB",
            "text": "Stopped here for a pepperoni slice and it was perfect. Light on the sauce, extra cheese, crunchy crust. I tried \"Made In New York\" after this and it wasn't as good. Give Bedford Pizza a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMTZlUWdnRRAB",
            "text": "Stopped for some slices before heading to the NYBG on Halloween. The counter staff were super friendly and inviting to us, and handed out puzzles and candy to trick-or-treaters. We had the pepperoni slice and the vegetable slice. Both were deliciously crispy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdnRuYzBRRRAB",
            "text": "First time ordering and they messed up my order . The rep I spoke with when I called was extremely passive and unapologetic about giving me the wrong order , no apology or explanation whatsoever.after admitting he was the one who took my order and remembering what I specifically asked for I should’ve at least received notice that my order was not fulfilled to my requests . And I still paid full price? Awful customer service . i regret the tip i gave"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN2NhVXlnRRAB",
            "text": "Great place and food! It has been a staple for many years!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaWN6M1NREAE",
            "text": "Small Pizza shop with a classic feel to it, and the food is amazing. Mario has been a part of our community for such a long time and his compassion, heart, and great food, make you feel at home"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dDc2WlBnEAE",
            "text": "They never get your order correctly. I've ordered 3 separate times and all 3 times they got my order wrong"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTZTQ0NBEAE",
            "text": "No flavor. They are not Italian don't be fooled it's a Bronx joint."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OXZUeF9nRRAB",
            "text": "Great food and service!! Great owner as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOWRxUFNnEAE",
            "text": "If you ever visit the Bronx, make at stop and grab a pizza at this place. It was awesome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOXR1ZVFREAE",
            "text": "One of my fav spots to grab a great slice. Nice variety and friendly service. You can't go wrong with a Bedford pie. Head on over there when you're in the neighborhood - you won't be disappointed."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbS1XTV9BRRAB",
            "text": "Beste Pizza in der Bronx"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbWR6ZmtBRRAB",
            "text": "Highly recommended. Very friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dXMtb21BRRAB",
            "text": "It's not defamation when it's the truth:\n\nHow do you knowingly employ an active porch pirate delivery guy without thinking it's going to come back on the business?\n\nDespite the fact that the individual employed by Bedford pizzeria is a locally known thief this place thinks its a good idea to ignore this basic fact. When I contacted the owner about this he basically said \"everyone knows he's a thief.\" Great way to lose customers while ignoring the facts.\n\nIf you happen to come home to a missing package and the security footage shows a large black guy in his 30s or 40s literally stealing from you or your neighbors please be sure to ask if anyone ordered delivery from Beford Pizzeria.\n\nThe owner of the business won't do anything to make things right, obviously the police won't either but at least you'll have a better idea of what happened to the item that got stolen by the delivery guy from Bedford Pizza.\n\nDon't believe this story?\n\nJust ask around- word on the street  will back up the situation I just wrote about.\n\nIt's pretty simple- if your employees are bad for business get rid of the employee that is hurting your business.\n\nAnd feel free to call out the owner about this as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkLUk3dWFREAE",
            "text": "Excellent people I love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzRhTmVBEAE",
            "text": "I ordered a Cheese Pizza Pie for delivery and it was an embarrassment!!  It was a medium pie and when I opened the box, the pie was too big for the box so the crust was curled over!! The dough was so thin the slice had no body and the crust was like a cracker, no joke! I love pizza!!, so know bad pizza and this is on the short list. Sorry Bedford Pizza, but quality is very important. I don’t mind paying for quality! I rate the pizza a 2 out of 10.  The 2 points is for the sauce and cheese which does not taste synthetic. Please step up and be a better representative of Bronx Pizza because right now you’re missing the mark!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMFB1SkJBEAE",
            "text": "One of the best NY pizzas I’ve tired a must try"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGZ19LbFBBEAE",
            "text": "Have been buying here for over 15 years. No problems."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOGNMLWlBRRAB",
            "text": "Pizza is good wings are good they beat they competition with their garlic knots."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadUp6ZVRREAE",
            "text": "I like the friendly ower, the good service and the food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcHU3RGhnRRAB",
            "text": "Great Italian food and great service. 👍🏼  Thank you Mario and the guys. God bless you 🙏"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeHJYWEp3EAE",
            "text": "The pizza was ok but the zepolies were inedible. They were too tough to bite into let alone chew. They should be completely taken off the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX0k3aUtBEAE",
            "text": "THE OWNER  TREAT everybody  WITH RESPECTED AND THE LASAGNA PIZZA  IS EXCELLENT"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNDVTRW1nRRAB",
            "text": "Love this place! Neighborhood classic! The marg slice is epic.. BBQ chicken too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdFo3QVh3EAE",
            "text": "Mario and his crew always does a phenomenal job when we order out for dinner a couple of times a month. Always a class act and a great person as well!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bUxhTVFREAE",
            "text": "They’re ok if you get actually pizza, garlic knots or a beef pattie etc.. Other than that this place is a rip off. $11 for “chicken fingers and fries” but what I received is a container of very thin very over cooked dry chicken cutlet cut into 4 pieces with what seemed like leftover fries."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocHNhZ0h3EAE",
            "text": "The kindest people selling great pizza!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbGRQZGtnRRAB",
            "text": "I go for the spaghetti, sausage.\nVery good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeWVpc2RREAE",
            "text": "Very nice 🍕 🍕 pizza the taste is very Italian 🍕 very nice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMGZ6NndBRRAB",
            "text": "Delivery did not speak ENGLISH, t👀k 1 1/2 hours, was received cold & half of what I did not order."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZ0wyaV9BRRAB",
            "text": "Every slice is served with a garlic knot. Pizza is good. Space is limited. Get your slice to go and enjoy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Nm8tOU93EAE",
            "text": "Albanian pizza is not Italian pizza no f,n way!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dU9EQy13RRAB",
            "text": "1 of my BEST GO TO PIZZARIA FOR ALL THINGS ITALIANO..🤗👌👏👍👍\nIt will fill you up..😮😯😲🤤🤤😇🤭😅😅…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMnZxNDF3RRAB",
            "text": "Great Pizza. Mario has been there since the late 60's. He makes a classic pie. The place is closed now due to an illegal gas problem in the building. He's getting a raw deal. Miss the pie😰 But, he's been back in business for several months now 😁 By the way, try something other than pizza too! His Lasagna is excellent and so is the grilled chicken salad (PICTURED)Also his grilled chicken wraps (also pictured) are great!!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2I2WXhnRRAB",
            "text": "Love this place. Food is always fresh and Mario provides great customer service."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eEtMcnB3RRAB",
            "text": "Friendliest Pizza spot on the Bedford Park strip with decent choices. I love their signature complementary Garlic knot added on to every order.\n\nIt's a bit tight fit if you want to eat inside so I highly recommend you order to go. They have a decent Greek salad and the pizza slices are bigger than usual. We typically visit Jerome's pizza but this spot is definitely our runner up."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdDhqMDRBRRAB",
            "text": "Staff were friendly even if they couldn’t get right to me I was greeted, got me beef pattie with mozzarella and pepperoni (they threw garlic knots on the side) my first bite I fell in love.\n\nTwo guys ordered the same thing after seeing mine haha."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbExXRkFnEAE",
            "text": "Best damn Pizza I've ever had. Just moved to the neighborhood. Damn it is crispy crust and just perfect. I wont be buying pizza from any other place"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZb1pTd3BnRRAB",
            "text": "The pizza here is great, exactly as you'd expect from this area. I'd say the cheese really shines - he'd told me he gets it fresh from Arthur Ave often, and it really shows. The sauce and the cheese really blend well.\n\nThe thing that really shines here is the service. The man behind the counter is always friendly, and if there's slack time, he'll strike up a conversation now and then. The guy really makes ordering there a joy every time. Even always throws in a few garlic knots with each pizza, too.\n\nShows you the pizza every time before closing it, just to make sure it's fine and also to put on toppings. Then before letting you go, he always asks if you need free paper plates or napkins to go with the pizza. I never need it, but the gesture is always appreciated. Recently became my go-to place for pizza, though other places in the area are great in their own way."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNWZHRzN3RRAB",
            "text": "Best pizza shop by far that i have eaten at. I really felt at home because the staff was doing everything to make me and my girls eat in experience comfy. The pizza was good with complimentary garlic knots. To top it off we got a discount because of my daughters school. Shout out to Ursula!!! I recommend this spot to everyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbjllQkNBEAE",
            "text": "This place has been my father and I’s favorite for years now!! Mario is always on top of everything and makes sure that the food is the best quality. Our go to order is always chicken calzone and garlic knots, and sausage and peppers on a hero. I’ve never had an issue with this place, even after 5 years of going here. Such an authentic NY staple!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPb01MU3R3RRAB",
            "text": "first of all, the pizza arrived in a tarnished box which was weird. To top that the Pizza was bad. Felt flimsy and wasn't baked long enough. Garlic knots taste like dough. 2 L of soda taste weird. I’m done with this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eGJEQ2pnRRAB",
            "text": "I lovED this place until today. I always tip, ALWAYS. In order for me to tip you though, YOU HAVE TO GIVE PEOPLE THEIR CHANGE BACK FIRST. Apparently the new delivery guy doesn’t know that and think your change is his. Then he thinks it’s okay to get snappy and tell customers “don’t call Bedford Pizza anymore,” well guess what? I WON’T and you can take this lashing out that you asked for with you.\n\nThen I call to tell them how their staff is acting and he says “I’m sorry about that BUT WHATEVER, they work for tips.” People like that are gonna try the wrong person one day and someone isn’t gonna have as much restraint as me and Bedford Pizza is gonna be looking for another delivery person."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbHJtMEhnEAE",
            "text": "I grew up in an Italian neighborhood in Brooklyn, where there was a pizzeria on every block and this place would rank right up there with the best. I just wish they were on Long Island. Best Eggplant Parmesan EVER!!…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNWJ5eG93RRAB",
            "text": "Ordered a Baked Ziti for the first time at this place and I have to say I’m extremely disappointed. The ziti had very little to zero sauce making it just a dish of hot cheese. Now to some that may be ok but last I remember Ziti has sauce…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMm9mWllBEAE",
            "text": "Horrible,  all the reviews may be from friends and family but this place sucks. Pizza is always cold soft and has a straight out of the microwave feel.  I forgot how bad this place was until I decided to eat it today,  Your pizza ruined my day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHellxSGRnEAE",
            "text": "Good pizza!! The man that served me the pizza gave me a garlic knot with my slice. I thought it was mistake and pointed it out to him and he smiled and said with every slice you get a garlic knot.  Thanks Bedford pizza."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcnBmby1nRRAB",
            "text": "Pizza was horrible. Ordered a large pie half pepperoni and half cheese. With an extra prder of garlic knots. Instead of sending these in an extra bag, they threw it all on top of the pizza which crust was burnt and looked like it been in…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPek5iR05BEAE",
            "text": "BEST PIZZA !!!!        WHY CAUSE OWNER MARIO IS ONE OF THE BEST,,,       MARIO SERVED ME PIZZA WHEN I WAS A BOY ON 194 ST. VALENTINE AVE. PUGSLEYS.EARLY 1980S  ,,   THEN MARIO WORKED AS A YOUNG MAN EXACT SAME PLACE THAT WAS BEFORE FAMOUS…"
        },
        {
            "date": "3년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNi1iNlNBEAE",
            "text": "Sehr lecker! Die Pizza Slices sind groß und machen gut satt. Am wichtigsten: sie schmecken. Der Service ist mega freundlich und die Preise günstig. Absolute Empfehlung!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdV8yV1BnEAE",
            "text": "It's new owners I used to come there about 10yrs ago and an Italian lady cooked the dishes and sandwiches the food was amazing..the new guy up front gave me a price off the menu and when it was time to pay the bill he added tax..for a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeUlySzB3RRAB",
            "text": "First off the pizza was mediocre, the garlic knots tasted like dried up dough, and the mozzarella sticks were dry as well, and the crust of the stick was not even crunchy 😂. This place is a joke, I recommend roccos pizzeria across from them, there pizza wigs and everything is way better then Bedford pizza…..…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNWJHWUVREAE",
            "text": "Good and big slice with plenty of cheese. All kinds of pizza. You all so get one free garlic bread roll with every slice.. I stop buy every Friday after work for an extra crispy slice.."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdUptY1FREAE",
            "text": "Fave pizza kick it spot! The owner is very sweet and definitely remembers you like family. Big, tasty slices and nice atmosphere!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrNjlIOGVREAE",
            "text": "This place is super clean and the food is delicious they even have types of pizza I have never heard of the staff here is familiar with the neighborhood and their customers.They even call their regulars by name and even suggest new types of pizza  regularly to keep you coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOE5uLWZREAE",
            "text": "We ordered food it arrived hot but within hours I was very ill. Vomiting 🤢 and my husband was ill several hours later. NEVER spending my money there again…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRc2ZpOTBnRRAB",
            "text": "I grew up in the Bronx where great Italian pizza thrived. I am happy to say that Bedford park pizza, an old favorite of the neighborhood is, still  standing with the Best pizza on earth!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaTV2VjJ3RRAB",
            "text": "These guys are great very family friendly\nPatient on the phone food is great they have ice cream and they are not stingy with toppings.…"
        }
    ],
    "reviews_count": 73
}