{
    "name": "Mosholu Cafe & Deli",
    "place_id": "ChIJKcZlSPDzwokR1rhyj_hb46U",
    "grid": "BX7",
    "address": "3441 Jerome Ave, Bronx, NY 10467, USA",
    "rating": 4.4,
    "user_ratings_total": 86,
    "phone_number": "(718) 708-6250",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ak9ETnlhemd0ZUdNMGRqUkJjR0UwUjBkaFFYYxAB",
            "text": "ordené un sándwich para delivery y tubo que pasar una hora para que me lo trajeran, y llego todo frío y aguado, pues ya tenía mucho rato que lo habían preparado y todavía cuando volví a llamar me dijeron que me habían terminado de hacer otro. Que mentirosos 😠y debo decir que no es la primera vez que pasa eso…"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcmJIWXRVakoyYkZWM1MwTlRXVXBmYkZWemJHYxAB",
            "text": "It was so good I couldn't eat it all at once .. this is now my go to place to get a good eat."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaGRrRlVSVEEyTFZrMFgwOU1Za1ZJYW1KR05YYxAB",
            "text": "Friendly staff, quick service and delicious food!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWk5EaENjVUpOWlU4NGRXMUxVRXRzYWkwMVRHYxAB",
            "text": "Customer service was great. Very nice and helpful staff. I have had basic deli sandwiches, fresh pastries and breakfast platters here. Food was good each time. And the Coffee was one the best coffee’s Ive had around this area. Coffee was fresher and more flavorful then Dunkin up the block."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kS1kyVTJTRGswWDFRM1RtY3hWSHBLWTBsTGRHYxAB",
            "text": "This...their food is heaven.... delivery time? Amazing. Food? Heaven. And service? Wonderful. If there was 6 stars I would've put it. So, 5 stars. Prices good for such heavenly food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUWVtcGFiMHRCV1VKM1RuaEhOa3czTWtGcFdsRRAB",
            "text": "They are the Best 👌🏾 👍🏾 Respectable Kind Gentlemen"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MGVuTm1XREEwTFZJM01IQndSako1VVVNd1oyYxAB",
            "text": "I always come to order the Mexican Wrap. The jalapeños are fresh and the wrap never falls apart in my hands. This is one of the many places in the bronx that properly wrap a tortilla roll. Much love to this deli!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VORFNoLWZvak1XdmpRRRAB",
            "text": "All of these family and friends reviews are a joke!! The \"Food\" here is subpar and the customer service is HORRIBLE. Every time they screw up the order, and you call to tell them, the guy that takes the orders denies any wrong doing, and even calls you a liar! Really dude? I called you about you messing up my order, and you say I'm lying? Needles to say I will NOT be going there again for their OVERPRICED food, and I will make sure everyone I know does the same.. Including at my job. Corner Pizza, on the corner of Mosholu and Jerome, is WAYYYY BETTER.. With reasonable prices and great food and customer service!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSE94cUhHX0t5U2xBRRAB",
            "text": "Todos mui amables"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMHJ5WlFREAE",
            "text": "Food is always fresh, one of the best BEC in the area!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNTVEbFVBEAE",
            "text": "Honestly speaking, this is simply THE BEST THING to happen to this area in a very long time by far it is the best food spot. Food is always good, quick delivery times, extremely professional employees. I cannot think of a single bad thing to say about them. Consistently delivers on all cylinders and we order from them consistently. If you’re looking to grab a bite from a well established, clean, friendly place with nice selection on the menu, this is definitely the one. Don’t waste your time on other spots in the area they simply cannot compare."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmemVpTml3RRAB",
            "text": "The food is great! But the customer service is terrible, I was rushed off the phone by a gentlemen taking my order."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX3BMM0FREAE",
            "text": "Great food, amazing service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bzZtQlZREAE",
            "text": "Honestly I have nothing bad to say about this place! Service and food are both great. Most of the time I get delivery and it gets here within 25 minutes and food still warm. Amazing food overall. If there is any place to recommend it would most definitely be this one!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2M3NMUGdnRRAB",
            "text": "Great food - Great staff"
        },
        {
            "date": "10달 전",
            "language": "ms",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ektqTTh3RRAB",
            "text": "Bangggin"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN3FQSWFREAE",
            "text": "I have been coming to this place since they open. However lately the customer service has been very bad. The food is not that great anymore. Ever time I go in they always have an attitude. I called the other day and they hung up on me. This use to be a nice place but now it’s not so good anymore and for that I will be taking my service else where."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cGJEX09REAE",
            "text": "Really love this spot, I usually call to order and they make my coffee and sandwich perfect every time. Also friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eWZULXJ3RRAB",
            "text": "The guy that picks up the phone is extremely rude and nasty. You guys need better customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieTgyLUtnEAE",
            "text": "Anytime I go there, the guy that takes orders, the cashier will be very rude to me. I asked him tea with sugar sweets, he will start yelling at me how many sugar how many sugar... Very bad customer service. I asked him his name for review and he refused. He is very rude."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidnJ1ZXZnRRAB",
            "text": "Excelente, servicio y buena comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeW9mZkhREAE",
            "text": "I ordered a coffee, bagel with cream cheese and bacon and a salad. I will admit the coffee and bagel were good, however the salad I had to throw out. On Grubhub, when you order a meat you have select if you want the meat hot or cold for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bjlhakJREAE",
            "text": "I order all the time from here with my coworkers and I was missing my sauce and I called and they argued with me for 5 minutes about sauce that I'm missing. I don't believe they would argue about something I paid for! I will never personally order again because the customer service I received today is horrible and they obviously don't care about their loyal customers. O customer service and I hope this is addressed with employees for future because they will lose lose of customers with this attitude!! i rather go to the food truck to get my food in the future!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeGVxRER3EAE",
            "text": "Love everything I have eaten there so far!!! I'm glad Mosholu Cafe & Deli opened up by my job!!! Go and see for yourself you will love their food!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqaFk2OVRREAE",
            "text": "By far the Greatest spot in the BX hands down, everything on point 👉 👈"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMTQtNTBnRRAB",
            "text": "This place is great! I’ve ordered many times in the past few months for breakfast and the food is always delicious and quality is fantastic. They pack everything so nicely and always follow any notes that I add. Love this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdFBtdWN3EAE",
            "text": "I love this soooo muchhhhh. wonderful service better than kingsbridge cafe. that store is WACKKKKKK. never order from kingsbridge cafe. Moshulo Cafe got better and Wonderful service. Fast delivery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcU9fMkZnEAE",
            "text": "Love this place they have great food, great coffee great attitudes even tho they're  busy as I walk in the guy says coffee w cream & Honey? Omg I can walk in disguise 🥸 & he still knows who iam & the girl too mad cool... I recommend everything on the menu  I've had breakfast lunch & dinner (they close @6pm so get it early) thank you guys for serving in my hood 😁❤️❤️❤️❤️💯💯💯💯💯 they definitely get 💯⭐⭐⭐⭐⭐⭐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5Nzh1ZGRREAE",
            "text": "Absolutely loveeee the staff here. So nice and kind. Food is amazing! Coffee is in point and made to perfection! Their salads are one of a kind and you truly get your bang for your buck."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeVBhU1hBEAE",
            "text": "Love this place ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdDdtSTNnRRAB",
            "text": "It's a tiny place, one table 3 seats, and the rest of the seats are bar style. But the food is the main draw, delicious and fresh, served hot. You can see with your own eyes how efficiently they work to get everything out, it's busy all the time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdTdfSDdRRRAB",
            "text": "First time here with the family to get some goods to go, will not be the last. Great staff, great fresh food, what else can you ask for. Hope this stays a staple in the area. I asked for a recommendation and it didn’t disappoint. Also, trust the reviews on the coffee…delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0X2RLYmNnEAE",
            "text": "I got it delivered from grubhub! I like how they packed my ice coffee very well with clingwrap. This is my first time to order but definitely not the last! I love their scallion bagels and nutella croissant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcXZQUF93RRAB",
            "text": "This is my regular place, love their toasted scallion cream cheese bagels so fresh! Pair it with a coffee always the perfect temperature to drink right away, i love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMi1lRFFBEAE",
            "text": "Best breakfast sandwich in town"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbUxucDJRRRAB",
            "text": "Love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOWNLS2dBRRAB",
            "text": "I didnt like when they busy , they don’t know how to react with customers … they were rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcXR2WVhBEAE",
            "text": "Their food is absolutely amazing. Their staff is very comforting at making you feel welcome, no matter how many times in the day you walk in. Prices vary as to what you’ll be eating but, very reasonable. Has a couple of dining tables but, mostly is a takeout business. Deli has their own delivery service as well in case you don’t want to use Uber eats or any other delivery services."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbHJiTS1nRRAB",
            "text": "Today was my first time in here and let me tell you its a HIDDEN GEM. Breakfast Burrito was absolutely amazing. The staff was attentive and was working really hard. I can’t wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMk5hWnlBRRAB",
            "text": "Buenas tardes noches hoy llame para una orden yo soy cliente frecuente y la verdad toda la comida esta super mal pedi un chicken clutle sandwich como siempre y el pollo esta quemadicimo las papas llegaron durisimas alpareser ya las tenia de todo el dia ahi la comida no me la regalan pago por el servicio y la comida y creo que de la misma manera que soy cliente frecuente deverian de tener un poquito de respeto y atender tanto al primer cliente como el ultimo asi que les pido por favor que tomen encuenta eso tengo las fotos de la comida pero de nada me sirve oonerlas si no ponen atencion en eso muchas gracias. Esto si es molesto"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacHRiZWJBEAE",
            "text": "Clean nice place all employees are very friendly,\nThe food is great prices not to bad ,\nI recommend this local business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabFBTRzh3RRAB",
            "text": "First time visiting, Great service great food, and a very clean place, I just wished it was a bigger place with tables to sit down and enjoy the food, it's more of a pickup place, by the way, they do have where to sit but it's uncomfortable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbS0tMlRREAE",
            "text": "Good food and good service for a good price!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaV96WlFREAE",
            "text": "Excellent food\nvery good cheeseburger and everything is affordable."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMGRPTWx3RRAB",
            "text": "Siempre un buen servicio, ☺️ comida deliciosa y el lugar siempre está limpio. En resúmen un buen ambiente para disfrutar de unas deliciosas comidas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaHFEcDhRRRAB",
            "text": "You can tell they make the food fresh because it’s consistently good every time I order from here. The best chicken quesadillas I ever had - they make them just how I like with the onions and peppers in it 🤌🏽🤌🏽 keep it up guys"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwek1DdlJ3EAE",
            "text": "3rd time eating here, so far so good! Highly recommended this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaW9tTFJ3EAE",
            "text": "wow"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNzl1TnFnRRAB",
            "text": "Outstanding service. My partner and I get breakfast from them on UberEats pretty often and they never fail us <3"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d2IyRDNRRRAB",
            "text": "Pedro is the best, great customer service from cashiers to the cooks. Congratulations & I wish you guys the best, my favorite morning spot. Don’t go to El President it’s not worth it.\n\nMosholu cafe is the best and fair prices for consumers.\n\nThank you, sincerely Popeyes !! 🙏"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNFByM3N3RRAB",
            "text": "Excelente  servicio de las personas que están en el mostrador  la verdad lo recomiendo  👍 👌  son pocos los lugares que Encuentras con esas características\nY la comida ni se diga esta riquísima 😋\nLa verdad"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScjRUM0R3EAE",
            "text": "Pure deliciousness!! Got the Tulcingo Breakfast Sandwich, (Bacon, egg, cheese, home fries and jalapeño peppers, on sesame bagel)everything was perfect, I recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa09YNy13RRAB",
            "text": "One of the best sandwich places in The Bronx! Food and coffee….AMAZING!!!\nFast service and reasonable prices. Must try if in the area!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSa0xIZk9nEAE",
            "text": "This cafe is amazing and I have Gone to this cafe 3 times. The iced coffee is amazing and the breakfast is clean non greasy and the staff is very nice and kind. They care about their customers. I have Recently moved in this area for a year…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc05MQjVnRRAB",
            "text": "Mosholu Cafe sets a new and higher standard for the Mosholu Parkway/Jerome Ave. corridor.  The space is bright, spotless and inviting --and most important-- the food and service here are excellent.   Great for coffee, breakfast, lunch and dinner (also smoothies !)\nHave both dined in and carried out from here with work colleagues and everyone has loved their food. Pricing is in line or even less (for the quality) for this area.\n\nReally glad Mosholu Cafe has finally opened !  At last we have an alternative to the otherwise grimy fast food joints along Jerome Ave.   Also, they offer counter seating here- so you can enjoy to dine in if you want - and this is key because they are the only cafe deli in the neighborhood to provide this option."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSZ2Nudk1BEAE",
            "text": "Absolutely love this place. The service and atmosphere is very nice. The employees are very friendly and welcoming. Their iced coffee is so fresh and flavorful. Totally recommend the chicken quesilldas and the salads so good ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdVliNUl3EAE",
            "text": "The turkey burger that I requested to my liking was delicious. It was made to perfectionn, it was everything. I will be ordering more food and looking forward to trying other dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNzdPLXZ3RRAB",
            "text": "Love the new environment, amazing food and the coffee is worth to try! Thanks for the hard work you guys do and I cannot wait to come again. 5 stars 🙏🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSektESjN3RRAB",
            "text": "This place is very nice and clean. Service is excellent. Pedro is very nice and friendly and great service. The food is super delicious. They’re chicken quesadillas and salads are on the money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSZ2JpUlZnEAE",
            "text": "Food is delicious. Coffee is amazing, just the right amount of sweetness and flavor. Definitely will go back"
        }
    ],
    "reviews_count": 60
}