{
    "name": "Rancho Tulcingo Restaurant",
    "place_id": "ChIJ9W3WLOzzwokR0emMwfRaBSg",
    "grid": "BX7",
    "address": "3127 Hull Ave, Bronx, NY 10467, USA",
    "rating": 4.4,
    "user_ratings_total": 58,
    "phone_number": "(718) 872-7634",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGVuSnNhbFZmYlVWak4zWllVMk5wTUZjNVgxRRAB",
            "text": "Walked in feeling welcomed and was seated immediately. Ordered chilaquiles verdes with al pastor and beans, and a lime margarita. I usually judge a place by their chilaquiles, and Rancho Tulcingo is fantastic by that standard, pretty cheap as well ($11 + $3 for adding meat), and it came out within 10 minutes of ordering. The margarita was good, although a bit more expensive than I'm used to. I'll certainly be back to try some other things on their large menu, give it a shot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNWVrWjNkMVEzWDBOR1VuTm1kMkZvYTFsb2JIYxAB",
            "text": "Wonderful local spot, they never disappoint. Huaraches and chimichangas were delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTE5rOTNObWxWTldaak0yMVlPVWRyTFRkblFtYxAB",
            "text": "Amazing food, great service I ordered the burrito bowl best bowl I ever had"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNE9UUkdOV3cwU2taM04ya3piVFJTVTFscmNWRRAB",
            "text": "Hola, muy buenas. Iré al grano: el delivery fue muy amable y las bebidas estuvieron muy buenas. El problema fue con la persona que me atendió hoy, martes 26 de agosto alrededor de las 8:20 pm.\n\nAntes de ordenar, revisé el menú en Google y fui a la parte de “tortas”. Cuando llamé, pedí exactamente por el nombre que aparece ahí, pero al final me trajeron algo que no era una torta. La persona que atendió el teléfono en ningún momento me aclaró ni me preguntó si lo que quería era realmente la torta u otra cosa.\n\nYo simplemente pedí lo que decía el menú en la sección de tortas, y me terminaron trayendo algo distinto y caro. Hubiera sido mucho mejor que la persona que tomó el pedido se asegurara de confirmar lo que yo quería, ya que el menú en Google no está nada claro"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrdExYcG5SRGRqVW5aMlVuaHFaRkZMVkVSeGJWRRAB",
            "text": "Venden barbacoa de chivo pides un plato y sólo te dan carne con arroz y frijoles ????? La Barbacoa viene con consomé y aquí el consomé lo venden aparte con carne en total sería si quieres una barbacoa con caldo más de 35 dólares es un engaño esto, porque no venden como son la cosas pides una barbacoa es con caldo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd1FWQjFRWFU0ZUMxd1NYWm5SRlJoU2xGQlprRRAB",
            "text": "They took almost 2 hours for a 5 minute walk and the food did came out how it was supposed to be"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRmFuWnFjVlY0UlRWVGRIRXllbEJ3YTFBd1UyYxAB",
            "text": "Excellent!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNRGhqLWpxcXZYWG13RRAB",
            "text": "I feel bad that I got upset because I ordered something that specified three flautas served with rice and beans. They seem very nice but I was just disappointed that I paid almost 30 dollars since I ordered avocados on the side on uber eats and never received rice and beans. On the order it mentioned three flautas served with rice and beans, i believe they need to remove that because it doesn’t specify clearly that it’s 4 instead of 3. It states three like it comes with three flautas and rice and beans."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbUpxYld4bXNlTjJnRRAB",
            "text": "This restaurant is like being at the corner diner in Mexico City, the flavor of the food is exactly like the “Real Mexican” Chilango seasoning! The atmosphere, the music, the decor, the service, make me feel like I am definitely in Mexico, very nice place, the service of the waiter Kevin is excellent, very attentive, friendly and helpful, I recommend the Red Pozole, the Birria Consome, the waters here are really “natural”… from Jamaica, Horchata, Tamarindo, it is truly a place you cannot miss if you are in Bronx, NY… 100% Recommended!!! Stop by the bathroom to wash your hands and enjoy the decor, you will love it! 💯/💯⭐️⭐️⭐️⭐️⭐️\n\neste restaurante es como si estuvieras en la fondita de la esquina en Ciudad de Mexico, el sabor de la comida, es exactamente como el sazon “ Real  Mexicano” ¡Chilango¡ El ambiente, la musica, la decoración, el servicio, me hacen sentir que estoy definitivamente en Mexico, muy agradable el lugar, el servicio del mesero Kevin es excelente muy atento, amable y servicial, les recomiendo el Pozole Rojo, el Consome de Birria, las aguas aqui si son de realmente.    “naturales “… de Jamaica, Horchata, Tamarindo, en verdad es un lugar que no pueden dejar de visitar si estas en Bronx, NY… 100% Recomendable!!! Pasense a lavar las manos al baño y disfruten de la decoracion les encantara! 💯/💯\n⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUGtxS3p0NExIbVhBEAE",
            "text": "Muy rica la comida y buen servicio 👍"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMU9xVXB3RRAB",
            "text": "Muy buena comida muy buen sabor aveces los lugares pequeños tiene el mejor sabor de la real comida mexicana 🇲🇽"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNVpyVlVREAE",
            "text": "Buena comida buen ambiente se los recomiendo 👍🏼👍🏼"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvejl2bVBnEAE",
            "text": "Great food ! Great service ! Totally recommend"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTRtVzBRRRAB",
            "text": "La comida es rica, les recomiendo las tortas son muy ricas 😋  la comida del día tiene muy sabor!!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJODZUUzFnRRAB",
            "text": "Buena comida muchas gracias tulcingo las costillas de puerco en salsa verde una delicia la pancita sopa de res roja y verde ni se diga soy de guatemala pero me encanta la comida mexicana y de ese lugar muy limpio también las margaritas y las piñas coladas se los recomiendo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMDZYWm53RRAB",
            "text": "Delicious delicious delicious. All of the meats are seasoned to perfection. Every bite is delicious. wow wow wow. The service is really great too! You can feel that the food here is made with love 😌…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNWNiZU5REAE",
            "text": "Today, Rancho Tulcingo disrespected me. I ordered a Torta de Milanesa de pollo. And as you can see by the pictures, there was no Milanesa de Pollo. I don't even know what that is! Just the Milanesa (breading)? How dare they have the gall to sell this! I PAID $13 FOR THIS? I know ya can agree with me just how disrespectful this is to their customers. And to a loyal customer! As of today, I stop endorsing this place. Go to MEXICAN DELI GROCERY around the corner, instead. They would never! And they never have!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dVlLd3R3RRAB",
            "text": "This restaurant is a gem! The people are so nice and friendly, the food is so tasty. And the music is always well selected. Definitely save this spot to come back again and again. It never gets old."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MXJ5elNBEAE",
            "text": "El ambience es bien tranquilo, la cómoda es bien rica y el servicio muy bueno. La comoda se sentía bien Fresca y sabrosa."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXZLb3pBRRAB",
            "text": "A pesar de ser un lugar pequeño, llena todas las expectativas, las sopas 100% recomendable, el servicio excelente, por supuesto que voy a regresar."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMDkzT3RBRRAB",
            "text": "El mejor restaurante de comida Mexicana aquí en el vecindario de Norwood, soy Dominicana y amo la comida mexicana de ese restaurante siempre fresca y con un excelente sabor, y también tienen un excelente servicio y ambiente, los recomiendo 💯."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd3B2cjJnRRAB",
            "text": "Great food! Great service! Great owner!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b2MteTNRRRAB",
            "text": "It’s a beautiful homie feel place. The food it great especially their soups are so good but as good as their margaritas the tamarindo or the Maracuyá which is passion Fruit are to die for definitely a place to try……"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzXy11b2NREAE",
            "text": "Had the mole poblano, chile relleno, carnitas, and lengua - all clearly expertly cooked and wonderfully tender. Owners were very sweet too. Definitely a standout!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcGNmY29BRRAB",
            "text": "La comida muy buena pero muy caro 4 tacos y una horchata 40 dólares mucho"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYck9PbEdBEAE",
            "text": "If I could give more then 5🌟 I would. This is top rate Mexican food and the people who work here are so lovely! Great for international visitors and locals. The lime margarita is fantastic and a must try! We also tried the burrito and stake quesadilla , both fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYck9QY3hRRRAB",
            "text": "Wish I could give higher than 5 stars! Delicious food and drinks and very welcoming! We wish we could try all the menu but everything we did try was fantastic. Highly recommended, especially with a short walk to the botanical garden!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYb3NuelhBEAE",
            "text": "Muchas felicidades la\nComida 💯mexicana 💯recomendado súper delicioso 😋 los que gusten hir son bienvenidos todo súper bien. Tienen de todo tipo de comida mexicana los\nFrijoles de olla lo más delicioso 😋 💯recomendós ❤️🙏🙏🙏"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIanJ6ZVp3EAE",
            "text": "Comida no exactamente mexicana"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnZQRzlRRRAB",
            "text": "Recomendó está muy rica toda la  comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnJPN29RRRAB",
            "text": "The food was delicious. We ate tacos de birria, lengua and barbacoa de chivo. Great new spot!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiay0tYWx3RRAB",
            "text": "Un ambiente muy agradable tranquilo para compartir con la familia es el restaurante favorito de mis gemelos y fuimos a comer para celebrar su cumpleaños ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaWZUNHFBRRAB",
            "text": "When I’m in the area I grab the grilled chicken taco salad bowl with  a large cup tamarind for drink!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NzVTaXd3RRAB",
            "text": "Todo muy rico , y las personas muy amables ,😊"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dlktZm93RRAB",
            "text": "Muy buen lugar buena comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MVlIWEV3EAE",
            "text": "Really nice place with great food that tastes like home from the Rancho. definitely my new spot to get homemade food. The mole poblano was delicious!! I wish I had the receipt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUOUxQdE1nEAE",
            "text": "Definitely go for tortas!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcDc3YURnEAE",
            "text": "Muy buen servicio muy amables y la comida es buena una baina bien !!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqb2UtSG93RRAB",
            "text": "Las sopas de res se las recomiendo"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNXNPdWxRRRAB",
            "text": "Muy amables en la atención y muy limpio !!! Las tortas cubanas muy ricas"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcklPUWxRRRAB",
            "text": "Buena comida las cemitas están ricas 👌"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdThUWUlBEAE",
            "text": "Excelente atención al cliente, amables y el lugar muy limpio.\nLa comida deliciosa"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOEtmSkFnEAE",
            "text": "Los tacos alpastor muy sabrosos 👍"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOEx1UzV3RRAB",
            "text": "Muy buena comida en el área recomendada 👌 👏 👍"
        }
    ],
    "reviews_count": 44
}