{
    "name": "Tex’s Chicken & Burgers",
    "place_id": "ChIJM70Hx-_zwokR4bhtoRQnEHs",
    "grid": "BX7",
    "address": "277 E 206th St, Bronx, NY 10467, USA",
    "rating": 4.4,
    "user_ratings_total": 284,
    "phone_number": "(718) 708-4737",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbHBPTEVREAE",
            "text": "I came to it from a far place and it took 50 minutes to get there because it is halal. It was our first time, but it will not be the last time. The food was delicious, the place was clean, and the service was excellent. My daughters were happy with this place. I thank those in charge of it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cVVFbFlNelpaT0c1NWRFbFJXWEZhU1dkSWJuYxAB",
            "text": "Literally sick in bed and craved chicken because the one on 141st and broadway is amazing and got nothing but uncooked fries, bread not baked, and the chicken smells uncooked. Im soo sad !!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKemJFdFBTV3d4V1ZWTFMyNUxSMDl4WVY5ck0zYxAB",
            "text": "Bueno"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oblkxTXlSbTVIU1U0MmVsOVJiVFpCVm5Gd1NXYxAB",
            "text": "Best services their chickens sandwiches, grilled chicken sandwiches, their chicken temfees delicious tasty. Their employees Amadur Rahman n Habib Ahmed others excellent services good friendly, customers happy with their services,  dining area tables always clean\nI'm their regular customer. I always  bring foods try their foods delicious"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk1UMUd3EAE",
            "text": "Thiss restaurant is worssttttttt the ownerrr is very rude the workers are rudeee they will send uh different item in uber orderrr without even asking you andddd willll arugueee with you andd everytime they will forget anything in the bag worstssssssss"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUlgzSnRkWFZPVTB4WlprMUtTVzVTTmpkTVZsRRAB",
            "text": "Great food great customer service opened all the way until 2am can’t beat that"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZek9VaFVXVXBDVkdGdloyeHNNa3AwUzFGb1RWRRAB",
            "text": "Ahmed bai is best employees this store. Thank you for survice 👍…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORkxTMXlVME5pYnpGdGVrMUNPVWxYTldNMllrRRAB",
            "text": "Highly recommend, always my favorite to go spot. Ahmed , Faial , Habib & Youns always giving us the best service 🙏🏼."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSd1JrdGlibVpCVlRSRVduTkVWVlZNWWtwaGRVRRAB",
            "text": "Barak B gives excellent customer service thank you Barak"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRlZEaEdjWGc0YW05VFkyaEZkRnBzU0hOclgxRRAB",
            "text": "Chicken is best workers are friendly had great experience. Bilal guy at the front was so friendly"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcU1xY193RRAB",
            "text": "They changed the hell burger sauce formula, too chunky of a sauce and it doesn't taste good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNVEtvT214d1pybHNnRRAB",
            "text": "Been here twice now and both times great service fresh food. Will add photos on my next visit. Only thing i dnt like is the homeless and the handicap guys in front of the shop keep asking for money. Like ill buy u food but im not giving u money and im with my kids smh other then that it great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM1Nyb21SMzVPdFVBEAE",
            "text": "The Spicy Chicken hit really good at this location.  They always have a fresh batch coming out.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQcnd0cEhzbUlhdm9RRRAB",
            "text": "Worst service they don’t know how to talk with customer, guy who takes order (bilal) he was too much attitude management should take action on service worst experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJX3czNldxMDQtNjRBRRAB",
            "text": "I love that they always hook me up when I go. Some days are hit or miss depending on who's working."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5djVpVkdREAE",
            "text": "Check your order before you leave they never give you everything you pay for always short items"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN2RUTzNRRRAB",
            "text": "Stopped staff working here"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRblA3a1VnEAE",
            "text": "No flavor\nMy spicy chicken wasn't spicy 😩"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHVxenBBRRAB",
            "text": "Muy buen lugar limpio , buen pollo, buena atención al cliente y lo más importante se puede comer tranquilo"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOGFLWW9nRRAB",
            "text": "Amazing spicy chicken tenders! Always fresh and yummy!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbnBQQkNREAE",
            "text": "Food is great. Whenever I pass by I get something always. Specially their biscuits are awesome with spicy chicken tenders. Also hell burger is another love of mine. There are dine in options too. Most importantly its a HALAL restuarent. So suitable for Muslim brothers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbjUyRDdRRRAB",
            "text": "Best experience and best chicken"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjViYkN3EAE",
            "text": "Best chicken in town best service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjlEUEdnEAE",
            "text": "Best service in town. The chicken taste is just awesome must try best fried chicken"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNzlfc013EAE",
            "text": "Best service .Food is always nice and hot best chicken and sandwiches must give a try ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN191ZXlBRRAB",
            "text": "Perfect food, nice and hot, always efficient and ready. Most importantly clean and direct service for the customers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNzltV1lBEAE",
            "text": "Best tenders in town must gove a try."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmajRtWGZ3EAE",
            "text": "Best service best food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbDlXMUZ3EAE",
            "text": "My daughter loves their hot wings. Regular chicken has no seasoning on them."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOHRmQ3VnRRAB",
            "text": "Rude and Unhelpful Staff at Tex’s Chicken & Burgers 277 E 206th St, Bronx, NY 10467 the employe name AHMED on 12/25/2024 at 9:07pm  I order food for my family to take out, while I was standing waiting for my food and saw a sign in front of the register Mac & Cheese ONLY $3.00, looked at my receipt and saw it was charged $3.25 I approach the employee name AHMED on his name tag asked him regarding charge my receipt MAC N CHEESE price his response was so rude he turns his scree at me and asked me to look at the price, when I show him the display sign that was in front of his cash register, He was very loud with me his exact word “IF YOU DON’T WANT THEN LEAVE”  the level of service is unacceptable. The customer service from Mr. AHMED was extremely rude and dismissive. I felt disrespected and will not be coming back to this restaurant and also will not recommend anyone I know in the neighborhood; I am a regular customer and business owner in the same neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeHVuM3pBRRAB",
            "text": "Jahed bai you best"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd3B1TUZBEAE",
            "text": "Excelente  la calidad de la comida.\nEl pollo muy exquisito y fresco la verdad me encanta a mi y a mi familia."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMVlqQW5nRRAB",
            "text": "Awesome staff. Always a welcoming bunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaV9TTnZBRRAB",
            "text": "They have the best spicy chicken ever it’s always fresh and hot. The fries are always fresh. I normally do DoorDash, and I’m never disappointed. Corn on the cob is fresh and good, the hell sauce is soo good!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuN1pPejR3RRAB",
            "text": "Un lugar perfecto y muy limpio.\nLos empleados son muy amables especialmente Barak. Siempre tiene una sonrisa y es muy atento."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubkk2Sk5REAE",
            "text": "Very good food the service was almost chic fil a quality and the place looks amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicUlld0dnEAE",
            "text": "Food was amazing but the customer service was more. The guy listened , handled  and packed my order perfectly. All stats goes to him. He was Bangladeshi boy very nice humble and professional"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdzZEUXpBRRAB",
            "text": "Very good place to eat food fresh burgers are the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX0ozc0dBEAE",
            "text": "Is the chicken here zabiha or machine slaughtered?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdDZmbVRREAE",
            "text": "Great food. Tastes better and fresher than your average McDonalds or Popeyes. Restaurant is also clean with good seating and bathroom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cHZ1VmpnRRAB",
            "text": "I come here all the time love the place but I recently discovered the app where i can scan for my points but come to find out they don’t even have a scanner at this location so I can’t have my points not impress not happy about that please fix thanks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6LUt2bElnEAE",
            "text": "frist time i'm here, damn best burger ever ,very delicious .."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc2YyWm13RRAB",
            "text": "1st time there and their Chicken Tenders are so darn GOOD & JUICY...🤤 My 12 year old enjoyed her Crispy Chicken Sandwich & my 5year old loved her Chicken Nuggets & Fries...💕 Food was better than KFC, McDonald's, Burger King, Wendy's, White Castle and all the rest I have ever eaten. This will now be our only Spot to eat real chicken that tastes great for a very reasonable price...🙌🏽 10/10 ⭐⭐⭐⭐⭐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOHVmWFJnEAE",
            "text": "poor service never coming again"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dG9Dc01BEAE",
            "text": "I usually refuse to have fried chicken from random places because most of my previous experiences have been negative\n\nMy husband ordered from this place by himself a couple of times and told me they were really really good and convinced me to give them a try... now we don't know to go back from this 😂\n\nBest fried chicken I have ever tried - always fresh, super crispy, tender, tasty, perfect texture and most important, PERFECTLY FRIED 👍🏻\n\nEven their huge size chicken pieces are always well cooked and tasty on the inside (not only on the outside!)\n\nAll sides we have tried so far: fries, corn cob, biscuits, coleslaw - have always been very good. I love the fact that these side dishes are as good and as important to them as the main dish, the chicken. Their ingredients are ALWAYS fresh and tasty: biscuits are never stale, vegetables are always fresh (they never look bad or brown like lettuce in some other places 😅)\n\nIts like, they really are paying attention to what they're doing and what they're doing is really good\n\nCustomer service is great as well - there is one specific cashier at the register who is always there when we visit; he is very very nice and always makes you feel welcome 👍🏻\n\nIn conclusion, our only option whenever craving some fried chicken 🍗"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1cTVMNHNnRRAB",
            "text": "Hell Style is probably the best chicken burger you can get in the whole state of NY, especially since it's Halal! Please try it and do not order it through those food apps because they charge double what you get in person at lower prices. I have been trying their burgers for more than a year now and I can very well say that I have loved their food every time I ate it! Although it is far from my home, my travel to get there has always been TOTALLY worth it!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bkxqTU1BEAE",
            "text": "Great place to come and enjoy a burger.  Try the Hell burger is great to have. Was not spicy enough for me being jalepeno in it. But the burger itself was good. Def better than McDonald’s and Burger King."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDXzh2RjVBRRAB",
            "text": "There chicken pieces are really exceptional, chicken sandwiches are a bit dry, beef sandwiches are juicy and have great toppings. Overall I like it. 👍…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxenNuMHpnRRAB",
            "text": "I had a food delivery from these guys and was sent the wrong order. I mean they got the total entire order wrong. When I contacted them they act like I didn't order from their location. So it's obvious I got someone's order but not my order and no refund of any kind. Not even a replacement for their mistake. I will not be ordering from them anymore. Good luck and good ridden."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ODd5ellREAE",
            "text": "This was a nice little restaurant. I had never heard of it before.  The food was really good. The spicy Texas burger was very tasty.  It's not crazy crazy spicy, but does have a kick to it.  They give you a very good admit of large fries.  They are worth the money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabS16ZTZBRRAB",
            "text": "Around 11pm one cannot be to choosey... price was a little more than we expected. I just had Cole slaw & French fries which was tasty. The fries have a slice to them which made them extra delicious. Other people had cheese burgers which they decided so couldn't be that bad. Single burger ran about $9, which is normal for a restaurant, but this looked more like a fast food place with some seating. A combo meal started around $14.\nThe guy at the counter didn't really tell to help us out on ordering he just tried to sell us a chicken dinner for $40. We said we just wanted something light. Still the food was delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacF8tWjJBRRAB",
            "text": "I have been ordering texas for years. Last night I ordered from here and their lettuce tasted really bitter. I somehow managed to get through spicy chicken burger but the coleslaw was so bad I had to throw the whole thing.\nThe taste is really different from what I get from their brooklyn location."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHazhMS1h3EAE",
            "text": "I want to like this chicken, I really do. At varied hours that I come in get similar order tenders ,fries or mashed potatoes. The fries oh my are always like warm but tasty of what they could really be if freshly made. Then tenders crispy,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXek9ETldBEAE",
            "text": "The mashed potatoes was nasty the biscuits was very dry and the chicken was alright"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpa1pyNGx3RRAB",
            "text": "This particular location was excellent. Also I didn't know they had biscuits that could not only stand up to but in my personal opinion surpass Popeyes biscuits. The biscuit was super soft, flaky, extra buttery delightfulness! The chicken was good too but that biscuit though!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzLW9tdTl3RRAB",
            "text": "This was my first time there and the chicken was really good!  I've only been to Popeyes and KFC so I wasn't sure what to expect.  I ordered the 2-pc combo meal which had any 2 pieces of chicken of your choosing, fries, a biscuit, and a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxOFpmTFZ3EAE",
            "text": "Out of all the Texas this one is the best. Jahed makes sure my family and I are taken care of. Food is always fresh and delicious. I would recommend this restaurant over and over again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdjRycnd3RRAB",
            "text": "Pros: Nice specials (5 for $5, 10 for $10) and usually clean interior with tables and a restroom.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNS0yQVdBEAE",
            "text": "Horrible customer service. When walking in I wasn't even, greeted or looked at just ignored. The only employee there spent more time talking to a guy he than worrying about acknowledging customers existence. He was rude the entire time he…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadF8yU0NBEAE",
            "text": "Chicken was nice and fresh, and the fries didn't taste like old fish oil. #winning... definitely the best chicken spot from Norwood to Woodlawn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxOGZlOVpREAE",
            "text": "I’ve been coming here for 3 years with my family. We have them a call of what we want they never disappoint us. Highly recommend their hell burger the best🙏🏼"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcGUtNTB3RRAB",
            "text": "Worst texas chicken burger ever. The mest up on my order. I asked for the 8 piece family combo. They chicken tasted bad, I know cause this is not my first time eating texas chicken restaurant take out. They gave me 7 pieces instead if 8.…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0X2VQc0RREAE",
            "text": "Vivo a un bloque de esa tienda y lel pollo y todo lo que se vende ahí es muy bueno ,aparte siempre está todo limpio y tranquilo. El mejor pollo que me e comido siempre voy a comerlo ahí en Tex's Chicken & Burgers."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X19PTUVBEAE",
            "text": "Texas fried Chicken has pretty decent prices. If it is pretty good. And you don't have to wait so long. I went to the one in West 205th Street Bainbridge avenue near the number 10 bus in the Bronx."
        }
    ],
    "reviews_count": 64
}