{
    "name": "Rocco's Pizzeria",
    "place_id": "ChIJvyxGjnnzwokRw5W56GcWzMg",
    "grid": "BX7",
    "address": "397 Bedford Park Blvd Ste 2414, Bronx, NY 10458, USA",
    "rating": 4,
    "user_ratings_total": 182,
    "phone_number": "(718) 295-6793",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MWNtcENjbW90VGxSUmVWbG1XbTQ1UVVoTFlsRRAB",
            "text": "They keep hiring back the delivery driver that threatens people while delivering pizza. Now😅he's back working behind the counter and he scratches his bear skin and touches all the pizza.  He's here now.  I asked to wait for a fresh pie to…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT05HRlJWRkJ6YUVkWE9VOHRYMWRvWW5aTVdGRRAB",
            "text": "Delcious cheese slices and open late"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc1dscHdVM1ZSTkdWQ2MxWkdjVVp1U3pCR00zYxAB",
            "text": "Pizza here is just like I wanted it to be. Perfect amount of cheese,... Definitely going back every week lol 😆. Seriously though, I like this place a lot. Service was great; they have a few tables to eat in. Only thing is that the energy outside of the restaurant is not good. There are druggies around the place outside. But it's the Bronx... I love it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT09pTkRHOXRpNExBEAE",
            "text": "One of the best pizza shops around!    Pizza is always great!   Not only is the pizza good the entrees are just as great!!  I eat here at least once a week!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMmI0N2l3NXZXUmNREAE",
            "text": "Such a dope spot, I feel like I stepped back in time eating inside. Great place to grab a slice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWHo1TnU5N1BmMXlBRRAB",
            "text": "great food!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MTRPYXFnRRAB",
            "text": "My favoriite"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMR3JpTVNoNGRQVUpnEAE",
            "text": "Amazing place, good food. Only took 30 minutes to come to my house in Eastchester NY. Overall amazing place, nice workers. Keep up the good work!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcThlbVd3EAE",
            "text": "Food has no flavor and the service sucks the people are rude to the customers that call in for delivery I guess the people that go in the store are more important"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeVl6d3ZRRRAB",
            "text": "The lasagna was amazing so was the cheesy garlic bread. Will not disappoint."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d0l1VVRBEAE",
            "text": "I was a student at Mt St Ursula in the 80s and had my 1st slice of Rocco’s Pizza. I have yet to find another slice that competes. I currently live outside of NYC, but I always navigate back to this spot and they always hit the spot! Forever my pizza spot!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMUl6WDRBRRAB",
            "text": "They raise the price a bit more now that there competition isn’t open. They are lying about you need to use a $10 and more minimum to use your credit which is a lie. That’s just a con to make people have to use more money so they can pay the credit card company every time we use our cards. They also saying they have to charge us tax because of using credit card and they charge me more then what tax is in nyc. It just makes no sense if there not charging tax when you are paying cash. There pie is a lot more expensive and a lot thinner is definitely not worth paying pizza here."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbDVyQ2xnRRAB",
            "text": "Roccos has changed alot MAN...This was the neighborhood's gem and it has gone DOWN....Instead of an Italian Combo Hero they give you a BODEGA hero with a piece of ham,salami and cheese with slapped Mayo on it,and nothing of what it actually is...Disappointing and insane"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLU55bUhBEAE",
            "text": "Food was really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM2RfMVlnEAE",
            "text": "I went to the HS in Bedford Park and this was always OUR GO TO pizza! A decade has passed, i moved far, and my husband picked up a pie yesterday night for our kids to enjoy an excellent pizza! They did not disappoint! i love Roccos 💚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbDhMeFFnEAE",
            "text": "Ordered thru Uber Eats & their pizza was more than scrumptious!! 😋 Got a large extra cheese pie with half pepperoni & devoured 3 slices!! Also ordered a beef patty with cheese, a pepperoni roll & garlic knots—wow, their garlic knots melted in my mouth! It was deliciously buttery & garlicky 💛 i enjoyed every bite! i can’t wait to order from them again 💚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIa09DOFNnEAE",
            "text": "It’s unfortunate that I have to give this place one star because the pizza is actually the better of the two on this block but the customer service here is so awful. I’ve gone a few times, and each time, it’s the worst. Today was my final straw when I asked for a bag and the man threw it on the counter as if he couldn’t be bothered. I won’t be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcXNPUC1BRRAB",
            "text": "Neighborhood pizza shop. Good seating area.  No restrooms and the cashier is an older rude man.  The new owner is the friendly one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMWVMdVpBEAE",
            "text": "I ordered from this place on DoorDash, off of their menu. I ordered their pasta and salad combo and a drink. I chose their Caesar salad out of three options provided for the salad options. I got some random garden salad with no dressing. I didn’t receive my drink. When I called the store to inquire about this, I was questioned about what I ordered. I was told that all they saw was a salad option. Don’t you know your own menu? Why are you questioning the customer who just paid for an order that they’re telling you that you got wrong? Who do you think you are? I will never order from this disrespectful restaurant again. Get better customer service or go out of business fast. As a chef, whoever answered, the phone would be fired."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdWJxMDZRRRAB",
            "text": "Great service from the staffs, but\nDelivery wise salmon delivery are very rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLWZTOExBEAE",
            "text": "The pizza is mid at best but for the Fordham boys this is the afternoon hangout spot."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0b2FPWmNREAE",
            "text": "Excelente producto y muy rico"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbW9lS2xRRRAB",
            "text": "The pizza from the establishment is top notch! Cooked perfectly and exactly what we were looking for."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcnIyWUJREAE",
            "text": "Never a miss. Regular slice isa mzing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadnA3SjRBRRAB",
            "text": "Big slices but i don't feel the tomatoes sauce. Nice community pizzeria."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab3NLZTZBRRAB",
            "text": "I hate to post a bad review bc I love supporting local business & my child loves the pizza here BUT when I say the people that work here are HORRIBLE it is an understatement. As a local I’ve been here too many times & everytime i go in either the older man or the Hispanic man are there and they both have the most nastiest attitudes. It’s as if they’re doing you a favor despite the fact that you’re bringing in business. My child was trying to pay and the older guy told her wait with the most nastiest attitude (my child is 5) They don’t acknowledge you when you come in & when they do they seem annoyed. Idk if the treatment is different with the tourists that visit NYBG than it is with the locals but their attitudes are so disgusting that I’d unfortunately rather support a larger corporation like Pizza Hut then to bother entering in an establishment where the customer feels like a burden."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad0tTbkpBEAE",
            "text": "Pizza was very mid, although the size is great, the selection not great, and the building poorly run. Not a fan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN0llOFNBEAE",
            "text": "Horrible service. Had me waiting on the phone for over fifteen minutes when ordering two large pies while some Russian man and woman were chatting away in the background. Finally hung up. One of the most expensive places on Bedford yet the behavior of the workers is very rude when ordering over the phone and the pizza quality is hit or miss compared to the other pizza shop on the other side of Bedford near the 4 train. I'll be taking my phone and walk in money somewhere else. идиот"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMTd2Z2F3EAE",
            "text": "Decent to very good pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcUtfQVNnEAE",
            "text": "Extremely Disappointed with Food Quality and Unprofessional Behavior\n\nI recently visited this pizzeria and and ordered lasagna, unfortunately, my experience was far from satisfactory. The food I ordered was simply horrible - it tasted as if it had been microwaved, the pasta was overcooked and soggy, and the sauce was overpowering. Moreover, the quality of the meat was extremely poor. Needless to say, I did not enjoy my meal at all and left feeling very disappointed.\n\nWhat made matters worse was the unprofessional behavior of one of the employees, specifically the driver at the restaurant. Instead of addressing my concerns or offering a solution, he overstepped boundaries by criticizing me for not cleaning the food off the table. He even went as far as questioning my upbringing, asking if my parents forgot to teach me manners. This kind of treatment towards a dissatisfied customer is completely unacceptable and reflects poorly on the establishment.\n\nI want to emphasize that I would not have felt the need to leave a review if it weren't for the insulting behavior of the employee. As a customer, I believe it is important to be treated with respect and professionalism, especially when expressing dissatisfaction with the quality of the food.\n\nOverall, my experience here was extremely disappointing. The poor food quality combined with the unprofessional behavior of the employee left a lasting negative impression. I hope that the management takes this feedback seriously."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LTliRHVBRRAB",
            "text": "Good Pizzas at low price. After visiting NYBG it was welcome. A great place to eat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMTl1cU9BEAE",
            "text": "Best pizza on Bedford since I was. Kid"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbk5ESm5RRRAB",
            "text": "Visited Rocco’s looking for fast lunch while visiting the Botanical Garden. Some of the best cheese slices I’ve had in NYC."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobDhMMjFnRRAB",
            "text": "I love this pizza i always come here the staff is very welcoming nice and polite always making sure your statisfied with their service especially Mike…best pizzeria in the bronx hands down..crunchy great taste even the garlic knots is a must have"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNWR5RWt3RRAB",
            "text": "I ordered a pizza because my house is 3 minutes from the place.  It took two hours for the house to arrive and the pizza was bad and cold😵‍💫…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodUt2czBnRRAB",
            "text": "Pizza is ehhh… the worse part is their always late and always have some issue, last time I ordered the lasagna, they didn’t have it… today I ordered pizza and a soda took 2 hrs to come pizza was cold and soda was missing. Skip this place plus they do have attitude when you call to ask what happened."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOWVybUpnEAE",
            "text": "Pizza is good the old man that b answering the phone tho needs to retire he’s so rude clearly don’t like his job"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaEptLVVREAE",
            "text": "Food was okay. I only tried the pizza and it was very bland even though the slice was big and tasted decent. Barstool rating 6.7"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjZyZWtnRRAB",
            "text": "The true ny experience. Affordable and delicious pizza. It reminded me of my childhood. 10/10"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydE1qZ1NBEAE",
            "text": "The folks make a good pizza"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXd2RyQ053EAE",
            "text": "Good food, good service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdHRhb1dREAE",
            "text": "My boys loved the pizza 🍕…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtd3NlM29BRRAB",
            "text": "I have been too this place many times and they have never messed up never, Amazing customer service delicious pizza amazing you should go check it out"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtM0tLbGhRRRAB",
            "text": "Ok pizza. If you don't like saucy but cheesy this is an ok pizza for you. I like mine with more sauce, found it dry. I'm being generous with an extra star. Basic nothing special."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtX2JUTEZnEAE",
            "text": "My wife and brother in law order veggie slices earlier today and they were outstanding. I order two pepperoni slices and they were sooo dam good. It is was worth the trip from Florida to come back home to the bronx and eat Rocco's Pizza.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHd0xyRVZ3EAE",
            "text": "Old-style Italian pizza.\nCrispy, tasty, chewy crust.\nGood cheese / sauce coverage.\nWell Cooked cheese,  tasty, olive oil based sauce.\nThis is a really good slice of pizza.\nGiving it a 96."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHanMyck93EAE",
            "text": "There chicken, tomatoes and onion pizza the best."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2djdhcWtnRRAB",
            "text": "Amazing pizzas!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dWRHY3JRRRAB",
            "text": "Kinda old school but one of my favorite pizzas in the Bronx!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbnB2LVd3EAE",
            "text": "Delicious!!!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRM1l1Wmt3RRAB",
            "text": "맛있는 집"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvX3ZHTDJRRRAB",
            "text": "Their pizza is delicious! I order 1 mushroom slice [for myself], 1 plain slice [for my husband], and 1 plain slice to go [for my mom]. We devoured ours! 2 bites into mine and I immediately ordered another to go as well. Even after heating it up at home: it was still just as delicious and just as much flavorful! The crust was perfect: crispy, but not burnt. The sauce has a certain quality to it that keeps you coming back for more. Also, the staff was very friendly, and seemed to really enjoy what they do.\n\nI know this review sounds like I'm an employee, or a friend/relative of an employee, but I ASSURE you: I am not lol. I'm just a HUGE fan of their pizza 🍕.\n\nThat being said, I haven't tried anything else off their menu. However I wouldn't mind one day when I have a larger appetite as I will definitely be getting another mushroom slice! 😊"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBam9YUkpBEAE",
            "text": "I have ordered from them twice so far. Both times the guy was very nice over the phone and the pizza has been delicious every time. Tonight I ordered garlic knots too. I'd continue ordering there just based on the customer service  (a lot…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBc1lEaVpnEAE",
            "text": "No company is perfect but in the 10 years I have been coming here and the last 4 since Ricky the owner took over I have been very happy giving them my repeat business. Best consistent pizza and better than Arthur Ave and definitely better…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaXBTbG1RRRAB",
            "text": "Yummy! Thank You. And great customer service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJLTVEcWl3RRAB",
            "text": "Hands down, the pizza here is the best in the Bedford Park/Norwood area. The slices are big, pizza is cheesy, just yum! I ordered the buffalo chicken pizza multiple times and am never dissatisfied. The vegetable pizza does need a little work though as the vegetables had a bit of a frozen or perhaps soaked in water, taste. The Cesar salad is also not that good, kinda just thrown together. But once again they are good at pizza. I would have given the place 5 stars, had it not been for the rude/cocky attitude from the workers! Always looking upset. They should take advantage of their amazing location and upgrade the restaurant. Could easily be a more popular restaurant for people to actually sit and eat in if it was a little prettier. (take a hint from the new confectionaries bakery around the corner from you and the rulay lounge, and modernize!)"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnazlQMUpnEAE",
            "text": "I order from here all the time and the food is great. I would of gave them 4 to 5 stars if they would not made me a few times order extra because I didn't reach the minimum to deliver by a $1 or $2. I just hope they realized that their…"
        },
        {
            "date": "14년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBb2FfTEZBEAE",
            "text": "Cheap. Only one in the area. Pizzas are greasy and not that good. And Rocco is a douche, reserves his own table but never there. Have to deal with all the local high school kids that congregate here. Had to deal with this pizza for 4 years, I know what I'm talking about."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4dDR1dXl3RRAB",
            "text": "Grandma`s pizza taste great! Mozzarella sticks, nice as well! I am ?wondering? if the sauce on the pizza is homemade? at any rate the sauce is really amazing!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3Nk5UMjhBRRAB",
            "text": "I just moved to Bronx from the city and i cannot find a single decent pizzeria!! I mean seriously do I have to take a 45 minute train ride for a good pizza. I spent 17 dollars [ cheap for pizza ] for large sausage and once again the sauce is terrible and i dont know where or what the sausage comes from but i would not feed that meat? to my dog. Please somebody tell me where to get a good pie. I tried bedford pizza across the street and they were worse ,and tried Villa pizza on Villa avenue and honestly can say that was the worst pizza i ever ate in my life.I took one bite and threw threw the whole pie away. Disgusting....at the risk of sounding racist i must say after reading all these positve review for these pizza parlors that are undeserving of them,esp.the Florida woman who wished she had s pizza parlor like this at Florida . That these fake pizza parlors are the norm cause the latest statics say that 86%  of pizza parlors are owned and operated by middle eastern and Hispanic and every year it goes higher ...the point is that a.can of tomato sauce is not pizza sause no matter how much suger you add. This generation grew up eating and thinking that this is pizza cause thats all they were exposed to,so how would they know the difference between a pizza thats OK,or a really great tasting one if they never had one.( I bet there is not one real Italian restaurant in the Bronx) The majority if not all the positve reviewers probably never ate a real good pizza. And,no its not a matter of opinion . Good is good and bad to average is just that. Its got nothing to do with race except most races are not raised with the know how to make real Italian food. Like i would not buy Spanish food from a Chinese restaurant or Chinese food from a Spanish restaurant . So why would i expect good Italian food food from a eastern owner Even if he calls himself.sals,or roccos,or Sammy the bull.,"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNC1Xbkx3EAE",
            "text": "Never got my food. Resturant claimed they cancelled order with Slice app but when I called Slice they said they never received the cancellation request. Slice disputed and resturant agreed to deliver food. 5 mins later I get a text from…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cklydC13RRAB",
            "text": "One of our very few places where you could still get a single slice of well made, fresh pizza and this was long before the lockdown and it's still available to you check it out. Great prices great pizza wonderful service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzeW9ITlNBEAE",
            "text": "This place doesn't even deserve a star.\nI went here to eat with my daughter and I came here before, the guy taking order always has an attitude the place is always dirty. Today I asked the guy if he can wipe the tables down because every table was dirty and the guy tells me \"can u sit in another table I don't have time to clean\" like really it only takes u a second to wipe a table down smh mind u they just opened up so that means they didn't clean before closing. This place deserves a \"D\" not the \"A\" they have in the window.\nDON'T COME TO EAT IN THIS PLACE THEY ARE SO DIRTY AND RUDE THEY NEED TO CLOSE THIS PLACE DOWN!!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROVlLVlB3EAE",
            "text": "Pizza was basic. We ordered online. It took a while then we called. They said they were off line and said have a good day. Contacted seamless 20 mins later they showed up"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLdEp5OUVBEAE",
            "text": "I ordered about 3 times but the third time the delivery guy refused to bring my order up to my apt , I am handicapped and cannot walk up and down the stairs as I like I asked, you're not bringing it up he said no,  I said okay and told him…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOU9HbGRBEAE",
            "text": "Perfect place to grab a true NY slice. Pizza slices are a little thick, but not too doughy, and extra large. (Buff-chick pizza was great)"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMGVEd0xnEAE",
            "text": "This Pizza Place is Rock Solid!  Everything they make is Arthur Avenue Quality.\nPizza is always fresh and these boys stay ahead of the trend on specialty Pizzas.\n\nLove It!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaHJ6dDZBRRAB",
            "text": "First pizza i had in NY and it wqs bangin! My dude that delivered to me in my 18 wheeler on the side of the road in his little scooter, props to you! My dude creepin through cars and zoomin through side walks to deliver pizza!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdnZUS1lREAE",
            "text": "Hello 👋🏻 I just have to say  the food is good when you dine in ...if you want to buy from this pizza shop do your self a favor and walk in do not call and order please don’t you will be waiting for moreee then 1hour ,when they tell you 30…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4bTViaXFBRRAB",
            "text": "I just ordered a large pizza extra cheese and a chicken parm with zitti.  The chicken was juicy and well seasoned the zitti was cooked properly had an amazing time eating . Thank you Rocco."
        }
    ],
    "reviews_count": 70
}