{
    "name": "Estrellita Poblana",
    "place_id": "ChIJc1TvGsvzwokR6H57xI-VdHM",
    "grid": "BX7",
    "address": "374 E 204th St, Bronx, NY 10467, USA",
    "rating": 4.2,
    "user_ratings_total": 144,
    "phone_number": "(718) 684-8801",
    "reviews": [
        {
            "date": "2주 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSVlVRnlPV0V3VEhCSU1FRTJaRWt3V21odFpsRRAB",
            "text": "La verdad el local está más o menos pero el servicio y la comida diría que les falta por aprender entiendo que el platillo tiene que tener un precio más o menos pero yo pedí uno de barbacoa y hubo más hueso que otra cosa para acabar también pedí una sopa de marisco que me trajeron con el cilantro podrido y los limones cortados hacia días atrás . Mi señora ordenó uno churrasco donde yo tengo entendido una carne lo sazonas con sal y pimienta y está venía llena de grasa de la carne enchilado lo la del chorizo que sirven ahí , la mesera me dijo creo que son los condimentos ….. bueno creo que ya no regreso a este lugar ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNlJrSlNYM040YVVSTE5HcE9kM0ZVZGtwNlRuYxAB",
            "text": "I had a shrimp burrito, and it was delicious,full of flavor and cooked to protection. The thing I like the most it was served in an original Mexican style not cut in half."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaGJ6ZzBWbU5mYzJSMGIyTTBUbTlaU1doM1kxRRAB",
            "text": "Unfortunately the quality of the food has dropped over the years. From not using proper ingredients to certain dishes not being prepared properly. It is unfortunate."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGV1dEUjNRVkZWVmtwTldrOXFkVXhCYTFKb1JGRRAB",
            "text": "Tasty tacos n more"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMWRFMDBSWEpoYWpJMmRUaGFkVTlzVlRWRWMyYxAB",
            "text": "Best Nachos ever !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNU0wNUhNVWN6TkdOVmFuTlZNRmR0VXpGRFpVRRAB",
            "text": "Love the food here it's always fresh hot and filling good portions and friendly staff"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Mk0zRnZTMGRTWlRoclZteHNRMFJRY0ZWS1QzYxAB",
            "text": "I go here almost weekly . I really enjoy there empanadas and rice . They make a good oina colada as well. Always nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaFYzRllTVzV6YWxBNWRFUlBWa1l5UVY5WFVIYxAB",
            "text": "The food was good, the establishment clean, staff friendly, prices reasonable... The loud music at a restaurant that forces its customers to yell at each other is always a bit annoying.\n\n* not pictured but the best dish was chicken, shrimp and mushrooms in a Chipotle sauce and I would return to order that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPaXh2b1NWN1lDZlVREAE",
            "text": "After spending the afternoon at the Botanical Garden, my wife and I decided to take a walk into Norwood to try the closest restaurant we could find that had a decent Yelp rating. We were not disappointed. Estrellita Poblana was cheery, delightful, and authentic, and has an impressive menu for a cozy neighborhood spot. The guacamole was delicious, as were the selection of tacos we tried, and the cocktails absolutely hit the spot, and everything was priced far more reasonably than what you'd expect to pay in other parts of the city. We'll definitely be back, and I'd recommend this place to anyone willing to venture 10 minutes up the road from the Metro North station."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNekJodGZXd1pubTFBRRAB",
            "text": "Llame para pedir una orden de Dos quesadillas de carnita el día 10/05/2025 a las 9:32 y la chica que me estaba tomando la orden me puso en espero 5 veces y cada vez que volvía a hablar conmigo me preguntaba la orden y me dijo ¡que me diera…"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeTlHMmdBRRAB",
            "text": "i always come here and i order alot. Today i came in and i ordered food, i bought my own pepsi zero because they didn't have and i cant have sugar and they told me i cant have my own drink even if I'm ordering a-lot of food. I found it so strange, I always order here and it’s not like im bringing outside food.\n\nIm big on customer service and they lost me with this. They didn't consider if I cant have sugar or have health issues, they didn't even care. Then before I left my daughter noticed another table in which a man had a sprite from outside right on the table and they said nothing to him at all. Anyway, I ate quickly and left, It was really akward."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvczY2SDdnRRAB",
            "text": "We had a wonderful experience here!!! The guacamole was so fresh and perfectly flavorful. Our dishes were also amazing: huarache, tacos and plantains. The space was so clean and service was amazing. Will definitely be back!!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJczVqRzRRRRAB",
            "text": "Be aware of the BS they are doing on your CC after they told you the total amount, they will edit it after 22hours without letting you know. I won't purchase here anymore. Keep your greedy attitude towards the customer for asking to include the sauce that comes with their food.😆 what a joke! As if their the only restaurant that serves tacos and nachos.\n\nDuh! I ORDER VIA GRUBHUB HOW SHOULD I PAY IN CASH? WHAT A JERK ANSWER AND YES, I WILL GO SOMEWHERE ELSE. 😆"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajhhR2VnEAE",
            "text": "Completamente satisfecho la Atención fue de 5 estrellas la señorita Adriana con tremenda recomendación el churrasco muy rico y el Chef don silvestre mis felicitaciones y A Angel también  felicidades la fajita deliciosa definitivamente volveré la sonrisa de mi esposa de a ver comido tan deliciosos platas gracias gracias"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OXRta2tBRRAB",
            "text": "La Comida muy Sabrosa 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMG9fR09REAE",
            "text": "Been to this place quite a few times and they never disappoint. Food quality and quantity are both good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbzRqMGVREAE",
            "text": "I asked for a tiny bit of onions and peppers in my quesadilla and they refused. I had to pay $3 extra for that which it’s insane. Never again will I eat here. The food is not even all that. SMH"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaDhpamZREAE",
            "text": "Buena"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdU5uNXZRRRAB",
            "text": "Spoke to Anibal yesterday who confirmed they forgot to send my drink when I ordered via Uber. Uber did not want to refund me and they could have called Uber to help me get my refund. Both Uber and this restaurant are absolutely trash service providers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZzVqWGJREAE",
            "text": "Delicious and variety food, always like to have craving for there food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMGREVmpRRRAB",
            "text": "Cozy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdnY2ZGxnRRAB",
            "text": "Is ok"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NVlTX3lnRRAB",
            "text": "Taco Tuesday...great guac and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OXRiSlVnEAE",
            "text": "The food is great the service is welcoming, would definitely come again, especially for that tiramisu 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeWRpX2hBRRAB",
            "text": "Yummy food chimichanga was so good and the pastelitos game changer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqa09tN3J3RRAB",
            "text": "The food and the service were excellent, wish I had found this place sooner."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5c2MyM2tBRRAB",
            "text": "La comida muy rica pero la atención pésima, el muchacho que atendió nos botaba los sorbetes de las bebidas y muy grocero solo por pedir un poco más de azúcar alas bebidas."
        },
        {
            "date": "1년 전",
            "language": "om",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNka19hSkZBEAE",
            "text": "Best Birria Tacos!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdFpHNUlREAE",
            "text": "Ordered Uber eats, delicious food, fast service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcmQ2OVRBEAE",
            "text": "Best stiffed salmon with veggies I have ever had"
        },
        {
            "date": "1년 전",
            "language": "om",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWZ3VLNzZnRRAB",
            "text": "Best BIRRIA TACOS"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdEtUWHB3RRAB",
            "text": "¡Que sabroso cocinan! Las fajitas de steak, Guacamole, Cemitas...... No puedes olvidar el sabor.  El servicio muy bueno."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNEluV1NREAE",
            "text": "Great food!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGa2RTVzl3RRAB",
            "text": "Muy. Caro un lunch para una persona arroz habichuela y chivo $27.75 muy caroooooo"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeXNDWmJ3EAE",
            "text": "One of my favorite mexican restaurants :)\n\nTheir food is consistently good + their prices are really good 👍🏻\n\nEven if my favorite dish is the flautas everything else I have tried at their place has been as good (tamales, burritos, nachos, the chicken empanadas 🙀, the tostadas!)\n\nThe service is usually pretty fast and the atmosphere is alright\n\nWill definitely continue going back and recommending them to others :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadDRtUU1nEAE",
            "text": "Mexican restaurant is a great place to try some authentic Mexican cuisine. The food is always fresh and flavorful, and the atmosphere is lively and fun. Service is usually very good, and prices are reasonable. Would definitely recommend this place to anyone looking for a tasty meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaXRtaWlnRRAB",
            "text": "I am a huge fan of this local chain, but this one is not my favorite. No chips and salsa, waitresses were not as friendly as other location and sparcely decorated. I likely won't be back."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdFAybDZ3RRAB",
            "text": "El servicio de este lugar es horrible , pedí una margarita y no sabía absolutamente a nada! , parecía agua con color, y para colmo cuando cortésmente le doy la queja a la camarera simplemente me dijo que la margarita estaba bien así y se fue sin por lo menos hacer el intento de arreglarla ó reemplazarla por algo más. Se la dejé en la mesa , la pagué y me fui.  Jamás volvería a este lugar!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeVozS2dnRRAB",
            "text": "Pedi 2 ordenes de quesadillas de tortillas de maiz y que no estuviera pasadas por aceite lo que me dijeron que no y cuando recivi la comida eso estaba lleno de aceite.                              No pierdan su dinero encargando comida de este lugar pesima calidad y precio muy alto y pesimo servicio."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNHYtSTdnRRAB",
            "text": "Great place if you don’t mind a forgetful, judgy waitress who after taking your order brings you half your food and avoids eye contact afterwards also ignores you when you repeatedly and respectfully try to get her attention. Not to mention the several little flies roaming around your food trying to have a meal as well. The waitress was super fast at retrieving the payment from me though so I’ll give her that. The sad part is that the food is actually really freaking good here. I suggest maybe ordering take out instead. Never again for me."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHN1B2WkpBEAE",
            "text": "Service, food and atmosphere are always perfect."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dTRfSTVnRRAB",
            "text": "Portion was small food was ok but not worth the price wouldn't recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHRYSEJREAE",
            "text": "Please try the burrito mojado. A1 !!!!! Fast delivery and good service. Very consistent with their food which is important"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eFBidXBRRRAB",
            "text": "The service is the worst I ordered a frozen margarita and the margarita tasted like water I asked the waitress to please add some lemon alcohol or something and she said no because the margarita was supposed to be good so I asked for the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSN3YzRFZREAE",
            "text": "Food was flavorful. The tacos are filling. The prices are reasonable"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoX1BlVmhBRRAB",
            "text": "Muy rica la comida y el servicio espectacular ,lo recomiendo ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodGM2SktnEAE",
            "text": "Place was nice, food was good. Drink was ok. I had a passionfruit Margarita and the taco salad. Staff needs to speak English. It was difficult to understand my waitress."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodGVUeHZ3RRAB",
            "text": "Excelente comida mexicana.  Buena atencion.\nVariedad de comidas y bebidas. Música..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNFpUN3NnRRAB",
            "text": "The food is truly amazing, we have ordered and today was the first time going in person but the drinks suck. I asked if the margarita had any alcohol and she said yes. Didn’t even taste like a passion fruit margarita. The server didn’t ask if we wanted a replacement, or if we wanted anything else. Will continue ordering instead of going in person. Horrible"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMkl1ZFp3EAE",
            "text": "Great food, great service!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtc3JpNXJRRRAB",
            "text": "🥳 Clean, organized, quality customer service, and I have to mention that the food is absolutely delicious 🤤😍😍😍🤤🙏🏼. The food is sooooo great here.. honestly you can’t go wrong with the food of this restaurant.\n\nWhat I would recommend is the Oxtail, Chicharrón, or Steak with White rice 🍚 Red Beans and Maduros. 😩😍 The códito is really good too. Btw the pernil is on point too. Even their lattes are good 😍🤤🤤🤤🤤🤤"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOC1tejFRRRAB",
            "text": "Ordered on grub hub. Paid $4 for 4oz of Guacamole and received a small portion. I put it on my kitchen scale and it was not even 3oz. I figured it must be a mistake so I called the restaurant. They said it’s 4oz and that the kitchen fills the containers to the top. The container doesn’t even hold 4oz. There’s 4tbsp at most. Picture is terrible but you can see the scale says 2.952 oz… even with the container adding weight. A scam."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdjVLQXpnRRAB",
            "text": "Started coming to this place when it first opened.  The quality of the food  I ordered (Tacos with Beef or Shrimp) was and remains superb.  They also offer good drinks like an Ochata.\n\nHowever, in recent days, prices have substantially increased.  A taco combo (three tacos) once $9.75 with fillings has now increased to almost $12.  The raising of less than fair prices makes it harder to recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eWJiYzF3RRAB",
            "text": "For transparency,  I've gone to another location on Westchester Avenue, prior to this. I had such a great food experience there, I was ECSTATIC when I realized there was a location so close to me. Needless to say, I've eaten at THIS…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMHZpdl9RRRAB",
            "text": "Los tamales son una burla de pequeno. Parecen cortados a la mitad y cuestan casi 4 dolares"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc3NHNjJRRRAB",
            "text": "Disappointed. Ordered on Uber eats and they called requesting I pay more. Stated Uber’s charge was not enough (Uber charges $3 for shrimp, they stated they usually charge $2.50 per shrimp). Refused to make order but wouldn’t cancel it. They even gave driver a hard time and told him they would take an extra 20min, trying to get him to cancel it. Had to go to Uber support to get it resolved. Not sure if it’s just with delivery but very rude on phone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dG9UaDRRRRAB",
            "text": "All I can say right now is this is the ONLY restaurant in the area that makes birria tacos. So good. Nice atmosphere for family get togethers. Can be empty one minute and packed the next. Food comes out pretty quick considering all the deliveries they do."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ2UybWJ3EAE",
            "text": "Es un buen lugar,  te atienden muy bien son muy amables"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcmNPX29nRRAB",
            "text": "It's hard to put into words how good this food is.  Es como ambrosia-comida de los dios!!  Enchiladas verdes son piquantes y los churros tienen una sabor especialmente.  The flavors were all so balanced, and nothing was overbearing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeWFyb1pBEAE",
            "text": "I've order 3×a\nAlready and evertime the food has been great,the steak it's salty like its been sitting in season for days,best tacos so far!!I like my cali tacos but these are good 👍🏼…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLX19QeEJREAE",
            "text": "I am from South Texas, I’ve been in NYC about 5 years. What I miss most, aside from family, is Mexican food and BBQ. I grew up eating Mexican food almost daily. I’ve found a few Mexican places that were ok but this place beats them all and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbElTWGt3RRAB",
            "text": "Amazing Customer Service!!\nThey were super nice and friendly.  I had flutas and opted out of the rice and beans. The manager came back and asked if I wanted anything else he gave me a number of suggestions! I ended up with a salad which was perfect! Gracias"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNE5XbVZBEAE",
            "text": "Loved all of it! Delicious strawberry banana milkshakes, sopes, and guac. The elote was a little sour for me, but not bad. Would definitely go again 😄…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHanFEcFd3EAE",
            "text": "My favorite local restaurant. It’s a must have and their service is superb. Try their hard shell chicken tacos and juevos rancheros. Enjoy!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcU9qRnJnRRAB",
            "text": "Incómodo supuestamente es restorante mexicano, pero pura música dominicana se escuchaba ,la comida en general insípida sin sabor y tardan que da sueño!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOHUybU53EAE",
            "text": "Was a really nice place, my husband and I had a great time and the Food was delicious"
        }
    ],
    "reviews_count": 66
}