{
    "name": "Tasty Caribbean Plus Buffet",
    "place_id": "ChIJ96Batw3zwokRTvSgjomHbg4",
    "grid": "BX7",
    "address": "131 E Gun Hill Rd, Bronx, NY 10467, USA",
    "rating": 4.3,
    "user_ratings_total": 238,
    "phone_number": "(718) 708-7979",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gb1kzZElaMU5YYnpoVlRGQktOMnBvUWtGMU4zYxAB",
            "text": "This is not the typical buffet. They charge you by the pound. So, technically, it's so unconvenient."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MVdrdEdWVFZtVWpseGRIUldPVTlZVkRSek9XYxAB",
            "text": "delicious shrimp alfredo pasta and so many healthy options in terms of veggies, I love this gem in the Bronx! Also very clean and high standards within the store"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMU5ETlRYemhUYTE5NVpEWnVUM0ZmVVcxSGQxRRAB",
            "text": "My go to for years. Cool staff and welcoming. Makes sure ppl are clean when handling the food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdUQtSVhOa2N5ZjZRRRAB",
            "text": "Went for lunch before and it was great. Went back for breakfast today and the ackee and salt fish and fry dumplin tun up!! It’s a must if you’re in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVHZsTDZGaU91OXB3RRAB",
            "text": "For me the best Halal and Kosher food in New York"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cnNtcVZREAE",
            "text": "Horrible"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReG8taFVBEAE",
            "text": "My sister, aunt and I visited this restaurant on a visit to the nearby hospital. Every dish we selected was incredibly delicious. Nothing was over or under seasoned—just perfect. The restaurant was extremely clean and the employees were pleasant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROHAyZzdRRRAB",
            "text": "they over priced all the food, very rude owner, not recommended"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbHFudkhnEAE",
            "text": "Bang for your buck, buffet style. Could of been a little warmer but the food was a yes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOGRQWXR3RRAB",
            "text": "For me it’s the best Buffet ever\nFood quality and cleanliness. I love it and I recommend it"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cW9QNFBREAE",
            "text": "Mom had surgery in the morning. So I checked out this place for breakfast. A very great choice on my part. You won't be disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dVBxZXJBRRAB",
            "text": "Delicious fooood!! They have a wide variety of islad food. I love their oxtail and salmon. Pleasant staff and tables available for dine in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYa3BIVERREAE",
            "text": "I don’t recommend I got a small piece of salmon with two scoops of rice and 1 soda and paid 19.11 and the food was basic nothing special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNk9HQllREAE",
            "text": "The food is spectacular, I was looking for a spot I can plate my own food, and here it goes, I got a scoop Mac and cheese, vegetable medley, oxtails, curry goat, sweet potatoes , plantains, and threw fried shrimps 🍤 which are 1$/piece. And it came out to 19.50. when I tell u I tore that whole platter up! Lol everything was on point! Will definitely go back. Srry for no pic I ate it up. 😁"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud1lEM213RRAB",
            "text": "I loved the food ! I will be back again. I appreciate the extra caution of cleanliness because everyone is required to wear gloves while serving their own food !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdE1ta21BRRAB",
            "text": "If you are in the Williamsbridge area, this is a good spot for a delicious bite. I tried the salmon, and I  couldn't get enough. I had to go back.  The oxtails, goat, jerk chicken, veg rice are all good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMWFhOHRRRRAB",
            "text": "Food is delicious 😋 and staff very friendly and welcoming 🙏"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NE1LYTZnRRAB",
            "text": "It was ok today"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcW9UNjNBRRAB",
            "text": "A little pricey, but compared to other options in jamaican cuisine well worth it."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMU16YU5BEAE",
            "text": "El precio de la comida es muy carro, pesan tu comida para darte el precio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcU12VHlRRRAB",
            "text": "I'm hooked on the oxtails and Mac and cheese 😍👌🏽💯\nAnd it's worth the price...I'm content with you guys ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5emVtN1VnEAE",
            "text": "ATTENTION: VERY Very expensive food. You can get similar food for half price. The food is ok, but $45 for a SMALL plate of chiness rice, a little veggetable, and a small meat of chicken. Never ever I WILL comeback again to this place. Pirate of the Caribbean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMjh5VVJBEAE",
            "text": "I love this location. Only went once but plan on going again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0c2JfUXVnRRAB",
            "text": "Absolutely delicious; a week since going here and I’m still thinking about it. It functions as a pay per weight buffet.\n\nMy recommendations are any of the chicken dishes, the flat steak in cream sauce (dry, jerky like texture but so tasty combined with the sauce it comes in), mashed potatoes, Mac and cheese, rice and beans, coleslaw, and top it off with half an avocado. Every bite was memorable. I paid around $28 but I got enough food for lunch and then later dinner as well. So $14 per meal I consider a good deal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMjR6d0hREAE",
            "text": "Everything is good I love the taste of everything I ate"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadHJTTElREAE",
            "text": "I just went to get some food and it's delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNTg2V0hREAE",
            "text": "I love their foods because it's soo good and it's a good price and it's good for lunch or dinner and it's cool cause you get to have whatever you want cause it's a buffet and their Dominican food is amazing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadzd6Wm9nRRAB",
            "text": "The food was good. The pricing didn't make sense in terms of weight and quantity. The food attached here was $24. My second order was similar to this, plus 2 bottles of water and two juices, and I only paid $28 for that order."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdzVhQ3B3RRAB",
            "text": "My spot on the go...food is always good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcTZEMXlnRRAB",
            "text": "Food is well flavored and lot of variety.\nIt is a nice clean atmosphere and I was pleasantly surprised at to how flavored the food was.  I give them a 10 start above and beyond."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bU5MOXBBRRAB",
            "text": "The chicken foot soup is to die for, cheaper than golden crust which is next door. The food is really good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaE5lRzN3RRAB",
            "text": "The food was delicious. Best Curry goat I've ever had. Plenty of menu items to choose from. Ate there several times in the same week."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNEpMbDNBRRAB",
            "text": "Excelente sus comidas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbUpmUVZREAE",
            "text": "Very compact. Don't go on the nurses ND doctors lunch time. It was horribly crambed. Now let's get to the food. Not to much salt which is a good thing if your a diabetic or have high blood pressure. And assortment of fruits and vegetables. Also the Carrot juice was good. The oxtail could have been cooked a little more but. Over all it was good."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaDVLcHd3RRAB",
            "text": "the price of the food is too exaggerated, I do not recommend this place to anyone, I could also notice that the young man who charges charges you depending on how you like it, I could see, different prices, that he charges a ridiculous price of $5 dollars, in my case I I charge for less than a pound, each plate  for two plates $36 dollars not including drinks, please be aware they  don't take you by surprise"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobko3UUh3EAE",
            "text": "This place was very clean and the people were very friendly and helpful.  I was recommended it to others."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMWNUT013EAE",
            "text": "I went there after reading the reviews knowing they were going to overcharge me, and still had the nerve to get upset when I got overcharged🤭…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCXzZmR2lnRRAB",
            "text": "Awesome food and the customer service is great"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMXFUc1dBEAE",
            "text": "Food is delicious , I Love the shrimp and salmon. Just don't go to the register with the old man...he will always over charge you for the same amount of food you get and the prices are always WAY OFF. Super expensive if he checks you out. I work across the street and I stopped going....a few of my co-workers did too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaGFHVHl3RRAB",
            "text": "They overcharge like crazy. They even charge you to sit in and eat.. Read a review and they talked about the old man at the register. HE GOT ME THAT THIEF!! WENT WITH MY WIFE 2 SMALL PLATES AND 2 SODAS $32. I didn't want to argue for my wife's sanity but WAY OVER PRICED!! WE NOT IN MIDTOWN OR DOWNTOWN FOR THE PRICE!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1d0kzTzFnRRAB",
            "text": "Mr. Bill food is delicious. I heard about him from a RN that worked across the street at Montefiore Hospital. She said every dish and soup that he cooks is, the best. Whenever I am in the area, I'll make sure to stop in. Jah Bless Him🙏🏾 💚💛❤🇯🇲…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcnI2MEpnEAE",
            "text": "They Selling food but the food was good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbnRyOS1RRRAB",
            "text": "Holy this is billys ..man I use to love his breakfast liver with dumplings and green banana ..those guys are the best  in the area I'm just happy to see them still there after fifteen yrs ..the whole Monti staff loves this place.."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcnAyenNBRRAB",
            "text": "They fell off again :("
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNnV6aFVREAE",
            "text": "Food is delicious"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtX0pHeHFnRRAB",
            "text": "This was my favorite go to spot and as of today 12/21/2021 they have lost me and a few of my coworkers. Beware of the older man at the register he is constantly over charging the customers. He always has a different convenience fee and when you ask him what is it for he has no answer. If you buy a small amount of food that consist of 2 items you have to constantly say to him not to over charge you and you also have to remind him that it is a small plate with only 2 items that do not consist of oxtails or shrimp. This man is a thief and we are all gonna make a complaint to consumer affairs. When the middle aged guy is there he does not charge these constant ridiculous  prices. They have lost so many of us behind him being a CROOK as of today for this old man being a thief and price gauging."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NnBxNk1nEAE",
            "text": "Very delicious and tasty take out spot. Favorite order is the Oxtail! Best part is, you order by the pound!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdVBlWEtREAE",
            "text": "The food was very tasty! Place is clean.. U can not sit and din! Workers are nice.. they take cash and debt.. if you want what you're looking for come early they're close by hospitals so you know how that is.. the food they weight by pounds"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dDhLTFN3EAE",
            "text": "Best buffet I have ever been to. The place is very clean and the food taste good."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJd3RUZ1NnEAE",
            "text": "Great food. I love the spicy veggies\n\nEdit:  the cashier charged me $8/lb instead of $6/lb because of the 3 pieces of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOTd1d3hnRRAB",
            "text": "Good Food, everything taste good, no problems as yet. I am new to the area and this place was recommended to me and so far it has been delightful, the owner is very wonderful. Might be a small space but he gives excellent Courteous business"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxXzhQdG1nRRAB",
            "text": "They served us oxtail for take out which was more sauce to then oxtails.  So paying for water by the lbs. Add to that they deliberately add so much salt that you can not eat it.  Of course, we did not know until home serving it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N1pHZElREAE",
            "text": "Expensive. But the food is good. The only place near me that has Caribbean food in the Bronx. That is strange. For a buffet it can be complicated. Ive spent 30 dollars twice and I don't spend that much at a regular carribbean restaurant. Makes me want to go back to Harlem, Brooklyn or even Queens to get the food I can afford"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrLTRMbTF3RRAB",
            "text": "This place used to be Billy's.  I think ownership is the same but is now a per pound buffet. Buffets like that aren't my favorite. I hate when my food is picked over by everyone but buffet are was kept clean and staff walked arpund…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3N3RMR1VnEAE",
            "text": "Food is good but they are dumb. In the store they'll tell you they deliver but then when you call to make an order they tell you they don't deliver. And all of their flyers say \"Free Delivery\" on it. I don't know if they trying to build clientele but they don't need to. Like you're food is good bruh."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbzlYWWdRRRAB",
            "text": "The Establishment had New Owners, they're From the Neighborhood, long time Servicing and Paying attention to what the People Want, Fresh, Healthy Clean, Tasty, Good Quick Stop, the Best to the Place, The Word is Getting Around. Check it out. Mr Fred"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhN3R1MXFBRRAB",
            "text": "The place is small, but the food is fresh, delicious and affordable. Ask me what my favorite is, and I'll anxiously tell you, everything....as a matter of fact, I'm headed there today...ummm😋…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdExyaDlnRRAB",
            "text": "Food is so delicious. I like the wide variety of foods. The staff is exceptionally great."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZdmFIbnpnRRAB",
            "text": "The best price in the bronx for top quality food , not forgetting to mention how delicious their home cooking is ; it's 2 thumbs up,  and 5 stars from me."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Njl2N2hBRRAB",
            "text": "Their breakfast food is the besttttt. I love the fact that it's buffet style. Been going here for years. Would recommend."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBd2I2Qkp3EAE",
            "text": "The food is great the atmosphere is nice could be a little bit more spacious they should extract to expand and get some seating areas but overall the Ambiance is good"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4eHJPcWt3RRAB",
            "text": "Great selection of Caribbean foods. Food is delicious, consistently being replenished. Will continue to fulfill my cravings for Caribbean food there."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTaTVEMmpBRRAB",
            "text": "This is a great place to go to the people from the hospital are always in there the food is great the price is great you pay by the weight. So if you can eat then you could die"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdDVudDdnRRAB",
            "text": "We left our house and took a bus and a train just to get to this spot. I think that's says enough. The food was good."
        }
    ],
    "reviews_count": 64
}