{
    "name": "Tasty Picks",
    "place_id": "ChIJ43sxsA3zwokRHYNyrGp3uuk",
    "grid": "BX7",
    "address": "89 E Gun Hill Rd, Bronx, NY 10467, USA",
    "rating": 4.1,
    "user_ratings_total": 476,
    "phone_number": "(718) 231-2230",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUFNGOUlPREpQWldsWWRGOTRaMjlSTjFwdFFVRRAB",
            "text": "Oh my God this place is horrendous. They can't read simple instructions on tickets like \"no sauce\" or \"no x ingredient\" this place Massively overcharges too. There's no reason why I should be paying $60 for 2 bacon egg and cheese and an order of fries. Sanitary and safety issues are constantly present such as not cleaning utensils or cross contamination. Every time I come or order it's a new headache and it's a horrible experience. I feel like I'm overpaying to get angry. Do NOT order food from here"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa2VqaDFTRjlCVjJKSWVIbE1lVGRtZEdsd1ZsRRAB",
            "text": "I came here to buy a salad that cost $9. They offer a 15% discount for hospital employees, which is nice but then they add tax afterward. They also have different prices for credit card and cash payments. I paid in cash and already did the math myself.\n\nThe man at the counter tried to shortchange me by $1.75, which is completely unacceptable. Who knows how many other customers this has happened to? As a business, you should never be lying to or cheating your customers. When I pointed it out, he even asked how I figured it out as if I couldn’t do basic math. I told him I used a calculator, and once he rechecked, he realized I was right.\n\nHe didn’t apologize just laughed it off. Terrible service and a very shady experience. I won’t be coming back. I will definitely be telling all my friends and family that Goes there"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS1JFdHNibmxaUWpKYUxXb3pRMlozV0RsaGRYYxAB",
            "text": "Crazy reckless driver. Please reconsider the person operating the company van."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdjVqMGNnEAE",
            "text": "This place has great food and great smoothies. Open 24 HRS I always come here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM1ZqVlFTRkZrYlhKSVgwdEJZV0pWZW1obExXYxAB",
            "text": "Food isnt bad but they chargin 10 dollars for fries on uber eats"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cExVdDVSbEpxTFRSaVZWSlNWVmN3WDB0UmVrRRAB",
            "text": "They not cleaning the knives after curing different food items. Be careful if you have allergies to some food. I found avocados and lettuce on my bagel and cream cheese. I have pictures!  Last time I found piece of plastic in my smoothie and boy! Change those gloves to touch food after  handling money😝🧐 😩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eVRuUXRiV3hNUjI5dFUwdHBNRFExT0U5MGNuYxAB",
            "text": "My food is always made with fresh ingredients. Friendly service, when delivered the driver's are 5 stars they are very good. I recommend them. All they do is good food and enjoy your eating from a clean and well made food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSGFFdE1RbXBtWDFwQk9VczRTMmhDZEc5dE1tYxAB",
            "text": "I got sick immediately after eating, so something’s clearly off with how the food is handled. The staff were yelling and cursing at each other, and the cashier took it out on me just for asking why the price was higher than what was posted. He was disrespectful, slammed my food, and threw the receipt in the bag. Definitely won’t be coming back, ever."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWVRXeFJMVkprTld4T2FtTllNVU5hU25aR2JIYxAB",
            "text": "The best place and food too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUGJIbDBVME0wVlhWUFRWWllWR1JuV1hOT1lsRRAB",
            "text": "Never been just ordered food my daughter highly recommend this establishment.  I have a concern but reached out and waiting for a response. But I've tasted tasty picks (lil pun lol) foods and I like it. Small issue aside i handled it on my end. ENJOY SUPPORTING"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVZ5MHpSR1pEYVRWRFVFczFjM2hCVjA1T1lsRRAB",
            "text": "Acai bowl was great"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJYl93NTNsdzhINXVBRRAB",
            "text": "Don't let them fool you! It's a bodega!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdzVyT09REAE",
            "text": "Love this place good prices and wide variety of choices"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJamJfT1hmaUxXTXFRRRAB",
            "text": "Food was ok manageable"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNaVkwS0QwcWRTOGV3EAE",
            "text": "I had a very disappointing experience at this grocery store. The staff are extremely rude, unprofessional, and seem poorly trained. They don’t know how to treat customers or delivery personnel with basic respect. Communication is terrible, and their behavior is downright hostile. On top of that, the store lacks hygiene and cleanliness. If I could give zero stars, I would. Avoid this place—it's run by people who clearly don’t care about customer service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3N3FqbnZnRRAB",
            "text": "The smoothie was really good."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdGFfUHdRRRAB",
            "text": "Un lugar donde los encuentra todos desde un café un sandwich una comida y una gran variedad de jugos y batidos fresco😊😊🥙🍔☕️🧋"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnZ2RELUhREAE",
            "text": "La persona que está en caja es muy mal educado no me gustó su servicio."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOFl1aU9REAE",
            "text": "The best sandwich and smoothies in the area\n\nTry it once and you won't stop."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNUszNmt3RRAB",
            "text": "I didn't realize it was a multi-style store until I saw the Blimpie sign. also no pork. But it was excellent."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b0pXSmxBRRAB",
            "text": "Oh man, I'm in my late 50s, and I grew up on Blimpies!!! When I googled it and saw it was close oh my!!! I go atleast every two weeks if I'm not on a cruise. I always get a number 1 and a blimpies best. It lasts for almost the whole week."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NHRla25RRRAB",
            "text": "Told the cook I’m allergic to eggs don’t cook my bacon near eggs and as u can see it’s egg on my bacon\nI called the store back there swearing up and down there’s no egg on my bacon…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNnJuSG5nRRAB",
            "text": "So I would give this place 5 stars but the prices are quite expensive.  The food isn't bad, depending on what you get.  Do not get fruit from them.  I was so sick after getting fruit from them and had to miss work.  Thats just my experience."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbnF1UXp3RRAB",
            "text": "the lemon chicken was good and acai were alright and best acai bowl i recomend best prices in bronx"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNy12NlRBEAE",
            "text": "Muy buenos y frescos siempde voy x los acay y nunca desepcionan son uno de los mejores del area"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbE11azRBRRAB",
            "text": "Ordered a vegan chicken club. The guy hands me a hero instead. I’m in a rush for work so I assume they misheard me and gave me a hero. But to make sure, I say, this is the vegan chicken sandwich? He says yes. I go to work. I get there and the guy gave me the completely wrong sandwich. It was a chicken wrap on a hero with cheese. I call the store to explain and just want to know what’s on the sandwich to see if it’s safe for me to eat (diet restrictions) and the guy is telling me not to worry and just to come in and return the sandwich for the other one. I tell him I’m at work and can’t, and that I’ll keep the sandwich, if he could just tell me what was ordered. He proceeds to not understand me. So not only is the customer service bad, but good luck getting a complaint because their English is not good to understand what you’re saying. Ended up spending $20 for no reason. Last time I go here. The place only gets business because it’s the only “healthy” option around the Bronx in that area."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcjVxSVBREAE",
            "text": "I have a love hate thing for this establishment. The pros are it's conveniently placed close to the hospital so it provides easy access to grub when hungry, this store has a Blimpies stationed in the store and serves classic great sandwiches. The store offers a variety of food options, sandwiches ( Blimpies or deli made ) hot & cold, smoothies and juice drinks, etc. You can order from the app which is recommended because the order is written down and minimizes the order being screwed up which leads to the cons of what I'm about to state.\n\nIF YOU CALL AND PLACE AN ORDER THAT CONSISTS OF MORE THAN ONE ITEM { i.e; a wrap and a sandwich } THEY WILL SCREW THE ORDER UP! When on the phone ordering they hang up on you, speak to you rudely, no customer service etiquette, when confronting the manager or person in charge about said grievance you will be brushed off as if your complaint means nothing. Many times I've been brushed off and it becomes frustrating where I want to take my order and throw it in their face. I remain civil nonetheless and keep business, business+ you should never argue with the person serving your food. Overall the food is great, the service sucks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuanAzcGRnEAE",
            "text": "Food is great and impeccable but they tend to forget utensils like straws and things of that nature a lot when you order a drink or anything that would require utensils via food delivery app but other then that great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIazhiNGJ3EAE",
            "text": "Best Blimpie restaurant in town. Great sandwiches."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NllxLWtRRRAB",
            "text": "Your employees need training in germs. Germs move around and working in a hospital setting means changing your gloves after you've picked up dirty boxes off the contaminated floor before you touch anything in the deli section. Using tongs to put fruit in a blender doesn't mean you won't cross contaminate especially when you scoop up the ice and the ice chips touched your gloves is proof of cross contamination. Instead of acknowledging his wrong when I politely asked him to please change his gloves, he continued about how that's not necessary. Obviously, he's ignorant and disgusting. Shame on you for that! I wonder how many people didn't notice and got sick. That needs to be addressed. Careless and unprofessional. Education is key!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeGFESkZ3EAE",
            "text": "Extremely expensive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMHItU1JREAE",
            "text": "I am satisfied with my experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHBPN2VBEAE",
            "text": "Love salad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcHRTaDRRRRAB",
            "text": "Guy behind the counter ignored me for 5 minutes (no one else in line). Finally he takes my order, but kept cutting me off, made me repeat it a bunch of times, and STILL got it wrong. How are you gonna work at a bodega in NYC and mess up a SEC order?"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6amVtYUpREAE",
            "text": "Muy bueno comidas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6amFtdzV3RRAB",
            "text": "I ordered a cease salad, the most disgusting salad I ever had in my life. They literally put so much Cesar dressing that I couldn’t even eat it. they put the whole bottle of Caesar dressing in my salad. I felt disrespected that they were treat my food that way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcElMSmh3RRAB",
            "text": "They never include straws every time I order smoothies for delivery 😡…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMEtfREdnEAE",
            "text": "Good food with fair prices. Nice juice bar and even a Blimpies on site...! Recommended 😎"
        },
        {
            "date": "1년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeXNqSTlRRRAB",
            "text": "اروع مكان اكل في المنطقه. وطاقم عمل محترمون واسعار طيبه .  لا يفوتكم زيارة المكان"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREajlUbEp3EAE",
            "text": "People who work there they don't have customer service they always doing chewing gum an is not polite 😒"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENGNLY0h3EAE",
            "text": "They rush their customers, they don't let you know that whats ingredients they are out of. They charge you $10 for a Grilled chicken salad which is part of their menu, which list all ingredients. My salad has chicken,  arugula,  tomatoes and dressing."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREX0tDREhnEAE",
            "text": "Los mejores en todo,  todo fresco y rápido servicio . Son muy amables , y la verdad es que es mi sitio favorito , siempre compro allí ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMElxcVNBEAE",
            "text": "Açaí bowls from here taste so watery, like a smoothie. I am a believer that these bowls are suppose to be flavorful and my fruits were sinking into this water bowl. I paid $12.00 after going back and forth with the guy about displaying $7.95 açaí bowls. This place is a scam and can’t live up to what an açaí bowl really is. Save your money and go to a real establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MXQydHF3RRAB",
            "text": "This is a popular spot near the hospital with some good healthy eating. Can't really go wrong here. Not my favorite place, but. Pretty decent, I would say."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N05tbk9REAE",
            "text": "Decent breakfast."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtek9IYkNREAE",
            "text": "After barely eating anything for three days home sick from COVID I felt like I might be able to eat some tacos. So I order shrimp tacos from Tasty Pick. What a disappointment. They sent me tacos with no toppings other than a glob of sour cream. Not to mention that I requested sauce on the side. There were No greens. No tomatoes. Just three shrimp sitting in a small patch of melted cheddar. Smothered in sour cream. Shameful"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbWFES053EAE",
            "text": "They can never get a online order correct. There have been so many and too many instances where my order is wrong. And today, I ordered a bagel and guess what they gave me. A BLT SANDWICH!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdVpmWWdRRRAB",
            "text": "Recently when I order through Uber eats they don’t read the special instructions because my order is never what I ask for.\nI specifically asked to put the dressing on the side and they DRENCHED the salad in dressing.\nAlso I order the same sandwich all the time and for some reason they started adding ingredients they don’t usually put like onions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNk82RUVREAE",
            "text": "I don’t know if they know that Acai suppose to be frozen not watery"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbV92VnVBRRAB",
            "text": "I order chicken over rice I requested to not chop chicken too much. They chop it to the extend that I feel like I’m eating ground chicken. I am pregnant and that makes me nauseous. I had to throw it away. So petty. I used to love them. No longer ordering here. However, food quality is good!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpaG8tT2xnRRAB",
            "text": "If you are looking for a clean place where you can pick up a meal and fresh smoothies I  highly recommend you try Tasty Picks. You will be treated with respect by its professional staff.\n\nBonus: If you enjoy Blimpies there is one in the store.\n\nHope this review was helpful. Let me know what you think."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa0pmR2tBRRAB",
            "text": "Best spot in the Bronx for healthy food available 24 hours! Clean environment and friendly staff. I’m glad they’ve expanded their store. Be mindful of business hours though! It gets packed like crazy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGX2Rqdkd3EAE",
            "text": "I love açaí bowls and want to try them from everywhere possible. So I can say I know a good bowl and a not so good one. This place has not so good ones. Firstly, the blueberries were old and wrinkled, mushy and did not easy break down when chewing. The granola was not high quality and was mushy and oat meal ish after a few bites, not crispy and crunchy as it should usually be. The açaí blend was lack luster and bland, barely any taste at all whatsoever. I usually savor the taste of the açaí berry but I couldn’t appreciate anything about it unfortunately. Didn’t feel like it was a special or tasty pick."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpc2Q3ZDF3RRAB",
            "text": "They offer all different sorts of healthy foods; salads, protein shakes, fresh fruits, smoothies etc. most healthy foods are not that great in taste but this one is on another level!! They make their recipes taste extraordinarily delicious! I would definitely recommend this place ✨"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNzR6czRnRRAB",
            "text": "I ordered a salad online and the portion size was great, and the salads are good. But they drench the salad in dressing. An easy fix would be to put the dressing in the bag and let the customer choose if they want to swim in it or not. Also let customers provide extra instructions when ordering online 🤷🏾‍♂️🤷🏾‍♂️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTZ056NmFnEAE",
            "text": "Definitely my FAVORITE Deli in ALL New York State.\nThey have a great variety and great prices.\n\nTheir Salads are the best!!!!\n\nI got here by casualty like a year ago and after that, every time I am craving a good salad I come here or order on DoorDash."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOUpPdGdRRRAB",
            "text": "I ordered the Hungry Man in a platter without the bread keeping it Keto. The meal was good with everything fresh. And the preparation was in a decent time.  Overall good 👍."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dDVMTVR3EAE",
            "text": "One of the best food spot on this area. The salad bar and juice bar are the best."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMHJYam1RRRAB",
            "text": "Great place and delicious food.  Will continue to buy there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aEtIclZBEAE",
            "text": "Always get my salads and smoothies from here. The customer service is really good."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3OUppeWp3RRAB",
            "text": "We still don't know if it is love at first sight. We were looking for a place like this nearby. Healthy options and clean.\n\nI like the Orange Juice regular, really good. The wrap I ordered was really good. The price is really good. I guess you could find Delis with similar or lower prices (maybe 1 o 1.5 difference), but I loved the place and presentation of it.\n\nIt doesn't have chairs to sit, so you must always take-out. They have a big menu, with many options.\n\nDefinitely would come back, sorry, I am coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMnBfa3FnRRAB",
            "text": "I went there to buy a Blimbies sandwich the worst thing I ever did I was better off getting a regular deli sandwich price was ridiculous $17 and if I would've know I should've left the store, first of all I order a grill Chicken Cheddar Bacon ranch sandwich, The guy made me a frozen chicken pattie sandwich with Cheddar cheese turkey bacon nothing like the menu, top it with red onions which we know blimpie's usually carry the white onion not the red with tomatoes, lettuce, banana peppers. Worst sandwich ever."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxOXJ1NWtnRRAB",
            "text": "Loving the local juice and smoothie spot here! With an expansive menu and really cool snacks to load up on, it could be quite a thrill to walk in here and get something to eat! From adding avocado to having almond milk in the smoothies, it's very customizable. They also have salads and other hot menu items. I personally only go for the juice. They have nuts and seeds, and whole fruits as well. I know where to go when I need a great antioxidant fix!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoajRUM2d3RRAB",
            "text": "Solid 24 hour Deli with a wide selection of sandwiches and wraps. However, the gold in that shop is in their amazing smoothies. $7 a sub. 4/5 stars as a lunch spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoX0xlQ0V3EAE",
            "text": "Love their salads don’t like the business . I’ve been buying the same salad every single time and unfortunately every single time it’s a different price which is extremely bad for business . I stopped buying salads for several months because this reason . The other day I was around the area so I got one , a couple days later I got sick so went to ER when I got discharged this the only store that’s open so got a salad took 2 extra toppings off & got charged MORE than the other day . It’s just unbelievable how this business is running ! Never in my life experienced a place that will charge you different prices all the time . Ps don’t buy smoothie if you get ginger etc doesn’t blend well they need new machines"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aklPa2lnRRAB",
            "text": "Something as simple as a BLT with extra turkey bacon was delicious. The food menu and items in the store is on a more healthier clean side. Dropped 1 star for attitude. Greet your customers and show that you appreciate their support."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNXBpdW5nRRAB",
            "text": "This is the go to location for fresh smoothies and protein shakes. Plenty of options, can customize to your liking, and they give you the extra in a cup instead of just throwing it out. The service is great and the smoothies are delicious. Definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa0tEZWtnRRAB",
            "text": "I made an order here through UberEATS and I was very specific about what I wanted them to don't include in the acai because I couldn't eat those fruits and they included every single one. Very disappointed honestly. The acai itself was just watery. I will not order here ever again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtejh1eU13EAE",
            "text": "-ordered from Uber eats tonight (2/12/22) and I was very disappointed. I provided clear instructions not to put white sauce and they still did. Food was cold and they still took very long to have it prepared. They also included this…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURza19Hd2lnRRAB",
            "text": "This is my favorite spot to go to when I want juices/smoothies and salads. The only complaint I have right now is the sand which guy that’s there in the mornings at 8/9 am has messed up my orders 3 times in total. I don’t get it but I don’t…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVOUxMT193RRAB",
            "text": "Best smoothies in the area. I usually always get oats of glory. A lot of the delis around here are not that good and the staffing is rude . This one is the exact opposite. Hoping it’s here for a long time. Wish they were on Uber eats though."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZd3JUbThnRRAB",
            "text": "This place is excellent for smoothies salads ...and great quick food made with quality ingredients.  24hrs a day it open... this place is highly on my list for quality and something quick and nutritious.  Just try not to visit around after…"
        }
    ],
    "reviews_count": 72
}