{
    "name": "Bedford Cafe",
    "place_id": "ChIJU4H-KHbzwokRxvdlQH8O_o8",
    "grid": "BX7",
    "address": "1 Bedford Park Blvd, Bronx, NY 10468, USA",
    "rating": 4.1,
    "user_ratings_total": 1464,
    "phone_number": "(718) 365-3446",
    "reviews": [
        {
            "date": "수정일: 6시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJLWFTUEJnEAE",
            "text": "Small diner with the usual comfort meals like burgers, sandwiches, breakfast dishes lunch and dinner foodies and serious plates like pasta and steaks."
        },
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbFUzRlRhSFk1ZEd3MVlqZGhZMmw1U1Voek5XYxAB",
            "text": "Friendly staff, seated and served quickly."
        },
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseVltaG9RMkpqWW1JMVN6WmtTbTVIVTJWelRYYxAB",
            "text": "You can’t find a good Diner these days, but if you’re in the area definitely recommend this one ! The place is Clean, the staff is Attentive, and it has that old school cozy diner feel. Go for the Club sandwich with waffles fries, or a Hot Chocolate with whip cream !"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOU2FqSkpVMkV0TjFRek5GOUZZa0l4U0hwM1dtYxAB",
            "text": "Food is always good but  Anthonio the waitress be having a nasty attitude"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMFFXNWljRU0wZUZOR1VVRlpaM2xTU1hWSlFrRRAB",
            "text": "Very friendly service. Food came out hot and fast!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUGFrVm1SSE0yV0Vjd2NXaElVV0Z1VTBsdFluYxAB",
            "text": "Waitress had the worst energy ever. No idea why she was being passive aggressive from the start. You don't need to shame me for not being ready to order...when your menu is LITERALLY 6+ pages long no exaggeration.\n\nDiplomatically I tried to describe what I was in the mood for to kinda like help her nudge me, but nope, more weird energy. Like the kind of attitude that is a complete turn off. Why are you so mad? Like there's literally 100 items on the menu. And it was not packed inside. Don't shame the customer if you don't feel like engaging...it takes 2 seconds to point out the 'special of the day' or even to just recommend a popular dish.\n\nLike seriously the energy was so bad that even though the super kind looking owner(?) checked our table FIVE times asking if everything was alright, I still did not feel comfortable being honest about my complete dissatisfaction with the service.\n\nIn our weird climate, some people are just ticking time bombs. Engaging is honestly a safety issue.\n\nI wind up ordering food from elsewhere and waited for my group to finish eating. The orange juice was ~$5 but it took me forever to finish the glass, so the serving size was good.\n\nIf this restaurant takes meaningful steps to address to do better, I'll remove this review. This is probably the first 1-star I've ever given. Small businesses deserve so much grace, but this was just ridiculous.\n\n1/10 experience dawg."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVJWY3hiM1pUTW5sdmNsWTFUbWhGTVdwZlJXYxAB",
            "text": "Great for a quick lunch. Service isn't mind-blowing, they give you the menu, the food, the bill. Don't expect pleasentries or a genuine smile and, for some, this is just fine. Steak is awful though. Milk shake, sundae, pancake, all are sufficient and average. Again, a good spot to get your full."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNFlibjFnRRAB",
            "text": "The cheese burger very good"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTemVHNG5BRRAB",
            "text": "Kalu doulia beautiful service ❤️ 😍 ♥️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeFlVUnlPRzFITmpKRVNVNUlVa2hDVlZSdFdtYxAB",
            "text": "We stopped by Bedford Café this morning without any big expectations, just looking for a casual breakfast — but we were pleasantly surprised! At first, the service felt a bit slow, and it took a minute to get menus, but considering how busy it was, that’s completely understandable. Once things picked up, the staff were fantastic — super attentive, friendly, and always offering coffee refills.\n\nThe atmosphere was warm and inviting, with a nice buzz of conversation that never got too loud. It’s a cozy spot that makes you feel right at home.\n\nAs for the food — absolutely delicious. We tried the banana pancakes with eggs and bacon, plus the triple-decker chicken sandwich with lettuce, tomato, and avocado. Everything was flavorful and well-made (though the sandwich did miss the pickles). Still, the food overall was great, especially those banana pancakes — highly recommend them.\n\nDefinitely a place we’ll be coming back . We do recommend people get there early ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUlZDMVlRV3BsWW1sMWVsVm1jWEJsVUc1c1pGRRAB",
            "text": "Solid late night eats 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNlQzTnJkRzFWVWxwdlFVc3pheloxYTJWYVRtYxAB",
            "text": "Loved this cafe. Mike was very welcoming and staff is quick to bring your order when you are on the go. I picked up coffee and a BLT.. I have visited twice and definitely the staff makes the difference with how they greet their regular customers and welcome new ones. Looking forward to visiting again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWGQxOW5TekZHYVRaMGRYVXlRak5xUkd4R2JsRRAB",
            "text": "I come here and the workers and manger are rude. They expect you do to buy a lot of food. If you buy minimum food please don’t bother even coming in."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUVgyeENNVmt3UzFjM1ZUUnFiRU5SYzNoV1oxRRAB",
            "text": "Amazing. Perfect. Owner is both of those things and the food and vibe is equally great. Highly recommend."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdGVpWE53EAE",
            "text": "{update}\nIf you want the best burger you ever had just call in, ask for Sandra, and tell her to give you the Habibi burger on the charcoal grill\n\nI love both jennies (rip shorty) they’ve never let me down, its been a perfect experience every single time with them. Most importantly is that they’re Clean, always clean..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMExUSXpZMjlVTUcxSFJ6UXROVmxWY1hCeWFFRRAB",
            "text": "The service was really good! It seems like a pleasant family owned diner that has fast and lovely service. Food was you would expect for breakfast with an extensive menu, maybe a bit too extensive lol. Otherwise, decent spot to go to if you’re in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWlNUWjBPQzFuWmxwT1NGUkdYMDVuY2pWdFVGRRAB",
            "text": "Oh, my gosh.\nYou're place rocks listen I ordered the fra Diablo that's Italian for red devil. Cause, oh my God, it's got everything in it all the seafood. Oh my gosh, I was in heaven but I'm a big double. Well you know, it should be called a restaurant at these prices. It's worth it because you're not a diner because the diner would be cheaper.\nI hope you like my sense of humor but it's true."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obU9Vd3lVV1JqYjFaUWNXTlBlRmw1U25ORWJrRRAB",
            "text": "Our food came quickly.  It was hot and very tasty. Our server was very friendly. The menu had This is my first time to be in NYC. I would recommend this restaurants highly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTVVXNXVPSG8wZDFselF6aDZjRVpGYkhKMVZVRRAB",
            "text": "So I just went to have breakfast with my wife as we live in the area, and we have had breakfast before here but never encountered the service we did today. So we sat down and  we did not catch her name but the dark skin African American server seemed to be having an attitude from the moment we got there. She practically continued having an argument with employee as we waited for our menu, the. When I was ready to order I simply asked if i can get the eggs sunny side up with the yolk cooled to a medium. She proceeded to tell me in a defensive and aggressive manner that it does not exist is either medium or sunny side up, i am sorry but I am a culinary professional that has attended culinary school and I know what im talking about. But I let it slide, and also ordered an orange juice. When i opened the orange juice it had mold around the tip of the box, i told her and showed her the orange juice as she debated me that the expiration date was fine. Listen I dont care if the date is fine as a hospitality professional you should see the problem, apologize to the customer and replace for same item or something else. After this I chose to leave and not dine there as she was already making the entire experience seem uncomfortable. Someone should really talk to her and explain what customer service is and to out personal issues aside."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMWQzQmhaa3BWYnpOYVJGcGxiRVZpWmxaeFVFRRAB",
            "text": "I WILL NEVER ORDER FROM HERE AGAIN. STOPPED BY FOR A UBER EATS PICK UP ORDER . UPON ARRIVAL THE CASHIER WAS ALREADY GOING BACK IN FORTH WITH A TABLE IN WHICH THE CUSTOMER WAS ALREADY TELLING THE CASHIER “ I DONT WANT TO ARGUE , I JUST WANT TO PAY FOR OUR MEALS AND GO “ I WAITED BY THE FRONT COUNTER FOR OVER 5 MINS BEFORE THE CASHIER EVEN SPOKE. WHEN HE DID SPEAK ( SHORT , HEAVY SET OLDER SPANISH MALE ) THE FIRST THING HE ASKED ME WAS “ WHAT DID I WANT “ I SHOWED HIM THE ORDER ON MY PHONE AND HE THEN SAID “ CANT YOU SEE THE UBER ORDERS  ARE DOWN THIER AT THE OTHER END OF THE COUNTER  “ I WOULDN'T HAVE KNOWN THAT CAUSE THIS WAS MY FIRST TIME AT THIS DINER . I PROCEEDED TO GO CHECK OUT ORDERS TO SEE IF MINE WAS SITTING THIER , IT WAS. I GO TO PICK UP MY ORDER THE SAME MAN IS NOW STANDING EXTREMELY CLOSE TO ME AND GRABBED THE ORDER OUT OF MY HAND\n“ YELLING THAT I NEEDED TO CONFIRM THE ORDER “ I ONLY HAD THE ORDER IN MY HAND FOR LESS THAN 30 SECONDS I DIDNT EVEN GET A CHANCE TO CONFIRM THE ORDER . THIS HAPPENED EARLY THIS MORNING ON 8/20/25 . I CALLED THE STORE AT 10 THIS MORNING TO REPORT THE ISSUE AND WAS GIVIG THE RUN AROUND BY BOTH AN MALE EMPLOYEE WHO ANSWERED THE PHONE, ALSO THE FEMALE MANAGER ON DUTY THIS MORNING HUNG UP ON ME WHEN I REPORTED TO HER. I DONT APPRECIATE THIS AT ALL. WHEN I TOLD THE CASHIER LAST NIGHT I NO LONGER WANTED ME ORDER HE SAID “ ITS NOT HIS PROBLEM AND TO CONTACT UBER OR MANAGER ABOUT IT “ IVE CONTACTED BOTH THE RESTAURANT AND UBER TO NO AVIL OR REAL HELP RESOLVING THE ISSUE."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV2MxaDZOa04xZGs1eWJHeEpkMVZPWjNKSE1YYxAB",
            "text": "I’ve been coming to  this place for years love  Freddie he’s the best everyone knows him if you have been going there for a while like myself  I do miss their other establishment that was across the street went In this morning the older short  lady with short blonde pasty pink lipstick should not be working the morning rush she was like a deer in headlights when I tried ordering a hash brown she looked confused so I had to repeat my order and explain what  a hash brown was and she said no we don’t sell that here we only do home fries what diner doesn’t do hash browns again a person like that shouldn’t be doing that morning rush when she’s not equipped to she was so over whelmed and she was doing was standing behind the counter where the register is and I’ve seen that place way more crowded than what it was today and she still seemed overwhelmed it’s a diner that sells breakfast foods but doesn’t sell hash browns"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWlFuQkJhbUZpY1VGak0yczBNMmQ2U1V4a1VVRRAB",
            "text": "Super friendly staff and great food! Grits were delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWFMxRlZWSEUwUTI1VFMxRnVNazVVU1dKa1FVRRAB",
            "text": "Best breakfast"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYU1ITlFka2N3ZEdodVFXTnVkelpYYWtKWmVYYxAB",
            "text": "Little pricey but it is what it is."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemMyZHNSQzFLYUZwRFdHeEZiWGhuUmpReFprRRAB",
            "text": "The only good thing about this place is that they greeted me when I walked in."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eU1HbHpZWEZTVEhSMWFuZGFSVEZ4ZHpGNU9YYxAB",
            "text": "Nice people. The owner talks to the customers.  It feels like family."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wYVdqQmpiMVY2UzBSbGFUVklVME56WnpOSVUxRRAB",
            "text": "Cuidado mi GENTE POR I C E ES BIEN SERIO ESO"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSWFrY3dWbll3YTFSNlNFcDRjbFJqZUdjNExVRRAB",
            "text": "Stopped in here after a morning at the BotanicalGardens. Great food, service and people."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMmVXNU9aQzF6ZGtWc1NVdHRaRzltWTFabk5uYxAB",
            "text": "Good food just dirty"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oa2FteHhYMUpWWTBsM1pXcDJZVVZ5TUhSbWFXYxAB",
            "text": "This Bedford Cafe is family oriented. They really enjoy my presence"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMZXBzWUthczlLTTVBRRAB",
            "text": "No cumplió mis expectativas, comida de mala calidad, servicio deficiente, cero carisma y simpatía."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbVFXaDRRVmM0TWxOUFJtTlpVbXRmYnpOaU9FRRAB",
            "text": "Sometimes is busy to get a table, but the service is very good, sometimes slow,  but  comprensible when is busy in holidays or after some events in the area, is a place for family, consistent for years, the waitress o waiters are very professional."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNS0FnTkNGbDRuOTlnRRAB",
            "text": "Naches were a disaster of beans and hot sauce, patrami is rubber, and I was so disappointed I wasted my money. Horrid"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOQ3R5WnVLeTl5SXhnRRAB",
            "text": "Very bad service by the young blonde waitress well we didn’t even get a hi or cups of water we were waiting for while and she didn’t even greet us or anything she keep passing by us and didn’t even ask to take our order, once she saw cops…"
        },
        {
            "date": "5달 전",
            "language": "mg",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLam41WTJMaHBEemxRRRAB",
            "text": "So NY. ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJVFJ1dHVIcGF5QnlBRRAB",
            "text": "Near my house"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJelN0ZWZiMi1hR1FBEAE",
            "text": "Bacon is always perfect"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLXZvOWlxdV9YQ0ZnEAE",
            "text": "Very good food 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNnNISmR3EAE",
            "text": "THE BEST DINER TO ORDER FROM!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva1lqTm53RRAB",
            "text": "Very bad, I was sadden by the way they treated some. I was trying to help ;a stranger with disabilitie.cold cold-hearted, ignorant people.  I had to oder out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXVLWUZnEAE",
            "text": "The VERY rude lady at the front whose name is Anglelica has very poor customer service skills.I paid $20 for wings & fries you would think I would get good customer service. I asked for Ranch , she’s said “oh you have to tell me that before because it comes with blue cheese”. I said ok but I want ranch . I gave her my $20 & was surprised when I only got a dollar & change back . So I said I gave you $20 how much was the he stuff . She replied with, I know how much you gave me then gave me the receipt. She is very rude & doesn’t need to be in the front greeting customers. I will not be back due to the food being over priced & Angelica’s customer service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcGN5eVlnEAE",
            "text": "Friendly staff . Food is always good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaU8zNnlBRRAB",
            "text": "Good speedy service. Food was good. A nice small place to get work done. Bus stop nearby for transportation."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eGVTdzlBRRAB",
            "text": "I ordered a grilled chicken sandwich with no fries or cheese but I didn’t expect this sandwich to be THIS plain for $10.13 .. service you front were nice tho"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eXItcUpnEAE",
            "text": "Went in early morning hrs havent been here for over 20yrs and still same employee that always served me as a teen. Fold was great as usual and calm atmosphere for being a saturday.keep it up! miss the old school vibe. Will come again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMTVMY29BRRAB",
            "text": "Excellent customer experience,  the meal was one of my all time favorites."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbG9UZ2NnEAE",
            "text": "Good service and food 👍 recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbktId093EAE",
            "text": "I love the food the service is great and you never have to wait too long for anything food or the waiter. Very cozy atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOUxPVkpREAE",
            "text": "A small diner in a busy street of the Bronx serving delicious food.  We ordered the Turkey Club sandwich, Beef Souvlaki platter, and Cheeseburger, which were all tasty and perfectly seasoned. The waiter was very friendly and attentive.   We will definitely come back again to try their other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaTdPeXRRRRAB",
            "text": "The food is soooooo fresh and healthy with very good price considering the portion. It was full when we arrive on Sunday afternoon but we did not wait for too long to get a table. The service is good and the staff refilled the coffee so fast. We were very happy to find the spot and it really made our day esp. in a cold winter weekend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILThTM09nEAE",
            "text": "The Bedford Cafe is an excellent rest stop from your travels via the 4 Train. I occasionally visit there, so I decided to give this place a review. The food is delicious with a full plate meal and the customer service is great. Any beverage they have, they will provide when you ask. The waiters and waitresses are very accommodating and friendly. The best seats are at the front row, where you can dine at an elevated level with close access to customer service. One waitress recommended me another restaurant to go to for review. I will check it out soon. Thank you Bedford Cafe!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTeWVTdEpnEAE",
            "text": "It was a very enjoyable experience. My meal was delicious and warm, the only thing I would say is I asked for some water and the water tasted very off. Other than that the service was good and the food I liked very much. I want to try other dishes I think I will return here. Outdoor dining was warm and comfortable."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeThiZmZ3EAE",
            "text": "Literally the best place ever. The food is absolutely AMAZING. Like they never slack on the food 😩. Always looks good and tastes good. Coming from a helllaaaa picky person this place suits my tastes so much. everything I've ever got tastes SO GOOD. Ok, I was once very sceptical of the place cuz the name was so off putting but once I finally tried it, it was LIFE CHANGING. yum yum the egg salad sandwich whatever thingy w the fries is my favorite 🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cmZ1c0pBEAE",
            "text": "I use to go to this diner twenty years ago when I went to Lehman College.  Not much has changed.  You get a throw back vibe when walking in.  The staff is friendly and attentive.  The service was pretty fast and food was good.  Nice sized portions and moderately priced."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPb29qSzRnRRAB",
            "text": "Food is always fresh and tasty. Don't forget to order the house special of home made freshly squeezed lemonade. Definitely hits the spot on these hot days. Very refreshing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMHQtOG9nRRAB",
            "text": "To start the service was good\nFood could’ve been better, missing flavor and the home fries I ordered was cold\nPrices has definitely increased\nWould recommend the French toast"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBOHJEaVNnEAE",
            "text": "Nice cozy place lots of choices to eat,I had the steak and fries and I love it my plate was enough for two but I didn't share that's how good it is was... prices are not that expensive  just good enough to spend a few dollars..and I almost…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZN2NfQlp3EAE",
            "text": "Very nice place to eat. The environment is clean and there are nice comfortable seats. The place is well decorated and it looks great.\n\nThe food tasted very good and the price was very reasonable and it won't break ones pocket.\n\nMy only complaint would be the service I received that day because they gave me the wrong food, but we are all humans and mistake happens. So I will still give it a five stars.\n\nOverall it is a great place and very affordable. You can come here for a date, breakfast, lunch and dinner and you won't be disappointed."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbDkzVXZnRRAB",
            "text": "I had ordered 2 honey dipped chicken from the restaurant as a delivery and got regular over cooked chicken with no type of honey added to the chicken. The food was disgustingly dry. When called to explain my dis satisfaction of the quality of the food, she said the chicken is frozen and she doesn't know why it was not honey dipped. This was the supervisor I was talking to. She would address me as sir and had to correct her. She then asked for my address to have the delivery guy bring back the food. I asked for my money back because the food was disgusting, but she said no then hung up the phone. When I tried to call back they did not pick up the phone. I advise do not eat from this place. Bad customer service and you will not enjoy the food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNXZPR21BRRAB",
            "text": "This place is very attentive and the order time was less than 10 minutes for a family of 7. Nothing disappointed :)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0cC1TLTVBRRAB",
            "text": "Quick friendly service! I had pancakes, home fries, bacon, coffee, orange juice. My friend had an omelette with a salad and apple juice. It all came out to about $30. Coffee was good. I'd recommend this place to locals and anyone attending Lehman since its super close!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb3VYZlVBEAE",
            "text": "Decent food nothing fancy but tremendous and delicious food I have been here for few times food is the same.\nI will recommend this local businesses."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTZ6aFRBEAE",
            "text": "Just had brunch and it was amazing. I called prior to ask if outdoor seating was available and if could bring my dog. They told me yes to both! The service was awesome! They even bought my dog water! My dog enjoyed his bacon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3Z3RxWDB3RRAB",
            "text": "This place have unhappy place the owner doesn’t care what happens with the bad service I not recommend this worst place"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5Zzd6Nm1nRRAB",
            "text": "Voted Best Diner Food in 🇺🇸 USA!!!! Regardless of food selection, beverages or desserts,  you will be a happy customer/diner!!!! Thank you Bedford Cafe!!!…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbXVhTGpBRRAB",
            "text": "The only issue I have is they don't put jalapeños on the bagel all the way like they do at National across the street."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNjZPQjJRRRAB",
            "text": "Great diner in the bronx with friendly service and good eats at whatever hour your cravings desire!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOV82SGtBRRAB",
            "text": "I ordered a grilled cheese with bacon and fries.  The fries were good.  The grilled cheese was terrible 😔 Some of the bacon was jiggly and some was burned.  The bread was soggy.  The cheese looked like hardening plastic and the sandwich looked like it was cut in half with someone's feet"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MWR6dm5BRRAB",
            "text": "The food is delicious I had to call to the Waiter attention I ordered a Homemade Lemonade he brings it in a plastic take out cup I said let me ask you something don't you use glasses? he said oh you want it in a glass I said for 4.50 really!! he changed it\na small glass of water to go with my meal I was dining alone shouldn't make a difference the Gentleman sitting behind me\nlarge regular glass I look at this as discrimination number one the color of my skin number 2 being a female the Waiter has yet to come back to me to see 👀 if everything is alright or do I need something else I'm sitting here to see how 🤔 long he or anybody else comes over to me I'm not\nInvisible 🫥"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpMnNLZGhBRRAB",
            "text": "Thanksgiving dinner was tasty, the best and everyday meals. Best foods on Bedford. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubkl1cTlRRRAB",
            "text": "Group of 5 went for breakfast\nall agreed food is NOT the best 👎\nPancakes were hard not fluffy at at all also had French toast HORRIBLE\nas well the bread was hard and had no taste I would not recommend this place for breakfast. I must say staff is extremely courteous and friendly but I think they need a new cooking person in the kitchen!!!"
        }
    ],
    "reviews_count": 71
}