{
    "name": "Los Munchies Jerome Ave",
    "place_id": "ChIJDboLFQDzwokRhrB0FSeT-qI",
    "grid": "BX7",
    "address": "3421 Jerome Ave, Bronx, NY 10467, USA",
    "rating": 4,
    "user_ratings_total": 120,
    "phone_number": "(718) 881-5500",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNME4wTktibXQwWjFGVE1FcGhRbEJHU1c0ek1HYxAB",
            "text": "Everytime I have an appointment I come here, the food is great, the people are always welcoming, the music is not too loud is just right. Evelinda always has a smile on her face and she's very welcoming. The cook knows his  business, because the food is always good. The pastelitos are always on  point they never miss. The smoothies are amazing."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd2RrZHdhRmRvUjBWUVNYZDFURVJMY0RsME1uYxAB",
            "text": "We are all equal we all struggle w thinking that God loves you ✝️❤️🙏…"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU2JFSm1ORTFUVUdoUlJXTm5WSHBYTjI5eVZIYxAB",
            "text": "Fui a pedir un batido y pensé que sería de mejor calidad y cuando veo la preparación,la mitad de una banana,3 pedazos de fresas y 2 de piña,la batida en ves de tomar color se quedó blanca,solo tenía hielo y la chica me mira como rara,muy…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aYWVUWmlSRlYxYmpGSlZFUlhjVk41VDFKMU1YYxAB",
            "text": "\"The food and drinks here are good, but unfortunately, the service not so much, some of the workers have an attitude when they answer the phone also each time I called to order food  it’s incredibly difficult to hear the person on the other end due to the excessive volume of the music, sounds more like a club than a restaurant. While the atmosphere is lively, it can be a bit overwhelming when it affects communication. A more balanced approach would definitely enhance the overall experience.\""
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNU5XeEthSEpVVFhVM1kwZzRkRUkzWldSQmFXYxAB",
            "text": "Excelente servicio todos muy amables"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaGNqWmlMVVJCTWtKcVMwUjZSVFJETFVKTFduYxAB",
            "text": "Loved everything ❤️ a fast and affordable food."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c2NHWnRNUzFhYUUxU1QyNWFNM2hWUzB4WUxWRRAB",
            "text": "Excelente comida y precios"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU1pISmtRMlU0WlhOcFRIbzVOemc1VWxKcWVYYxAB",
            "text": "Food quality, service, and  atmosphere in 10/10. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJM2RrZS1RdmVmcmFREAE",
            "text": "Wait how I’m now getting charged for delivery fee when your flyer says free delivery?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLejJxOF9EcmRfZ2xBRRAB",
            "text": "Excellent service"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMblVyNXJzOU1mc3dRRRAB",
            "text": "El servicio al cliente es perfecto primera vez que ordeno y atienden muy bien y la comida Uff ni se diga más… gracias 🙏🏻"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYU10LVcxNUlhOUlREAE",
            "text": "Un lugar acojedor con los mejores sabores y equipo de trabajo  gracias @Maria @Nayeli"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaTBrTk9maUlDRzNBRRAB",
            "text": "Pedi a domicilio el servicio al cliente es excelente y la comida super rica. Lo recomiendo 100%"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLUZvOHZzMnNIZWdBRRAB",
            "text": "Un excelente servicio me atendió maria"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKLUkyYm5wZ1piU2x3RRAB",
            "text": "Duros buensimos recomendado"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMV2FtZVhqc2NtMTVBRRAB",
            "text": "María me atendió fue muy profesional, amable y recomendaría este lugar."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQNjR0Zjd6enJQUFNBEAE",
            "text": "Principalmente nayely es mi favorita siempre hace que mis pedidos sean exactamente como me gustan, María me dio un buen servicio en realidad todos me tratan bien att Alexa"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQM1UydmloaUpQaHN3RRAB",
            "text": "Food is amazing, fresh made by order. Love the atmosphere, friendly staff!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdF9UMmFnEAE",
            "text": "Muy bueno"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMNklsZHY5b3RQWVZBEAE",
            "text": "1 hora esperando por un delivery para al final decirme que no llegaban a mi dirección 🥲🥲pésimo servicio…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd3MyTjBRRRAB",
            "text": "They basically stole money from me. I placed an order online (via toast). A female employee calls telling me they didn’t have a delivery person available to bring my order. And that the order had to be canceled. She assured me I would get a refund once the owner was informed. I called multiple times afterwards asking for the refund without any success. It has been over 30 days and I still haven’t received the money. I will be filing a complaint with the SBA bureau."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvckwyYjF3RRAB",
            "text": "No sirve el servicio al cliente, en uber eats, tu ordenas y ellos te remplazan el perdido por lo que le da su gana, te dan actitud y mandan algo que no pediste. El único sito en New York donde el cliente no tiene la razon."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvM0tQdWJnEAE",
            "text": "El servicio al cliente de este lugar es muy malo. La comida tarda mucho en salir pero Su comida es Sabrosa la recomiendo."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMFkyV05REAE",
            "text": "Everything I’ve tried from here has been delicious.🤤 love how clean the place is!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbk8tMnpBRRAB",
            "text": "When they first opened they were dope but after a while they got comfortable and started getting lazy with the food. I’ve ordered  the same thing and today they gave me a stick and said it was oregano"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcE1HWUR3EAE",
            "text": "Jahaira fue la mejor servicio de todo muy bueno en verdad 10 de 10 muy bueno todo la atencion la calidad  los recomiendo al 1000"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNC15aEl3EAE",
            "text": "Horrible experience. Ground beef for the patacon had a putrid smell and taste. Took 2 bites before my girlfriend realized. Later that night she got food poisoning as a result from eating food from this place. I do not recommend. Stay away!!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNElpM2N3EAE",
            "text": "Primero la actitud de los empleados es muy malas te miran mal si haces alguna pregunta y ágüelas de las comidas le tienen que poder más sazón"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa3M2ckxBEAE",
            "text": "The best taste ever"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMWNybmZnEAE",
            "text": "Me encanta esa yaroa de pollo y espero que hagan un menú y publiquen los precios siempre están escondidos, quiero probar más comida de los muchies pero no me gusta preguntar por precios a la hora de ordenar...."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNXVhMXJRRRAB",
            "text": "Por Estar muy entretenidos acabo de llegar a casa a comerme una yaroa y cuando voy abrir la comida no tiene ni tenedores los paletas de queso no tenía salsa, no me gustó el servicio"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbXUyQzB3RRAB",
            "text": "Everything was amazing here as always! Love the hotdog. It really is the best taste. 👅"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NzVhR1BBEAE",
            "text": "La comida estaba mala y el servicio fue horrible."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Ny1hcDRnRRAB",
            "text": "I would never order from here again. They deserve zero star. The fries of the yarrow were all burnt horrible customer services and food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NzZhU2l3RRAB",
            "text": "If I can give a zero star review I would. I ordered food to be delivered to my home and my order was incomplete and I paid cash. I called back to let them know and I waited more than an hour for my food to be delivered and they called me back after all that time to let me know that because my address is too far they couldn't bring it. I waited over two hours to not get my food back or my money back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdmVyWW93RRAB",
            "text": "The food was amazing thanks to maria,ramon,Nelson y Edy"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQN2VmdWx3RRAB",
            "text": "La comida 1000/10 y el ambiente por igual, Maria nos trató excelente, tienen que ir."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQN2FlZG5nRRAB",
            "text": "Great services!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOHM2T2hBRRAB",
            "text": "Me encanta ir a este sitio!! A mis niños les encanta el personal es súper amable y atento. Nayely, Evelina, Antonio, Ramón y Joan son excelentes me encanta el servicio muchas gracias!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQck9tektnEAE",
            "text": "The food is always so good and the staff is always very nice 🫶🏽 . Nayelis y Evelina served me the last time I went in 🥰."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQek9QVnVnRRAB",
            "text": "Muy bonito el lugar"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQek83WGtRRRAB",
            "text": "Muy buen servicio muy buena comida me facina todo excelente personal me encanta todo nayelis y Evelina las mejores ❤️"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQekk2N0R3EAE",
            "text": "Muy buen servicio me encanta esta comida es mi favorita la Amoo muchas gracias a Evelina y a nayelis por el buen servicio ♥️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcU1XVVhBEAE",
            "text": "Maria and Mariely the best."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeUl1ZXlRRRAB",
            "text": "Muy buena comida muy buen servicio muy amables nayelis y María 😍…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQME1fWjZnRRAB",
            "text": "Evelina"
        },
        {
            "date": "수정일: 11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNl8tb0JBEAE",
            "text": "Muy buen servicio en especial María gracias por su atención 🙏🏻👍🏻…"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMElucnhBRRAB",
            "text": "Me encanta su comida y su atención felicidades I love your food and your attention, congratulations gracias por tu atención Evelina"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQd09YX2F3EAE",
            "text": "Evelina did a great job in service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQd0l5V29RRRAB",
            "text": "Good and friendly service from evelina."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZy16QlBBEAE",
            "text": "Lamentablemente se están dañando, los primeros días todos tuvo delicioso pero ya hacen las cosas a lo loco.  La chica que atiende es muy amable eso si tengo que decirlo pero por favor cambien o entrenen a la persona que hace la comida. Por que pagar por algo mal echo y quemado no esta bien."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNGFPd1ZBEAE",
            "text": "Ordered a smoothie and a quesadilla. They both tasted okay, nothing special. The music in there was a bit too loud for me. The whole experience was just okay. The staff was nice, it was my first time there. The place was clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNnZIWU9nEAE",
            "text": "I came into the restaurant and ordered a cheese burger but for some reason it had this slice of ham in it when I got home, I ordered cheese burgers from there before and I never had something like this in it. Another thing is that I don’t know if they ran out of yellow cheese but I when I removed the burger bun it had, what I’m assuming is mozzarella cheese I think because normally when I ordered the last two times they didn’t ask if I wanted a specific cheese on the burger. I ordered cheese burgers before from this place and the last two times had yellow cheese and never had a slice of ham on it either. I’m confused as to why they put ham on my cheeseburger anyway because the ham is something I didn’t order on the burger."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcGVqNDFRRRAB",
            "text": "My experience dining in was interesting and telling. While waiting for my order i saw one of the workers come in from the next door produce store. She came in and immediately stored everything she just purchased directly in the front bins. She did not wash any of the vegetables or fruits. It was unpleasant to witness. She claimed they wash them once someone orders but i did not witness that happen when someone came in to order a juice. Service was not great. Not friendly individuals."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM2FIVDJnRRAB",
            "text": "Llame y pregunte primero que tiempo para deliver o para yo recojer y me dicen 20 min a los 45 min llamo y me dicen si la comida esta lista pero no sabos el tiempo del delivery guy. Le dije que si ellos no saben lo que me van a traer una comida fria me dicen que no que 5 min. Cuando el driver llama con una actitud que el estaba abajo le digo que me espere que voy a bajar me dice yo tengo mas delivery que hacer y yo le respondo si yo espere 1hry 10 min el me puede esperar un 1 min. Cuando cojo la comida todo estaba frio y me falto el jugo que pedi. Deberian de mejorar el costumer services o darle clase de como tratar a un cliente."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaU9qMDR3RRAB",
            "text": "Me encanta el servicio tratan muy bien a los clientes fui por qué una amiga me recomendó las chicas que trabajan en la noches son un amor especial mente una chikita morenita excelente persona y muy buena comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyODhYbWFnEAE",
            "text": "Everything here is delicious and fresh to my understanding. I waited a while and it was fine everything was hot and so yummy definitely will be returning. Come here if you're looking for fried food fun especially with its late night hours! And check out our video on IG @JadaExploresAll!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUak5MaW93RRAB",
            "text": "The place is good, I like it from Tremont\n\nBut the Yaroa of sweet platain was horrible 😫,  my wife order sweet plantain yaroa medium on wendsday after yankees game and the platano was like a syrup. It was not good neither the cheese. Please if it is not good the platano just say that you don't have.\n\nI still like this place they are the best for mofongo,chimichanga, tacos , hot dogs.....I just want better yaroas.\n\nGood luck in this new place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINFpQMGVnEAE",
            "text": "The chicken cachapa alone makes this place a 10/10 and it’s only $8"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aUtpcGx3RRAB",
            "text": "Food is amazing!!!!!!! Where has this spot been hinding all my life I love it here friendly servers food amazing made to order there smoothies are on point I can’t say enough about this spot please go try it your taste buds will thank you!!!!!!!! ❤️#munchies and there open late ⏰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia1BLclVnEAE",
            "text": "It was alright, not terrible but not great. Portions were actually really bad though. I got a burrito and it barely had anything in there, basically became a quesadilla if I flattened it. Not worth the money."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYby1QSFd3EAE",
            "text": "Estuve en el local 3421 Jerome, Hice un pedido de mofongo y los plátanos estaban crudos mal cocidos, también el jugo de naranja estaba malísimo pura agua y sabor amargo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aXFYZXhBRRAB",
            "text": "bad coordination.  I was waiting 1 hour and a half for a delivery, something was missing in the delivery and they still have the nerve to say I'll send it to you in 20 minutes.  I had to decide and go look for him there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbWVITFp3EAE",
            "text": "This is BY FAR the best food spot in the city. Their food is amazing, the customer service is top notch, the vibes are immaculate and, on top of that, they always have great music playing."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaUpTaS1RRRAB",
            "text": "El de Jerome es muy bueno me encanta me gusta el servicio  la comida el personal muy bueno voy mayor mente de noche muy amables las chicas te motivan a que vuelvas"
        }
    ],
    "reviews_count": 65
}