{
    "name": "The Bronx Public",
    "place_id": "ChIJq1XtH5fzwokRyUjVe6nRJp0",
    "grid": "BX8",
    "address": "170 W 231st St, Bronx, NY 10463, USA",
    "rating": 4.3,
    "user_ratings_total": 1139,
    "phone_number": "(646) 939-3080",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMldtdHFNRFJwUzJRMU1GbG1UekpOUWpWTldWRRAB",
            "text": "Have yet to try the food but the drinks do not disappoint. Looking to chill and listen to good music? Or want to go with friends? This is a good place to go"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVptMUpTalYyT0ZBdFdrWnhaVWt0Ym5ONExXYxAB",
            "text": "I live nearby but rarely come here because the food is mediocre and the drinks are just as bad. Every year I gave it another try hoping things would improve but they never do.\n\nThe last time I went (the place was empty, by the way), their security had the audacity to kick my group out even though we were already leaving. We were 8 people, the only ones giving them business at the time, and he was unbelievably rude. Sorry, but it’s not our fault you don’t like working the night shift, you chose the job. At the very least, be polite to paying customers.\n\nIf you want good food, good drinks, and actual customer service, skip this place and head to Last Stop on 242nd st. Hands down the best bar in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcllWVnRPRk13WVVGcFVERnpiRWxCYTNabE9IYxAB",
            "text": "Maravilloso lugar para disfrutar en familia"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbjdXajZ3RRAB",
            "text": "The best bar in the Bronx area ... I shouldn't say that aloud.. bc is MY ( mío solamente) local bar 😂 drinks, food, music, the people are the best! Love it here."
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSS1JXVnVkbXRzV0hjeU1TMWxiVkF0ZVdndGNWRRAB",
            "text": "好"
        },
        {
            "date": "2달 전",
            "language": "ro",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1T1NuaGpiVkJKVldoUmR6UldZV2xPY0dZM1NGRRAB",
            "text": "Excelent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4d1l6Tm5jRWMwU2xKd1dHWjRibG81U0Zvek9WRRAB",
            "text": "Sanjit has been a great person!! The food and ambience is too good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdGJXNUZabWN5YzNsT05HMVRVVTF3YXpKNWExRRAB",
            "text": "My wife took me here for my birthday, she knows how much the Bronx and hip hop means to me.  this establishment is a must if your looking for a glimpse of hip hop culture and some of the greatest food/drinks the Bronx has to offer."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcVMyWldjRGxoVlRCUVJFVTVZbE5oUkdKa2FuYxAB",
            "text": "Go during the various happy hours and you'll be fine. Check the website.\nChicken quesadilla looked good & filled well (my guest had it). If you're a fries purist don't get the waffle fries - they have that seasoned batter on them. They were well cooked & crispy  tho. Just not my taste."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Zd1FrMVVPR2xZVUZKc1lYSk5WRGxVWjFaVmMxRRAB",
            "text": "The food: the mofongo came with flavorless and skimpy sauce and flavorless chicken. I had to drown everything in salt and pepper. It needed the acid of something like Tabasco. I asked for hot sauce and they gave me buffalo wing sauce. Terrible.\n\nDrinks: paltry beer menu. All mainstream stuff. I asked for the one independent beer: the Bronx IPA. They said they didn’t have it.\n\nAtmosphere: music so loud you can’t hear yourself speak. This shouldn’t feel like a nightclub. Nightclubs and bars are two very different things.\n\nService: Many people standing around ignoring you. The beers are served with no release of the head. Amateurs.\n\nThey added an automatic 20% gratuity. Probably because they know their service is unacceptable.\n\nSend Jon Taffer from Bar Rescue in here.\n-10/10."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSVF6VnBRWE4xU3kxM2Rua3dZV2RKVWpKS04wRRAB",
            "text": "You leave feeling satisfied and appreciated."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVlNUZDNOWGQzY0VaNFZXdzFiRFJVVm1sM2QzYxAB",
            "text": "The waitresses are horrible with that fake smiling doing anything for a tip. I ordered some food and my food had hair in it the chicken was fried so hard. The sangria is watered down  no Thank you."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R04xSXdjblZWZFRodFdtdEpaRnBzTUZabldtYxAB",
            "text": "The food was good was surprised I only seen two people waiting on there order.\nWill definitely return without hesitation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRUxXbGxhakZWZDNRdE16UkJTR1ZvVDIxSVNFRRAB",
            "text": "I waited almost a hour for one appetizer and I tried to cancel it multiple times and the bartender continued to say just three minutes, 20 minutes went by and I finally received my food after over 50 minutes of waiting and the food was not good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa1FqUXlaRUZaTmpOc016Rm9kMjA1YWpVdFptYxAB",
            "text": "I love it here. Food is delicious drinks on point and ambiance ever so lovely"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdGVHMVdjWGhMTTNwWFpVdGZOemgyTkdwTFFXYxAB",
            "text": "Visited after a long night.. didn't get any food, just a few drinks with friends. Enjoyed really good drinks and some good music. Overall, vibe was nice...."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5akp6X053EAE",
            "text": "Went with my wife and two of our friends. The service was top notch. The food was very tasty. Omg the passion sangria was amazing."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLaUxYNU9BEAE",
            "text": "Bronx Public Bar & Grill is one of those spots that hits all the right notes—great energy, good food, and a chill atmosphere that keeps you coming back. Whether you’re there for brunch, game night, or just a casual night out, it never disappoints.\n\nThe food is way better than your average bar fare. The burgers are juicy and cooked just right, wings are flavorful with a solid range of sauces, and the nachos are piled high and perfect for sharing. They also have a decent selection of craft beers and cocktails that pair well with the menu.\n\nService is quick and friendly, and the staff keeps things running smoothly even when it’s busy. The music is always on point, and the space itself has a cool, urban vibe—lively but not overwhelming.\n\nIt’s a solid neighborhood spot with a loyal crowd and good energy. If you’re in the Bronx and looking for a place to grab drinks, good eats, and enjoy a laid-back night out, Bronx Public is a go-to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV09YaEZhazlrU0RGUkxUY3RTbnBtT1hJM1dGRRAB",
            "text": "I have to give 5 stars. This place is amazing. The bartender Juan is awesome. Everyone is friendly. you're welcome with lots of attention. The food is good and the service is pretty fast. The new management did some updates that make the place feel bigger 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeXhxTG1La0pLREFREAE",
            "text": "Always a good time!! The brunch is amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJenJuS2VHaDhtOFVnEAE",
            "text": "Works like a charm. Thanks!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYmlyNERramJXcWpnRRAB",
            "text": "Great local spot. Good Spanish and Puerto Food as well as American fare. The decor is unique and hip for the culture. Very friendly staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPZlAzT1M0MHFma3V3RRAB",
            "text": "Rumpunch was awful! So watered down. $20 wasted, bathroom disgusting, staff doesn't know which customers are which. I hated it so much I left after just 1 drink."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJRGxoNWo3M04ybmp3RRAB",
            "text": "I have a reservation at 11 AM that I would like to confirm, but no one answered the phone when I called. It seems that this restaurant doesn’t value its guests; there is a large party that made a reservation for Friday at 11 AM, and the Bronx public updated the time on Google at the last minute. However, they didn’t even bother to inform the guests who had existing reservations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZlVwWlhQaGJ6bmFBEAE",
            "text": "Servers were very attentive - great drinks"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZTgxN1QxcnVMX0lnEAE",
            "text": "Everything was great!! Have been here a couple of times for happy hour and service, drinks, and food have been good! Juan has done an amazing job serving us as well!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2M3MEZBEAE",
            "text": "Terrible service. We had a reservation, the place was not packed yet we had to wait 5 minutes to be seated. No problem. Next, we ordered a chicken sandwich with sweet potato fries, steak and eggs, and cauliflower as an appetizer. The appetizer came out after 40 min. 5 min later they brought out the chicken sandwich with regular fries not the sweet potato fries and instead of steak and eggs they brought out chicken and waffles. 1 hour after ordering I see them put the steak out and it's just sitting there. A guy wearing a white undershirt and glasses looks at the steak, calls over Ashley (waitor) and they begin talking over the food. When he brought me the steak I politely declined and the guy put it in front of me anyway. I said again I didn't want it and he took the plate and walked away. I was never addressed again. Ashley walked past my table, dropped off the receipt and kept on walking. No apology, discussion or anything. I will definitely not be going back there. On top of all of that they include the tip so you can't even pay what you want for the poor service.\nExpect to pay over $100 for 2 people, expect loud music, expect the tip to be included and pray you get better service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNjRqcHh3RRAB",
            "text": "My wife and I just hosted my birthday party at Bronx Public Bar & Grill this past Saturday (4/26), and I couldn’t have asked for a better experience!\n\nThe food was absolutely delicious — everyone at the party was raving about it. The DJ kept the energy up all night with a great mix of music, and the vibe throughout the space was just amazing. It was the perfect setting for a fun, lively celebration.\n\nAshley was a great and big shout-out to Joselito — super attentive, friendly, and made sure everything we needed was taken care of. Also, a huge shoutout to the owner, Juan, who was extremely accommodating to all of my requests and really made the whole planning process easy and stress-free.\n\nThe staff, the atmosphere, and the service were all top-notch. I will definitely be recommending Bronx Public to all my friends and family for parties or just a great night out. Can't wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2ZHazFnRRAB",
            "text": "Really good spot for brunch. Great music and food! Highly recommended 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnRTOVpnEAE",
            "text": "I was so pleased with my food and service! Juan the server/bartender was amazing to my mom and I. I requested a strawberry lemonade and he made it on the spot, and it was absolutely delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvenZXZ3J3RRAB",
            "text": "Juan was great . He helped me decide what to eat .The chop cheese Eggroll was really good .Juan had amazing service and was very kind . He made my experience a 10 out of 10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnFIMVNnEAE",
            "text": "Me and my bf come here legit every other week😭 We’ve had Juan several times as our waiter and he is amazing, he’s also the manager of the spot. The food is fire & the drinks are fire, I always get the chicken sandwich with garlic mayo on the side and my bf always gets the dirty fries. The coconut margarita pitcher is so good and not too sweet, its perfect for two people. I love this spot, 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnNHSk9BEAE",
            "text": "Service is always great and the food is amazinggggg highly recommend it. Ask for Juan!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMjRHUUtBEAE",
            "text": "Great place to go to Juan the serve/ manager has been great the experience was great he was extremely accommodating to all of out needs and accommodation to all we needed. Very attentive and ready to healp us with everything we needed. Thankful for him and will definitely will be back ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWRlTk93EAE",
            "text": "Had a blast after 13hrs shift the guys were amazing and made the perfect drink for picky me"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWI2NzNRRRAB",
            "text": "We had such a great time! Happy hour with Juan is so much fun, he’s so attentive and responsive, we return often and we are always taken care of.\nSuch great music!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXNPajJnRRAB",
            "text": "Great spot! The drinks and food were on point, and the service was solid too. Definitely recommend checking it out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNnFXYUFREAE",
            "text": "Juan was amazing !!!!! I love there menu ( ladies come on Tuesdays)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNm9YX1Z3EAE",
            "text": "I love coming here for Happy Hour. Nice friendly service, great drinks, great food! Juan is an awesome bartender!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNnZuLS1RRRAB",
            "text": "It was a great experience, drinks were great and food was amazing. Really great service.\nI had juan at the bar and he made bomb drinks"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJekxmVVZREAE",
            "text": "I’m really disappointed as I paid a $28 cab just to get horrible service. Waited more than usual for just a beer. Then I didn’t get my order correctly they forgot my buffalo sauce I asked for on the side and brought me uncooked fries. I tell the girl immediately to take it back and make it crispier and waited for like 10 mins and eventually ask the server for the fries only to be brought out the same uncooked fries that been sitting there. I tell the server these are the same fries uncooked and she says sorry the other girl didn’t tell me. And I said I don’t want it anymore I’m already almost done with my wings. Overall not worth it coming here they don’t get ur order right"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dXVQMzZRRRAB",
            "text": "Love this spot but they have to do better, on Sunday my friends and I were tipping over %20 cash on every round of drinks, end of the night we caught them including gratuity without saying anything, probably attempting to get tipped twice.\nDon’t think you can play your customers just because we had a few drinks."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LUxfQ09nEAE",
            "text": "Patron beware! They will bill you adding the gratuity and then ask you for an additional gratuity. I believe it’s in hopes that because they are a bar you will not be paying attention to that tab. I paid an $11 gratuity on a $58 bill. After paying the gratuity they asked for an additional $16 for a gratuity so my $58 bill would’ve came to $91.57 if I didn’t know what they were trying. Buyer beware! Unless they change their policies and their staff gets better, I will definitely not be going back to this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMDZXV2xnRRAB",
            "text": "Great, easy spot to grab a burger and beer or hang with friends.\nI went a weeknight after 10 and it was pretty empty which I appreciated,\nThe music is a little loud.\nStaff is friendly.\nFood slightly above your average pub, and prices are great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRekxmMnZnRRAB",
            "text": "The staff was very friendly and they saved my little experience from being a complete waste of time. The drinks have no liquor and the food was not good. Don't suggest going here unless you drink beer and are not currently hungry."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMHUyMFBBEAE",
            "text": "The 3 stars come because I had 3 drinks and woke up feeling like crap.\n\nI started drinking gin years ago because I woke up perfectly the next day. The only thing is cheap gin messes me up.\nMy boy tried to warm me by saying bro look at the bartender in reference to drink something straight. I didn't listen and thought they have Hendricks so I should be good but Hendricks has never left me feeling like crap.\n\nThe wings are great. Something simple and good. The fries are regular.\n\nOverall I enjoyed myself."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXVTRTVnRRAB",
            "text": "Great place to chill and have a good meal with a tasty drink."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNXR1WFd3EAE",
            "text": "please don’t visit this business unless\nyou are willing to return your food. the back of the house is the worst. chef undercooks everything. the front of the house i to young to understand the business"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnd00tMl9RRRAB",
            "text": "My first and last time there. I had chicken wings that barely had any meat on them, im talking about wings from any rinky dink Chinese restaurant w bulletproof glass have superior wings! And the meat that WAS on the wings was very tough, hmmmm..  I have braces in my mouth so it was alot of work for tiny shreds of tough meat, no thanks. I also had a passion fruit cocktail that was obviously made from some fruit syrup mix, so it was overly sweet. Places like this is why I can't stand drinking uptown 😒"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbnREN1R3EAE",
            "text": "Very nice experience good drinks and music"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0aTlUTkJ3EAE",
            "text": "If you are looking for somewhere with atmosphere to catch a game and grab brunch (or something to eat), look no further. The Bronx Public is a comfortable, familiar sports bar/restaurant with bottomless drink options at brunch on weekends.\n\nThey offer a variety of 90 min bottomless flavoured mimosas, sangrias and a few other cocktails.\n\nAfter getting word that its gets super crowded once it’s game time, my cousin and I got to the spot early because we didn’t have a reservation! Luckily it was super quick getting us seated, and we were told we had to wrap up before the next reservation time; which worked out great.\n\nOverall it was a good experience. The food and drinks were okay/good… And most importantly you can tell that this is a spot which is a regular for people living nearby."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaElHYWJBEAE",
            "text": "Thank you for dealing with my family and being kind and responsive I'm the process. They were horrible and you were all sweet and quick to address allllllll if there issues.  Amazing staff. Great experience would recommend and it doesn't hurt the food was great as well!!!!! We we for brunch with two options -- prefix or bottomless drink add on $26"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdWMtS2R3EAE",
            "text": "Their service was good the food came out pretty quickly. We had wings, street corn, and the biscuits for appetizers. They were all pretty good but nothing to write home about. I had the steak and fries but I found the steak too salty for…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNlotaHpBRRAB",
            "text": "I’ll start with the cons and end with the pros…\nThe only con was the fried chicken sandwich’s breading was falling apart from the chicken making the whole sandwich a big jumbled mess.\nSad to say I couldn’t enjoy that along with the fries the were full of oil\n\nNow on to the pros\nfirst of all is in the Bronx, which I love and appreciate. I liked their happy hour special which includes any of their happy hour drinks with 3 tacos! We had the steak tacos & just wow, super tender and great taste.\n(any choice of protein is included)\n\nFor happy hour we ordered a rum punch that was not strong and a mule which was very tasty.\nThe best thing on the drink menu has to be the\n“Catch A flight” A tasting of 4 different types of whiskeys for $30. Now that’s an amazing deal, my friend and I treated it like a whiskey tasting lol\n\nI would come here again just for that!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKc2FDbDJ3RRAB",
            "text": "Food was really good. I had the crispy chicken sandwich and it tasted really good. I also had the henny punch and it was soooooooooo good. Normally when I have a drink that includes punch it always has a like a empowering taste of orange but not this drink, it was more of a mango taste which surprised me that I had to get two. They do have happy hour but I got there after happy hour so not sure how their happy hour is but I am going to try brunch. The server was great except that I guess I got there when it was busy but I do not like having to call the server I rather have the server come to me and ask if I need anything else, other than that it was great 👍 5/5"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMk16RThBRRAB",
            "text": "When we saw this place on social media we were hype to check it out.   But it's really more bar than restaurant. It's really small. The regular seating in the back is super cramped and they literally time you and kick you out your table for 2hr seating schedule. We saw folks have to pick up their drinks and squish stand in the cramped bar area.\n\nFood was mid...we got there between brunch and regular dining so it wasn't worth it to order from that menu but we couldn't order off the main menu till  Brunch was officially over. So we ordered apps from the Brunch menu, wings and cheesy bread. After waiting the 30 min we order fr regular menu.  Food was nothing special, my BFF's steak was dry and burnt even though she asked for med. well. I had the Cuban sandwich it was OK but also dry. The seasoned fries were just regular fries with old bay on them...very salty.  We ordered a pitcher of the Bourbon Punch for 2 expected to get a lil buzz....and nothing.\n\nOur waitress disappeared mid service and we had to ask for our bill from someone-else. I hope she got that tip bc we still do that.\n\nThis spot is not for kids or older folks. Also they have someone circling around taking video for socials and that was annoying as well. I didn't consent to be filmed while eating my food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDLU9XTDRnRRAB",
            "text": "Bronx Public has been on my radar for a few weeks and I finally had a chance to give it a try. I will say it can be difficult to get a seat but I’m sure that’s due to Covid and strict rules in NYC. The food is incredible. I ordered the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NlpHNENnEAE",
            "text": "Visited this place for the first time this past weekend with my husband. We arrived around 10pm on Friday night (ladies night) and was surprisingly seated right away without a reservation! The ladies were far outnumbered by men, but I must say that this place was a complete vibe! Overall, I would definitely return.\n\nThe DJ played a great balance of music to match the crowd (Black & Hispanic). The food and drinks were good, with the exception that the lychee martini was very weak for $12. If you are looking for something stronger, I recommend the $28 take-home size coconut margarita.\n\nOne major negative was that  20% gratuity was automatically added to the check for a party of two. I have never seen that done before, and while I would have tipped the server well regardless, I do not think that the service was deserving of 20%."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaTRqOV9nRRAB",
            "text": "all i gotta say is 10/10 would recommend! as soon as i opened the door i was greeted and seated. my friend and i shared the chopped cheese spring rolls and they were good! i had the classic burger and my friend had the crispy chicken…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBenRyYWRnEAE",
            "text": "I went there for Happy Hour and I loved it! Kelani J. was the perfect hostess/ server. I had a pitcher of Passion Fruit Margaritas which were delicious. I also had the chicken and steak quesadillas were delicious and they were not skimpy on the meat to cheese ratio. The chicken wings in original and garlic chili. My beau enjoyed the original wings and ordered more. The garlic chili wings was supposed to be sweet and spicy but all it tasted like was sweet wings with red chili flakes sprinkled around. They were tasty and sweet but they needed a bit more chili.\n\nAs well as the chicken and beef silders. I found beef slider to be dry. The chicken slider was supposed to be a buffalo slider but it was more a a dry fried chicken slider with a ton of hot sauce on the bun. The plantain chips were nice and crispy and could have used more salt. They chips were served with a mojo- ranch mix that was not to my liking... it is tangy, creamy, full of cilantro, garlic and citrus. I did not want a ache so I passed on the dip.\n\nI would definitely be back to try out the other items on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeTRUd3JnRRAB",
            "text": "Food was good, but not great. Bland fries (seriously?). Waffles were good and the avocado toast was enjoyable! Service was terrible. FOH requires more training (including bartender and management!). Everyone was working hard, but not smart. Super loud music. Spaniards will roll over and die if they try the sangria. Espresso martini also bad. Please re-evaluate the drink recipes!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdWRyc1NREAE",
            "text": "Beautiful contemporary design in the bar. A taste of Manhattan style in the Bronx. Graffiti on the walls display a strong sense of culture and energy. Totally love this place and will be back in the future.\n\nWonderful wings and fries. The Bronx punch is great, pretty strong too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0azRfd0JBEAE",
            "text": "My co-workers and I went there for  brunch on Sunday, and the $40.00 bottomless drinks and meal were great! I had Sangria with chicken and waffles. The music was great, a little of everything which we enjoyed, I would recommend this spot, especially if you're on a budget and like music. The place is a little small but I think you will have a nice time there."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4dmJhM0J3EAE",
            "text": "Food - bad\nService - mediocre\nDrinks and price - good\n\nWent for brunch with bottomless drinks. The chicken and waffles were quite frankly awful, and the BLT was also pretty bad. The wait staff also went 30+ minutes between coming over to check if we wanted more drinks.\n\nI still gave 3 stars because: unlimited drinks, an appetizer and entrees for two people for under $45 is really good. Despite not having a great experience, I’d probably go back for unlimited drinks and just order some fries (if they let you)."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0MW92Y3NnRRAB",
            "text": "Visited this location for the first time and i absolutely love it here. The decor is nice there's plenty of seating, a bar, a small backroom that is possibly used to house private events.Theres two unisex bathrooms. There happy hour is from…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxa2Q2dnZRRRAB",
            "text": "The food was really well seasoned. I had the garlic wings and when I tell you it was amazing. My friends said the same of their food. Once thing we all agreed on was that the drinks were very weak. I had an sangria and then a margarita and it felt like drinking juice. The rose donuts are a must try!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKX0xDcGlBRRAB",
            "text": "Was there for taco Tuesday.\n3 tacos and a drink ( margarita or Paloma) for $20\ntacos, we're pretty good. we had the chicken ones come with cilantro and onions, The drinks were delicious to.\nService was good to 👍🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWeHNtdm93RRAB",
            "text": "I went to the R&B Saturday Brunch (December). It's a nice spot with good vibes, and the server was polite and accommodating. I ordered the chicken and waffles, which were good, and my table did the unlimited bottomless for $25 per person. The sangria was okay; I wish it was a bit stronger, and the unlimited bottomless should be $25 for the table and not per person. All in all, I will be returning."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNa29ibTVBRRAB",
            "text": "Close to home right in the Bronx. If you like watching sports, they have a sports bar and tables in the front. Towards the back there is an area where they seat people for dinning. There is no dress code, pretty dress down spot. The food…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXb2UzVHdRRRAB",
            "text": "Love Bronx Public, from the graffiti on the walls to the attentive servers and the amazing food.The vibes are super chilled. There is a lot of seating indoors and out so when I got there at 4 for happy hour there was no wait. Let's talk about the food... we ordered the garlic chili wings and plantain chips with garlic mojito dip to start. Everything about this was amazing!  The wings were drenched in sauce and the chili flakes gave it that kick which I love but not spicy...Hot, crispy and delicious. The chips were just as good and we had to ask for another mojito dip because it was that good. Had 3 Mexican mules which were $10 during happy hour lol they were refreshing and delicious if you're not into drinks that are too sweet, not that strong though. For my main dish I had the blackened salmon with scallion rice. Perfect choice. The salmon was perfectly cooked and the rice delicious.  Always love my experience here, the servers are all gorgeous girls BTW. Can't go wrong here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScTRfdFBnEAE",
            "text": "Love this place! Everything was great as always! Very clean and the food is always cooked well!\n\nMy friend & I ordered:\nMac n cheese AMAZING!!!\nchopped cheese spring rolls (which tasted ok to me but my friend loved them lol)\nLoaded fries was good (I’d prefer it without the guac)\nI ordered 10 wings and mixed 5bbq and 5lemon pepper which is my fave I prefer the lemon pepper for sure!!\nMy friend ordered 10 wings and her mix was 5buffalo and 5garlic chili sauce hers was ok but she loved it she just hated that they didn’t have ranch sauce and they only had buffalo sauce.\n\nOverall love this place you can go with friends/ family when I’ve gone before they had games to play at your tables & they have  tvs that play sports when’s there’s games and the Djs who go play great music!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ0aHFQeTdBRRAB",
            "text": "Typical bar, The chicken quesadilla was good, the ambience was decent, the waiter were nice and atentive, and the drinks were somewhat tasty. My old fashioned had no space to breath as the glass was too small for the ice cube. This has been…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMElDZk5REAE",
            "text": "The food is amazing and the frozen drinks are the bomb and yesterday was my birthday and i had a big group they took care of us are server Ashley was amazing"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dFBqd25BRRAB",
            "text": "Cute place to have a drink after work. Great place to have brunch on the weekend with friends. Great evening atmosphere to listen to music and play games at a table. The drinks are always on point and the food is great for the munchies……."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX1p5RXl3RRAB",
            "text": "Joined some other veterans for a meet and greet for some wings. Great place to come and have a drink and hang out with friends. This is my first time here and I will come back. The service  was good, the waitress was very attentive. They…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2a0tqYnVRRRAB",
            "text": "The venue was nicely designed and the bathrooms were spotless. I had the creamiest cheesiest Mac and cheese that was amazing  and the drinks came out fast and delicious. My favorite drink was the Watermelon Mint Cosmo. The server was very nice and attentive. Overall I will definitely be coming back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNGJEVFdnEAE",
            "text": "I went to Bronx Public on a Saturday night.\n\nMusic was pretty good playing 90s - contemporary hip-hop.\n\nFood was tasty for the value. Steak and fries hit the spot. If you're here, try their freshly made strawberry glazed donut for dessert! It was nice and hot.\n\nDrinks are strong. You won't be disappointed with the value of alcohol.\n\nOverall, a good spot to get food and hang out with friends."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcUtuc253RRAB",
            "text": "I WAS in LOVE with this establishment. But my last visit has me feeling otherwise. I came during Brunch time on a Saturday with my siblings and we literally waited 1 HOUR to be seated.  Nor were we told the wait is 1 hour, we came in and was told a party should be leaving soon, soon turned into 1 HOUR!! We came in at 3:30pm and was seated at 4:35pm . The hostess was a sweetheart and befriended us but at that point I wanted food not a friend. Now the place was busy with about 3 large parties and other small groups that were eating but majority of them were done eating and were just having drinks. This is something management needs to work on. There are losing out on money allowing people to chill while others are waiting to be seated and bring in more money for them. They need to work on their flow of having customers in and out during their busiest time. Our first waitress was okay. We got the bottomless mimosas and it took her a while to bring our pitcher. Then she just disappeared. No one informed us we would be having a new waitress. But when our new waitress came, we asked if she would be with us and she replied \"Yes\". She was A1!!!!. She was attentive, kept the drinks going and checked on our table. Her name was Andira. She was awesome.  End of story, the place is good and a fairly new establishment , so I know some tweeks will be made. I will just fall back from attending to see if my next visit in the future months from now will win me over again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoaWMySWR3EAE",
            "text": "Food was good . Had wings steak tacos and chips and Guac. Pitcher of margaritas ( 2 ppl max not strong)and it was wed so happy hour night. Hip hop trivia was kool too. I had a great low key evening."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbU5iRHpnRRAB",
            "text": "As a reviewer, The Bronx Public caught my attention with its lively atmosphere and inviting vibe. Located on 231st St in the Bronx, this spot has a lot going for it, making it a great place to unwind with friends or enjoy a casual night out.\n\nThe first thing you’ll notice is the cool, modern decor that gives the place a relaxed yet trendy feel. Whether you’re sitting at the bar or grabbing a table, the ambiance is perfect for a laid-back evening. The crowd is a good mix of locals, and the energy is upbeat without being overwhelming.\n\nThe menu is what you’d expect from a solid pub—comfort food with a twist. The burgers are definitely a highlight, juicy and packed with flavor, and the fries are just the right level of crispy. The drink menu is also impressive, offering a range of craft beers, creative cocktails, and some classic favorites. There’s something for everyone, whether you’re in the mood for a strong drink or something more refreshing.\n\nService here is generally good, with friendly staff who are attentive and ready to help. There were a couple of moments where things slowed down a bit, but nothing that detracted too much from the overall experience. It’s the kind of place where you can settle in for a while, enjoy your food and drinks, and not feel rushed.\n\nOverall, The Bronx Public delivers on what it promises—a solid neighborhood pub with good food, great drinks, and a lively atmosphere. It’s definitely worth a visit if you’re in the area and looking for a spot to relax and enjoy some quality pub fare."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNM2NXNjdBRRAB",
            "text": "I was amazed by this place, couldn’t find a better place, unbelievable how many times I’ve had passed by and never called my attention, but is a really nice place to go with friends or like multiple friends dates, they have cool games, their food is Yummmmmm delicious and the staff is AMAZING!! Loved it!! Can’t wait to go back!"
        }
    ],
    "reviews_count": 81
}