{
    "name": "Kai Fan",
    "place_id": "ChIJ0a2Usr7zwokR9AKXrQxfF1c",
    "grid": "BX8",
    "address": "3717 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.1,
    "user_ratings_total": 170,
    "phone_number": "(347) 275-8056",
    "reviews": [
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OU9pQlFnEAE",
            "text": "Glatt Kosher Asian food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NFRsOHdSRTVJZW5WTlFWWlhNV2xuV1ZaNWVIYxAB",
            "text": "Great food, great service. Thank you for a wonderful birthday!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V1YyWmhibXRFYnpFd2NtNTZlVFJsYUdkRGRsRRAB",
            "text": "This was the actual worst food I think I have ever had. The chicken, if it actually was chicken, was ALL grist. I’m not sure if they thought by frying the food they can hide the consistency of the meat, but they failed horribly. I cannot believe that this restaurant is allowed to stay open. We ordered the two most basic of Chinese/American dishes, general gao chicken and sesame chicken. You have to be on a different level bad at your chosen profession if you cannot get these two dishes right.\n\nThat is $90 and probably about a week of my life/health that I just lost."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWmNVVnJiR2hOYW1kdFFuRkhiREZVZVc5a01rRRAB",
            "text": "The best Kosher Oriental food in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYU1XZE5UV3RUTUd4R1FtaG1ZUzB0WmxOU2VXYxAB",
            "text": "Large portion size, fast service, pleasant atmosphere."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNeXR2NDJRRRAB",
            "text": "Great place for delicious Chinese in riverdale. Fast friendly service. Bobby is so nice. Always a wonderful time. Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJazRYQ0JBEAE",
            "text": "Portions are too small for the price"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdHB6dUJ3EAE",
            "text": "Had higher expectations considering the price listed for the food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbjhtSm5BRRAB",
            "text": "I get it kosher food is expensive but this dish is just a disgrace $28 for broccoli with almost no beef. Shame on you Kai Fan."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbUwteTRBRRAB",
            "text": "There's a reason why this restaurant is rather empty. As you can see, the cashew chicken which is priced at $28, contains mainly large pieces of chopped celery and some slightly rancid baby corn. There's minimal if any chicken in there (and seems like grade B chicken at best). Other reviews mention the lack of meat, and I should have heeded these reviews before going to the restaurant. I simply won't go back to the restaurant again. I think they should be ashamed of what they are serving."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYM3FHdW5RRRAB",
            "text": "Very pricey for heavy on the vegetables and skimpy on the meat in their meals.\nSoup watery.\nFood not extremely flavorful as compared to other places."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNHJLMERREAE",
            "text": "Good Chinese food. Lors if take out. Do not.much in dining. Parking always tough"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dllHR0F3EAE",
            "text": "I ordered sesame chicken with rice and truthfully the chicken was very hard. It was not enjoyable at all. The food came out in less than 5 minutes and maybe that meant the food was sitting for a while or premade. The food was also over priced for the quality and portion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMzdlTWFREAE",
            "text": "Just received delivery and I am not sure if I am more stunned with price or terrible food.\nI ordered small short ribs and brocoli with light brown sauce.\nSmall short rubs are really SMALL.\n4 times smaller Comparing to Chinese restaurant I always order( sadly today they were closed)\nOvercooked brocoli swimming in thin watery extra sweet and sour sauce.\nTital: 39.00\nThe most terrible Chinese food restaurant I ever ordered from.\nIt it disgrace to call them Chinese food restaurant.\nSTAY AWAY"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeE1HODdnRRAB",
            "text": "Upscale-ish Asian restaurant. Really delicious. This is not your greasy take out American Chinese. I had the Szechuan hot oil lamb. Delicious, and good and spicy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX3MyTlBREAE",
            "text": "Food tasted off even the soy sauce which that’s weird. Overall bad experience 3 out of 4 people at my table ended up sick and vomiting shortly after."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OWFDMzRBRRAB",
            "text": "i went to all you can eat sushi with 5 other individuals. service was quick, fish was fresh, the staff was kind, and everything was delicious! would definitely recommend and go again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMnAtVGhnRRAB",
            "text": "If I could give them 6 stars I would, they are great!!! Went there on a date with a lovely friend expecting the usual Kosher Chinese fare that I have had from LA to Pittsburgh to my hometown here on Long Island, NY. I came expecting the food to be the normal I have expected in an inexpensive (for Kosher that is) Chinese restaurant, OK to good. However this restaurant astounded me, it was different!!!\n\nThe food was fabulous!!! We both had the 'Hot and Sour' soup, and it was impressive! The temp, was just right, not luke-warm as I have come to expect in many restaurants, and, not scaldingly hot, but just right! The spices were hot as they should be, but not too hot. As I said, I was amazed!!!\n\nThen for the mains, we had, Spicy Chicken and Curry Chicken. Again the spices were quite hot, but not too, at least for me. They were just wonderful, tasty, yet with a subtle delight. It is hard to express. And we both commented how the presentation of the food on the plates was 'picture perfect.'\n\nI would suggest you go and write your own experience! I live 30 miles on the other side of the NYC metro area where traveling can be a challenge all on its own, but for this restaurant in the Bronx, NYC, NY, Kai Fan, I will be returning!!!\n\nps I only wish they were closer to me here on Long Island!!\n\npss I was served by one of the owners, and an owner was on duty at the cash register! A great family run operation!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxZ2NXaFB3EAE",
            "text": "The service and atmosphere were good but the food was really not good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dnBHcFZ3EAE",
            "text": "Meat dishes a bit expensive with minimal amount of meat. Service was excellent"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweVllZlZREAE",
            "text": "Delicious 😋"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNajdXVXlRRRAB",
            "text": "Found it on the map, loved it.\nUpdate 3 years later: we are regulars, and love going to the all you can eat nights!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURod1piTnZ3RRAB",
            "text": "Good food and service. Pleasant place to dine. For kosher food prices are average. Under rabbinical supervision (kosher)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMjQzdHBnRRAB",
            "text": "The only thing bad was the broccoli was under cooked, aside from that good food"
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4d01HNUV3EAE",
            "text": "не хочется быть грубой, но мой опыт пребывания здесь был ужасен. соотношение цена-качество просто что-то: как будто бы ешь в дайнере, но с ценником хорошего ресторана\nхотелось бы отдельно упомянуть детское меню. написано: хотдоги с картофелем фри. что приносят? две БЕЗУМНО жирные жареные сосиски. картофель вкусный, но сосиски лежат на нём, поэтому всё измазано в жире. я практически не трогала сосиски, но из-за того, насколько всё было в жире, меня дико мутило весь день. чувствовала себя ужасно, не рекомендую"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3OEpXZk9nEAE",
            "text": "The fish is always fresh and delicious, and hand rolls are generous and original. Definitely the best kosher sushi place in Riverdale (not that ee have many though). The atmosphere is quite ok for a family-oriented restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCME1hSXlnRRAB",
            "text": "The food was delicious, the waitress was very accommodating, and the decorations work terrific. Street parking. Recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCb2FMU0d3EAE",
            "text": "Not a lot of protein for the price especially when paying for extra."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCN3ZLd0NnEAE",
            "text": "Everything was bland and completely tasteless.  I honestly felt we were eating old food.  Plenty of leftovers that went straight into the garbage."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaXQtT053EAE",
            "text": "The dumplings & Beef Lo mein are the absolute best!!! 🙌🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdU1ldVFnEAE",
            "text": "Went with my large family. Accommodated us with no reservation, well lit, so we could see our food, ample choices. We all enjoyed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlXzVIMGlRRRAB",
            "text": "Sweet and sour chicken not good. They should try using fresh chicken unless you like stringy  old hard to chew chicken. The rice was good but for 30 bucks I will boil my own"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb2VDWGtnRRAB",
            "text": "Classic NYC kosher Chinese food with great sushi. Mostly meat dishes on the Chinese side of the menu, but fish and tofu also available. The owners are super friendly!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdFpPVVdnEAE",
            "text": "Their Chinese and Thai food is adequate but not much different from that of other kosher Chinese restaurants.  By contrast, their Korean dishes are exceptional and excellent, and fully justify a trip from another borough."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaExIRkJREAE",
            "text": "Just fantastic!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc3RuRTRnRRAB",
            "text": "Delicious authentic Asian cuisine. Do not miss out on their lunch specials, chicken and broccoli is unrivaled. Eaten over 200+ times, my go to for lunch, dinner, and even mid day snack. Prices are manageable, lunch special is a steal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMEx6MUZBEAE",
            "text": "Sweet Mushroom Nigiri is delicious! The Kani roll is just imitation crab and rice wrapped in seaweed, which isn’t a Kani roll. But for $7 a roll, the roll should have a little more to it. Fried rice was as per."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteVBpRjRnRRAB",
            "text": "Extremely mediocre. Mapo tofu tasted like nothing, tofu could have been straight from the box. Garlic eggplant among the worst I've ever had and distinctly undercooked. Soup was fine, rama rama song (peanut chicken) more flavorful but quite sweet for a peanut sauce. Pleasant service and quick preparation, but for the premium you pay, ($20+ an entree), this was a disappointment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMTRUOHVBRRAB",
            "text": "The food was delicious and the ambiance was very pleasant. We especially enjoyed both the fried and steamed dumplings, highly recommend them!!! The waiter did a phenomenal job making us feel comfortable and handling my requests."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcklXb3J3RRAB",
            "text": "Best Sesame Chicken in the country!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNUpiOFNREAE",
            "text": "Food was great but got a weird vibe from the staff. They gave us different treatment than the non colored people and was very hostile on the couple times that I’ve walked in there to get a table"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ODZERS1RRRAB",
            "text": "We celebrated my mom's 90th birthday.  Delicious food, great service,  they ordered us a birthday cake and I finished the meal with a lucky fortune cooky."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdlB5Sk9REAE",
            "text": "Very fresh sushi. Fast delivery and great customer service. Well priced too! So lucky to have such a great (kosher) sushi place in Riverdale!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cDhUWFJBEAE",
            "text": "Sushi platters are always excellent. Very fresh."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMGFPTkRREAE",
            "text": "Velly good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpdWVXQkd3EAE",
            "text": "Good food and fast service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzel82WTB3RRAB",
            "text": "Best sesame chicken ever"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwLWY2Sy1RRRAB",
            "text": "Excellent kosher Asian dishes."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBaG9PX1lnEAE",
            "text": "The food was pretty great. I've only had my order to go, but the restaurant looks nice inside.\nThe service was decent as well. Parking around this place is difficult, even if just picking up food, but it's worth it."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbTZDZnJBRRAB",
            "text": "Delicious! Fresh! Excellent Chinese & \"fusion\" menu food: kosher! Lunch menu is an especially good value. Large variety of excellent meals, all well-prepared and served nicely displayed. This fine restaurant has been in the same family for many decades yet has improved!"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbHR6NUNBEAE",
            "text": "Delicious food, family-oriented, lovely and calm surroundings.  We tasted quite a few dishes, and there is something for those who enjoy milder flavors and those who like things spicy.  The short ribs were outstanding (I still dream about them!).  Great vegetarian dishes and plenty for the meat-lover.  I highly recommend."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMTR6MkNnEAE",
            "text": "For a Kosher Chinese place in Riverdale, this place is pretty good. It's understandably difficult to find authentic Chinese food that is also Kosher, but this place comes closer than most other Kosher Chinese places. Their menu is pretty extensive with many options for differing tastes. They even have non-Chinese options like sushi and some Thai noodle dishes.\n\nThe restaurant has a nice atmosphere. They serve crispy noodles with duck sauce in traditional American Chinese dining room fashion. Tea is available upon request. The service is friendly but a bit delayed. The wait staff and manager are all very accommodating and are willing to make substitutions.\n\nThe egg rolls, dumplings, and cold sesame noodles make for good appetizers. The cold sesame noodles are not especially authentic, leaning much more on the peanut-buttery side than the sesame side, but they are still tasty. The hot and sour soup is vegetarian friendly, hearty and well flavored. The general Tso's tofu is a nice vegetarian option for an entree. The portion is huge and comes with steamed broccoli. The tofu is a bit over-breaded and the breading falls off of the tofu easily. Nonetheless, it's a reasonable option for vegetarians who are stuck eating at a Kosher Chinese restaurant. The Szechuan hot oil dish can be made with tofu. This dish comes closest to an authentic Chinese dish at this restaurant, but the flavor and spice level just isn't what you will find at a more authentic place. The sushi is adequate, and a good option if you are looking for a lighter meal.\n\nThe meat dishes all come with huge portions and look pretty good.\n\nOverall, this is an above average Kosher Chinese restaurant in a neighborhood that really needs one. The place does a good job at maintaining some level of authenticity while also providing Kosher food. Unlike many Kosher Chinese places, you don't feel like you are sacrificing quality by eating here. It's a great addition to the sparse Riverdale dining scene. The management here has done a great job in a difficult market."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdWNpQkxREAE",
            "text": "This place is great! The restaurant very clean staff is friendly and very knowledgeable about their menu and the foods on the menu. What makes this restaurant extra special is it's kosher! If you are Jewish you will be able to enjoy the Chinese food here."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRM0lMUkJREAE",
            "text": "Was hopeful of a good Chinese dinner.  Food that was ordered came out tasting quite awful,  very acidic and kinda like \"off\" . Had 3 dishes to sample from and all were the same story.\n\nThe would NOT reccomend this restuarant."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bWNiTmhBRRAB",
            "text": "amazing food.  I am VERY particular about freshness and you cannot beat this place. Wonderful flavors, beautiful decor...can't say enough. I tip my hat to Kai Fan"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNWYyVXBRRRAB",
            "text": "Fantastic. Great service unbelievable sushi and fresh Chinese. The owner is a very nice man and greets everyone who enters his fine establishment.  Highly recommend very good food."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnM3FlZzhnRRAB",
            "text": "I love GOOD Chinese food and this certainly passed the test! It was delicious. The place looks really nice too..legit restaurant and of course kosher :) Highly recommended."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBek1EOElBEAE",
            "text": "so-so Chinese food, because its Kosher. So you get what you get, and you don't get upset.  BEST dish for my taste: Singapore Rice noodles with variety of meat in the dis"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdXU3OVBBEAE",
            "text": "We had lunch: nice tasty servings, fair prices. Somewhat slow service. Kosher. We were absolutely satisfied!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcXFibzRBRRAB",
            "text": "Really good fresh food. Glad they provided a fresh fortune cookie and the crackers are great too. Overall I recommend this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMS1QRU13EAE",
            "text": "Great restaurant 👍. I highly recommend it. All the locals go there along with others. I recommend the sesame chicken if you like sweet foods…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMV92WEFREAE",
            "text": "Hot, fresh food with decently priced and varied lunch menu. Gluten free available upon request. Friendly and attentive staff :)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0d0xyUEZBEAE",
            "text": "Love their food and service in general, and especially their Monday and Tuesday night all you can eat sushi special."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMWNQZWpnRRAB",
            "text": "Very pleasant, as always. Staff very responsive to any reasonable request. Ambience pleasant. Food never falls below their high standards!"
        }
    ],
    "reviews_count": 64
}