{
    "name": "Yukka",
    "place_id": "ChIJm-_qK0zywokRRRqGnol2dtY",
    "grid": "BX8",
    "address": "5684 Riverdale Ave, Bronx, NY 10471, USA",
    "rating": 4.4,
    "user_ratings_total": 787,
    "phone_number": "(347) 346-9338",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM1ZFaHlabkJJVmxacVZtNWxWMnhDYVhKV05YYxAB",
            "text": "BUEN LUGAR BIEN ACOJEDOR BUEN SERVICIO Y BUENA COMIDA"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMFlqZGpTV1o1TkZCRVMzUnlUUzFQYVVWVlZtYxAB",
            "text": "Good looking crowd, good looking dishes, good looking art & design, good live music, of course there's..."
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM2RuTnBaRUZ1UnpScVlqaHpNR2xpZGtjM2RrRRAB",
            "text": "First off, the tables are way too close to each other and not to mention, the tables are small, like bartop tables, which inly holds drinks. The prices here are ridiculous but I guess that's the price you pay for gentrified Dominican food. We ordered empanadas which were basically cut in half and tasted okay. The oil tasted more than anything. We ordered shrimp and tostones which was $32 for 5 jumbo shrimp In a bland butter sauce and a handful of tostones. I regretted going to this spot because the food is bland, expensive and lacks flavor and creativity. The service was lacking as well, barely came to check on us. Really just wanted to eat quickly and get this terrible dining experience over with. It was just a chore trying to balance the food on the table in addition to feeling like you were intruding on ghe other table's personal space."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUmRUWkNjWGR1WVhObmFYbGljRTg1VlZSMGVWRRAB",
            "text": "We stopped for an early light lunch after voting at the Riverdale Y. The menu was tempting, we had a delicious Pulpo al Ajillo (flambe) and a Crispy Calamary. Nice and attentive service. Very nice decoration, a well appointed bar with a…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM01tcEliMk5CUVdadVEwMHdVMjB6UkhOWGNrRRAB",
            "text": "Awesome staff, great food and vibrant environment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRlFubzVVVGRqU0VwUlJIVjVkRWxLUTJkMWQxRRAB",
            "text": "Pretty good. The atmosphere is what people go for. Food is good scepter their chimichurri is not chimichurri. It's a mushroom soy based sauce with more of an umami flavor. The waitress was good at pointing it out."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MGIxVkJWekJYWjFGWGFERlhSMGxpVjBnM1FYYxAB",
            "text": "The atmosphere was cool, the restaurant is well decorated. It was very crowded and loud, which is a good sign, but if you want an intimate date night it might be hard to have a conversation. The food was okay, it was tasty but not something extraordinary. Overall happy with the experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWR2VUTkxMVlZtTWpSMlEybE1ObTVEVGtGblkyYxAB",
            "text": "Delicious plates, good atmosphere the only thing is we sit too close to eachother but otherwise fast service and Chef is amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMGFEVmxWVXhCWDE5RE56WjFWRGx5ZUY5NlExRRAB",
            "text": "Great food, service and vibe, good drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNlJqTjNRbE5rT1RBMlJUUkJPRXhWZEY5MFgxRRAB",
            "text": "No matter if I stop by once a month or once a year, this place always hits the stop. I LOVE  IT SO MUCH! I recommend all the menu items as well!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweUxVTkxhVkpPWms1NVJHMUtXa3Q1WW5SWk1HYxAB",
            "text": "delicious！！"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSWEybERUa1JXUlUwd2FHdFdSbWMyT1c1blNWRRAB",
            "text": "Awesome place great music live first time there & it was amazing I love it going back this weekend again 😀 😊 😄"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMlVtY3dWbWRsVm1KdmRYcDVXUzEzY0VONE9YYxAB",
            "text": "I keep coming back those mussels! And drinks"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM29PQkRnEAE",
            "text": "The food was absolutely amazing. I went there last week to celebrate my sister's birthday and we all had an amazing timd. I really enjoyed the churrasco and yuca fries. Their dessert platter when you order from the prefix menu was also amazing. I enjoyed the guava dessert. They make a really great coconut mojito. The staff was amazing. The ambience was beautiful, and very delicious food, and wonderful live music. It's definitely worth the trip if you're in the Riverdale area of the Bronx."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNVJubGphbTlmVTJ0VVJYUkRlblZ4ZEhOMVgyYxAB",
            "text": "I ordered through DoorDash. Delivery was prompt and the food is delicious! Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SVkwNW5SbEZoWlZscFQxaEhkMVI1YzFSa2VFRRAB",
            "text": "Food is delicious and drinks are strong and live music"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemJHODNhalJKTURaeFdEaDVZV2hNT1VKSmRWRRAB",
            "text": "The food is good\nThe service is good\nNothing to complain about\nNothing to get excited about\nThe owner looks around with a creepy stare but never introduces himself nor ask if everything is ok ?\nBut the food is good !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neWIxaENVR2xxZWtoamRWTjZkMnRZTURRMk1HYxAB",
            "text": "Great vibe and great food. Plus attentive service. I bought the family and we truly enjoyed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb00ydFJjSFJ3UTFGRGJtWmlhVnBQVlVjdE5GRRAB",
            "text": "This is a little restaurant but it is very beautiful and well kept. The ambiance is very elegant. The food is delicious! The steaks are perfect but my favorite main dish so far is the chuletas I’ve tried all their steaks and they are all juicy and perfect but the chuletas are awesome for appetizers I recommend the chopped octopus!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSVpuQmFkbHBaT1Y5RlRWZGpVemxIUVc5R05YYxAB",
            "text": "Dishes were imaginative and well thought out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVEyZGxWSFUzTkZJNFVWTkZiRUZ4Ymt4NU9IYxAB",
            "text": "Delicious Latin food & drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMWF6aFNjSGhpU0dWdmIxY3RaVnA1VHpWTmVIYxAB",
            "text": "Good place to have a good time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdlpGVmFkSGhMWVZJd1ZXUnhZMmN4YTNKaFVFRRAB",
            "text": "Good food and good service thank you guys for hosting us"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdmEzVXhhVkZpU1hoTGFtOTBOalJmVnpsNlRXYxAB",
            "text": "Had a wonderful experience here with food, service and ambiance. We were celebrating a birthday and ordered a bunch of different foods. Started off with the calamari, and the mixed croquettas, which were filled with bacalao and ropa vieja. Then we got seafood paella, churrasco, mar y tierra, garlic shrimp, and lobster mac. Everything was amazing, but definitely the star at this restaurant is their paella. Will definitely be coming back for more food and good vibes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKR3I4OGFEck4yU1FBEAE",
            "text": "I cant talk about the ropa vieja enough....sooooooo good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQNms2X0gzaG9lclhnEAE",
            "text": "Delicious food and great service at Yukka! The tuna tartare was the standout—so fresh and flavorful. The empanadas were close behind, perfectly crispy and packed with filling. We also enjoyed the seafood paella, which was tasty and well-seasoned. The staff was friendly, and the restaurant was clean and welcoming. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLanVpTm5CNUx6bW5RRRAB",
            "text": "Great service, wonderful food 👌…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPRGg2dEQyeVpXd0x3EAE",
            "text": "Pleasant experience all around."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeVMyS21LcGMtWWZ3EAE",
            "text": "Well deserve 5 star.  Great food, atmosphere, and service! Favorite plate so far Paella!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMamg0THJ5bWZTaTFBRRAB",
            "text": "I would like to share my recent experience at your restaurant, which, unfortunately, did not meet my expectations. Upon arrival, the host failed to inform me of any time limitations for our table. When I inquired later, I was told that, due to Mother's Day, I should have already been aware of the time restriction. This information was not communicated to me at any point prior to or during seating.\n\nThe manner in which this was handled felt unprofessional and dismissive, and it significantly impacted the overall experience. On a day meant to celebrate and enjoy time with loved ones, I was disappointed by the lack of courtesy and clear communication.\n\nI hope this feedback is taken constructively to help improve the quality of service for future guests"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPamtvdnZQbU9UbDdRRRAB",
            "text": "5/11/25 (Mother’s Day)\n\nI was very disappointed with the service during my reservation at 6:30 PM. We began our evening by ordering appetizers and drinks, intending to enjoy a relaxed dining experience. However, our server approached the table multiple times to inquire if we were ready to order entrées, despite us clearly indicating that we were not yet ready.\n\nOn the fourth time coming to our table, the server informed us that there was a two-hour seating limit. We explained that we had not been made aware of this policy, but she insisted that the host had informed us — which was not the case. When the host came to the table, instead of offering an apology or clarification, she simply stated that the two-hour limit was \"standard time,\" with no acknowledgment of the communication lapse.\n\nTo further detract from the experience, at the end of our meal, the check was brought to our table without any inquiry as to whether we were interested in dessert or coffee. It was clear that we were being rushed out, and despite our visible dissatisfaction, no apology or effort to rectify the situation was made.\n\nThis lack of communication and courtesy from the staff was disappointing and fell short of the level of hospitality one should expect. Unfortunately, I do not intend to return.\n\nDo not recommend…. 0/0 stars."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaFpLSnBBRRAB",
            "text": "OMG, I love it here!!!! The BEST places to go is here and nextdoor, I have a hard time deciding to go in the left door ARNAUD'S or the right door YUKKA, They both have amazing food. I love the Steaks, different in both places, SUPER YUM!!!!!!!!!!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJczQzWTZBRRAB",
            "text": "Awesome !  Very happy with the service and the food  is excellent."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJczRXXzJ3RRAB",
            "text": "Excellent food , affordable price service is excellent , great music and atmosphere . Ángela was great paying attenticion to all details."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLU1YdTBnRRAB",
            "text": "Great drinks, delicious food, good vibes and the friendliest staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJek4yN2VBEAE",
            "text": "We ordered the mussels, they were PACKED with flavor, I was very pleased. The ropa vieja, market salad, and spaghetti were delicious. But the star of the show was the mussles. They give you sliced garlic bread to dip in the broth, will definitely be back for that alone."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3M3JiUWZnEAE",
            "text": "Churrasco El mejor De todo NYC al Punto . Recomiendo choriso con camarones aperitivo . Servicio 1A impecable Recomiendo este lugar 100% Lugar familiar limpio Hermoso."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRblBMQjFRRRAB",
            "text": "My birthday dinner was held here. Great food and drinks. Plus live music. Great night."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aXVpNXdnRRAB",
            "text": "I went this past Friday for the first time, and I loved it. I'll be back soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b05xZVpBEAE",
            "text": "Visited the restaurant as reference however when arriving the best thing was the heater at the entrance. When sitting down our drink request was a passion fruit juice, passion fruit mojito, and a ginger ale. The passion fruit  juice tasted like a Welch passion fruit juice that Walmart sells. The passion fruit mojito taste like mint and the ginger ale tasted like water. When asking the server to switch the mojito no empathy was shown with the discomfort. As plates the group ordered grilled chicken and steak was asked to be well done. Grilled chicken was not cooked fully and steak was not well done. Grilled chicken was asked to be changed to salmon and with no sauce, server asked if salmon should be medium well, well done, etc. (Did not know that the salmon had cook finished.) Salmon came with sauce although it was asked with no sauce. Server did not show empathy whatsoever. Very unpleasant experience as it was the first time and now last."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM0x6NU9BEAE",
            "text": "Prices don't match menu online  everything seems to be about 20-25 % more at restaurant. Appetizers are way too expensive for what they are."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLW9Td1JnEAE",
            "text": "Estuve en su local de al lado! La comida es excelente 10/10 las atenciones, excelentes. Los precios son muy razonables."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNHZPSlpBEAE",
            "text": "Went last night to this restaurant. The food was excellent. The pulpo al ajillo  is a must. I ordered the Mar Y Tierra and my husband ordered the Paella and they were both delicious. We'll definitely be back with friends and family."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHN1NnBnRRAB",
            "text": "My husband and I went to Yukka Latin Bistro for Valentine’s Day, and we had a wonderful experience! The ambiance was warm and inviting, perfect for a special occasion. The food was delicious, with fresh flavors and well-seasoned dishes that showcased Latin cuisine beautifully."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfXzl2OGRBEAE",
            "text": "I recommend the ropa vieja: very good!   The pernil is good too. Great atmosphere and service although pricey for the Bronx."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMUpqUEJ3EAE",
            "text": "The ambiance was great, live band was amazing! Drinks were pretty good and service too! Definitely would come back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaUpyX093EAE",
            "text": "Went on Friday night, and it was packed tightly.  It was busy, that I got a water refill after eating my meal"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzenM2ZVRBEAE",
            "text": "4 stars for food because they close up too early for a weekend. 5 stars if they can extend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbU9IUTVRRRAB",
            "text": "Live music and delicious food, the perfect combination 😋 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNEltdExBEAE",
            "text": "Love this restaurant, great food, good drinks and ambiance. Recommended"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NUxEZFFnEAE",
            "text": "Wonderful atmosphere, Amazing beautiful and professional staff!! I tried  several selections from their menu and I have to say, totally mouth watering! Lobster Mac & Cheese! The grill salmon at T-bone is perfection! Let’s not forget their…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX0l5Y2RREAE",
            "text": "This restaurant seems like it has great ambiance. I went in the middle of the week.. there was only one other party at the restaurant so it was kind of dead. We were a group of 8. We were seated and served immediately. Drinks were good (semi strong not too overwhelming) and they had cool drink options. Several people ordered seafood related food options (surf & turf, paella, lobster Mac). Everyone had mixed options but were mostly positive. Though a few complains about the seafood tasting a bit undercooked (paella in particular). Nevertheless it was a good time. Service was OK, can’t imagine how it would be if the restaurant was packed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNXZ2Z1dnEAE",
            "text": "Delicious Latin dishes and good atmosphere. There's a nice bar here but the real winner are the appetizers. It's basically tapas which I'm not a fan of but they are good portions. My wife ordered the fish croquettes, empanadas, and chorizo and I'm shrimp (in red sauce). I got the baked chicken and .ash potatoes with a side of plantains. I was so full. Will def be going back for another date night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbFllOG93RRAB",
            "text": "This is our third time visiting this restaurant. We celebrated my dads birthday here as we have had good experiences in the past. He ordered the Mar y Tierra which was lobster & steak, unfortunately the lobster claw was not pre-cracked and in order to eat the lobster meat my dad had to put his hands on the claw covered in sauce. Overall it was a struggle that was not worth it. By the time he finished that ordeal, his steak was cold. My mom had the ropa vieja which was good. I had the seafood paella which was good as well. The service was ok, nothing spectacular. My fiancé wanted a soccer game to be played however they never put it on. We also ordered croquetas as an appetizer and they were ok. Tres leche guava was delicious. Overall mixed feelings."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbnM2Z1hREAE",
            "text": "Fantastic place! The food is amazing and the customer service too. I've been there on Fridays when they have live music (not loud at all). AND, no hookah."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhdl9ydU1nEAE",
            "text": "Food takes the spotlight at this wonderful establishment as guests become its audience. Music, lighting, artwork and spacing combine to create what will definitely become a time to remember.\n\nGreat place for friend get togethers, girls night, and even date night."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdTdmSVZnEAE",
            "text": "There was a bit of a issue when it came to my friend and I being seated. The workers sat an acquaintance of theirs before us which was unprofessional as we had been waiting already 45 mins to be seated.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMHR5NVVBEAE",
            "text": "Pretty amazing food up here in Riverdale, I had no idea these places where tucked away so neatly in this part of town. Outside of the excellent food, service and entertainment, I was pleased with their adherence to the covid protocol and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrM3IyeXF3RRAB",
            "text": "Brunch at Yukka was better than what I expected. The food was delicious and the vibe and decor was interesting. The Benedict was actually really good and the mangu with the 3s golpes was also tasty. I recommend this place to anyein the area…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX0xUSnRBRRAB",
            "text": "As always, I’ll rate each category individually because people have different priorities.\n\nAtmosphere- ⭐️⭐️⭐️⭐️ The decor is beautiful,  nice and modern style. Music is played a bit loud for my personal liking but this is considered a positive to some.\n\nFood- ⭐️⭐️⭐️⭐️⭐️ Everything I and my party ate was full of flavor, no complaints. I had the jumbo shrimp al ajillo, I also tried fried calamari, bacalao spread, and dulce de leche from members of my party. In regards to drinks, my ONLY criticism is that the bar does not have soda on tap, it’s canned. This may seem like no big deal to some but it’s a personal pet peeve of mine. I did not have any alcoholic drinks, however the members of my party were pleased with theirs.\n\nService- ⭐️⭐️⭐️⭐️⭐️ The staff is very attentive, professional, and quick on their feet.\n\nSpeed- ⭐️⭐️⭐️⭐️⭐️ No complaints, the time it took for our food to arrive was satisfactory in the context of it being a larger party and on a busy Saturday night.\n\nPrice- ⭐️⭐️⭐️⭐️ Some of the entrees are a bit overpriced in the context of their portion size. For example, the $32 jumbo shrimp al ajillo being 5 shrimps with the tostones making up more than half of the dish seemed excessive. This was also the case of the burger (which was rather small, the fries making up the majority of the meal) as well as the ropa vieja.\n\nOverall a nice place for a date or family outing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkalpMc193RRAB",
            "text": "Been to this place a couple times and it has become one of my favorites in the area. Food is always great the ropa vieja was dynamite and the tres leches was perfection. Atmosphere is cozy and service is polite and attentive."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtLWZHQmlnRRAB",
            "text": "Difiero de algunas de las opiniones de aquí, el lugar es lindo, la atención es buena pero al menos lo que ordenamos nosotros estaba muy desabrido , y de igual forma los platos servidos muy escasos para un precio un tanto alto, un guacamole…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMHZLMEl3EAE",
            "text": "The food is delicious. Drinks are soo good as well. Service was also great. They even offered to change my phone with out me asking. It's great overall."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhX01UQmt3RRAB",
            "text": "This place is very nice, the ambience is great, the DJ was amazing. He was hitting all those great songs that make you want to dance. The food is yummy! The service not the best but they try to make you feel comfortable. I would definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazZMTFZBEAE",
            "text": "Stopped by randomly and had an overwhelmingly good experience. I ordered the pernilito and was angry when I saw that it came with chickpeas. To my surprise, the chickpeas tasted amazing, they were the best thing on the menu. Our server,…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeDhiUUV3EAE",
            "text": "The food is Devine! We enjoyed everything we ordered! Highly recommend!!!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaXBhd2hRRRAB",
            "text": "Excelente servicio.\nLa comida super, el ambiente y la música siempre agradables super acogedor.\nWe keep coming back again and again !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMDlmckxBEAE",
            "text": "I'm glad I came here! Fine and high end Dominican foods restaurant that is a rare find in NYC. Short full carte menu with specialty drinks. And great shot of espresso to end my meal. Sea bass, seafood paella and \"la ropa vieja\" are my usual favorite main  choices. I really like this place."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHRiM0F3EAE",
            "text": "The food is amazing here! You do have to wait a bit if it’s packed like it was when I arrived but the wait is well worth it!\nLa mejor comida que he probado en mucho tiempo. Espere un poco más de lo que hubiera querido pero valió la pena y la espera no se debe a falta de atención sino por lo lleno que estaba el restaurante. Lo recomiendo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcUk3STRnRRAB",
            "text": "Great cuisine with attention to detail.. great staff, on top of their customer service game. The empanada shell was crispy yet not overdone  and pork belly for starters were made to perfection. The entrees, ropa vieja w/ rice, beans and sweet plantains had great flavor and the meat was just right. Black beans had the right thickness and flavor... Finished dinner with a cortadito, latte and guava flan for a great ending."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dHEtNjVBRRAB",
            "text": "Excellent ambience, good food,services,life music, easy parking spots and of course good drinks!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOXNqVldnEAE",
            "text": "It was a spontaneous outing between friends and we were not disappointed. The scene is very trendy, nice chill environment. They have beer on tap. The appetizers were to die for. The guacamole fried queso chips were amazing. When it came…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdlBUdDNBRRAB",
            "text": "Excellent latino fare... I had the Pork...Pernir and the ladies shared a Ropa Vieja... complements to the Chef... we had croquetas as a starter... both codfish and beef left me wanting more... we will be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bS12NXdRRRAB",
            "text": "Excellent atmosphere. Excellent customer service. Order churrasco steak. Amazing. Frozen margarita a tad bit sweet but overall excellent experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NGVDTF9RRRAB",
            "text": "Dining here was a treat. I am happy to have been invited here. I ordered ropa vieja and guacamole. They were both delicious. The waitresses were sweet. The bathroom was very clean. I always use that as a gauge of cleanliness of a restaurant. Bendiciones."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyenZIQ0NREAE",
            "text": "Enjoyed a lovely dinner outdoors for our wedding anniversary at Yukka. Everything was delicious, the guacamole with fried queso Blanco, the bacalao croquettes, the empanadas."
        }
    ],
    "reviews_count": 76
}