{
    "name": "New Riverdale Gourmet Deli",
    "place_id": "ChIJIdDN9LvzwokRkp0eiG8Sfv4",
    "grid": "BX8",
    "address": "452 W 238th St, Bronx, NY 10463, USA",
    "rating": 4.1,
    "user_ratings_total": 176,
    "phone_number": "(516) 440-3355",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbE5XRnNOR3RWZEd0cGVFcFRlbGx5WnpSamQwRRAB",
            "text": "Great  fresh food  always order"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM2JUWTBZMEUzV1V4RmVFTm1WREEzTldGaU4xRRAB",
            "text": "Food is delicious. The Owner and worker was gracious and polite."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcGNXcVFREAE",
            "text": "great friendly in person, delivery and pick up service    clean, stocked, and organized"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLV3g0ZFhCNWVyMG1nRRAB",
            "text": "Not sure what happened to this deli use to be so good and on point only now it serves food that's off...\n1) Mold on napoleon dessert\n2) Hair in my sandwich"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPTzNfNksza1lUSVR3EAE",
            "text": "Bad business when it comes to your hard earned money.  The have prices displayed,  but charge different,  and I mean more. Also depending on who is at the register you don't know what the price will be. Brought the same item 3 times and was changed differently every time.  To me that's bad business"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b2Mya3p3RRAB",
            "text": "Super wide selection of fresh foods as well as other goods.The entire staff is always courteous.Everything they make has always been speedy and fantastic.\nThe menu is so large, there's always something for every occasion and other things you can get later and never be bored."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURmeFpvWBAB",
            "text": "The guys making the food do not listen. Always getting my order wrong then look at me like I have five heads. Overpriced."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aTc3M1JnEAE",
            "text": "Prices doesn’t match with menus on line"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeklHOG9BRRAB",
            "text": "Nice neighborhood deli and very clean and organized inside. I ordered a buffalo chicken wrap but when I sat down to eat it (about 20min later at my end destination) they gave me a turkey BLT. Funny thing is, the guy who made it and wrapped it said Buffalo Chicken Wrap to the cashier. I suspect since I ordered this at 4:30pm they wanted to get rid of bacon from the morning? Maybe too lazy to make an actually chicken wrap? The wrap itself wasn’t bad but sadly was inaccurate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiX29HSy1nRRAB",
            "text": "Well-maintained deli with a professional staff that delivers quality service. The halal lamb over rice is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMDR6NEpREAE",
            "text": "Greatest turkey burger and fries"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb2UyWTRBRRAB",
            "text": "Never had an issue with their food and service until recently. Delivery person was rude, didn’t follow directions on how to navigate our entrance system, and refused to come up to the front door for an elderly person. They proceeded with taking over an 90 mins to finally deliver the food which was cold upon arrival. Never ordering from here again after being a valuable customer for more than 3 years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaU5iakxREAE",
            "text": "Sorry if I'm being petty but I'm a chef and it's a slap in a face when YOU ASK FOR a SIMPLE BUTTER ROLL AND THEY GIVE YOU MARGARINE INSTEAD AND THEN CHARGE 2 DOLLARS .. DISGUSTING!!! 🤢…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdnZxTlNBEAE",
            "text": "The have the best ice creams\nvan leeuwen"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROc19TTHlBRRAB",
            "text": "Over priced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcHI2RjVRRRAB",
            "text": "Poor quality across the board. Waited 2 hours for an order that had no cooking involved and it came wrong."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeXRlQXRRRRAB",
            "text": "First time customer, was there last night and purchased an item in cash. Cashier provided incorrect change. She clearly tried to short change me. Please do better, won’t be returning. Always double check your change customers before leaving the store."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbUs3NzlRRRAB",
            "text": "I ordered from here and the food was not delivered and no explanation was given as to why."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxX0l1VExnEAE",
            "text": "This place is a Godsend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NE5teFpREAE",
            "text": "Been ordering here for about a year and a half now, so far every sandwich I’ve ordered has been on point. No complaints. Coffee is great too 👍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdUpqcWVREAE",
            "text": "Always good in a pinch"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbTVHdWVREAE",
            "text": "Great sandwiches. Italian tuna salad is best I ever had."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN016WTdBRRAB",
            "text": "Yea the food here is delicious I just discovered them on Uber eats 3 nights ago I’ve ordered 4 times. The drinks are great and the sandwiches are delicious. 5 star fr."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bDRpNDNnRRAB",
            "text": "I get they’re trying to get those Fieldston/Manhattan College coins, but not everyone in the neighborhood comes from money or can afford these ridiculously inflated prices for mediocre food and poor service. I’m happy to support local businesses but not when they price gouge."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLThQR0RBEAE",
            "text": "Fresh selection of real deli sandwiches. A mini market with just about anything you could ask for and fresh squeezed orange juice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOXBUaE93EAE",
            "text": "They delivered a smoothie that I ordered in a BROKEN plastic cup. It leaked everywhere and got all over the floor and my clothes. Horrible service. Would not recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdE9PRk53EAE",
            "text": "LOVE IT recommend everyone to go here !!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob2NmMUR3EAE",
            "text": "Best in the area by far"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNl9YSnhRRRAB",
            "text": "I usually buy the same sandwich, Wolverine, honey ham, brie and lettuce and tomatos. It is always very good food and have a lot of other items worth checking out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX0lQUkpREAE",
            "text": "Very pricey for very average food. 😒…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNVpTVUt3EAE",
            "text": "I am so disappointed with the service here. Visiting a friend who frequents this deli with her husband and decided to order for dinner. The sandwiches came and her husband's was smothered in ranch which he is allergic to. Mistakes happen fine - she calls back to let them know of their error, hoping they would rectify it quickly and was first told that she would be called back which was strange but then they said they would send a replacement sandwich in exchange for the messed up one. It's been 30 minutes and the deli is less than a mile away and no sandwich. The first order came within 15 minutes of us ordering. Now that I see some of the reviews it seems they have an accountability issue when they mess up and take it out on the customer. Smh"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOHVMbzFBRRAB",
            "text": "I love this place. There’s great variety and gluten free options"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM0lDODdnRRAB",
            "text": "Deli kings of Riverdale!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLV9iN3VBRRAB",
            "text": "Greek salad is the move!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd3EzbHFRRRAB",
            "text": "Great sandwiches & good staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMTlEUlVBEAE",
            "text": "The service is horrible. There’s a very angry Hispanic girl who works the cash register, she’s extremely rude and off putting. Come here if you like your food overpriced, with a free side of attitude. Otherwise skip and go straight to Jasper’s!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNlptNC13RRAB",
            "text": "Best deli in the neighborhood. Food is always fresh, fast and friendly."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcjRHYUhREAE",
            "text": "Now this is a Riverdal Gourment Deli to go to, very clean and again professional, the people that work there are very nice and fast with there work, and you can basically get anything you want from a deli in there with a nice rangeable price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNU03d0RREAE",
            "text": "THE BEST DELY...."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcE9EOW13RRAB",
            "text": "This deli is perfect from the food to the grab and go options and all the employees are great too!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtci12VGlRRRAB",
            "text": "Liars and thieves. They charged my card, didn’t send the delivery, then said it was “my” fault"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcl9ISm13RRAB",
            "text": "DO NOT ORDER!! …HORRIBLE, if they mess up an order they blame it on you.\nThey charged me for a delivery that never came, then argued with me saying it was my fault. They wrote my phone number wrong and said it was my fault because I didn’t answer my phone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta2FfUUVBEAE",
            "text": "Pricy but convenient"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURld0xtTzlRRRAB",
            "text": "Clean, organized store with lots of good products. Have gotten breakfast sandwiches here and always fresh. The fresh OJ is excellent!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eHRyTlNBEAE",
            "text": "Always there when you need them"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLWItcEhnEAE",
            "text": "Great little deli, family owned.  Very friendly and great sandwiches."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOXR5akpnEAE",
            "text": "great sandwiches and smoothies!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyODZLZllREAE",
            "text": "Best deli in all of Riverdale!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMk0tcFFREAE",
            "text": "I think I've eaten like 20 different meals from this place and I really liked all of them. Quick friendly and good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaXFLaEtBEAE",
            "text": "The best ever"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLX19fXzJnRRAB",
            "text": "Delighted that this deli is in the neighborhood.  It has an upscale vibe without the expensive prices.  The place is clean and neat and recently remodeled.  The team there are very friendly and helpful.  You definitely feel welcome.  The food is delicious and made and packed with care."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdVBXOTBBRRAB",
            "text": "Ordered a few things today and it was all pretty mediocre. Buffalo wings are the frozen kind  that are never good, mozzarella sticks were not warm enough, French fries smelled like peanut butter ( maybe they use peanut oil) but the bacon…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzei03WE1REAE",
            "text": "I love this place. Some of the best sandwiches I’ve ever had. Coming in here buzzed at 2am or later and looking at the menu is usually one of the hardest decisions of my life. There’s just so many delectable options! Riverdale Gourmet Deli offers a superb smorgasbord of splendidly scrumptious sandwiches and snacks. For my money though, I usually go with the ghost rider. I have and will continue to fantasize about that sandwich long after my doctor tells me I can no longer eat them. Also the atmosphere here is lovely. You can sit around the table with the boys and your sandwiches and choose to either watch News 12 or whatever sports game they have on or read from the daily news. A 10/10 deli experience"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvNFpiZ2FnEAE",
            "text": "Great deli for late evening orders. Tons of options inside. We ordered the Batman hero and a grilled cheese with an order of onion rings and mozzarella sticks and they were perfectly cooked. Only drawback was the marinara sauce that was…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwclphYkZREAE",
            "text": "This is my go to spot for sandwiches in Riverdale. Open late night, with the BEST cooks for custom cooking. I always order a New Yorker Bagel with Avocado, Or...Custom Italian Cold Combo sandwich with cucumbers, croutons and vinegar among…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MG9hcWpnRRAB",
            "text": "Completely unacceptable service or lack there of I should say. Ordered from them via Seamless only for the food to NEVER show up. Had to call the deli twice only to be told a delivery was attempted( it wasn’t) and phone called multiple times (it wasn’t) and they would send it out  again. They never attempted a second delivery. I call again only to be told my food is literally sitting next to the man I’m speaking to on the counter delivery was attempted and no on answered the phone. They didn’t even knock on the door let alone call my phone either time these alleged deliveries took place. After 3 hours I gave up on food that should have arrived in 45 minutes from less than 10 blocks away."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwbWVDVjB3RRAB",
            "text": "Giving them 1 star is even too much, I ordered a bacon, egg n cheese. It was terrible! Fried egg?!! With old bacon and no cheddar cheese. For $4.95 😑 the juice I ordered nothing but lemon juice absolutely terrible. If you going to juice a lemon remove the skin first!!! You guys need to step it up for what your charging.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDemV6RFJnEAE",
            "text": "First time ordering through Uber Eats for this deli and everything was outstanding! Most delivery locations have problems getting orders correct, or not following order instructions, but New Riverdale Gourmet Deli sent exactly what I…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdnRTMWN3EAE",
            "text": "Friendly staff and clean. Food is good. Ordered the Mexican Steak wrap with a side of fries. The Steak needs a little bit more flavor maybe some salt and pepper. Kind of bland."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNV9hOEJ3EAE",
            "text": "Love ordering from them.  The guys have such great personalities. 99% of my order are perfect.  That's on a scale of 1-10 a 9 3/4.  Pretty good.\nFast service and very very fare prices.\nHi Guys from C 6"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4cHNDVDVBRRAB",
            "text": "Save your money and buy from a restaurant. My husband and I placed an order Thursday night. Aside from this deli charging restaurant prices we were just glad we could order late night. We ordered 3 steak sandwiches, an order of cheese fries, and a 2 liter coke. The delivery man arrived and had everything but the coke which by the way cost almost $4. We brought it to the delivery guys attention and he said no worries I‘ll pick it up now and bring it back. An hour later my husband calls back and he’s told they’re on the way with your soda. Clock strikes midnight and still nothing so I began calling and got no answer. Friday morning my husband calls back and they say yes we’re going to deliver this morning. An hour passes and still nothing so I call and they say the same thing, we’re sending it. It’s now Saturday evening and still haven’t received the soda. It’s just a soda but I paid for it and should have gotten it, period!! I was a very frequent customer.. I will no longer order from this place!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRazcteVZ3EAE",
            "text": "Best deli ever! They have everything you need for quick breakfast, lunch. They also have a large variety of grocery items, vegan and organic included. Friendly staff and open all the time! Love love love them!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcV91V2dRRRAB",
            "text": "Above average food and convenient long hours of operation. The employee are very nice and tend to recognize their regular customers which is appreciated. My only negative... big negative... is the prices. They charge significantly more for just about everything."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbFpDUTRRRRAB",
            "text": "I love this Deli and come all the time. The sandwiches are yummy and fresh, great smoothies too. Everything always looks clean and the people working there are nice. Best deli in riverdale"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtX2N1MF9BRRAB",
            "text": "I stopped going year's ago, because their pricing kept going up. It's really for all the Manhattan College student's who's parent's pay for everything. They don't seem to care so much about regular people who live around there that aren't…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LTVmVEF3EAE",
            "text": "They would have gotten the other 2 stars if their prices weren't RIDICULOUS. It's like everything is 50% over priced, from the sandwiches to cereal boxes, even fruits!!! I hate it! But, their sandwiches are good and the place seems really clean."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdEpxNnF3RRAB",
            "text": "My favorite deli in the area. Been eating here for years. Breakfast sandwiches are great, but my favorite sandwich of all time has to be The Thing. It's basically thanksgiving on a hoagie, can't go wrong."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndjllMVFnEAE",
            "text": "I've ordered from this place a few times. The first time, they forgot an item but was very speedy. Another time they shorted me by 1 item(I wanted 3 of something, only got 2), but they didn't charge me so it's okay I guess."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaHRmRWpRRRAB",
            "text": "Open late (by Riverdale standards, not NYC standards). They sell beer after most of the other vendors in the area have closed unreasonably early, and they'll even deliver it (hence the four stars); sandwiches and salads are okay (not too…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4NzUzb3BnRRAB",
            "text": "The food is always on point. Our go-to’s are the ghost rider sandwich and the turkey melt. Even when we order delivery, everything is packed with such care albeit I feel bad because of all the plastic but not a thing leaks. And def order the fries, absolutely necessary!"
        },
        {
            "date": "15년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnenJpLV93RRAB",
            "text": "They have the best sandwiches and there is an incredible selection of beers. They have a decent amount of sitting room and there is a T.V. with something worth watching on. If you are hungry it is the place to go."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeWQ3NFJnEAE",
            "text": "If this the area you live in, you shouldn't be going anywhere else for your deli needs. Sandwiches, smoothies, large selection of beverages, large selection of chips. Breakfast, lunch or dinner, always satisfied. Clean and very friendly environment."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNXRYLTFRRRAB",
            "text": "I like the breakfast sandwich though it's a bit over-priced. I'll update the review after trying the lunch-time sandwiches. The store is clean and well organized."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3enFmY0pBEAE",
            "text": "Great selection and prices. I had the ghost rider sandwich which was excellent. The fries are also good. The tiramisu was a little dry."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTNEx5aHB3RRAB",
            "text": "The signature sandwiches are well made and there is a wide variety of them so you never have to order the same thing twice if you don't want to."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwb2JPWWxRRRAB",
            "text": "Definitely the new hero place .Up here in the woods in Westchester cant find any great tasting Italian hero!! fast and great customer service I ate like a baby T-rex when I got home will definitely be going back again they can feed me slow any time of the day"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbHVXYmpRRRAB",
            "text": "This is place is awesome, clean, professional workers, delivery fantastic and prices are incredible cheap, compare to other stores around.  and there sandwich are fantastic."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3d2Y3eTlnRRAB",
            "text": "They add water to fresh squeezed juices. I ordered two large juices and I saw them pouring water first and then adding juice. I used to like this place before it happened."
        }
    ],
    "reviews_count": 78
}