{
    "name": "Malecon",
    "place_id": "ChIJ_1Ip-pbzwokRVj2IwC65d-Q",
    "grid": "BX8",
    "address": "5592 Broadway, Bronx, NY 10463, USA",
    "rating": 4,
    "user_ratings_total": 1595,
    "phone_number": "(718) 432-5155",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pad2RYaGhaWE50VWtnNVNYZDJjRkpzTWxWaWNVRRAB",
            "text": "Delicious food, a bit on the expensive side. Service could be a bit kinder. Overall decent experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Mk4zQTFaRFJRTW5wbFNtOWxYMGt4U1hoVVZHYxAB",
            "text": "The waitresses are attentive and the atmosphere is pleasant. The food is nothing spectacular and a bit overpriced but I would still go again because of the staff and atmosphere."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xka1VEaHJaazVSY1MxbVlqbHBkR0ZtV1RGaFZGRRAB",
            "text": "Keep coming Back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa00zbG9jamhaVkVkT09FSlpVbVZ0UWt4TmQwRRAB",
            "text": "Always hot fresh great service"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPay1PbmRnEAE",
            "text": "Always so much food for the price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eVkwRXhiRTlSTkVaVWN6ZEVOV2huWVc1RFUzYxAB",
            "text": "What a great place"
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVGVtcGlhRlZ5TUROa01qUkxTMnd4WDI4MU0xRRAB",
            "text": "Excelente chicharrón de cerdo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd1FXUmxXbXRYUzBkdlptRmxRVGxNVVZVM2VrRRAB",
            "text": "Not the worst “tres golpes” but def not the best or nowhere near it. The mangu was off texture and bland. I also ordered an oatmeal juice which was totally off. There’s a way better restaurant that’s in the same area hi h is war better quality, it’s called El Tinas, better bang for your buck and way better taste"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdEp2cTRRRRAB",
            "text": "Good food, and good service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWWEzQnBSVE5UU2t0Q2NraDVkMjgzUTB4d2VWRRAB",
            "text": "I am an employee at the Cubesmart at 5740 Broadway and I have to say; there’s two women who take the best care of me the moment they see me walk into the restaurant and for that I am highly appreciative and grateful to be served by those two, forgive as I do not know their names but I plan to visit and learn their names personally. My name is JUANITA and the food here is magical."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM1psZFJibE16VEdJelYwbE5YM0pZUWxab1gxRRAB",
            "text": "Great!!!  food 🥘 and drinks 🍹"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNmJGOTBkR05aUW1wZllrUnZWMUp6WVVaNVIwRRAB",
            "text": "My Brother and I went yesterday he ordered a shrimp soup HORRIBLE and very SALTY ON TOP OF that very expensive ...... he order wasn't what we expected to get ......don't go there"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdVIxSnlhRGhPZEZoRmIyZEpiM1oyTjBKMFNHYxAB",
            "text": "El guatemalteco que atiende un chaparrito, atiende súper mal hasta grita a los clientes!!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSFJrMURZV0UxWVRGd1FuSlBiVE5UVVdjMVNFRRAB",
            "text": "Muy mala experiencia sancocho en un plato normal Wao primer restaurante que veo eso no vuelvo más piénsenlo antes de ir muy mal costumer service 🤦🏻‍♂️…"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc1JtUlRTbFowVTFWcFkyaHdZMUV4VW1KaWRXYxAB",
            "text": "La atención al cliente es horrible, la señora pequeña Dominicana es una persona grosera, no nos escuchaba y contestaba con actitud, y sarcasticamente, ademas de que se pidio un sancocho y no hecho ni una sola carne, pedimos algo mas  y nos dios lo que ella quiso, ademas de que nisiquiera espero a que terminaramos de pedir y saco cuenta dos veces, porque ella estaba muy desesperada en salir de nosotros, no volveré jamas a ese negocio ojala q nadie mas pase por est,  era mi primera vez comprando en este restaurante y fue muy desagradable."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV1prWXRUSG93UVhkVVpVdHFkRTkwVmxNeGRtYxAB",
            "text": "La musica es insoportable y alta.\nUno no puede en su hora de almuerzo comunicarse con nadie porque no mo te oyen.\nMe he quejado varias veces pero no hacen caso."
        },
        {
            "date": "수정일: 4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndVliYXN3RRAB",
            "text": "Excelente"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKZTVrNVBxaXVtTWh3RRAB",
            "text": "Great spanish food 👌 really amazing won't be disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTzA2OVBHb0x6MVZnEAE",
            "text": "First & foremost we got the Cafe con leche. Then we ordered our usual Mangu with huevos Frito, longaniza, & queso Frito. 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZXhtYXVQNnNqOEt3EAE",
            "text": "The best roasted chicken flavor I've had. The favor is by far the best. The meat is juicy and not dry at all"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZUxtNUtDX3NDWmVREAE",
            "text": "Excellent local food near the ocean with beautiful views"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaS1nUEhhM282Z3dBRRAB",
            "text": "Muy acogedor,Buenos precios.Comida exquisita"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSFQyNmlfOTV5S3FRRRAB",
            "text": "Ame este lugar. Su personal muy amable  y se adaptan a lo que uno  necesita, pedí algo que necesitaba tiempo  para prepararse y me resolvieron rápido y con muy buena atenciones. Los recomiendo, su comida fue 100 de 100"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJbkw3WUQxbEtTcEFREAE",
            "text": "Worst Pernil I ever had in my life. It was so dry and a little amount for a $15 lunch order"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdm9pT2F3EAE",
            "text": "Compre un sancocho grande  y me lo sirvieron en un plato  menos de un sancocho pequeño  y  parecía una sopa de sobre de tan aguado y 2 carne pequeña  no lo recomiendo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNDVPRDh3RRAB",
            "text": "Pricey"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaDVQUGp3RRAB",
            "text": "Tasty as per usual. We got the combo platter with the grilled pepper steak and chicken, which was enough to feed two. Service and attentiveness was wonderful. Would come again for a quick bite!\n\nALWAYS get the fried sweet plantains. They’re delicious every time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b3J6X0xnEAE",
            "text": "Whenever I’m in town I have to get my fix, the CHICKEN AND THE GREEEN SAUCE IS LIFEE"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MUxPQU5REAE",
            "text": "El peor restaurante que yo e podido ordenar comida. Pedí un mofongo de chicharron y la base con queso y chicharrón. Solo me llegó la Base osea la bola de plátano y ensalada. Y el Chicharrón???? Entonces ustedes cobran $27 por una bola de…"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcDctc0dnEAE",
            "text": "Primera ves k me sale tan mala la comida el sancocho esta malo el chicharon de pollo tanbien estaba malo la abichuela esta mala solo el rabo estaba bueno y el aroz."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd2ZidTlBRRAB",
            "text": "If it is always full and you see people waiting, that should tell you something."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDdTQ193RRAB",
            "text": "Hemos venido varias veces a este lugar, pero esta última vez vine a comer por mi cumpleaños y resulta que hemos pedido una “Paella” como Vera en la foto parece estar llena de mariscos, pero cuando comimos la parte de arriba que íbamos a buscar dentro del arroz solo era arroz amarillo sin ningún marisco ni nada en absoluto.\n\nLas paellas son un poco de arroz abajo y arriba full de mariscos. En las fotos se verá que las primeras fotos luce espectacular… solo 3 langostinos, media cola de langosta pequeña, y disfrazado de calamar y cangrejo sin nada de masa. Con unas muelas flaquitas. Si miras el plato full de arroz amarillo. Sin nada de mariscos adentro, pero el plato que tienen en el menú es muy diferente.\n\nLlamamos al Manager para hacerle la sugerencia de mejorar el servicio y jamás quiso ir a la mesa a mirar ni a escucharnos, nos pidió que fuéramos a la caja y cuando llegamos lo que dijo es que estábamos reclamando para no pagar… nos insultó sin justificación porque dijo que el vio que el servicio estaba bien sin ni siquiera alejarse de la caja. Nos trató con mucha grosería y los demás empleados que estaban del lado del mostrador lo que hacían era burlarse y apoyar lo que decía el manager como si nuestra intención era no pagar el servicio. Nos trajeron una cuenta de 63 dólares en lo que era un servicio de 50, que teníamos mas que sobrado dinero para pagar…\n\nEn definitiva, si es tu cumpleaños o quieres llevar tu familia a comer, este no es el lugar ideal. Vas a pasar un muy mal gusto si tienes que reclamar el servicio."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN1lEZHl3RRAB",
            "text": "I ordered fried pork, rice and beans. The pork was tasteless, dried and hard. The waitress gave me several sauces to help it, however,  nothing worked. I could not eat it and they still charged me. Needless to say, the food was pretty bad and still have to pay for it. I barely touched it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnemZfRWtBRRAB",
            "text": "Food always good"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOU5yUEh3EAE",
            "text": "Regular"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNDcySUt3EAE",
            "text": "I told the lady I wanted lunch special and she bring me back a big plate and then on top of that the food had no flavor the one in manhattan is 100 times better"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaWF6blhBEAE",
            "text": "Food was great. Although the buffalo chicken wing were tiny, but good! Had Sancocho and should have been served in a plate bowl, but was very good. Coronas were ice cold, yes!!\nGladly gave 18% tip. Can’t wait to go back and try other dishes😋"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdmZfaEd3EAE",
            "text": "The food is good, but I can only give it 3 stars because my experience has been hit or miss. I've ordered multiple times, and while sometimes the pernil is fantastic, other times it can be quite dry. The “víveres” also lack salt on occasion. There are moments when the meal is amazing, but there are also times when it falls short. On the bright side, the portions are always generous, and the staff is really friendly!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd2V2ZXNBRRAB",
            "text": "UBER EATS ORDER; Before ordering from here If your item isn’t available, make sure that the courier or the restaurant cancels do not do it on your end. Restaurant in courier refuse to cancel and said that I needed to and when I did, I ended up being charged $50 for something I did not receive and they did not have. Uber Eats will not, absolutely not refund you."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2FTQ3BnRRAB",
            "text": "Excellent service"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma0lhMElnEAE",
            "text": "Take seemed to be better for me but dine in service was ok.  Had the chicharron de pollo and yuca. The yuca is excellent."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dC1yRUZREAE",
            "text": "I ordered Pernil a whole 90 dollars for my Christmas dinner and sadly we go to open it up to serve and it’s MADUROS!!! I will be coming the day after Christmas to fix this— this is unacceptable\nSo lesson to everyone out there CHECK CHECK CHECK because they clearly DONT! IT SAID PERNIL ON THE BAG"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b192bVNREAE",
            "text": "I was a my mami wake and it was a Monday night. All those who stood to the end were invited to eat. Malecon was the closest restaurant. The food was good. The place decor was nice and the location was clean. When the bill arrived, i was delighted that the bill was not high. I will definitely return."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b3MzbUN3EAE",
            "text": "Marcelino needs to be fired! Horrible customer service. He has the nasties attitude and hangs up on customers. The man can not do a thing and has no clue what he is doing. How he is employed is beyond me. That man is useless. He tells you call for Valentino, then oh I don’t know when he is coming. You ask for a manager and he hangs the phone up. DISGUSTING. I was supposed to use this restaurant for events for my company ABSOLUTELY NOT!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcHZ6UlN3EAE",
            "text": "The location is very convenient, but parking can be a problem. The place is pulsating with energy and aromatic smells from the kitchen. The service is quick and efficient. I catered a large party with Malecon and I was not at all disappointed. The food arrived at the expected time, hot and delicious, the chicken was moist and mouthwatering, the rice and beans was incredibly tasty and full of flavor. I will definitely use their food to host another party. Malecon is a great place to cater your party. I was very pleased."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d2R6OU1nEAE",
            "text": "King of the rotisserie chicken, steak w/onions and sanchoco. My go to when the area. Can't go wrong. Come hungry as portions are large."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Z3ZxNy1nRRAB",
            "text": "The Best!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYa3ZyN2pBRRAB",
            "text": "The food was delicious,  the rice & stew red beans so good  even order extra to go home. 10 out 10 for the food.  The service was  fair. As we entered, that was a line no one acknowledged us again. The bathroom was  not clean. Very crowded."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa3JHeWx3RRAB",
            "text": "Possibly one of the best Spanish restaurants I've ever been to. As soon as we walked into the door we were greeted with a friendly smile and seated instantaneously. I appreciate how fast the food came considering the countless number of take-out orders.\nAs for the food, it was delicious. Juicy, tender, well-seasoned chicken that hits the spot. Mondongo soup comes hot and satistfied my cravings. Everyone left the restaurants happy and with a full belly. Highly reccommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEM2V1LTBBRRAB",
            "text": "Wanted a Bistec \"steak \" but Lady said only Carne de res. Got me confused 😕,. So I ordered chicken mofongo,. Later I checked the menu and they do have steak mofongo. Shrimp didn't explain well SMH. The food was Good and tasty 😋 I'll come back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNXVLY3hnRRAB",
            "text": "Comida muy sabrosa y servicio excelente, tanto en inglés como en español.\nVery tasty food and excellent service, both in English and Spanish."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcEtMcktBEAE",
            "text": "Decided to place a phone call for delivery. Order the churrasco (well done) w mashed potato, bistec encebollado w tostones and 3 patelitos. The churrasco came pink inside & mashed potatoe was bland. The tostones where hard. I ordered 3 pastelitos for my nephew one of the chicken pastelitos had a bone inside (very unsafe)  Asides from the food there customer service was horrible.when they answer the phone they immediately put you on hold and when they do manage to answer 5min later they have the audacity to have an attitude and rush you. I’m super upset it’s my birthday and this was not it!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBazRpR3pnRRAB",
            "text": "One of the best rotisserie chicken around the city if not the best, I have been to this location multiple times and the flavor is always the same. The side orders are a wide variety and great taste. The only downside is the parking as all…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaDdQT1N3EAE",
            "text": "Tasty food, bring your appetite, the portions \"son generosos\"!\n\nWhether you are in need of feasting on pernil, mangu, mofongo, chicken and rice or simply café con leche. The fruit smoothies/batidos can be made with milk or water.\n\nIf you drive here, finding parking can be a challenge, you have been warned!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbjR5ZUxREAE",
            "text": "Great Atmosphere, clean inside everything looks good, didn't liked the rice, was dry and the salad needs a little flavor, enjoyed the chicken  and plantains, tamarind drink was excellent and forget about the tres leches,,,,is to die for, jaja"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb1l6M1Z3EAE",
            "text": "I've been going here since I was a kid and I can say, I love eating here. It's my favorite spot to get rice and beans. I love the salsa Verde too"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdjZtYWhBRRAB",
            "text": "Malecon is a staple in this community when it comes to authentic spanish cuisine. They serve you bread as an appetizer and the portions are more than enough you’re going to need a TO GO box trust me ! I recommend the Lemon Chicken w/ Mashed potatoes ! Never Disappoints 🥹"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOGVHMlJnEAE",
            "text": "I haven’t been here since 2007 and all I can tell you is that the food is still the same as it was the last time I came here.. PHENOMENAL… and the Gentleman who took my order was EXCEPTIONAL…the Rotisserie Chicken is on point as well as the Red Beans and White Rice.. if you happen to be on W 231st in the Bronx.. you most definitely need to stop by…🤩🤩🤩🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcWZlcXJRRRAB",
            "text": "Roast pork with yellow rice and pinto beans. Everything was delicious.  Service great and welcoming atmosphere."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURna0xLYXhnRRAB",
            "text": "Good food!! I particularly liked the fried green bananas (plantains). The mondongo reminded me of Papaitan dish back in the Philippines.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cTZxSnJBRRAB",
            "text": "Food was amazing portions big... $$ but worthy! Sauté liver a must go..."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNUtieHB3RRAB",
            "text": "I have been eating at this Malecon since they’ve opened. Their prices have become absolutely ridiculous (even considering inflation). I ordered a large beans and rice (no meat!) and was charged $26.\n\nHe estado comiendo en este Malecón desde que abrieron. Sus precios se han vuelto absolutamente ridículos (incluso teniendo en cuenta la inflación). Pedí frijoles grandes y arroz (¡sin carne!) Y se cobraron $26."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzaUotRHdBRRAB",
            "text": "The Food was excellent!!! 😋The staff is  amazing very friendly and professional Thank you for your service.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cEt6Tm13RRAB",
            "text": "As always it was so good. Mofongo wasn't hard it was soft almost creamy with each bite, tostones were fresh off the fryer, steam coming off each bite."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c1p6TUdREAE",
            "text": "Food is fresh and delicious. Service was not great but will come back for the food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOHVEaG9BRRAB",
            "text": "I order small sancocho. It was delicious and so fulfilling. I think the rice is too much  though."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwbnJyVW9BRRAB",
            "text": "The chicharon and queso blanco mofongo is heavenly! As well as the mondongo is to die for!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBazdtNWdBRRAB",
            "text": "Consistent Quality that I reccomend highly.  They always deserve a good 35% tip."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbHVyMUJREAE",
            "text": "The place was clean the waitress was professional and the food was exquisite!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNC1IanRRRRAB",
            "text": "Amazing food. The mofongo con camarones is bomb and the place is great for family, a date or just to chill. I def recommend it."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2enRuV3lBRRAB",
            "text": "Exelente lugar., toda la comida muy sabrosa., personal muy amable"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMmZDT09nEAE",
            "text": "Hace años la comida era mejor, tal vez cambiaron de cocinero o quien sabe? Uñtimamente está muy reseca especialmente el arroz y el pollo, los precios están ridiculamente altos por la porción que dan ( a pesar de la inflación ) y la señora…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc29QVGF3EAE",
            "text": "My mom catered some food for Mother’s Day and they didn’t even give her what she ordered. She only only chicken, rice, and maduros. They gave her like 6 platters and charged her 300$. A bunch of food she didn’t even order and they totally took advantage. I’m so mad she went there. For the rest of my life I will tell everyone I know to never step foot in there."
        }
    ],
    "reviews_count": 73
}