{
    "name": "Moon Star Grill Restaurant",
    "place_id": "ChIJozTLWqDzwokRiBdsO5GQmIU",
    "grid": "BX8",
    "address": "3519-25 Johnson Ave, Bronx, NY 10463, USA",
    "rating": 4.2,
    "user_ratings_total": 145,
    "phone_number": "(718) 432-2570",
    "reviews": [
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFYzQXlWVTR0VFU5eGVWRkZNM0J0ZUZGMmFWRRAB",
            "text": "Cloudy pho broth. Looks like dirty dish water with things floating in it. They served me old Thai iced tea (it was slimey! Bacterial growth?). Even though they replaced it and made a fresh batch, that was disgusting. This restaurant is not inviting or comfortable inside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYTNvUEdKN3N5N0JnEAE",
            "text": "Our go to place in Riverdale.  Great Peking duck.  Spicy or not tasty Chinese food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJYW16OHU0M29DUnF3RRAB",
            "text": "Me and my friends decided to go try out this restaurant because it’s one of the few pho places around the Westchester -Bronx area. When we got there, there was only one other couple eating in the restaurant which wasn’t a problem, but the ambience was very odd. The lights were very dark so the food doesn’t look very appetizing even under a camera. They were playing very low Massage ASMR type music that made you scared to even speak because you seem so loud . It sucked to have to whisper after not seeing my friends for so long. My friends and I are African so our parents are adamant on respect so we use all of our manners, please and thank you, etc. Everything was going well until after we ordered appetizers and my friend and I who don’t eat pork realized that my appetizer platter that I ordered came with pork. As soon as I realized, I got up and went and spoke to the older lady at the front desk and told her like” hey due to religious reasons, I don’t eat pork. is there anyway we can just switch out The pork items with a non-pork option so the spring roll for a vegetable spring roll and the spare rib for a chicken sate. I even apologized and said it’s my fault for not triple checking before I ordered. Pork is one of the cheapest meats in the world and I think the spare rib plus the spring roll maybe cost them $.50 in total because it was one piece each. When asking for an alternative the lady kept saying oh “it’s already made” “it’s ready”, “what do you want us to do?” I kept telling her so you want me to eat it and it’s against my religion like I’m confused. Another younger lady joined her and I told her the story as well and they continue to tell me that EVERY restaurant has pork in their appetizer and I should’ve known that about combination platters. I said I’ve never been to this restaurant, but I do go and frequent other restaurants a lot and not every restaurant has pork on their combination platte.  I’m proud that I stood up for myself and told them that to their faces because it was the most awkward situation ever. I felt like I didn’t even want to eat there anymore and just out of place. Honestly, it was just an odd experience.  This back and forth went on for at least 10 mins before they agreed to switch out the non pork items.\n\nThey were on the phone harassing people for tips and even asked me one when I was paying my bill. They asked me if I was gonna add my tip now or tip in  cash. I always tip but it is not mandatory especially when there’s bad service and even even then I tipped them five dollars out of the kindness of my heart.\n\nThe chicken & beef sate were good . The spring rolls and calamari had an overwhelming old oil taste. The pho bo was decent but lacked a lot of flavor as you can see from the color . You have to doctor it up and they are cheap with the condiments too like oyster sauce and Sriracha. The Thai lemon iced tea was very good ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJek9XWHZnRRAB",
            "text": "Omg went here with my boyfriend for the first time. We had the beef curry and Mongolian beef, with pork dumplings. Food was to die for and obviously fresh. Everything came out quick and the service was perfect. Cheap too! This wont disappoint."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aXByMnZRRRAB",
            "text": "Food was ok nothing special. It was fresh and not greasy but it was still missing flavors. Nothing to write home about. Spring rolls better than entrees. Pineapple rice had canned uncooked small pineapple pieces in it. It was really plain. Ginger chicken was soaked in a broth and looked like slop. The description made you think you’d be eating more appetizing food. Disappointed beyond words."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM3FPRy1RRRAB",
            "text": "Never received my order.  The doordash app was selected for pickup and I wanted to delivered.  The store will not accommodate me so I never received my order."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncmJQX05BEAE",
            "text": "Very good food never disappoints"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cTRXdkVBEAE",
            "text": "We go here regularly.  The staff are lovely.  The food is always excellent and prices are reasonable for the area.  Our favorites are the Kung Po Chicken, Pho Bo soup, beef scallion pancakes and the homemade dumplings are all delish.  If they say something is spicy... they aren't joking.  But they will adjust spice if you ask.  Honestly deserve the five stars."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM2ZDZFF3EAE",
            "text": "An undiscovered gem. Haven't had a bad meal in 4 visits. Run, don't walk"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNGJ5ZDR3RRAB",
            "text": "I wanted to give this place the benefit of the doubt despite the weird reviews. I got the hot basil lunch special and summer rolls. The summer rolls were ok, it was my first time ever having them so they may just not be for me. As for the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bWFtbDFnRRAB",
            "text": "We are regulars here for dine in, delivery and take out. The food is high quality, very fresh tasting and flavorful. The staff is very kind and thoughtful. They are mindful about waste so they ask if you will use certain items and I love that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3XzRUX01nEAE",
            "text": "Excellent food, perfect service, quiet and nicely decorated."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dGN2NXdRRRAB",
            "text": "This place deserves to be packed, but you can always find a table. This place does great to go service, but it is worth it to come down and experience these dishes fresh. One of the best Asian places I have been in, with delicious and authentic dishes with fresh ingredients you can taste. Everything is quality and everything is delicious. Highly recommended!  Try the pho, the duck and my favorite, the country pork."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMXAya3pRRRAB",
            "text": "We ordered from Moon Star Grill recently and we were not disappointed at all. We had the grilled pork chop, which was yummy! The general tsao and sesame chicken and the curry chicken all of which were tasty and delicious!  The food traveled well it was still hot and the flavors were mouth- watering. The service was excellent and there was plenty of parking as well. We will return for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHFDdGpnRRAB",
            "text": "The food is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNDdmeFVBEAE",
            "text": "This place has very nice food. If you like onions, must try Mongolian Lamb is very very delicious. So as Eggplant with ground pork."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bzdmM2pBRRAB",
            "text": "Shrimp fried rice. Delicious. Friendly establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMExQOWFBEAE",
            "text": "There are three places on Johnson Ave. that serve Pad Thai: the Japanese and Chinese restaurants and Moon Star grill.  This is by far the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbU95WWd3RRAB",
            "text": "Good pan Asian selection of food. Service is efficient, attentive and pleasant. Prices are very reasonable and food is tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5enF2QW5nRRAB",
            "text": "I've been there a handful of times with mom. We love the food and staff. They are very welcoming and nice. The food is so super delicious.  I have taken my Dad and his wife who came to visit last December and they as well enjoyed the food. Two weeks ago I had a cousin in town from Florida I brought her here to eat. I was was recently there this past Thursday with another cousin who was in town from Florida. She really liked and enjoyed the food here. She can't wait to come back again. This is definitely my mom's and myself go to spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cktxYVpREAE",
            "text": "One of the best of the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNU5iRWN3EAE",
            "text": "Look the food is decent compared to Chinese takeout. However, portion sizes are small for a price. Lunch special is 10.89 for certain items and the portion size of the meat is half the container."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bWJxNG1nRRAB",
            "text": "I go here for the pho,  so far the has been yummi, I would like the broth hotter in temperature, other wise no complaints.  The place could use some remodeling."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cUptUTVRRRAB",
            "text": "I ordered off uber eats, i was very upset that they didn’t give me chopsticks .. when I order from a ASIAN restaurants i’d expect chopsticks, not a spoon and fork… but when I tasted the pho none of that even mattered anymore ! this was the best one i’ve had . the broth wasn’t sweet which I REALLY liked, It had really good flavor and all the topping were fresh . They also gave this red sauce which wasn’t spicy but still tasty ! I will definitely pay them a visit ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROd3U3VEV3EAE",
            "text": "The food is ABSOLUTELY EXQUISITE & MOUTHWATERING!!!!! The service is wonderful & they are always so pleasant!!! I most definitely recommend this lovely place to eat!!!!!😋😋😋😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROLUxiWDNRRRAB",
            "text": "Nasty food , poor customer service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdFpiekdBEAE",
            "text": "The sautéed chicken with string beans and the Vietnamese Fried Rice were very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWd0lHQktnEAE",
            "text": "We use to order from here when we lived local a few years ago.\n\nThe General Tsos chicken was quality, much different than other establishments.\n\nMaybe it was costly because now they're no different and this will probably be the last time we eat if we're ever close."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjc0tXVmxRRRAB",
            "text": "Food is delicious and the staff is friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXAyd0p3EAE",
            "text": "I highly recommend avoiding this establishment.\nWe spent $60 just to throw it away and order pizza instead. Cold, soggy and severely lacking in flavor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGOHBpU0dBEAE",
            "text": "I have ordered food from moonstar grill on Johnson Ave. for rmany years for take out/ pick up. I have noticed some very disturbing changes in the food I came to enjoy, particularly the spare ribs which would always order another dish. The last couple of orders were either poorly prepared or over cook vegetables. The spare ribs were dry and.chardonce and the most recent order.the ribs literally was a order of bones there was no meat to bite into. I am saddened because moonstar was my go to place for when I wanted Asian food. I don't live close enough to return it , I just will not order from them again. I gave 2 stars  1 for flavor and 1 for the bones. The two dishes was over $25.00  and didn't  call them to complain  because when I did before the women started talking fast and loud were as I couldn't get a word in. I'm Done!! The ribs had drastic change they used to be so good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGeGZmVEtnEAE",
            "text": "Solid option for Asian food in Riverdale. Service was nice and professional. Menu has many options. Would visit again when in area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNjRyVzRnRRAB",
            "text": "Amazing high quality Asian food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MGEtYzl3RRAB",
            "text": "Ordered delivery here at least 40 times. The food quality is consistent and reliable. Highly recommend the red bowl noodle soup with beef and the pecking duck with bao. The prices are a little high for the amount you get but worth it for the consistent good food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaV8tSmhnRRAB",
            "text": "Terrible. Ordered the tofu + steamed vegetables for pickup. The tofu wasn't even prepared, practically raw tofu in a box. I usually don't leave reviews but that was the worst meal I've ever had."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM29DVlF3EAE",
            "text": "Great food, tastes really fresh!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4djg3UWNREAE",
            "text": "This restaurant has acceptable food, but the crystal shrimp dumplings were a bit tough. The bun xao (pad thai) was acceptable, but the flavour could be more flavourful."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwZ1ozR0V3EAE",
            "text": "Delicious food, including some dishes I haven't seen in other restaurants. Cumin Chicken (Beef, etc) is one example.  I appreciate Moonstar making my entrees with lower sugar or salt when requested."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM1BIR2N3EAE",
            "text": "Food was soo good and so fresh ❤️ I absolutely loved it !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaUxtWTl3RRAB",
            "text": "Seems like a small thing but I just stopped by for a wonton soup. This is fairly simple soup that many places get ver wrong. Moon Star Grill the soup was excellent wontons were perfect as well as the broth. Will be my go to place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCejV2M2RnEAE",
            "text": "Our go-to for Chinese food.  Fast delivery and the food always tastes good.  We usually order general tsos/Sesame chicken along with chicken and broccoli with garlic sauce.  The food isn't greasy, and the prices are decent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMGFYQmJREAE",
            "text": "I went there with my parents for dinner. The food was delicious, & the employees were respectful as ever. I love how they have hand sanitizer at the tables you eat at. How they clean the tables very well after someone is done eating, & leaves it great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcnUyYWJBEAE",
            "text": "Nice place  and nice lunch specials too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX09xUzlBRRAB",
            "text": "I've had better Chinese food in shopping malls in Michigan. Disgusting. I ordered five dishes (spare ribs, Pad Thai, shrimp summer roll, pork fried rice, shrimp and broccoli in ginger sauce) and threw them all out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdnZMWEZREAE",
            "text": "Outstanding food. Three of us were there for lunch and each dish was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcU9PVDN3RRAB",
            "text": "Chicken with string beans and beef with string beans.  Way too sweet.  If I wasn't  starving I would have thrown it out.  Couldn't finish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcU5hYkxBEAE",
            "text": "Not a good experience with their food👎🏽…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtZ1BDYTVRRRAB",
            "text": "Best Asian food I’ve had in New York. Their dumplings are my favorite !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMV9Hal9nRRAB",
            "text": "Great Beijing duck"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlemJMUTBnRRAB",
            "text": "We ordered Thai...maybe we should have had Vietnamese. It was ok. Good service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMk9ubGtRRRAB",
            "text": "Recently ordered food from the establishment (and I use the term “establishment” loosely). The weight for my food was about 10 minutes. I found that odd since there was no one else in the restaurant not even sitting down to eat and it look like someone pulled the fire alarm. When the rude buswoman brought my food I asked her if I could have extra Duck Sauce and she replied “how many are in bag”? I felt around and felt one or two and told her as much. She then went and get back to get more and then wanted to give a speech about how they already give enough duck sauce. I told her I spent over $11 on my food  so why is it you are  acting like you are putting your career on the line to give me a few extra packets of Duck Sauce? She then reached in my bag and pulled out a small red container and said “look we give you hot sauce and it’s homemade!” I informed her that I didn’t ask for a hot sauce I’m asking for duck sauce and then she went and snatched the hot sauce back out of the bag and THREW a single packet of duck sauce in my bag.\n\nLastly, they had the nerve to ask if I wanted a fork. How was I supposed to eat the food, with a spatula?!?\n\nI have never been to an establishment where I’ve been treated in such a manner. You could feel the racism in the air. I would never give this raggedy hole in the wall a dime, again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4em9YVTN3RRAB",
            "text": "As a first-time customer, I was very satisfied with the quality, taste, and timeliness of our delivery order! I appreciate finally finding a local restaurant with good vegetarian options with a variety of fresh vegetables and generous…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOHFycC13RRAB",
            "text": "If you're a sesame chicken fan like our family is, we'd suggest you stop by Moon Star restaurant. Their chicken was lightly battered and fresh. What made it even better was the short wait time. The staff was friendly and attentive to our…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaS1TVk1nEAE",
            "text": "Terrible food served on paper plates and plastic forks. It was freezing cold inside and we had to eat with our coats on. Food was very bland but server was nice. It was a weird place. Won't be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM0pubjRBRRAB",
            "text": "It was a very nice restaurant.  Our waitress was lovely and helpful and everything we ordered was above average."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbWRhYmR3EAE",
            "text": "Our first time ordering from this place. Spring rolls dry an tough to bite into. Seemed to be stuffed with pork and nothing else. The dumplings were too thick dumpling and dry.\nVegetable fried rice was good. Lots of veggies and shrimp. Mango chicken was okay. Chicken was over cooked.\nCurry Bo not spicy and could not taste the curry.\nOrder did come with chopsticks or napkins. The 3 sauces could not be identified,\nDisappointed,."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURld3FhcWtnRRAB",
            "text": "Seems like it might be better to dine in, as everything had potential but didn’t travel well. Everything was cold and tasted like it had been sitting out for a while, all the meat was super chewy. Carrots and peas were raw in the Mapo tofu, one tiny chunk of pork in the entire container. Need to try this place in person and give it another go but in no rush at the moment."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNazRLMmp3RRAB",
            "text": "I've only ordered delivery, haven't been in the physical location, but we were so happy to find a good Chinese takeout place after moving into our new neighborhood! I grew up eating in Chinatown with my family every weekend, so I'm picky about my Chinese food, and takeout is different from authentic Chinese cuisines, but I still enjoy GOOD takeout! I never even used to order from my previous local takeout place because it was flavorless and poorly cooked. Moon Star is really yummy though. It has more fusion options which is cool, in addition to the classic Chinese American takeout dishes, and it's all really tasty! Haven't been disappointed by a dish yet. My favorite is the spicy eggplant with pork. I love it when it's done right, and they do it right!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeUlIVVpBEAE",
            "text": "Best food in the area. I rather pay a few extra dollars for this quality delicious food. Excellent customer service. The girls at the front are always helpful and respectful.  The place looks clean and has a good energy. Everybody looks like they get along (team work). I order food almost every day for my workers. Totally a win."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5MjRiMWVREAE",
            "text": "5 stars for sure. This place has very high quality food and service. We had the beef wrapped in scallion pancakes, ribs, general tsos chicken and a shrimp salad. Everything was incredibly delicious and gave the impression that we were…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpamFHa1hnEAE",
            "text": "The food was super hot and fresh. The pork dumplings are the best around. Seriously I may bathe in the left over dipping sauce.\n\nThe pad Thai could desperately use more sauce, but the veggies were fresh and crunchy.\n\nCurry soup is tasty and flavorful with the perfect amount of spice. Those dumplings tho... get yourself some of those dumplings. Put them in your mouth.. you’re welcome.\n\nDumplings."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbnB5SGxnRRAB",
            "text": "Had a takeout from the Moon Star for the 1st time tonight, and it certainly won't be the last.\nThe quality of the food is excellent, not too oily and not too salty from an…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMnFIOUJnEAE",
            "text": "Moonstar is a perfect place non-run of the mill bit to eat. This Vietnamese restaurant, serves tasty, made to order meals that are heavy on the rich flavors and stingy on the grease.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPM3NlWFFREAE",
            "text": "Wonderful Vietnamese cuisine. Ho fun is my favorite noodle; bo loc lac my favorite entree. The family proprietors offer welcoming hospitality. So glad they made it through."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhN0pUWUl3EAE",
            "text": "Amazing food and service! Food came fast and hot, our drinks were refilled consistently, and the servers wore masks. Bathroom was clean and staff was very polite :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbV9DcXJ3RRAB",
            "text": "Excellent food, friendly & accommodating staff,  reasonable prices.  I've been eating here since the current people took over. Always tasty and enjoyable."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaDZfcjhnRRAB",
            "text": "Nice environment. Quick service. Kids love the chicken and broccoli. I like the noodles with chicken or pork. Love the summer rolls. Very consistent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eE5DYlNREAE",
            "text": "The food is great, it has flavor, and is healthy. The service is great, very polite waitress. Very relaxing place to eat. Highly recommend this  place."
        }
    ],
    "reviews_count": 68
}