{
    "name": "Palace of Japan",
    "place_id": "ChIJgUQiB9_zwokR7QfKkUuEzzU",
    "grid": "BX8",
    "address": "3505 Johnson Ave, Bronx, NY 10463, USA",
    "rating": 4.6,
    "user_ratings_total": 237,
    "phone_number": "(718) 543-8833",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTFdGTlhRbGxCTUdkM04xWmlibEJqVDNWUWNtYxAB",
            "text": "The service is good and the food is delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVmQwSjFOMkZyY2xsaWEwaEZiRGxIZWtGalVHYxAB",
            "text": "This was the first time I tried this place, and unfortunately the last. The service was great, but I ordered the Shoryu Ramen. The taste was okay. At best, 7/10. However, 30 minutes later, I experienced major diarrhea. I have eaten ramen in several other Japanese spots and never experienced this sort of reaction.\n\nFlame Sushi in 231st doesn't have the best ramen, but it is overall the better restaurant."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemMzWnhiVWsxVjB0cVkwTXpUamx3YUVSSGMxRRAB",
            "text": "Love this place - has been my go to spot in the neighborhood for some time now. Excellent service and the drinks are amazing. The layout of the restaurant is also very spacious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bd1lVSkhNVXBpYlhKYVVXbG5UWGhZYmtOaVdrRRAB",
            "text": "Order three rolls and they were really good.   Service was friendly and very efficient."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQmFYcFdkMFo1U21SeFRsOXJSWFl6Y1VJeGVVRRAB",
            "text": "Went here with two other people, overall it was a nice place. I got the sushi deluxe and it was an assortment of different sushi and overall all of the different pieces tatsed pretty nice. Immediately after we ordered we also got some miso and a basic salad, which was convenient because our actual food took quite a while to come out. All in all a good spot for a casual meal but nothing special."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMWFFSkxVMUIyY1VkRmRtTTRTRWw2TjIxaGFFRRAB",
            "text": "The best leeche martinees"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeFNVdFZNRTU1Vkc1ek9FVmZTVUZaV2t0c1pXYxAB",
            "text": "Affordable, tasty and excellent service. Perfect for a weekday dinner"
        },
        {
            "date": "4달 전",
            "language": "ja",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVF6Rk9hakZyWWtWRmVIRXhjMVJoVGpabFNVRRAB",
            "text": "Vvery nice place 🥰 But\nVery expensive .\n非常に高価"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeVJsUTVNRkEwVjFaR1ZuaFhTbGxxTkRGd2NsRRAB",
            "text": "I can't begin to explain how good the food is. The appetizers such as the scallion pancake, shumai, and dumplings were extremely crispy. They were really flavorful and fresh. The food came on a sushi boat with some carved ice sculptures. The raw salmon was absolutely to die for. The wasabi also looked and tasted authentic. The owners and servers are so nice as well! The decorations and music made the place feel welcoming and comfortable."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJZURzTy10OXJmT2FREAE",
            "text": "Disappointing experience. Despite the place not being busy, we had to wait around 20 minutes for our food to be served. The sushi itself was of low quality and did not meet our expectations. On the positive side, the staff were friendly and attentive, checking in with us frequently throughout our meal. Overall, while the service was pleasant, the long wait and the quality of the food left much to be desired."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNkh0NnJkMS1TdHJnRRAB",
            "text": "Looking for local sushi, palace of Japan is the spot! Their sushi is good and affordable. I usually like to order the sushi party for 2, which is more than enough. It also includes a miso soup and salad. Their edamame is a good appetizer and so is the calamari. Their calamari is actually really good. On top of all that the staff here is also very sweet."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYnUtWnJfOVpfQ29BRRAB",
            "text": "I’ve been coming to this restaurant for over 34 years before the renovation, I remember the first owner I met. They have a good lunch special. I ordered the hamachi Kama -yellow tail collar I’ve been eating it for years. The price of this dish has doubled over time $20 now. Today the dish was awful.. dry, burnt inedible  - I’m not sure I will be back here but felt I had to say something. I was going to order a take out lunch special this is usually good at $17.00 but I think I’ve wasted enough money here for today."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJanFpNnlGNXZmMllBEAE",
            "text": "The ramen was soo good and the fried chicken and the avocado roll I really recommend it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJN3BnTDJ5NzliVnVnRRAB",
            "text": "This was my first time ordering from here. My wife was craving ramen so we decided to order in. First impression: the woman who answered the phone was rude. She was not friendly and was rushing to get me off the line. The ramen itself wasn’t that great. It was lacking in flavor. Very disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYU1nTF8tdEwtNEpnEAE",
            "text": "Amazing food and service! I got the Seth salad and it was really good. The rolls here are also amazing! Highly recommend this place and would definitely come here again! 😁"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc1l5MFRBEAE",
            "text": "Always a great meal here, especially the lunch specials!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcjZ6NHBnRRAB",
            "text": "Gisselle is a great new addition to the Palace of Japan family. She made my birthday very special."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvajdiNW9RRRAB",
            "text": "All around great service, good atmosphere and great staff !!Fiona was EXCELLENT!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvb3RHNHp3RRAB",
            "text": "My favorite lunch spot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaV91WGFREAE",
            "text": "I was never a fan of Japanese Cousin and Rolls until I moved to Riverdale and tried this restaurant. In particular, I am a fan of Hand Rolls, such as smoked salmon avocado or spicey yellow tail, because they are in small sizes, fresh, tasty, and inexpensive. I had their beef ramen soup daily while being under the weather with the flu."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODdUaEJBEAE",
            "text": "I recently had the pleasure of ordering from this establishment after quite some time, and I felt truly valued by the experience. My order arrived with great attention to detail, and I was pleasantly surprised to find metal cutlery, including a fork and two chopsticks. Such thoughtful touches make a significant impact. The restaurant has maintained its excellent standards, just as I remembered. I eagerly anticipate my next visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbzdQUTRRRRAB",
            "text": "Excellent food. Excellent service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOGNfUENREAE",
            "text": "My go to sushi spot in town. Gisselle is the best, best service in the world."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHQyQXBRRRAB",
            "text": "Thank to the all staff the food was delicious"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaElQbzBBRRAB",
            "text": "The food and service was amazing. I will definitely be going back for more delicious sushi."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNU9IaDRBRRAB",
            "text": "I have been eating from this restaurant for years now. Of all of the Japanese restaurants in Riverdale their food is absolutely the best. All of their sushi is fresh and delicious. I highly recommend it. Worth every penny!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2enRHa3VRRRAB",
            "text": "I have seen this location many times and never went in. So sad I didn't, the food is delicious. The look of the restaurant is so beautiful and the service was pleasant and quick. I will definitely return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcHBfc3RnRRAB",
            "text": "Satisfied customer here 😊"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZzc3dWhRRRAB",
            "text": "Food is always excellent.  Outstanding service and great value in a very nice atmosphere"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcU1IX0hBEAE",
            "text": "Excelente lugar"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURua3NxbERnEAE",
            "text": "Love the soothing music they play. Place is always clean. Staff is pleasant and respectful. They deserve good tips ❤️\nLovely to eat with the family or by yourself.\nAlso, there's a nice bar section to sit and watch sports"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNnFmV2R3EAE",
            "text": "It was one of the best sushi and sashimi that I had in for a long time.  Everything including sushi, sashimi,  udon, and even desert, was high quality and excellent taste.\nService was great, price was inexpensive considering quality of foods.\nI live in Flushing Queens, but I would definitely come back with my friends!\n- Alfonso"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucllfNzZ3RRAB",
            "text": "This is my favorite sushi place.  Here, you get the best bang for your buck!  They are the most yummy.  Their food is also well prepared and displayed.  You have to give them a visit.  During the pandemic, this was our go to place, and it still is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Nlp6MGVBEAE",
            "text": "Best lychee martinis"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyODczWTh3RRAB",
            "text": "I loved everything about this place! The environment is very welcoming and warm. The hostess with the colorful hair (forgot to get her name) had the best energy, just a doll! The waitress was very attentive and very nice. The food was magnificent!! The lychee Martinis will definitely give you a buzz☺️ This is definitely my new favorite sushi spot.. everything is fresh and just delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydkpYa3R3RRAB",
            "text": "The owners are special people and genuinely care about their customers. It also helps when the food and service are great as well.  Love this place!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeTRqRkJnEAE",
            "text": "Always a great experience at Palace of Japan. Always treated like family and the food is super great!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeTZfZU5REAE",
            "text": "Good food and service. Nice variety on the menu. Good drink options. Very solid local place, overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3N2YndBRRAB",
            "text": "Everything is great about Palace of Japan !!where should I begin so many wonderful things :) amazing service, great drinks and wonderful salads ! Cant wait to go back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eGJLZ3lBRRAB",
            "text": "Officially my fav sushi place in bronx/upper Manhattan.  Always so yummy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdDhEa1F3EAE",
            "text": "Friendly, welcoming, and the food!\nSo delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOEp2dWNREAE",
            "text": "It's been a very long time since I enjoyed sashimi/sushi since moving away from my old home.  So happy to have found this place.  Sweet potatoes are sooooo good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aHA3Slh3EAE",
            "text": "The owner is amazing, her staff are all super friendly, sashimi/sushi is top quality and so are her wine and sake recommendations!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cFllbFNnEAE",
            "text": "This place is great. The atmosphere is wonderful. Also the price is reasonable, food  is aswome."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdGVhcHdRRRAB",
            "text": "Always fresh and delicious food! Amazing service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMXQ3QmZnEAE",
            "text": "Pretty dope. I only got the sushi but I liked it, my fav sushi in Riverdale I think. They had a great playlist and the bartender was an epic singer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbGQ2ekFnEAE",
            "text": "The best of the best👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMmJLbTRnRRAB",
            "text": "The worst"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1ME9xd0hBEAE",
            "text": "Never had a less than stellar experience. Friendliest management. Amazing food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MDl5N01nEAE",
            "text": "Deliciousssss chicken teriyaki! This is our family’s go-to place for yummy takeout. The staff is also very accommodating and cares about their customers. Eson is especially awesome! Five stars and full bellies!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNHRiUXdRRRAB",
            "text": "Vegan and vegetarian-friendly, this spot is absolutely excellent. Delivery is usually reliable, and dining-in is great, too. Fair prices and great selection. I REALLY appreciated that the waiter asked if we wanted egg in our friend rice or not; it’s that attention to detail that you really appreciate!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhN1ltV0l3EAE",
            "text": "Omg, the food was delicious and inexpensive.  I ordered the Shrimp and vegetable tempera bento box and it was a lot of food for less than $15. The drinks were superb as well.  The service was good too. I definitely recommend this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOVlEWl9RRRAB",
            "text": "Amazingly delicious food! Very fast service.\nQuiet, cozy and relaxing atmosphere.\nI was really surprised finding this place in area!\nWill definitely come back to have more sushi and soup! Nothing is better than hot soup to start with.\nBy the way, I was very much surprised with fantastic dessert selection!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzX1BmLWxBRRAB",
            "text": "Great ambiance and attentive customer service! Food was very delicious. We excited to find a Local Sushi Place with good food and decent price!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM1pIdV9BRRAB",
            "text": "Affordable prices and the bento box is delicious. The food is really good. Sushi is fresh. I am a frequent customer because I love the sushi and environment. One suggestion for the bento box tempura was too greasy. Only time I didn't like it. Even the vegetables were fried and too greasy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M3NfWE13EAE",
            "text": "Late lunch - the noodles was too sweet but the tempura was perfect"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbzh2Y0hBEAE",
            "text": "Everything was great.\nVariety and a very quiet and comfy place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d2VEcVRREAE",
            "text": "Amazing place, great atmosphere and service. Delicious and nutritious food. I do recommend this spot if you are ever in the Bronx or specifically Riverdale. Enjoy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNkpxWXd3RRAB",
            "text": "A very interesting place. Great interior! Great service and very tasty food. The staff is friendly towards guests and with each other. Very helpful and can teach how to open Japan soda bottles. The prices are nice for such place. I loved the Seaweed and Mango salad! The rolls were marvelous. A cool love for a date or a family night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ME9lRnJBRRAB",
            "text": "Dear Sofia and staff\n\nI wanted to take a moment to thank you for the excellent service you provided during my recent visit to your establishment. Your warm greeting and friendly demeanor made me feel so welcome and appreciated.\n\nYou went above and beyond to ensure that I had everything I needed and that my visit was enjoyable. It's clear that you take your role as front hostess seriously and that you truly care about your customers.\n\nOnce again, thank you for your outstanding service. Your dedication and hard work are truly appreciated.\n\nBest regards,\n\nRuben]"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bnYyY2pnRRAB",
            "text": "DO NOT GO!!!! The only reason it’s so good is because it’s the only Japanese spot around. The food is disgusting with no flavor and so much grease, the only thing you can taste is the oil. Another thing, the hostess doesn’t speak English, and I’m not biased, but she took my order wrong, charged me extra for fried rice bc apparently it was not included, but didn’t even offer me the white rice that was included even after I had pointed out that the menu stated a lunch box with rice for $15. They rip people off, the food is gross and the service is deplorable. be careful!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1anZpemZnEAE",
            "text": "My favorite Japanese cuisine in the area. Their sushi is amazing and I can't go without their amazing lychee martinis! We love coming here for a date night. Great atmosphere, service and affordable high quality yet authentic feeling meal!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteXNYTjVnRRAB",
            "text": "I used to eat there in the early 2000's. I was in NY from New England, and decided to give in to that long-awaited craving. I suppose I was expecting the same ambiance, service, etc, as before. They used to bring a hot cloth to each customer, to cleanse hands. The food used to be exceptional. There was no hot cloth, miso soup was just warm, and I was disappointed with the majority of our dinner. Dessert-tiramisu was frozen, and they offered to microwave it! Fried ice cream was still great. I will go back, but will definitely not order the usual, I used to order for years. It may also be the sushi chef, obviously it wasn't the same as before. I've craved food from there for years, so that added to my disappointment. But do not let my opinion discourage you. The restaurant has been there for years, and the staff is still very attentive. I simply had expectations not met. So go, enjoy, and you'll have your own opinion. As I said, I will try something different next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1a2JQMDJnRRAB",
            "text": "My wife and I have been eating at this restaurant for many years now - it's our favorite place in the whole neighborhood. The staff is very nice and polite, food is always fresh and tasty, wouldn't change a thing. Highly recommend."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNLThTSElnEAE",
            "text": "The food is always amazing, and the lunch special is a blessing. The chefs are very skilled and the fish tastes very fresh. The staff are kind but I feel that they're judgemental when teens come in to eat, ei me and my friends. We behave…"
        },
        {
            "date": "2년 전",
            "language": "rw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtc2FpcjlBRRAB",
            "text": "Best sushi and ramen I've ever tasted my whole life! My personal favorite is the sushi and sashimi deluxe, with an appetizer of Miso no noodle soup. 私が今まで味わった中で最高の寿司とラーメン！ 私の個人的なお気に入りは、寿司と刺身のデラックスで、前菜に味噌のヌードル スープが付いています。This was written in katakana because google translate doesn't use hirigana. 我一生中品尝过的最好的寿司和拉面！ 我个人最喜欢的是豪华寿司和生鱼片，开胃菜是味噌汤面。 This was simplified chinese. Sushi và ramen ngon nhất tôi từng nếm cả đời! Cá nhân tôi thích nhất là món sushi và sashimi cao cấp, với món khai vị là mì Miso no. For all my viets out there, and finally ซูชิและราเมนที่ดีที่สุดที่ฉันเคยลิ้มลองมาทั้งชีวิต! สิ่งที่ฉันชอบเป็นการส่วนตัวคือซูชิและซาชิมิดีลักซ์พร้อมอาหารเรียกน้ำย่อยของซุปมิโซะไม่มีบะหมี่ for thailand."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDNkw2Y2t3RRAB",
            "text": "I have been coming here for years. I ordered three items and received one set of chopsticks (2 people ordering at the take out window).Our sushi had a strong odor and didn't appear to be fresh. Ended up throwing it in the garbage. Not sure if I would give them another shot after this. Very disappointed."
        }
    ],
    "reviews_count": 67
}