{
    "name": "Greek Express",
    "place_id": "ChIJKa27TLnzwokR9XDDYsZT0ys",
    "grid": "BX8",
    "address": "3733 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 381,
    "phone_number": "(718) 601-4976",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wclUyeHpSV1F5WjBSTlkxQXdTbGN5YUdrMVYzYxAB",
            "text": "Decent standard fair.\nWould recommend for a quick and decent bite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205amJWTlZOMkpEU0ZaZmVtRnNVR3BZY2s5cGMzYxAB",
            "text": "Gyro doesn’t taste good for 14$. It’s too expensive for sliced lamb, pitta bread, lettuce and tomato. Do not recommend as lunch place for one person."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sT1NWZGhkRGRvVURWUVppMHRXSFptVm1nMGQyYxAB",
            "text": "Ordered the falafel gyro from here and it was mediocre for the price. The falafel was a doughy chewy texture without much seasoning. Overall just wasn't good. Unlikely to come back. The Johnson Diner a few blocks over does a much better falafel gyro. Go there instead"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcGJIcG9NREpaZGxSSmNpMTBaRk5qZVVKWVJtYxAB",
            "text": "I've been coming here (on/off) since it's opening.  Overall, the food is pretty tasty and reasonably priced-- with the lentil soup being a featured star!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGYVVWWnZVRFJMWDBWZk5rRlhOR2hJWkhkQlRsRRAB",
            "text": "Great service and great food!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLXJLbWhnRRAB",
            "text": "First of all, I want to say this is the only business in the Riverdale area that treated me with understanding, like a human being deserves (during Covid-19 pandemic). If it wasn't for them, it would have made a bad period in my life even worse. That says a lot! The people who work here are likeable, down to earth, pleasant and friendly. Now in terms of the food, I don't eat certain things but don't hold that against me. The menu choices I like are: Manitari Gemisto (feta, spinach on a giant portobello mushroom). It is served hot and with all the ingredients blended together are a taste sensation. The Kolokithokeftedes are zucchini croquettes blended with cheese and herbs. This is very very good. Oddly I notice some similarity to potato latkes with this side dish though it is made completely differently. Their octopus is also very good. If you've never had octopus I find it has a similar taste to tuna fish but has a tougher consistency.  Under salads, their Kritharaki has an interesting taste. The flow between oil and saltiness makes it more subtle yet different. It contains orzo, spinach, artichokes, olives, feta, sundried tomatoes and virgin olive oil. The artichoke taste really stands out. Their Mesogiaki salad is really satisfying, tasty and with ingredients well balanced together for a meal. It contains grilled halloumi cheese, baby greens, apple slices, walnuts and honey lemon vinaigrette sauce. My girlfriend likes their tilapia plaki, yogurt and lentil soup. I wish they would cook an authentic saganaki steak using kasseri rather than feta. The restaurant and its decorations feel like you are in Greece. I lived there. When there I feel am in relatable surroundings. Another thing, they need to do more making daily specials. They had this white bean soup that was excellent but have not served it in awhile. Perhaps they need to hire me as a cook to do more?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOS1U5ZjdZMGRYaUJREAE",
            "text": "I had such a great time on a rainy day! Food clean… u taste everything omg! Desert please get the orange cake! John & Anita thank you!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2QtQldBEAE",
            "text": "The moment you walk in, it feels like stepping into a small Greek city — the atmosphere is so authentic and welcoming. You can immediately feel the comfort of it being a family-run business. The owners and staff are incredibly kind and make you feel right at home. The traditional Greek food is absolutely outstanding — everything tasted so fresh and full of flavor. From the perfectly seasoned meats to the crisp, vibrant salads, every dish was a reminder of true, homemade Greek cooking. You can tell they put so much pride and heart into everything they serve. I can’t wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaTVXUkZ3EAE",
            "text": "The next big thing besides traveling to Greece is dining here. The restaurant has a very warm and down-to-earth environment. While renovating our kitchen, we ate here several times and the ingredients were always fresh, and we experienced authentic Greek dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXzlIRFR3EAE",
            "text": "Today are family ate at the Greek Express.\nGreat authentic Greek food. We enjoyed lamb and beef Gyros, grilled chicken Gyros, Falafel, lemon potatoes and topped it with Greek Beer. Peter and Mario hospitality was most full Hearted.\nThank you!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bEk2ZDRnRRAB",
            "text": "Just came from from having lunch here with my friends. It’s beautiful! We loved the food. The service was great. Definitely coming back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOWNXWVNnEAE",
            "text": "Hard to find a good, authentic Greek restaurant in the Bronx/Lower Westchester. This place is very good, authentic Greek dishes, even Greek wine and beers. Great service, delightful owners. Highly recommended."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNk1YVk93EAE",
            "text": "My parents ordered New Years Eve dinner from Greek Express and they loved it so much they asked me to write a review! They worked with Emmanuel at Greek Express to help them select menu items and quantities for 5 people (4 out of 5 Greeks)!  They were so pleased with the final order.  Everything was fresh and delicious and the pick-up went so smoothly.  Looking forward to more delicious meals!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaXBhR2hBRRAB",
            "text": "Great place to dine in.  Great gyros"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN0xTQmNBEAE",
            "text": "Delicious food and wine. Service was also good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMelphS3NBRRAB",
            "text": "I was not impress! The pita bread was stale!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM3BlbzRnRRAB",
            "text": "Greek Express for years was our family \"go-to place\" for ordering in.  (We've never eaten at the restaurant.).  What has happened??  Tonight may be the last time we order here.  We've ordered the same things for over 12 years:  gyros, fries, chicken souvlaki, Greek salad, calamari.  Observations tonight:  Portions are noticeably smaller.  Fries used to be awesome -- now they are limp, tasteless.  Gyros and chicken souvlaki-- ok.  Calamari -- pretty good and pretty small.  And prices?  a lot higher.  Thank you for the food and the memories."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNnR1ZHVRRRAB",
            "text": "Service was very slow considering there was only one other table being used. The glasses are the size of tumblers and for a place charging over 20 an entree they only serve Snapple. Thankfully the food was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXA3VlhnEAE",
            "text": "I love this place! The food, the service, and the atmosphere! One of the best Greek restaurants I've been outside of Greece. Thumbs up!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bzZQVER3EAE",
            "text": "Great greek food, gyro and octopus are always a solid choice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OElXS0JREAE",
            "text": "Cute little place with amazing Greek food. Service could be a little better but definitely worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaVBtM0FREAE",
            "text": "I ordered a large Greek salad with grilled chicken. However, it came with a small piece of chicken and two big pieces of feta cheese, and the cost was  $24.40 ... to expensive for the portion served. And not even plastic utensils."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeDRqc01nEAE",
            "text": "Food is good but they don’t give a lot for the amount of money they charge."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMlp5cGFREAE",
            "text": "Best Greek salad EVEER"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqel9mR3pnRRAB",
            "text": "Very good flavor, fair prices, friendly family owned place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOVlyY0VBEAE",
            "text": "The fresh tilapia plaki is the best fish meal I've ever had and the yogurt is rich and creamy."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3B5WUVnEAE",
            "text": "Delicious greek food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ODZXTzF3RRAB",
            "text": "Im.just completely satisfied with this restaurant i mean the food is delicious 😋 best Greek food and prices are reasonable and great service too... of u want good greek food go there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaDlEeERREAE",
            "text": "Waitress was nice\nAll the food came cold\nThe owner as soon as we walked in gave us weird vibes like Spanish people weren’t welcomed but we still gave the benefit of the doubt\nAggg maybe people my color ain’t welcomed well welcomed but definitely eating the food cold"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbnMzSXF3RRAB",
            "text": "Best for takeout or delivery, as it's a small space for dining in. The grilled meat combos are amazing. It's expensive but worth it. Probably one of the top 5 restaurants in Riverdale in terms of popularity, food quality and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0LWJYNjNnRRAB",
            "text": "Excellent quality food. Affordable great wine. It is a gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObmV1MGFREAE",
            "text": "This place has the best GREEK food. The service is top notch and the owner is so kind and polite. I love everything about this restaurant. Its small and warm... the decor is unique and If you dine in you'll feel as if you are in Greece 🇬🇷."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabDZMcjR3RRAB",
            "text": "Very cozy restaurant for authentic Greek dishes.  My  favorite is a Greek burger, which comes with Greek salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsZ3Ztd1JREAE",
            "text": "Good food relative to the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNTlXTXp3RRAB",
            "text": "Restaurant is a bit small with only\nabout 6 tables. The Ambiance of the place is OK, The service was OK, The server works alone serving and doing other stuff so to get a refill of water was a bit difficult, we had to continously get up to ask for a refill because they serve water in tiny cups. The food was absolutely awesome. All the stars are for the food, I absolutely love the food here. Great salad and amazing flavors in the entrees. Meals are the same price for lunch n dinner so $20 each for the lunch platter."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGa0tEY2x3RRAB",
            "text": "Be advised that their prices have gone up so much that Greek Express in Riverdale may be a place you want to avoid.\nJust opened my 68.00 delivery.\nNOT GOOD\nNo salad in the bag with the dinner.\nThe hummus is so salty that it went right in the trash.\nAll the containers were packed on their sides, complete mess.\nThere was a time this was a great little gem. That ship has sailed.\n."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NnY2V0VREAE",
            "text": "Amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadWFmQklREAE",
            "text": "I’ve never been to the actual location, only had delivery but the food is excellent. A but on the pricey side (I paid almost $90 with tax & tip include for 3 meals/people) but definitely worth it especially since there is no other spot like this in my area"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaak9ENHNnRRAB",
            "text": "My girlfriend and I had a wonderful time here. The service was friendly and very attentive. The food was lite but full of flavor. We really enjoyed our meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwam9xUEZnEAE",
            "text": "This place is so homey with great food. It's like eating with family. The owners are so friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaG9hcURnEAE",
            "text": "Delicious 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjV1Z3BnRRAB",
            "text": "Lovely hidden Greek gem in Riverdale.  Great classic Greek food.  Nicely priced . Pleasant service.  Can’t wait to return for live Greek music❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNjVqZ0JBEAE",
            "text": "Terrible delivery, no utensils… can’t enjoy the food. Never ordering from them again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeE1xM19RRRAB",
            "text": "This is a small and cozy restaurant that seems to be family owned. The service is excellent, the server was very kind and helpful. We tried the gyro and the chicken souvlaki. The crowd favorite was definitely the gyro. The Tzatziki was really good. They provided us with more pita at no cost. I would definitely eat here again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhajlpaklnEAE",
            "text": "The food was delicious. The dessert was incredible delicious and it is really affordable."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBN191Z2JnEAE",
            "text": "Try the lentil soup with your warm pita bread. Local spot with friendly owner and staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ai1QcVd3EAE",
            "text": "The food is always delicious however I have two complaints. Yesterday I called to order food and I didn’t mind  being put on hold but I ended up not ordering because the 2 times I called not only was I put on hold for a long time but on both occasions they hung up the phone without  taking my order.\nToday I ordered food and upon delivery the delivery person had the audacity  to ask  me how much I wanted back from my $7 change. That was completely inappropriate and rude."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Z2ZXUmFnEAE",
            "text": "Very nice place, I le the Greek heritage accessories on the walls and the seaport paint, make u feel like authentic place, it looks like small family business which is something I always love to support, I would suggest to add some Greek brands for the soft drinks section, to complete the Greek experience, snaple is good option for those who don't want to take total Greek  \"risk\", but I'm sure I'm not the only one who want it as authentic as possible... other than that was really nice place! They all was checking on us to make sure we happy with the food, the music in the background was nice and not to loud so we could have nice conversation while we dine.... definitely going to come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHVIaUt3EAE",
            "text": "I’ve been to Greece twice and this restaurant was spot on!!! Loved the Gyro platter and you get a TON of meat for what you pay for. Highly recommend this place!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazkyWG1BRRAB",
            "text": "Small dining room but good atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMHJxSmZBEAE",
            "text": "Every time I passed this place I will tell my self that I must try it. Well, today was the day!! My brother and I tried this place and we were very pleased.  The food was good, the salad was delicious!! My brother had the first octopus and he liked it. I had the shrimp with rice, very good; the feta cheese enhanced the flavor on the sauce.  We will definitely return!! The gentlemen the owners were very nice and attentive.\n\nIf you do stop by, give yourself time to look for parking, is a busy street"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocDVuSXh3RRAB",
            "text": "My girlfriend and I was looking for a mom and pop like restaurant and we found it with Greek Express. The vibes feel like you're with family and the atmosphere is like you're in Santorini. The food is very fresh, flavorful, and clean.  Manos (I hope I got his name right) the owner spoke with us, he came out to speak with all the guests and make sure we were ok. I didn't get our waiters name but he was an older gentlemen very helpful and kind as well. The food, the atmosphere, The Staff brings Greece to NYC and it's fire! 🔥🔥🔥 We had the Calamari which is the best calamari I ever had. Usually I eat like 2 or 3 anywhere else but here I couldn't stop eating them. Our main meal, we had the Chicken Souvlaki. We also had the Greek Coffee. If you like your coffee really sweet you probably won't like it. But I loved it. I'll be back for sure. If you're reading this you have to come to Greek Express."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxd29tY1ZREAE",
            "text": "I like this place  because it is the only Greek restaurant in the area. It is definitely not the best Greek food I've ever had , but it is good enough when you're craving it.\nIt is small and cute inside the service is friendly and the people are nice it seems the prices went up It is small and cute inside the service is friendly and the people are nice it seems the prices went up.\nThe portion sizes are good ,but the food is not that flavourful in my opinion.\nI prefer going to queens but that is a whole mission, and I have also been to Greece, so I guess I'm a little bit picky but like I said in the beginning of this review it's good enough considering its close in the area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bnZLT0NBEAE",
            "text": "Went for a late lunch with the family. The service was slow as far as getting my order in. The food came out on time, no issues there;however it would be nice if they had more then one person working. Sat outside, the inside looked clean and well organized. The food was ok!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwa2RuQklBEAE",
            "text": "Was in the mood for Greek Food, especially grilled octopus. The Greek Coffee was great like an espresso. Loved the egg plant with hummus, falafels where also flavorful. Great cozy experience! Will be back, Thank you"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJOVo2VnR3RRAB",
            "text": "I fell in love with this Restaurant,such a beautiful decoration!and the food omg so delicious!,great staff!fast service,fresh,highly recommend it,the don’t serve wine but the told me I could bring my own if i wanted to!thank you so much for your service❤️will be back soon."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBallLQkdnEAE",
            "text": "This is a nice small Greek restaurant with good gyros for a reasonable price.  The gyro had more lettuce in it than I expected but the meat was very good and wasn't too salty.  It is also nicely decorated inside and feels pretty comfortable."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRek51QkVnEAE",
            "text": "Pretty good greek dishes but the service was as if they wished to be somewhere else."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoajgzSmF3EAE",
            "text": "I reached out to Greek Express to cater a film shoot happening nearby and they were wonderful to the work with. The meals were fresh, delicious, and decently priced for what we were getting. The whole cast and crew raved about how delicious their lunches were. I highly recommend this spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdl9mQkZREAE",
            "text": "Rude server and very bad food\n, description is not even accurate\nRomaine letters without romaine.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNa3ZfczRRRRAB",
            "text": "Don't miss out on this little gem.  Excellent food never had a bad meal, fresh and flavorful.  Charming atmosphere,  owner is a true gentleman and host.  They know how to treat their customers.  Best gyro I ever had, reasonable prices.  I cannot say enough good things, just go you will not be sorry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoc3R2UEtREAE",
            "text": "Thankful to have Greek Express in the neighborhood! Really nice decor, the food is delicious. We often get the gyro plate and usually have enough for leftovers! The staff is Greek and when you go here it's as if you're in the local streets of Athens."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5djkza0V3EAE",
            "text": "This tiny spot in Riverdale was a fun surprise during our visit to the neighborhood. They were open for indoor dining with reasonable distancing between tables. The service was cozy and personal. We got our food promptly, and the different…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdl9qTlBnEAE",
            "text": "Ordered delivery.\n\nStaff on the phone was really friendly and very accommodating and knowledgeable when it came to a nut allergy. I appreciated that greatly.\n\nPastitsio was pretty good\n\nChicken Souvalki was bland and meh. As was the rice that came with it.\n\nFelt it was extremely pricey.\n\nIt's my first time having greek food in the Riverdale area so don't know if there are other places better in the neighborhood. But compared to many other times I have had greek food in general, it was definitely inferior to pretty much every other restaurant I've ever eaten in/from while also being significantly more expensive.\n\nSadly, I can't recommend this place. I very much wanted to given how great the staff was on the phone. But it's simply not worth it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdkppeE5BEAE",
            "text": "Such a polite sweet waitress, food was delicious, great portions. The pita bread was so soft and warm. Fries are amazing. Price incredibly fair. Will come back"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdklDdS1nRRAB",
            "text": "Greek Express is basic but good - not great.  In my experience their dips are very good, their chicken is overcooked and everything could use a little more seasoning (salt, paprika.) But there is a perfect menu, the food itself is fresh and both delivery & sit down dinner is efficient & friendly. Please like & follow"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOUt6UmZREAE",
            "text": "Awesome Greek spot in Riverdale. Nice little homey feel and never too crowded. You can even request tables if you like a certain area. Food is phenomenal. Had the calamari, wrapped leaves, and eggplant appetizers. For main, lamb gyro,…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzalozOVdBEAE",
            "text": "Consistently a good meal.   Food is always fresh and delicious.  My son's favorite is the salmon and spanakorizi.  I love the Pikilia appetizer and their salads.   The gyro is also delicious and huge.   The owner is lovely and knows all of his local clients."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dEktcXVRRRAB",
            "text": "We always eat our lunch at Greek Express Restaurant in Riverdale Avenue,  it feels like home. The owner named John and his father are wonderful. Plus Peter and April are also wonderful people. It's peaceful and I really enjoy the food. God bless them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCb2ZtYmNREAE",
            "text": "I don’t expect this place to be five stars but they really do not even try. The food is beyond bland and presented sloppily. Put some attention and detail into your dishes. Just try. Don’t throw things together and hope they taste ok. And…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteU1pbHpnRRAB",
            "text": "Picked up a Greek salad for myself and a souvlaki sandwich for my kid. We loved what we ate. Will definitely return. The atmosphere I gave 3 stars because inside they still operate like high covid times."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcDd1VVhnEAE",
            "text": "Came for dinner with the family. The people who work here are very kind and patient and provided stellar service. This is the second time we came here and the food is very fresh and delicious. We came back for the food, and will be coming…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcDV1dHV3RRAB",
            "text": "The gyro is really tasty. It's huge and tastes fresh and can make a meal. Other food is good, though entrees are pretty pricey. Love the spinach rice especially. I feel like they charge differently than what's on the takeout menu sometimes, or intentionally upsize you like if you order a sandwich only and they give you the platter with fries and charge you more. I don't like fries, so I find that annoying. The menu pricing is annoying too, because I think they said something like well you must have had an old menu (we didn't). So we stopped ordering from them because it got annoying, which is disappointing."
        }
    ],
    "reviews_count": 73
}