{
    "name": "Tin Marín Tapas",
    "place_id": "ChIJnRjrrr7zwokRc6Uo6E8DI7s",
    "grid": "BX8",
    "address": "3708 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.5,
    "user_ratings_total": 1204,
    "phone_number": "(718) 884-4800",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTWRGWkxjRFJXVG1OQ2JIRnRWVmxyY0haVWFIYxAB",
            "text": "Since they expanded their restaurant, this was my first visit.\n\nOur waitress was excellent and friendly.  Food was great\n\nThe new space, while get nice looking, was very noisy.  Also, food took quite a while to arrive... Although the waitress was very attentive and offered to refill our drinks.  (They did explain they were \"down a person\" in the kitchen...so perhaps this explain some).\n\nSince I've been there many times prior to expansion, I'd return another time to see if things changed."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scVVXNVVMVU5UTkZkRVZFaFpUVWc1V210NGJXYxAB",
            "text": "This place is amazing.  They had live Latin music from 10:30 until late.  Great food and vibe.  Highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TE4wd3hkVEIzT1Vwd1ZtaGxaV1U0ZUU1MVRtYxAB",
            "text": "I’ve been here so many times and it is my favorite restaurant in The Bronx. Point blank period. The service is great, the food is awesome and affordable. It’s a vibe always. Love love love will be coming back soon."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNVpXSnlVbkpGWWtKNVN6ZHBVVEl6YVdSMGMzYxAB",
            "text": "Me encantó este lugar. La comida es deliciosa, las porciones justas y todo con muy buen sabor. El ambiente es acogedor y tranquilo, ideal para disfrutar una comida en pareja o en familia. El servicio fue amable y atento. Sin duda, un sitio al que volvería sin pensarlo.✨"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CclFteGFjV2x0VG5FM0xXTTVXV1p5VFVsRlpXYxAB",
            "text": "La rubia is super nice and friendly"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kV2FsOXNWMVZ3TjBseWFVSm5MVXBYVEdScFdHYxAB",
            "text": "Recently took my family for dinner to this location. We were three individuals and were looking forward to experiencing a nice evening out.\n\nThe venue is clean and the decor very pleasant to the eyes. However, at a certain time during the later afternoon/early evening, the lights were significantly dimmed making it a bit difficult to see what one was actually eating. Not sure if this is a cost cutting measure.\n\nThe food from start to finish was generally very good. However, the Caldo Gallego was rather bland, but then, this isn't a restaurant with focus on Spanish cuisine. But I expected a little more taste. The main dishes were excellent - churrasco and filet mignon. They were seasoned just right and fresh!!! The desserts were also nicely made. Seems like any choice of dessert is a good choice.\n\nBut, and this a huge but, and be forewarned. The wait time is excessive. We were a party of three and it took us more than 2 1/2 to complete our dinner. The drinks took about 20+ minutes to arrive. The appetizers took more than half an hour to arrive. The entrees took almost an hour to arrive. And the desserts took about half an hour to arrive.\n\nI inquired from our waitress regarding the wait time for the food and she replied that the kitchen is limited in size and that perhaps the wait time is not what we were accustomed to. It appears that the restaurant expanded its interior but expansion of the kitchen did not take place.\n\nA very nice restaurant with mostly very good cuisine. However, don't arrive too hungry or you'll be sorry."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQ1VXWXpRM2RoWDJwNU5YZDZOUzFPUzJNM1VuYxAB",
            "text": "Siempre la pasamos divinamente, para nosotras es el lugar de encuentro y hacer memorias juntas , excelente en todo el sentido de la palabra ♥️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVpFRjRaMnAzY0ZCNlFYUkpNVU5mUzNvNVFVRRAB",
            "text": "Unttentive greeters, cold, like out of the fridge bread. Handling fee whatever the heck that is, why on earth put an arbitrary fee on everyone's bill? Just charge more from the begining and you won't have any complaints the stupidity. Execution not good. 2 stars."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFRqbDNSRmx6TlVsNWRVOXlWWFo1YWpCWmQyYxAB",
            "text": "Excelente 👌 servicio un ambiente agradable y buena música 🎶 en vivo…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYVgxRjRXVXgxWkhrd01HNU5iRTh6V0RCU1QzYxAB",
            "text": "Tin Marín has always been a gem, especially for those who love tapas and Latin/Mediterranean influences with a seafood twist.\n\nAnd now with the expansion, you can expect more live music and entertainment. Whether it’s date night, family dinner, or gathering with friends, the place now has more room, more flavors, and more comfort without losing any of its character."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdFZrVktObWx3YzFOR1RWRTVaR2sxU0hWelgwRRAB",
            "text": "Love it!!! 😍 after the new expansion, this place is WAYYYY nicer and more spacious. Food, drinks and ambiance is unbeatable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VmRHdERlRWR2ZG01Sk5GVjJaMWszWHpGdGFVRRAB",
            "text": "Bread was stale which took half an hour to arrive. Never refilled our water, didn't pay attention to us signaling we were ready for the check. Just terrible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRU16Skdia3hPVUhSUVMyUnNlWFp1ZFhSVGFXYxAB",
            "text": "Best strawberry mojito I’ve had in a decade!!!\n\nBacon wrapped dates with blue cheese amazing!\n\nNice decor.\n\nGreat service.\n\nWill be a staple."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sM1RFSmxibmg1ZUZwTFZtdDBOalZUWmxoMlJYYxAB",
            "text": "Our favorite neighborhood restaurant. The food is always so delicious and we always feel so comfortable dining in with our twins and toddler (aka chaos). Waiters and manager are always so friendly and helpful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcVdFeG1ReTFpVmxwU1pFNXhXRFk1YkRsNldIYxAB",
            "text": "Stumbled onto this amazing treasure of delicious food, great vibes, superb service and the arts. Have already been back several times and i have to say i found my favorite local restaurant. Great wine, food and live music…what more could you ask for? The owner should pat himself in the back."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNTkyT1F3EAE",
            "text": "Just had the salmon and it was very good. The vegetables and spinach complemented the fish very well. Ate at the bar and the bartender was very busy, but attentive. Will definitely return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VlIyMURSMlExV1dVMGVEVkVia050TW5sVGRWRRAB",
            "text": "This is such an awesome place to come and hang out. The food is amazing the team here is so nice, it feels like visiting family and the ambiance it perfect for all occasions. I would definitely recommend tgis spot for any occasion."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RmFIZ3pUQzFMV25JeGFUWjZjbTlyTWtSMU5GRRAB",
            "text": "Fabulosos me gustó mucho"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCa01YSmlWRGwwYWtzMExXRk5kbFZMYTJsMVQxRRAB",
            "text": "Food is excellent, service is good, but the live music is so incredibly loud, it ruined my entire experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRFFqZGhTbEpEVEc1YWRtWm9SWG80ZVhrMk0yYxAB",
            "text": "The music was deafening, especially the bass. And when the live music started it was unbearable. What a shame."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclJ6ZEtRemxzTmpoT1NGZDZkbTV4V0dwYWIxRRAB",
            "text": "The place itself is nice, and the bartenders were amazing—friendly and attentive. Unfortunately, the manager/owner left a bad impression. He was rude and dismissive, more focused on drinking his shot and beer than on taking care of customers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvdFVHOU9WVFZOVmsxUmFXRjRRbFZSTkVaTFJHYxAB",
            "text": "Lock of staff, too long waited for even getting a glass of water.\nUnprofessional manager, interrupted waiter while attending us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R1NtSmlUVU5SZDI0eFQwdFBlREpyUXkxR01WRRAB",
            "text": "The atmosphere and energy of this place are phenomenal. I invited a friend from out of town to celebrate her birthday, and we were excited to enjoy a small celebration here. The food and drinks were delicious; however, we encountered an issue with one of the dishes. As my friend was taking a bite of the mofonguitos, she bit into a long piece of hair. This completely ruined our dinner experience. While a replacement dish was brought out, I wish the situation had been handled with more care, at the very least, having a manager come over to personally apologize. I recommend that the kitchen implement stricter protocols to prevent this from happening in the future. Just left a bad impresion and it was really embarrassing."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1VqTnZUbWMyZDA1dGEwaHJXR2hvT0VoRWRWRRAB",
            "text": "Lugar muy acogedor,  la comida deliciosa, buenos tragos.  Pero sugiero que capaciten a las bartenders en ser más empaticss,  amables,  sonrientes y una presentación acorde al lugar.  Falta sonrisa en sus caras , maquillaje y cordialidad al responder."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMVQxSjViRGREVjBaQk5rSjNkQzFRT1ZGNlJtYxAB",
            "text": "Newly expanded and certainly busy. That night there were not enough waiters, but they were certainly working as best they could. Food was prety good, maybe not hot, but I would go back and try more dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkemVVVktUbDl0V0hKTFEySktUM1ZOTlhocVNrRRAB",
            "text": "Very nice to take someone you would love to impress. The staff is attentive to all your needs from the moment you walk in up till the moment you are leaving. The atmosphere gives you a feeling of home as you mingle with other patrons. Will Definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4Mk1UVkdjVEUzZVVadVpXZHhSRTFYVG1WQlFtYxAB",
            "text": "Stopped by Tin Marin Tapas Bar for an early solo dinner around 6pm and opted for one of the outdoor tables. The al fresco setup was charming—relaxed, street-facing, and perfect for people-watching as the day softened into evening.\n\nService started a bit slow when it came to taking the order, but once things got going, everything else was smooth. The staff were friendly, and the food came out impressively quick. They were also easygoing and efficient when I asked to pack up what I couldn’t finish—no fuss at all.\n\nThe meal itself was satisfying. I started with a refreshing shrimp ceviche, bright with lime, cherry tomatoes, and creamy slices of avocado. The steamed mussels in a light broth were plump and aromatic—comforting but not heavy. A glass of sangria, chilled and fruity, rounded out the meal nicely, especially with the side of rustic bread and olive oil.\n\nInside, the décor had personality—wine racks, vintage chandeliers, warm lighting, and a bold flamenco mural—but sitting outside gave me space and quiet to unwind.\n\nA solid choice in Riverdale for a solo unwind or casual catch-up. I’d return, especially for the ceviche and the easygoing vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUWVIWkNjekZTU1hGMVJXUkdaVFZ0VWtnMFgyYxAB",
            "text": "My go to spot!! LOVE THE SANGRIA!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbFYzUjRlRVY0VUhkNk5qaEdOa05KU1hWemRIYxAB",
            "text": "Drinks were great! Server lacked attention. Food was ehh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc2JrcEtlV1JEUXpWa1h5MHlaV2M1WmtVdFZrRRAB",
            "text": "We did the Tapas with drinks this time. But everything I've had each time I visit is delicious! Very clean place, friendly and accommodating staff. I was feeling the last lingering symptoms of my latest vertigo episode and my friends were having drinks. The server recommended a mocktail and it was delicious!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWU5ubzViMmgyZDBJNGNqVkthMDB6UTFOeWJHYxAB",
            "text": "No recibo ningún tipo de compensación por esta opinión; simplemente soy una clienta frecuente y muy satisfecha. Tin Marín es mi lugar de favorito en el Bronx. Ofrecen excelente comida a precios justos, un ambiente elegante pero acogedor, música en vivo y un público maduro con estilo. Siempre me siento segura y bien recibida, Se han ganado mi admiración.\n\nI’m not being compensated in any way for this review I’m simply a regular customer who truly appreciates this place. Tapas Tin Marín is my go to spot in the Bronx. They offer excellent food at fair prices, a warm yet elegant atmosphere, live music, and a mature, stylish crowd. I always feel safe and welcomed, specially on dates. They’ve truly earned my respect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FelIwbDFZV3QwVFRWclpteENkbTFaVTNKcllVRRAB",
            "text": "\"Great place! The food was amazing, the music and vibe were on point. Maria the bartender was fantastic—friendly, attentive, and made the experience even better. Highly recommend!\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFEwMTJRMm8wUmpsVmVFWlRhakI0VVdrM1lVRRAB",
            "text": "Fabulous time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TGR6SndTSG95TldwUFpraEpXRmRaU0RCU1UxRRAB",
            "text": "Very deceptive. Would love to know what exactly a “handling fee” is. Would be to nice to be transparent as a company and inform your guests of charges like this. And not once the bill arrives.\n\nFood is very subpar. Cocktail was good. Would not return.\n\nAddendum:\nI see that you left a reply and quickly deleted it. No worries, I’ve already seen it. In response to your defense about the fee and how transparent you claim to be , you confirmed that the fee is stated on customer’s bill and also your website. I’ve went ahead and attached a screen recording of your website for your convenience. You will find that you are in noncompliance of the credit card disclosure requirements. So the fact that you would remain steadfast in lying and being deceptive with your shiesty business practices , has only cemented the fact that I will never suffer the displeasure of eating at your establishment ever again.\nBe best."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNGExTm1SVk00YnpKRWREUTBhbnBoZVd3eWRVRRAB",
            "text": "Excelente comida todo renovado vale la pena visitar..lo recomiendo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMWNYcHFSek5ZWkRWaFdXeFRXVlptVUdaQ04yYxAB",
            "text": "\"Tin Marin in the Bronx is a true gem - a restaurant where everybody knows your name and feels like home. The food is delicious, and the ambience is a perfect blend of festive and romantic, especially when the talented performers take the stage and transport you to another era with their soulful melodies. The drinks are expertly crafted, and the staff is friendly and accommodating, making you feel like family. While parking can be a bit of a challenge, it's well worth the risk to experience the warmth and charm of this wonderful restaurant. If you're looking for a spot that will make you feel like you're part of the family, look no further than Tin Marin - you'll feel right at home!\""
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZloxcFpUVXRDUVRSRFVUaGxOVU4yZG1GNE4wRRAB",
            "text": "Qué ricaaaaas las tapas y lo mejor la música en vivo😍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM1JuTlNhVmRCTVRJMWRWOVVlbkppZURKVlFrRRAB",
            "text": "What an amazing experience. Food was just on point of flavor and texture. Great variety of drinks. Staff was kind and friendly. Live music was an excellent touch! Can’t wait to come back and do it all over again 🫶🏽"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbFduTkpVVEU1YXpkUFZWRTRaME54U2pkTWNuYxAB",
            "text": "Muy buen ambiente"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjemNreHBiM0F5TlhaUFpXZE5PVk5PWld3NFdtYxAB",
            "text": "The best ever placer for drink and music live love it 🔥🔥🔥🔥🔥"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndFNYbEVXVVJxVTBob2RXbHFYMEV6YlVNdFlVRRAB",
            "text": "this restaurant was amazing and the food is very good and flavors the drinks as well highly recommend i can’t wait until go back."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMFF6VjRTV3B0WW1aUVZqZGlSbk51ZWtnM1IwRRAB",
            "text": "El lugar está en una muy buena área, he venido antes por las croquetas de pescado que son muy buenaa, hoy mi esposo y yo pedimos las croquetas para mi y los pinchos para él y la verdad, todo muy bueno incluyendo las bebidas PERO el servicio de la bartender MUY MALO, estaba sóla en la barra y quizás por esto no te prestaba atención, te escucha a pero la veías como corriendo, los vasos vacíos por rato, se sentía tosca y cuando llegamos casi no habían personas en la barra por lo que a las 5 cuando el restaurante se llenó esto solo empeoró. El bullicio lo ignoramos pues así somos los Dominicanos🤷🏽‍♀️Deben mejorar el servicio, es cuanto."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMFJ6azVWa0Z2ZFZjeGVHMWlkamM0WnkxT05uYxAB",
            "text": "By far, one of the best restaurants in NYC. Every time I eat there, I leave with a big smile on my face and a full belly. You need to go!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQMmtrZXJDd2NlcWFREAE",
            "text": "Was there last night and the experience was horrible. Our server clearly needs customer service training and POS training. It was 3 of us at a table, we all ordered a bunch of different appetisers. This is where I think POS training needs to happen, the two of us received one dish at the table throughout the whole time. By the time your dish came out, the other person was already done. Third person never received the soup they ordered. They only wanted just the soup, our server never once apologised for the delay. He’ll just pass and say “it’s coming, we are making it fresh”. After we’ve had all the food that came one person’s plate at the time, we asked for the check and we had given up waiting for that soup and the person was ok with not eating. Server demanded to know why we no longer wanted the soup. I explained we got one dish at time, mind you we were not sharing any dishes. 2 of us had finished eating 2 app that we both ordered. He told me that’s how they serve. Each person gets a plate at different times."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLajltc0NRaEpyaURREAE",
            "text": "Visité este lugar por primera vez el verano pasado, me encantó. Hoy llevé a mi familia para El Día del Padre, y fue muy penosa la experiencia. La comida estuvo súper salada y el servicio horrible. Briana L. , el servicio al cliente es muy importante. Necesitas trabajarlo un poquito. ¡Qué pena!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaFJWVTRTVXRsWDBWUGNYWlpaV0ZrWHpsVFZYYxAB",
            "text": "Different brunch meal, not the typical steak and potato meal.  Was delicious, had the French fries with fried eggs, tomato and spicy chorizo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VONlYyWnFhNnZtR29nRRAB",
            "text": "Very relaxed vibe...very nice staff, great drinks and overall a great place to go when you want to sit and enjoy good company."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPRHc4OXlMaXF2dGx3RRAB",
            "text": "Excellent Latin food but I go there for the margaritas. Happy hours fun too if you're into that."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNREEwN3J5LXZtLVN3EAE",
            "text": "Very neighborhood vibe. Live music on select days."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMZno5ckxhMHZISkRREAE",
            "text": "The food is good, I didn't enjoy the atmosphere, people speak too loud and even if you don't want you  can hear their conversations, I took my food to go as my ears were hurting., probably is good idea to seat outside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ251b0dsemNUWnZnRRAB",
            "text": "We stopped by Tin Marín, for the first time, for coffee and desserts, just desserts. At first we thought that we would not be accommodated, but learned otherwise. The host was gracious and prompt.  Our server, Danielle, was very pleasant and accommodating, We were surprised to learn that they do not serve coffee at Tin Marín. Very surprised. I had a glass of port and not one of the desserts that I wanted on hand. The tres leches, we’re told, is phenomenal.  Didn’t get to prove that at all. The churro was delightfully tasty and freshly made. The flan was light and delicious and I totally devoured it. We will return. TBC.."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd1pmVU5BEAE",
            "text": "Everything was great especially the restaurant week menu. Great food portions.  My drink was different tasting but nice. The seating area is very tight and very loud when crowded.  Can't hear the poison next you loud .  I wouldn't come back during crowded hours.  It's dark there as well, which I don't mind, hence the dark pictures."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbXJLcUJREAE",
            "text": "A great go-to spot! Good food, cute aesthetic, great service, and delicious cocktails. The mofonguitos are always a hit. Love the variety of tapas—perfect for sharing. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfME8tNnNnRRAB",
            "text": "I have been here many times and it is always amazing! The food is delicious and their happy hour is top tier. The patatas bravas, steak and salmon are my favorite dishes."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cm9fWVhREAE",
            "text": "I had a cozy experience at this restaurant. I stopped by for happy hour and started with their sangria, adding a mango flavor☺️💛 Then, I followed the bartender's recommendation and tried the passion fruit addition, which was really good😌. For my meal, I went with the seafood Suquet, paired with a side of rice and beans. It was amazing🙌🏽"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPczVXNnZnRRAB",
            "text": "Service was excellent!!\nWe came here to celebrate my mom’s birthday.\n\nThe ambiance was very intimate, at the same time very loud and live. The waiters and all staff were extremely polite, friendly, professional, it was perfect!!!\nThere was a gentleman that seemed like the owner or manager, that made us feel welcomed right away and like we were long long friends.\n\nFood was excellent, I really didn’t expect all plates to be so delicious. Every plate was made from perfection, starters and entrees as well.\nDessert was even better than the food and that says a lot!!!\n\nI really enjoyed my time here.\nAlthough there was a long wait, (cause they were not really making reservations, it was a first come first serve kind of system), we NEVER felt rushed to empty our tables. We finished eating and drinking and stayed for the live band for about an hour more, and they never suggested we had to leave or brought the bill like they do at some other places. And believe me, as soon as we decided to leave, someone was already standing up next to the tables we had so that they could sit."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbWVISXNnRRAB",
            "text": "I had a great experience at Tin Marín Tapas in Riverdale. From the start, the staff was wonderful—attentive without being intrusive. One detail I really appreciated was how they naturally replaced our utensils after the appetizers, a small but thoughtful touch. Speaking of appetizers, we had the CHULETITAS DE CORDERO (lamb chops with truffle cilantro mashed yuca and red wine reduction). The texture was perfect, and they were cooked just right (I got them medium). My only minor gripe was that I expected maybe three or four chops instead of two, but since it's an appetizer, I get it.\n\nFor the main course, we split the PAELLA DE MARISCOS (Spanish saffron rice with clams, mussels, shrimp, lobster, and white fish). It takes about 35 minutes to prepare, but it was worth the wait. The portion was generous—we even had leftovers to take home, which made up for the smaller lamb portion. Flavor-wise, everything was on point.\n\nA surprise highlight of the night was the live performance after 11 PM (I went on a Saturday). We didn’t expect it, but it definitely set the mood—even if it meant we had to pause our conversation! Also, my dining partner had the passion fruit mojito, and she loved it.\n\nOverall, this place is a definite win. Great food, solid service, and a lively atmosphere. I’d absolutely recommend it and would come back. 5 stars!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob2EtYUV3EAE",
            "text": "I love dining around the neighborhood and this is one of my top three. They have live music on the weekends. We generally come for an early dinner after work. We’ve literally tried everything on the menu and its delicious any authentic. I leave a little tipsy definitely happy and insanely stuffed with decadent food…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaLWJHMmR3EAE",
            "text": "Hola a todos chicos! Bueno, hace como 2 meses fuimos a comer esta restaurante nuevo para nosotros. La atencion dentro de todo fue inmediata y nos sentaron rapido en una mesa hacia la calle, me gusto eso. La chica que nos atendio, fue amable, servial y siempre con una sonrisa. La comida no fue tan súper o muy buena, uno de los platos que realmente me decepciono fue el Pulpo con Platanos Fritos, no tenia gusto a nada, era como el aceite y el agua. El plato de mariscos fue dentro de todo bastante regular, pero es como masticar chicle, chicos y el Plato de Champinones. No sé quién es el Chef, pero tiene que pensar más en poder unir los sabores y hacer platos más ricos.\n\nHello all guys! Well, about 2 months ago we went to eat at this new restaurant for us. The attention within everything was immediate and they seated us quickly at a table facing the street, I liked that. The girl who served us was friendly, helpful and always with a smile. The food was not that great or very good, one of the dishes that really disappointed me was the Octopus with Fried Plantains, it had no taste at all, it was like oil and water. The seafood dish was pretty average overall, but it's like chewing gum, guys, and the Mushroom Dish. I don't know who the Chef is, but he has to think more about being able to unite the flavors and make richer dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNabHBjSBAB",
            "text": "Delicious food and adult atmosphere. Fits nicely into the neighborhood. Service was attentive and staff courteous. Food comes out quickly and served by the entire team. Amazing how busy they were and how quick the food was being served. Definitely worth visiting if in the area. The empanadas were my least favorite. Meatballs were extremely flavorful and moist."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM2lnNXJJaTdEa29nRRAB",
            "text": "Great tapas; decent wine list.\nA little too loud"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN3ZxZVBREAE",
            "text": "Overall rating: 4.9\n\nCompletely worth the trip to the bronx. I stumbled here after visiting one of the nearest gardens & the food was soo good. We got a pitcher of the sangria which I don’t think was totally worth it. It was good but not as strong as I wanted. But the food was amazing. I went with a friend and here’s what we ordered:\n- Caprese ensaladas: 5/5 absolutely amazing\n- Papas Bravas: 6/5 sooo good\n- Chuletitas de Cordero:  6/5 I would come back just for this"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPa3B5aDN3RRAB",
            "text": "We went to this establishment, wanting to try something  new.  The place had a great atmosphere,  the waitstaff was good and attentive. We ordered  from the manu. That was simple  and understandable.The food came out  on time with out any issues. The steak was very good, the appetizers was the right proportions..and service was overall good..we will return..the only issue  is the slope and the seating outside.. it is hard not to think your about  to fall if you sit back and relax  in your chair , just me personally.. sit inside if your a big size person if your concern about this.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNjlmQ3RRRRAB",
            "text": "Went here for the first time last night to celebrate my best friends birthday and boy did we enjoy! The service was friendly and honest! (Our served was honest about recommendations which we so appreciated) everything was delicious! The drinks and live music made for a full experience. I will definitely be back soon! Thank you guys! Also without even asking they made sure to add a candle to my friends dessert for me to sing! Great time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNGRTSHFBRRAB",
            "text": "We love going to Tin Marin with the family. The drinks and the food are really good and the staff really nice. They also always have great music!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzLWZyU2x3RRAB",
            "text": "Good cozy place to relax and have some good  drinks and dinner. When ever there is live music is even better. Waiter was friendly and attentive, even though the place was packed. If you want to enjoy some live music and have a relax time this is a good place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibkxMTlhREAE",
            "text": "Tin Martin is hands down the best, most fun restaurant in the Kingsbridge/Riverdale area!  We had the melt in your mouth lamb chops and delectable white fish croquettas plus churasco skirt steak alongside Pinot Grigio and Malbec. Even the bread was good. The atmosphere is lovely and fun. Great crowd. Great music, sometimes live. Sit inside or out. Highly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaThTbmZ3EAE",
            "text": "The staff at Tin Marín is very welcoming and friendly. The food is delish, everything from the tapas to the main dishes. The ceviche is to die for! Meatballs are amazing! Lamb chops over mashed yucca is my favorite! This restaurant is great for date night, girls night out or just because. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveDQtTS1nRRAB",
            "text": "We planned our date night last minute but were looking for low key, relaxed style for some good grinds as we say in Hawaii!  We were delighted to find some amazing live music as well.  The energy and vibes were wonderful - we would definitely go back.  My arugula and beet salad was on POINT!!  So delicious - Thank you for an amazing evening"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dko3N3FRRRAB",
            "text": "Very delicious!!! Lots of good options. Docked a star only because I wish there was more carbs to soak up the sauce on shrimps & mushrooms ✨"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMzZyT2d3RRAB",
            "text": "Delicious service. Lovely vibe. The bacalao and yucca dish was heavenly! Everything else was on-point, from the perfectly made tostones, the coca/flatbread, the bacon-wrapped, Bleu cheese-stuffed dates, cabbage/potato/chorizo soup."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVZ1lmcl9RRRAB",
            "text": ".\nPros:\n(+) Excellent tapas\n(+) Grilled octopus is a must!\n(+) Outdoor seating\n(+) Seasoned olive oil with the complimentary bread was delicious\n(+) Great food presentation\n(+) Clean bathroom\n\nCons:\n(-) The tapas are pricey\n(-) Night time, the music is too loud...hard to have a conversation"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eXBQbWZ3EAE",
            "text": "I absolutely love Tin Marin, I always get the best service, great food and even greater drinks! They had live performance today which is always a great treat. The Paella is my favorite for appetizers I recommend the mofongitos and setas , I personally love the lava cake and ice cream for dessert!! All the drinks are great I like the suavemente if you want something fun and not “too” different Rubia makes dope cocktails 10/10 recommend"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dThUdWRnEAE",
            "text": "Found this little place in Riverdale.. the cod with yucca was something out of this world. The owner’s mother makes this dish. The streak was how I like it. Medium rare. Enjoyed the pastelitos, and the mofonguito of shrimp. The presidente beer was nice and cold."
        }
    ],
    "reviews_count": 74
}