{
    "name": "Tibbett Diner",
    "place_id": "ChIJM3k1rJXzwokRQj1A0KOxjtc",
    "grid": "BX8",
    "address": "3033 Tibbett Ave, Bronx, NY 10463, USA",
    "rating": 4.6,
    "user_ratings_total": 1030,
    "phone_number": "(718) 549-8893",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUFMyYzJjRFpZUjNoUlIwTkthelJ5YVc1b1dsRRAB",
            "text": "😋🌽🥙"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRk9YcHBUVWh4YUVaT1QxWmtOM1J1UWpac1pHYxAB",
            "text": "I have eaten here and ordered a number of times over the past 8 years, usually the food is pretty good...the last two times were not. I ordered a brisked sandwich today, and the meat was SO dry...smelled and tasted old and gross, I barely had a couple of bites. Never again."
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVZFSjZZMDFqZVVvdFpGTm1VSE5JV0ZCU2RtYxAB",
            "text": "מקום נחמד, לא לצפות להרבה.. אוכל ממוצע.\nאכלתי שם במקרה על הדרך .."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGclJXcFliMDVPUVZORVRqUnFWM1k1YTJSd2RYYxAB",
            "text": "I've been coming here since I was like 10 years old. Best. Diner. The staff are lovely, the food delicious, fast service--it's the best place. I go here weekly, and i take everyone here! 100000/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ob2IwNWhPVVpaTVRkaVdsRnRhbUZTYTA0d1oyYxAB",
            "text": "Beautiful, Delicious n Calm to Enjoy a Good Meal. Breakfast,  Lunch or Dinner. Spent a very Beautiful Valentines 💝 with Wine, Candles, Seafood 😍 The works, Fabulous Time. We Fully Had A Great Time, Valentines..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUGRtbDJiR0p3VDI5SmJuSjBORVpxYTFJNVZuYxAB",
            "text": "Outstanding across the board, my server was Chris and she knows about the specials of the day. Lobster was on the menu,and I had to have it 😆 🤣. It was\nCooked to perfection...it also came with a choice of soup or salad. And two sides,I\nOrdered the mashed potatoes and broccoli cooked in garlic and oil.\nThe mood at the restaurant was just right.\nI'm beyond joyful, regarding my experience at the tibbett diner. Everyone that works there works as a team.\nTibbett is family,full of ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNlpFdHVORGh5VG1velFscGZSa2RRV2pkWE9GRRAB",
            "text": "Pleasant place to eat. Traditional diner. Had the Western Omelette sandwich, very good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWloyVkdSR0paWVROM1NWUnRNWEk1YldkdlZuYxAB",
            "text": "It’s hard not to recommend this place to everyone."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4alNIWlJWWFZTUVc5aWFESTNZMHBQV1Vadk1FRRAB",
            "text": "The food was good as was the service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WWFIVnljR2d0ZGtaVWFXeDZiMHd6ZFU1a01WRRAB",
            "text": "Only the best diner, ever! Say hi to Nick!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213dFgyUTFkazV2Vm1RNFJuQmlNRXBwVkhrNWRFRRAB",
            "text": "Met friends for good breakfast at good prices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV00xUkhTMUZEYTBKVlVuVTVZbWxaWkRsWGNsRRAB",
            "text": "Ordered a cheeseburger with saute onions, mushrooms and avocado. The 4 slices of avocado was all black. They should not put rotten avocado on a good burger."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMWFtSlNVMlZ6TUROdE9URlRVSEpqTWtjNGVXYxAB",
            "text": "This is an old-fashioned diner with standard diner food. It is a very popular popular brunch place on the weekends, so expect to wait sometimes. The owner is very friendly, as are the staff, especially one waitress who always welcomes us. She always makes sure my son gets crayons or markers to draw with.\n\nWe love getting pancakes there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNMkVpS080NVBtdEJBEAE",
            "text": "Did not like the sausage, it was more like a hot dog, very disappointing and the potatoes had an off diluted taste like they had been soaked in water, this was for breakfast."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKX18xb2lRX1pfTjlBRRAB",
            "text": "Es la primera vez q estoy d visita en este lugar..mi experiencia fue muy horrible..no estaba para nada ocupado,todos platicaban,solo pasaban y nadie se acercaba para tomar la orden..hasta 20 min despues alguien finalmente se acerco..Me encantaria que mi jefe hubiece vivido esta horrible experiencia conmigo..para q vea y compare el servicio q sus empleados ofrecemos...para nada  recomiendo este lugar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcUJsUGE2a2FqXzd3RRAB",
            "text": "Great neighborhood diner. Reasonable prices, enjoy the food."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNFBQSmtBRRAB",
            "text": "Favorite diner to eat while visiting NY."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJcmo5NGFwZ2RieFZnEAE",
            "text": "Cute diner but truly confused at their 4.6. We came for breakfast. The potatoes were super bland and service was lacking. I also found it very distasteful that the waitress, what appeared to be a regular customer and the cashier/hostess were partaking in bets as to how much a table would leave for a tip. They were grossly undertipped but there is a clear lack of attentiveness with certain groups from the waitress.  We waited a bit for service, food came super quick though. Sure the place will defend their staff. It is unfortunate from a neighborhood staple."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOcWdxX0NIMkl5Ull3EAE",
            "text": "Food was alright.\nI really liked the atmosphere, very nice experience!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaHZXUTdnRRAB",
            "text": "Love this place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvck5tTHpRRRAB",
            "text": "True classic diner experience with friendly staff and delicious food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbzhfOEZnEAE",
            "text": "Best dinner in the Bronx!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURJdzZnUxAB",
            "text": "Best diner experience by a long shot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJa2VlcC1BRRAB",
            "text": "Food was decent. However, service was below standard. Waited 10 minutes for a server, who had a horrible attitude . Unfriendly & unwelcoming atmosphere. Waiter did not check on us, had to ask another waitress for help & check. First & last time for me here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNGJIZTJ3RRAB",
            "text": "A little packed when I went but the food was delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaDd1Tm53RRAB",
            "text": "Fun experience"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNUpYZ253RRAB",
            "text": "Great diner with good food. Service was fast and efficient.  Pancakes are outstanding. Didn't like service charge on credit card payments"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc3RQTENnEAE",
            "text": "Real old popular fashioned diner near my daughter's school. We went for breakfast and although the ambiance is nostalgic, the coffee was pretty bad and the food is somewhat mediocre. The service was OK even though they were really busy on a Sunday morning. It's a good neighborhood joint that bucks the franchises and cookie cutter places."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNWNQeml3RRAB",
            "text": "This is my favorite diner in the world. I thought I already gave this review, but just in case, here is another 5 stars."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNGRyaWlBRRAB",
            "text": "I went to school around here for 4 years and would pass the diner every single day. And for some weird reason I was always scared to walk inside but today while going to school for some business I went inside. Idk why I was so scared because the food was good, the service was good, everything was good. If I find myself around here, I’m definitely going inside even if it’s just for a coffee."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRazUyenVRRRAB",
            "text": "Staff is friendly and food prices are more reasonable than other places in NYC"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncVBpVHdnRRAB",
            "text": "Old school diner. I live in LA now and grew up in Riverdale up the hill. Tibbets is exactly the same as ever, which is great to see\"old school diner\" still exist. No such place in LA. Food was fine, it's the atmosphere NY da Bronx! 😁😀"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbnRfbUxREAE",
            "text": "Best pancakes in this entire neighborhood hands-down every other place that I’ve been to all diners in the Kingsbridge area have used corn flour in their pancake mix. The quality and inflation has affected everyone, but this diner I will be ordering from here for the rest of my time living here thank you and the coffee is incredible as well"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaDRpSWFBEAE",
            "text": "Great staff and food. Worth the money. Best diner around. Shout out to Cris, the waitress. She's amazing!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURFa2YzQkN3EAE",
            "text": "One of the best kept secrets in the Bronx."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbllLTTFRRRAB",
            "text": "Best diner in Marble Hill."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcGRmSEhBEAE",
            "text": "We've dined at Tibbett's over many many years ...  Good reliable old school diner in Kingsbridge.  Excellent service every time.  Either breakfast or lunch served exactly how you order - with a smile, efficient, generous portions and delicious.  Eileen is our favorite waitress, she's a gem!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfM3Iybkp3EAE",
            "text": "My first time visiting this diner, and I will say I was pleased with the food and the service. Not sure if I was extra hungry but the pancakes were delicious!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3N0oyR3R3RRAB",
            "text": "The absolute best. Quality, service. And they treat you like family"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMTlTZlVREAE",
            "text": "I purchase French toast totally horrible no taste it was to go order which I find they just don’t care when is to go. I wouldn’t go here or recommend it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcXRTWGlnRRAB",
            "text": "Cool American Experience"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNDRiWGdRRRAB",
            "text": "Very tasty"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bjQtOW9nRRAB",
            "text": "The best so far.veryfriendly and attentive ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmZy03bDB3RRAB",
            "text": "Been brunching here for over 20 years! 🤗✨🥰 Fresh and delicious 😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaGRmVVJREAE",
            "text": "Excellent sandwiches and service.  Very good value in a classic dinner setting."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNE1xdzlnRRAB",
            "text": "Usually my experience at Tibetts diner has been good.  Today though some young girl seemed uninterested in providing outstanding service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmZ04zaTFnRRAB",
            "text": "My family and I visited there last year Christmas. We are originally from Trinidad. Everything thing about this place was excellent. Can't wait to visit again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2elBPLWp3RRAB",
            "text": "We love this tiny neighborhood diner! Food, location. Wait staff the best!  My only advice is to sit all the way off to the left so you won’t be near the gunshot-sounding blasts of the guy shaking  open the delivery bags every minute or so. THWACK! THWACK!!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdThTVlh3EAE",
            "text": "Classic diner with an extensive menu that includes daily specials. The parking lot was full, which is always a good sign for me. I tried the daily special of the gyro platter and the chicken noodle soup. The soup was sufficiently savory and soothing, the lamb in the gyro platter was the typical pre-sliced thin patties, the lettuce was fresh romaine with nice thick slices of juicy tomatoes and red onions with a generous dusting of briny feta. The portions are also generous and I wasn’t able to finish my meal. The prices are very reasonable and the service was exceptional. Definitely adding this Tibbett’s to my list of go-to diners."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQc2ZQMkd3EAE",
            "text": "My best breakfast spot. Get the pancakes oh man! Awesome"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMWEyd2dnRRAB",
            "text": "An old style Greek diner used as a set by a TV show delivers fine food almost as fast as a fast food restaurant. Waiters are pros. I ordered soft bacon and well-done home fries. Seltzer is complimentary. Before 11AM coffee and juice are complimentary."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNzZ5MWVBEAE",
            "text": "A mom and pop restaurant that has fine tuned its food and service but their prices are great too. This restaurant serves authentic food not found in too many places. Their Irish pudding, in one of the plates was definitely a special treat.…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdWZxZ1FnEAE",
            "text": "Been a frequent visitor of this place for the last 15 years. They've experienced no drop in quality, consistently good American diner fare. Wonderful service and the owner is an absolute pleasure to have a quick chat with as you eat. Love this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZdV91LVVBEAE",
            "text": "As diners go, this one ranks up there with the best. Great location, atmosphere, and food. I had the Italian pork chops which were delicious. The chops are served with a tomato and vegetable sauce poured over top of them. I will say that they went overboard on the the sauce (see pic), but still was delicious. The sides were spinach and rice mixed together and mashed turnips. Where I'm from, turnips are hard to come by on a menu, so it was refreshing to see them here. The spinach and rice was a nice touch too. I'm sure breakfast is killer here. I expect to return to try it. I highly recommend this place for anyone looking for an affordable well prepared meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3djhHbENnEAE",
            "text": "First time ordering delivery from them and I wasn’t asked if I wanted to pay card or cash. When the delivery arrived he told me it was cash and thankfully i found the amount since i was totally expecting card payment. The delivery person was really rude. Basically left me with the word when I asked him how to make sure I’m paying with card next time I order by phone…. First and last time with them. Food is bad and service is horrible. Worst waffles I ever had."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSb29tQUFREAE",
            "text": "Classic NYC diner vibe. Mushroom Swiss cheese omelette w/ home fries, rye toast and a side of bacon, and field greens salad with London broil, and two coffees, of course. Friendly, attentive service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbUxEM3N3RRAB",
            "text": "Small and busy Diner. Big portions. Parking is very limited. Be prepared to wait to park. Food was good.  Prices are moderate.  Service okay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMl8yNS13RRAB",
            "text": "I’m from Jersey where I pride myself with knowing good diner food. Love love love this place! I take trips here to treat myself to yummy food with that good old fashioned diner feel. They are a TRUE diner. Service is great and the corned beef hash is delish!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMV9LRG5nRRAB",
            "text": "This was the quintessential diner. At my table we ordered Scrambled Eggs, Sausage, a Western Omelette, French Toast, Corned Beef Hash, Home Fries, and Disco Fries. The taste, portions, service and prices were all great! If you’re in the mood for diner food this place is perfect!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbDZXdVNnEAE",
            "text": "Great small place, has a lot of variety on their menu, good service. Great hidden gem in the Riverdale kingsbridge area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeWYydFRBEAE",
            "text": "Their customer service is top notch! they are really really nice! One of the top food i recommend that everyone should try id the disco fries! They tastes so amazing! Brown gravy on the bottom and mozzarella cheese on top. Other food I had,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bjdxRmdRRRAB",
            "text": "Found hair in my sandwich and then called the waiter to have it sent back. The waiter had the audacity to say it was either cheese or tomato. I had to then call another restaurant employee and ask him what he thinks the strand of hair is. He agreed it's hair and they then decided to have it changed. The gall to call a clear strand of hair cheese or tomato is ludacris. 0 stars for service and will definitely never come back. Also take a look at these sad house fries."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbXJqdUxBEAE",
            "text": "I heard nice thing about this place, It was busy by the time I was there, food related: they might been changed their cook staff recently cause food is missing of flavor in my opinion, or maybe was because or the rush time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdk5PWlN3EAE",
            "text": "Classic diner vibes randomly came upon this one day afternoon and will def be going back…quick service good atmosphere and the food was very good !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZZzR5VklnEAE",
            "text": "It was a nice family diner experience, the food is sugar and salt controlled. The customer can apply as much as they want, the capochino was cool it had a nice presentation. I had the alpine burger it was good but the place could be pricey."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dzllazN3RRAB",
            "text": "My family's been coming here since I was a kid and my grandma lived in the area. I live in Queens now, but still like coming here when I'm in the area. The staff is super friendly, food is great (big portions) and affordable, and there is parking. Best of all are the characters that come to this place, so it is incredible for people watching because there are a lot of retired people from the area that eat here. Overall this has a special place in my heart and I'll definitely be back!\n\nPS really good selection of desserts as well."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnc1lXcWZREAE",
            "text": "Worth the trip to the Bronx.\nPerfect Greek salad including an anchovy along to one of the best mousakas I've ever tried, full of ground beef, potatoes and eggplant slices, topped with the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNU1xVjdBRRAB",
            "text": "An establishment that has been in my life since I was a lad. I will take a second mortgage out on my house in an effort to order more food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrcnBmc2ZREAE",
            "text": "Classic NY diner! Good food, welcoming service. Check out the daily specials."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaODhPM29nRRAB",
            "text": "Amazing food! Amazing service, quick fast and attentive! For a busy Sunday morning , we waited about 10-15 minutes, it is a small location, but we got our order in and our food came out, very quickly! Best diner I’ve been too, reasonable prices! Amazing breakfast the challah bread French toast was amazing, eggs cooked to perfection & Caesar salad was delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5enNmWXdnRRAB",
            "text": "Went on a Saturday and it was pretty busy. Fortunately we didn't wait long for a table. We ordered a basic breakfast platter, eggs, bacon, potatoes, a pastrami sammy and french toast. All the food was delicious, well cooked with care. Service was very friendly but a bit slow but understandable seeing how busy it was inside. No complaints in that regard, tbh. Will be going more regularly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb2FPcjNRRRAB",
            "text": "Loved the food, the service, the entire experience! Deluxe burger with grilled onions & mushrooms, and chocolate chip pancakes with blueberries & strawberries (the only place where I've gotten such a generous helping of berries!). The food was great, the person serving was very friendly and helpful. Definitely going to visit again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwN1phOGZnEAE",
            "text": "This place is busy which is cool. Service was very fast and food was fresh and tasty."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnc05MaS1BRRAB",
            "text": "A most wonderful neighborhood diner where the waitresses knows to bring you regular or decalf before you've even been  seated. It's not fancy food but everything on the menu is delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdnZmVU13EAE",
            "text": "Nice Irish breakfast - big portion and reasonable price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOM3RTV1dBEAE",
            "text": "Love this place! The food is really, really good, and the waiters are all very nice. The philly cheese steak and Belgian waffles both tasted absolutely delicious. I would definitely come back again soon."
        }
    ],
    "reviews_count": 76
}