{
    "name": "Home BX Steak",
    "place_id": "ChIJ4V1lvjHzwokRind0ISFkC-w",
    "grid": "BX8",
    "address": "224 W 238th St, Bronx, NY 10463, USA",
    "rating": 4.3,
    "user_ratings_total": 280,
    "phone_number": "(929) 243-3527",
    "reviews": [
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb2NWOWtPSE0yY25sclVuZFBiR1ppZDB0eWVGRRAB",
            "text": "I wanted steak and this place was open not to far from my house I ordered the Rib Eye medium and it was really good I will definitely be going back"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFltNUtlVGhJWm5Ka05FRjZiVVE1TTNWRmExRRAB",
            "text": "Uyy primera vez que fui y quede como amor a primera vista!.. ideal para pasar un buen momento ya sea con una persona especial o en familia!.. el ambiente de noche es muy romantico, La musica, La comida, el servicio .. ufff todo! Super bueno! Vuelvo pronto!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSk0zcEVRMjlWUm5kTlFsbERVWGREUkdOd2EyYxAB",
            "text": "Great service ! Always love coming here for a chill vibe. Irma, the server is amazing and the drinks she makes are always spot on and so delicious!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab1ZIcGplbXh2Y1ZKR1MxRlZjV2RaWm01M2VXYxAB",
            "text": "Don’t get me wrong the atmosphere and food are amazing, but the overall service is horrible for the price you’re paying. Spending approx 200-300$ bucks on two people the least you can do is be attentive. Server “Irma M.” needs to lock in and cater to her guest more. She said two sentences total to my party the whole night, which were  “you ready to order” & “do you want dessert”  Thankfully all the other servers had no problem helping us get the things we needed to enjoy our dinner. Auto gratuity inclusion is clearly the reason for this lack of concern."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSmFVZHdhV0ZYTFhCeFQzSXlWekV0YlZkYVZVRRAB",
            "text": "Went in for Sunday afternoon by myself at the bar. Bartender was sweet but other than that not really worth the trip. Oyster we’re good. Steak on the other hand was not I waited about 45 minutes after I was done with my oyster for it. It’s advertised as a prime serlion 100% not prime. Select at best the fat cap was still on and very veiny. Very tuff I asked for medium rare it was medium well. I didn’t want to send back as I already waited a long time for it with nearly empty restaurant. Cream spinach was good.  It’s fine if you don’t serve prime but advertised with honesty. Being that I am in the restaurant industry myself I would know the difference."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReWNFWkJPVVZNWVhWRFV6SXlWV1F3WjNsVE9GRRAB",
            "text": "While food quality is good, it's way overpriced. Mid-town pricing in a so-so Bronx neighborhood. Very loud music, which makes it obviously difficult to have conversation. And only \"ONE\" bathroom for a large location. No coffee offered among other customer choices..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMGFVdFpiMEZKZVZwSWJqUnJOV3RJV0daWGNWRRAB",
            "text": "The service was great the food was delicious and the location was on point. The atmosphere was very welcoming the drinks were well priced for happy hour. I would definitely recommend the tamarind sangria. Yummy. The calamari was cooked right. Definitely recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGb1pqZDBiRkl3VEdGaGRFdGZaRmhEU1MxS1ZXYxAB",
            "text": "They don't know how you treat people the bartender was arguing with his boyfriend messing up my drink what in the love and hip-hop is this service sucks and the drinks\nThe bacon was good the lamb had no flavor and it sou d like a cafeteria when you walk in chaos I think they own that place that mysteriously burnt down on 238 th and Bailey im not impressed it's not worth the hype it's loud like bbqs"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFRWSlVTVTVsYW14YVZuRnBNa1pLTmpaQk0yYxAB",
            "text": "Amazing service, great food. Our waiter was very friendly and helpful. Definitely recommend 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbWMxbHVOV0ZsTkhnd1QxTXljbWRZTnpWU1kwRRAB",
            "text": "This place is really a hidden GEM in the Bronx! I have walked in here since the day they opened and it has yet to disappoint! The greeting from the door until you are seated is pleasant & the food is 5 star! We had the Còte de Boeuf & it was amazing. We then moved over to the bar where we were greeted by Irma and her amazing smile & silent humor.\nThis place is a must try… you won’t be sorry you did!\nWe’ll be back soon!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MWJHZGZVbk4xZDBGYWFETkdaR0UwUms1QlMzYxAB",
            "text": "Irma is an amazing bartender, she is always so attentive and make sure your always taken care of!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa1dGaG5iemxDYlY4NFJHWk1XbUpXUlc1ck5rRRAB",
            "text": "\"BX Steakhouse in the Bronx is a hidden gem, one of the needles found in a haystack. In a town overflowing with Dominican cuisine, this spot stands out as a top-notch destination for steak lovers. The ambience is exceptional, the service is top-tier, and the drinks are expertly crafted. But it's the food that's truly out of this world. The steaks are made from quality beef, cooked to perfection, and paired with incredible sauces and side dishes that will leave you speechless. I had the carpaccio, and I can confidently say it's one of the best I've ever tasted. If you're looking for a dining experience that will exceed your expectations, look no further than BX Steakhouse. You won't be disappointed!\""
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNk1uQkZhVmRMT1hoRWJXTlhhV1JtUWtGYU9YYxAB",
            "text": "BX Steakhouse hands down served me the best steak in the city. Perfectly cooked, full of flavor, and absolutely unforgettable. After this meal, I’m convinced—I’ll never leave the Bronx again. A must-visit for serious steak lovers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJX1R4OGJYLXFDTWhnRRAB",
            "text": "Food was not even seasoned, only thing that was good was the drinks !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeE5FOXlUbGhuVFZOemNUWTRla0ZxUkZKSVgyYxAB",
            "text": "Bx Home Steakhouse truly feels like my home! It’s my favorite spot where I can unwind and enjoy myself in a welcoming environment. The atmosphere is fantastic, creating the perfect vibe for relaxation and good times. The staff are exceptional—friendly, attentive, and always pleasant. The manager consistently greets guests with warmth and ensures everyone is well taken care of, which really makes a difference.\n\nThe bartenders, Irma and Jose, are outstanding at what they do. Irma, in particular, always goes above and beyond to ensure every detail is attended to, making the experience even more enjoyable.\n\nBx Home Steakhouse consistently makes you feel like their place is your place. It’s a special spot that combines great service, a friendly atmosphere, and a sense of community. I highly recommend it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOREo0TTcyaXVHeGhBRRAB",
            "text": "I’ve been coming here consistently for the last two years. It’s become my home away from home. The success of a business is a trickle down effect from management. Management is always hospitable and welcoming. And the staff? A+.. Irma is the gem of the bar. Always smiling, attentive and her mixologist skills are amazing. Give them a try and prove me wrong."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVE5fWl9xeklIeGVREAE",
            "text": "Great atmosphere, Amazing food, bartender Irma very attentive and good service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSd1JVaHJlR1ZZUkhCNVJqSkNPVWsxVDBOb2JYYxAB",
            "text": "Great time, great atmosphere and great food.  Irma our server / bartenter was attentive and made the best drinks. Margaritas and Mojitos were off the hook. I recommend visiting this place you wont regret it. Dont forget to ask for Irma, she will take care of you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relF5MWpZV3hUTTBwVVNuSkZUM3A2VEhCamJHYxAB",
            "text": "I ordered chicken wings and there are so salty you only taste salt i didn’t complain I just wanted to mention to the bartender but she acted like didn’t didn’t want to hear about it didn’t respond\nVery disappointed they have this salty wings I have tried before other food dishes they are good but this never again don’t order this if you there"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQaWtpTHl5dkpXN1lBEAE",
            "text": "If you’re looking for a steakhouse, this is not the place. I asked for a medium porterhouse steak, I received a different cut steak, looked boiled, chewy and not seared. The drinks were good and service was good. Not a steakhouse!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLR25wWUNNZ0xHNVFBEAE",
            "text": "Not your traditional steakhouse in my opinion but still a steakhouse if that makes sense. It gives a nice rustic family vibe with an open concept. I had this place bookmarked for over a year made my way down 2 weeks ago because I wanted oysters and they had happy hour where they were $2 each. Let's just say I made the most of this and downed about 18 oysters by myself lol  the happy hour drinks are good I didn't like the coconut mojito too much but the white sangria 10/10. The service is friendly warm and attentive I also enjoyed the comp bread and butter, I also had the pork belly with garbanzo beans and that was soooo yummy the highlight for me mad I didn't get dessert. I will definitely be back again with friends next round."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWHc4TW1PM3ZQQzVRRRAB",
            "text": "Un lugar genial! Me encanta!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN0Jnc2pWdGRxQzZBRRAB",
            "text": "The food was so good.\nMe and my man had Steak\nMacaroni and cheese and potatoes. He had Mediterranean salad and I had Caesar salad I didn’t get to take a picture but it was finger licking good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLbUdsSVBwdTlYcjZRRRAB",
            "text": "Food took extremely long to come out and when it did it was COLD I ordered steak with cream spinach the steak was cold and the spinach was kind of raw it was crunchy and my daughter ordered lobster mac & cheese and it was cold and salty i told the waitress that my daughter didn’t like it she stood there with her hands folded across her chest with the expression on her face LIKE WHAT YOU WANT ME TO DO… and to end it off my stomach was hurting all the way home.. im never coming back here first experience was the Worst experience"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OUtXMXVRRRAB",
            "text": "This place doesn’t disappoint the food and drinks are always good and delicious! The servers and bartenders are attentive and really nice. It has a dim light ambiance making it cozy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMlJnb3pSbkp5RTh3RRAB",
            "text": "Thank you, the dining experience-food & services were great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZekltOW9nRRAB",
            "text": "In a neighborhood with a ton of friendly bars this is the most unfriendly. If I wanted a bartender to be rude to me I’d just drink in Manhattan"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMThIZVVnEAE",
            "text": "I don’t usually go spur of the moment, but the happy hour all day Tuesday’s was awesome!\nThe chimi sliders and calamari’s is delish!\nRed sangria is off the hook!\nMelvin is amazing!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXNyaGRnEAE",
            "text": "Largo tiempo de espera"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3N3ZqN2lnRRAB",
            "text": "Great ambiance, staff is attentive. They often have live music which I love. The food options I've tried have been really good. I don't think I have tried any other drink other than margaritas here, and usually go for the The Dark Side of the Bronx one. Love the smoky taste."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dE9PcThnRRAB",
            "text": "Third time coming to this restaurant and the food is delicious, great atmosphere kind staff a must try definitely!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LXF1U0t3EAE",
            "text": "The drinks are always amazing and so is the food. The atmosphere is very nice, especially when they have live music."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd2F2dUhnEAE",
            "text": "My favorite steakhouse in the Bronx! And in New York! Food is amazing. Staff is super nice. Oh my God, the cocktails.! To die for."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncV8yX1N3EAE",
            "text": "One of my favorite restaurants! Their lamb chops and Mac & cheese are my fave! Also love their lychee martini. Delicious! The food is always on point, staff are friendly and the vibes there are amazing. They also have live music! HomeBX is a must!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDdpaDNRRRAB",
            "text": "Amazing food and service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbnZ6cHlBRRAB",
            "text": "The service was excellent, the drinks were strong, the scene was ambient but the food left much to be desired.\n\nWe were mostly satisfied with the apps. The crab cake was a bit overcooked outside but the inside was great. Lobster Mac and cheese was really good, had lots of lobster. Salads were good.\n\nThe steaks tho, none of us were satisfied with. We all ordered rare or medium rare and all were overcooked.\n\nThe mash, no one touched. Super dry and smelled funny. Tasted like boxed mash,\nnot steakhouse mash.\n\nBill was $430 for 4 adults, 2 kids with 5  entrees, 4 apps, 3 alcoholic drinks, 3 non-alch drinks, and sides were included with entrees, so price wise, this place is a steal. It’s smaller budget friendly, but a steakhouse is a steakhouse so it’ll cost over $100 easily for 1-2 persons.\n\nWe chose this spot because we wanted to support small local business in the Bronx  but unlikely we will return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfazU3LU13EAE",
            "text": "I have been here for Brunch and Dinner. This place has a cozy/friendly feeling. The staff is welcoming, knowledgable and attentive. The food is great quality and delicious. Whether it is for a quick bite, girls night or just a drink, they never disappoint. If you haven't been here, do yourself a favor and head over."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeGFLbTdnRRAB",
            "text": "Super nice and elegant food and drinks are amazing 👌"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2enJ6Q0FnEAE",
            "text": "It 20 minutes to get water and additional 15 before I received a menu (had to ask for it).\nAfter 50 minutes of waiting for Churrasco and fries, I  gave up and walked  out.\nNext time I'll come with my Spanish friends."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LUpqWVBBEAE",
            "text": "One of the best steaks I have had in a very long time! Definitely recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQak95VUpBEAE",
            "text": "I tried this place for the 1st time tonight with my wife and kid. Ordered 2 drinks, and the bar tender was on point. We had the porterhouse, crab cakes, bacon,  and the chimi sliders and it was all delicious. The vibe was perfect. Good for the fam and great for the younger crowd. The waiter was awesome, walked us through the menu, super attentive. The price was right for a Steakhouse. Stuffed and Happy. Can’t wait to come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbE16UnpnRRAB",
            "text": "Was having a great time until they served me near spoiled $50+ steak and tried passing it off as fresh - lost faith that the restaurant uses fresh ingredients - got minor food poisoning afterwards.  Would not return."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb015ZDZnRRAB",
            "text": "We went there on a Monday night. They played sports on their tv that you can watch. The place has a good atmosphere, like a mysterious and romantic atmosphere at the same time. The waiter was very attentive and made us recommendations. We ordered a picadera or platter of various meats such as steak, shrimp, chicken and sausage with fried green plantains and fried yuka. The food was on point. We had a good time there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMElySVZ3EAE",
            "text": "Food was delicious. Sangria was good. And our server Melvin was as amazing. Truly notable service, the restaurant is lucky to have him."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueTlQUWpRRRAB",
            "text": "I've come here quite a few times. I can't say it's always great but as a business owner I have to bring it up to attention. I was drinking beer (which they were great) .I had to call to the bartender (erma?) Multiple times to get me a beer. The bar alone i counted held about 15 people. 5 people at the bar and There were 8 people in the whole establishment. There was no reason for her not to ask me for a refill. I had 3 beers but I would have drank 5 and I didnt just because of the non attention. There were 2 empty glasses of mines while I drank and I asked for the bill and went to the bathroom. The bill was there in the 2 min it took me to use the restroom. Faster than any bill I ever got. I gave her $5 cash as tip . The minimum i tip is $20 when I am drinking, no matter what I drink. The only way I will only come back is when I'm invited. I was there from about 9pm till 12am."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuODZDVmpnRRAB",
            "text": "The food is decent, but the prices are unreasonable when considering inconsistency and the service. The service lacks especially in comparison to similar style restaurants. Some of the staff are kind and friendly others act like you’re doing them a favor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cWEtSjFRRRAB",
            "text": "Great service, staff are very nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MkppRDBnRRAB",
            "text": "I came here Saturday night with my partner and we were so impressed with everything. Shoutout to our super star waitress Kiara for going above and beyond for us(she deserved a raise).  I’ll keep this short and sweet you need to make it your business to come here. No disrespect to all the steakhouses in Manhattan but this place has a vibe no where else can replicate. I started off with the onion soup and knew right away I was in for a fantastic evening it was so delicious. My steak was perfectly done at medium rare oh and I had the cote de bouef.  I wish they made baked Mac and cheese but the Mac itself was delightful. The whipped mash potatoes and garlic sauce were immaculate. Ask for an old fashioned if you are a drinker you won’t be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyd05fSnF3RRAB",
            "text": "Amazing happy hr drinks and prices and Amazing food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycGY2R1Z3EAE",
            "text": "Nice vibe."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydmJxNEl3EAE",
            "text": "Neighborhood Gem!! Love coming here for Happy Hour before heading one from a long day. Today I ordered the Pork Belly & Calamari from the Happy hour Menu never ordered this items before but pleasantly pleased with my selection. The calamari is so flavorful every bite is crunchy and delicious it’s paired with two sauces but honestly one of them I favored over the other lol. My most favorite thing on the menu is the Baked Oysters. I have never enjoyed oysters so much the way you prepare them. I have to order the appetizer for myself i refuse to share lol."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGLVp5b1N3EAE",
            "text": "Found this little jewel on Instagram and had to try it so I took a friend out to dinner for her Birthday. My friend was quite pleased as was I. The food was amazing! The sevice was great and the bartender did his thing! It's a cozy little place with a nice ambiance, live entertainment and a happy hour as well. We'll be ba ck!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNnFpRHlRRRAB",
            "text": "What a fun night!!!!\n\nI was a little skeptical about the place based on the location but I have to say it was fun, the food and service was amazing. Prices were reasonable. The decor inside the restaurant was very basic. We asked to be moved from our original location and they were very accommodating even though the place was packed. I highly recommend to make reservations. Parking was somewhat difficult."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobmEzSzJBRRAB",
            "text": "My first time there and the decor was nice. Music was playing and I was told that on Friday they have live band. The bartender was amazing. She was professional and made great drinks. The restroom was clean and nice. Will return again and recommend to friends."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaGJ5WkVBEAE",
            "text": "Great brunch spot (will be trying dinner another time). We had a cafe con leche martini and a mimosa which were delicious and strong. The charcuterie board had a nice variety. The summer salad and cheeseburger were very good. The music was…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMGJpdFZBEAE",
            "text": "OK y'all this ones gonna be a long one. I am so so happy I found this lil hidden in plain sight gem! We went for bae's birthday and let me tell you this place did not disappoint! From when we walked in we were amazed at the instant vibe. It's a wonderful size restaurant and beautifully decorated. There were a few people but it was fairly empty and our waitress told us we could pick our own seats. We opted to sit as close to the fireplace area as possible. I mentioned to our wonderful waitress that it was bae's birthday and she smiled and winked at me. From beginning to end our waitress was perfect! She showed the right amount of attention to us without being overbearing and annoying. She took her time explaining the menu and drink menu. (We're always looking for the strongest drinks on the menu lol)The menu has something wonderful for every one's price range. I went with the lamb chops and brussel sprouts(y'all know how much I love the sprouts) bae went with the salmon and veggies with mashed potatoes. While waiting for our food the bartender came over with complimentary glasses of Rose(idk if they do that all the time so don't go there expecting it and being mad at me if they don't lol) and it was dry and delicious we were pleasantly shocked lol. Then the food came and everything was perfectly seasoned and phenomenal! They really show you love and take care of you in there! They have happy hour from 4-7 so needless to say we will def be checking that out very soon! While we were sitting and talking the waitress came by and asked if we wanted to take pictures by the piano(insert happy face) she even remembered it was his bday and brought him a complimentary piece of cheesecake which was also delish and sang him happy birthday all by herself. This place is a ten out of ten! Run don't walk to Home BX Steakhouse!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscUxPb2R3EAE",
            "text": "The food was amazing, for appetizers we had The crab cake and burrata salad which were delicious. I had the porterhouse steak with whipped mashed potatoes. The steak was made to perfection. The service was impeccable. Great ambiance. I'm definitely coming back and highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURqNWZNXxAB",
            "text": "Came for a birthday party and had a great time. I ordered the Beef Bourguignon. It was flavorful and melted in my mouth. Everyone had something different and I heard no complaints. We were a large party and they accommodated us nicely"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPXzl2SjFnRRAB",
            "text": "I have been at the Home BX Steakhouse to celebrate my son's graduation.  I would start with the call for reservations with Irma very patient and helpful. The extraordinary service of Tober Polanco full of energy, patience and love for his job and customer service and very caring manager Nathan.  The food amazing. All of it with a distintive flavor of freshness. Every item we tried very delicious. The beef with pasta, the salmon, the churrasco with mushrooms, the ny strip steak with mac and cheese, the lamb chops with salad and yuca chips. Everything so delicious and so unique in flavor. This place made us feel like home! I recommend the place to everyone! If you need to go a a great place to eat go to Home BX Steakhouse!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWZxOXFBRRAB",
            "text": "Honestly not going to hide the truth I was a  little skeptical about trying this place being that it took so long to open.\n\nWe had the zucchini dip and bacon to start\nThe dip was very good, nice texture and nice flavor. The bacon was ok, it was missing the black pepper but had a descent taste.\n\nThe entrees were amazing. I had the filet and my wife had one kf the specials. She said her fell off the bone and the risotto had a great flavor. The filet was probably one of the best i have had in a very long time.\n\nSince I write reviews I had to have dessert and the apple tart was not to be missed. Yes they have S&S cheesecake but I live in the neighborhood and could get that anytime.\n\nOverall nice place to come on a date night with good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxallYRjZnRRAB",
            "text": "So dark and gloomy. If you like to eat in the dark, this is your place soon as you leave, you’re gonna feel more alive. The food is really good. The atmosphere was not for me. You have to get reservations for this place. I would suggest go next-door after you’re done to upbeat yourself they’ll have great music and cheap drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbjRyX3J3RRAB",
            "text": "First but not the last time I come here!! Loved this place so much, the employees are very welcoming and accommodating, friendly, attentive, very good service!! I went on a Friday night and they had a Live band at 10pm (really started at 11 lol) .. but it was GREAT! Will be back soon! Really recommend this Place, for a Friend’s date, romantic date, family dinner lol.. Really recommend it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbVlEbmRnEAE",
            "text": "I love the ambiance. The feel of the place - it feels like visiting family. The Staff is very friendly.  Irma and Adonis are absolutely great. Irma is very attentive to the customers needs. Great place for a date and happy hour!! Live music 🎶 Great food\nMy favorite drink Classy AF😉"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLTdHYndRRRAB",
            "text": "This restaurant is not a steak house. Upon arrival, I had to hunt for a hostess or server. Someone from the street went back to the kitchen to retrieve an employee. I ordered boeuf bourguignon, a dish rarely on menues as it take hours to make it properly.  What arrived, predictably, wasn't bourguignon. The whole point of bourguignon is the burgundy used to cook it and tenderize the meat, which takes hours to cook. First, you must caramelise the pearl onions for the flavour.  There were no onions. Also, you should serve it with wide egg noodles, not tough fettuccine pasta. I also had to ask for bread and butter. The bread was not warmed and invariably tough. I am being hard on this restaurant as we have few restaurants in the Bronx that are striving for excellence. This one needs to have its staff retrained and cooks and menues revised. It was unacceptable. Also, they need to add some ports to the wine list."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXckl2Tkx3EAE",
            "text": "First of all, this establishment is a few doors down from Bronx Alehouse.  Home Bx Steakhouse had a soft opening today. It was beautiful. We we're celebrating my bestie/sister from another mother who earned an Amazing opportunity.  The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaTZMdVJBEAE",
            "text": "The service was good and the passion fruit margarita was amazing and the yuca mashed was really good. But The Cesar salad had a weird oily taste. but it’s a steakhouse we came for the steak and it was a big disappointment just bad I didn’t finish it and left more than half it was over cooked and hard 1* for the steak I won’t be returning and I don’t recommend if you looking for a steakhouse this ain’t it also my partner had the chicken and it was dry and over and flavorless"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa282QU9REAE",
            "text": "This was my first time visiting the place. They forgot the BBQ sauce for the wings, they gave us the Tequila shot on the house. We ordered the 7oz cheese burger, it was tasty and juicy. I couldn't finished it. My magarita was light, I've had better. Overall the place has a nice atmosphere and a nice size bar. The menu is not to my liking, too much red meat. I don't see myself returning. Sorry 🙇‍♀️🙇‍♂️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqck5TUWh3RRAB",
            "text": "If you’re going to be a steak you must know how to cook steak! And this place unfortunately does not.  We ordered a Ny strip steak (medium) with mac cheese & truffle fires and a beef bourguignon. The steak was overcooked to well done and had no flavor, the mac was bland and they forgot the truffle fries even after the food came and we reminded them. As for the beef bourguignon the meat was tender and flavorful but it did not pair well with the pasta they serve it with. Although we did not enjoy the dinner we did enjoy the drinks and appetizers. We had the caesar salad, bacon & french onion soup, I love me some french onion soup and this one was good and their frida cocktail was delicious. As for the servers whom were friendly but not attentive, I had to ask for my server 3x to get a refill on our drinks which shouldn’t take an hour. Due to this experience I will not return nor do I recommend Home Bx Steakhouse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNk9IOTV3RRAB",
            "text": "The restaruant is a great time. They have a really nice vibe and it’s a family friendly place. I’ve been several times with my Duaghter for daddy Duaghter dates and they never let us down. The burgers they have are really good. Be prepared to make a mess due to the cheese suace they have on it. The mess takes nothing away from the flavor. The waiters are very nice and professional. The bar scene also looks like a great time. The music isn’t to loud for you to hear your company and they told us that someone plays the piano live on Wednesday nights. I look forward to returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLThfdTlRRRAB",
            "text": "I am a regular here! I come at least once a week, the service is amazing Jonathan is flawless at what he does from beginning to end  , Vivian is the best bartender I have met better than me! It only allows me to give 5 stars if I could I would give them 10 in every aspect! The chef the atmosphere the service is so amazing I brought my queen to Celebrate her fabulous 60  blessings and endless success to this business The  home BX Steak house !!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN1lqSHl3RRAB",
            "text": "I always find myself driving so far down into Manhattan or Brooklyn to find a good restaurant. So one day I decided that I wanted to find a good restaurant in my area and saw this restaurant. The prices were great the server was amazing.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cDhPdWZREAE",
            "text": "Amazing. This place is truly one of the best restaurants I have been to in NY. Jonathan, my wonderful waiter, made sure that me and my party was well taken care of. He accommodated to all my allergies and my entire family. My food was great as well as the drinks. And to top it all off, the artist performing that night sang Happy Birthday to me. An amazing experience, amazing workers. 10/10 recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1c1pyWU9REAE",
            "text": "Excellent food, service and atmosphere. If you’re looking for a yummy restaurant to have dinner at, this is the place! We had the filet mignon carpaccio, seafood pasta, and the ossobuco. They were all delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMDdEZ293RRAB",
            "text": "Food taste good, but please pay more attention to the order, I ordered med rare, and got med well, I said it 3 times even in Spanish medio crudo and this is what I got place is nice, service needs some attention, meaning like putting water…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXX3RpanR3RRAB",
            "text": "I love finding great neighborhood gems and this is absolutely one! The quality of the drinks, food, staff and ambiance are all top notch and a fantastic representation of what Bronx dining can be. Went for a casual dinner on Wednesday and…"
        }
    ],
    "reviews_count": 75
}