{
    "name": "Flame Bronx",
    "place_id": "ChIJPXS0R73zwokRWl5P4-BsJ7w",
    "grid": "BX8",
    "address": "5740 Broadway Unit # 5, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 597,
    "phone_number": "(718) 884-2828",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVU9WWTRjREpSTVZwWFFtZG9URkJSYjI4MFRrRRAB",
            "text": "Me and my husband came here for the very first time, and we loved the experience. Everything was amazing from the service to the hospitality, we loved it all. Thank you so much for the experience and we will be coming back soon with our family and friends🥰❤️ thank you thank you thank you you guys are the best❤️"
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWVdIa3laVzgxYW5veVdsZDJNM1ozY2tacFVGRRAB",
            "text": "Ottimo ristorante di Sushi, con piccolo spettacolo degli Chef che cucinano i piatti al tavolo, la qualità del pesce è ottima, il servizio è sul posto, l'ambiente è molto bello anche per una cena elegante, super consigliato!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU1ZXeHZVVEZxVEVjNVlUWnRNVmRHZEhsVWEyYxAB",
            "text": "Hands down the best sushi I have ever had. Food was amazing and service was somehow better- my server Cristian went above and beyond. Cannot recommend this place enough!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcWQwTmpkVmxWT0Y5Tk5tUkNZVXBzZFhoc1VVRRAB",
            "text": "It is great for lunch or dinner even a birthday celebration..I visited in different times and enjoyed the different menus sushi or Hibachi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aclRsYzNUMFJmVGxaTWRFb3ljM0pMU3pWelltYxAB",
            "text": "I come here often, the atmosphere is good, customer service is great, good beer selection, the dumplings and takoyaki are great. Sadly my partner and I were disappointed about their ramen because the broth was salty, with impurities and you can smell the pork, it had not aromatics, it just did not feel or taste like authentic Japanese ramen."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSmFWWm9iUzFPYlU5RlgxY3hNVmhGYkZGWGQzYxAB",
            "text": "Billy is the best!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabGF6Tm5SMTlhUlVGMFZEUTJVRE5ZVGpJNWFHYxAB",
            "text": "This is one of my go to restaurants as I order regularly from them. But I am getting beyond annoyed and inconvenienced when I order delivery, with how they do sides such as rice when I’m trying to feed my family.\nNo matter how large my order, I always am given these dinky small containers of rice not enough for even merely two adults. And there is nowhere on the online menu to order more. Really frustrating! May be time to find another place with Sichuan style food available."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFpsaFNUVlJQV0VSSlUwcEtlVWRNYjJsMldVRRAB",
            "text": "Cool spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTGNTMDRVVFJVTVRFemJuTm1PVjlmZDJwa1dVRRAB",
            "text": "Great food and service. There are two sections, one for hibachi and the other for sushi. I went with a big party for a hibachi dinner and encountered zero issues! Staff is very friendly and they make the experience that more exciting. An ideal place for a family dinner or an intimate date. Recommended for any occasion!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdkxXeFJOMDFLZUZJelpsWk1iRTVxUTFKeVowRRAB",
            "text": "We had a large graduation party & they were extremely accommodating. Managed to sit us as one large party & accommodated our change in reservation. The service as well as the chefs were engaged, fun & pleasant. Made our memorable night unforgettable. Thank you Flame . Recommend for special occasions that you want to feel extraordinary. Beautiful ambiance and ample parking. 10/10 experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbWVUUnhiVzgyVG1VMVQxTlhXa2RuWjAxeFNHYxAB",
            "text": "Great spot. Sushi was great orange chicken was tasty. AND THE PINEAPPLE FRIED RICE WAS DA BOMB"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFZEWjRjbFptU21ObWMxOTNkRWwzYUV0RlIxRRAB",
            "text": "We had such a wonderful time at Flame in the Bronx! The service was absolutely amazing—our server was so attentive and went above and beyond to make sure our children were comfortable and having fun. The kids especially loved the hibachi performance, and the chef’s funny jokes had them (and us!) laughing the whole time. It was so entertaining to watch him cook right in front of us!\n\nThe food was delicious and came in generous portions—each meal included soup, fried rice, fried noodles, vegetables, and your choice of one or two proteins. Everything was flavorful and cooked perfectly. The restaurant was also very clean, which made the experience even more enjoyable. A great spot for families and anyone looking for a fun, lively dining experience with both great food and great entertainment!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUlowRndkbGhQUzJaVVlUaEVUVTAyTld3Mk9GRRAB",
            "text": "Had a great time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWk1GVXdZWEI1UkZSVVQzcEpla05sVGtKUUxWRRAB",
            "text": "I took food to go im allergic to shellfish an the aroma so I couldn't stay long ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNGFuSXdlSEpCWW5aWmNFcFRMV0ZGYTFGd1VFRRAB",
            "text": "Just terrible customer service. The manager Diamond and another employee were incredibly rude and unhelpful in fixing an error over the phone. We will never be ordering here again.\n\nEDIT: what a ridiculous response below. You told me over the phone a minute later that if I'm not coming to pick up the order the food was not getting fired. You couldn't cancel a minute later? Stay away, this is not a hospitable restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Zk4wWmpkRkUxZVVFeWFUaDBVR1pCYTFCS05HYxAB",
            "text": "Really good food and cool staff.\n\nBest hibachi spot for sure."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdlRFMUdUWGh4Y0VsU09XSjNOak4wYURaR1RrRRAB",
            "text": "Muy bonito lugar y el ambiente muy familiar Me gusta para celebrar en familia"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa2NVZHhORmw0VDJGUlEzRlBNa2hZUlVoaVRYYxAB",
            "text": "Came here for my cousins birthday, the food is amazing!! sushi in the dine in section is fresh, staff is very friendly. i would recommend making a reservation for the weekend since ive seen it get crowded"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aYVUwaDJTV2xaVEZrNE4xQjViVFV4Y0hwTlpIYxAB",
            "text": "Very nice and well kept restaurant, great food, variety, quality and portions. Friendly and welcoming staff 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeVZtbHdVbTl0VFhwSE1tdHdhRVUzYkc5T1JsRRAB",
            "text": "SHADY BUSINESS PRACTICES ENFORCED BY MANAGEMENT. BEWARE.\n\nI’ve brought my family here on two occasions. Today I decided to take my brother. The chef was perfect and so was the waiter initially! I realized that I had no cash and asked the manager “Diamond” and her assistant where I could get cash —as I love tipping servers that way! They directed me down the street and I walked while the meal was being prepared to get cash. The food was delish and fresh as always!\nThen I ordered two meals to go- I didn’t read the menu to see that gratuity was already included so at the end I had tipped the chef cash prior which he deserves! And then I tipped the waiter before almost walking out.\n\nBefore walking out I realized they had charged me gratuity (which was my fault for seeing on the menu before that it’s included ) but not just for the meal I ate in. They PURPOSEFULLY ADDED GRATUITY TO MY TO GO ORDERS!\nWhen I spoke to the manager diamond, she said it was my fault for not asking for a separate check!!!! I told them this was  shady business practices and she instead of apologizing she doubled down and insisted it was my fault. I told her I’d been a waitress for years and when customers complained, I often followed up with, “I can understand why you’re upset and we will discuss this with management”. She did not care.\nI asked myself why wouldn’t they be more apologetic for charging me more accidentally? But i realized that I wasn’t an accident.\n\nAnyways she didn’t apologize but she refunded me, I asked back for my cash tip and she ran the check again this time only including gratuity on the dine in meals.\n\nLastly, when I asked who was above her that I could discuss this forced gratuity on to go orders with she said, “it’s Danny, he’s not here today, he’ll be here tomorrow but he is going to tell you the exact same thing” - which is basically we will charge you gratuity on a to go order unless you ask us not to by asking for a separate check.\n\nLong story short: Won’t be back they tried to take an additional ~$15 in tips illegally. Diamond needs better training as a manager because the way she handled that situation was atrocious. I’m sure there will be a response to this review by management, I implore you guys to watch the tone of voice towards this matter and ask yourself if that’s how management should handle complaints especially in regards to something as sensitive as money! Ive attached receipts."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeVprRlpXRXRoVUd0UGFEaFRjSGx2VjE4NWJuYxAB",
            "text": "I recently visited Flame Bronx and had an amazing experience! The sushi, including the Yellowtail Carpaccio and the special Fuego Flame roll, was incredibly fresh and bursting with flavor. The presentation was stunning, and the rolls were uniquely delicious. Highly recommend this place for anyone looking for top-notch sushi!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMmRhVmN3EAE",
            "text": "Food was excellent! service was a little slow but it was a great experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFdYUXdaR3h0WmpscWVrbzJOVVp3VkdwM09WRRAB",
            "text": "We celebrated a birthday dinner at Flame in the Bronx and it absolutely exceeded our expectations! The chefs put on a thrilling hibachi show. The portions were huge and everything arrived piping hot, from the filet mignon to the fresh sushi and flavorful fried rice. We also enjoyed lively cocktails and our friendly waiter made the night feel extra special. Flame didn’t  disappoints and we will be back very soon, highly recommend for any occasion!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT2EwZDJUbTEwY1dWb2QyaFFlVGRGTjB4WVpGRRAB",
            "text": "I’ve been here 4 or 5 times now and the food, portion sizes, and service is always fantastic!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UFF6UlFOa1pSUlZoR1N6VTRRbGhwV1dGSVJrRRAB",
            "text": "Family-friendly restaurant.   They only accept cash or credit card.  Fun cooks who keep you engaged.   Our food was prepared nicely.  Service by waiters is quick and accurate.  Very organized establishment.  Bathrooms are clean.  The price for large groups is reasonable. Great experience overall."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GclVUUTNlRXBzY21aeGNtVkdlRVZwYmtOVVEzYxAB",
            "text": "MUY PROFESIONALES HERMOSO LUGAR LOS COSINERO EXPLENDIDOS"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd1oxaHpPV1ZMVm5SVVozaEdiMlpyTUVKWVpXYxAB",
            "text": "Be careful. I was stupid enough  not to examine the bill which had tips added automatically and tipped extra. The server did not say anything and excepted the extra tips. These tactics are awful and dishonest. Never again I will go to this dishonest trap. The food is tipical Japanese restaurant run by Chinese.\n\nThese the rules for NY restaurant:\n\nIs adding tips to the bill illegal in NY?\n\nNo, adding an automatic gratuity (tip) to a bill, especially for large parties, is generally not illegal in New York, provided certain conditions are met. Restaurants are allowed to add automatic gratuities, but they must clearly disclose this policy to the customer beforehand. This disclosure should be conspicuous, meaning easily noticeable. If the restaurant fails to provide this notice, customers may have a claim under New York's deceptive acts and practices law.\n\nBelow, the owner, responded to my criticism, a day late, forgetting to mentioned that the waiter, receiving 20$ extra unnecessary  tip, never said anything afterwards, took the money and left. And the fact, they mentioned an automatic tip addition rule on their menu -  nobody can see it on their menu or anywhere else!!!This place is a scam. Shame on you and your ethics. U need to stop this and be normal. But you prefer to cheat. This place is fraud. Garbage!!! Fake!!!\nSo sad.\n\nAs far I know, you owe me 20$ for money you stole from me and an Apology for doing this sneaky lowball garbage trick.\nOtherwise I have lived in this neighbourhood since 1985 and I will spread the word about your unethical tricks all the time. Thanks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMVRrcDBOVmRvVjJoeFozWlBYMHh0WkhGb1RXYxAB",
            "text": "Love Love Loved it\nPlease go for lunch and take me with you 😆"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac1FWTmhTa2RYVUVjdFdrbDNOMVpVUVVSMlNIYxAB",
            "text": "We love this place. The food is delicious especially the wings."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS3Z2NzJsOElYTFJ3EAE",
            "text": "My first time here and I loved it. The service and atmosphere were great, but the chefs, were incredibly talented, yet funny. They made us laugh, while preparing the great food. Forget the conventional everyday restaurants, I know that I'll keep going back for more. 👍🏾"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOS2RyOUdlczh5Q2pnRRAB",
            "text": "Great place for family. Went for Mother's Day and the food was great. The chef was super friendly and funny. Didn't give them 5 stars because they only have ginger dressing for the salad. I would go again though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPRzh2TkdIei0ySXpRRRAB",
            "text": "Great food, our hibachi chef did not make any trick but the food was delicious as well as the service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTDU2ZHlCdl91Tld3EAE",
            "text": "Amazing it is a hidden gem in the Bronx. Went here with my family for a graduation celebration and the food and service was amazing. The kids got little balloons from the chef and I must mention the restaurant itself is beautiful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSGY1NURoODZ5cWxnRRAB",
            "text": "Excellent service, very tasty food and Drinks. Love it recommend 100%"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX3ZXT0dnEAE",
            "text": "Great service, the staff is very friendly, and the food is very tasty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VONjB2Ti1mN0tidEVBEAE",
            "text": "Food and hibachi show were excellent but overall service needs help. Wasn't terrible but wasn't amazing. The biggest disappointment was getting ice cream cups with wooden spoons for dessert. With the prices they charge for food they gotta do better with dessert"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbU9QUDNRRRAB",
            "text": "I loved it me in the family had a great time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ05DZkh3EAE",
            "text": "I love that we have hibachi so close to home and we don't have to go far. Our chef, Henry, was amazing - so skilled, very personable and a great showman. He made our evening so memorable and special. The food was delicious too. We made a reservation (recommended). There is parking outside, also easy to get to by train (A). You can either do the hibachi or sit at a table. They do take out as well from their set menu"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNzh5bTdRRRAB",
            "text": "I ordered Takeout, and it was okay. Ordered the Kani salad, shrimp Tempura rolls, shrimp teriyaki, pineapple fried rice, and vegetable lo mein. The Kani salad was a very small portion and smelled a bit fishy, as did the shrimp in the pineapple fried rice. The pineapple fried rice was so bland. It was just a mix of white rice, egg, a few chunks of pineapple and shrimp... no salt and no seasoning. The shrimp teriyaki had a good flavor, but the shrimp were very chewy. The vegetable lo mein is good. The atmosphere is very nice and staff are friendly. Food is a bit disappointing for the atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdHF2UExBEAE",
            "text": "Love the workers very nice Great customer service\nAmazing food and drinks !!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajdMZHNBRRAB",
            "text": "First off if these people don’t do separate checks that should’ve been the first thing that was said !!! Second of alll they made us wait to sit down until everyone was present and it’s like for what we standing up and we could’ve been sitting down waiting for the last person to arrive ! They just difficult as hell I’ll never come back again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aG9DM19RRRAB",
            "text": "Had my first visit to Flame’s Bronx location, and it was an amazing experience! The hibachi show was highly entertaining, with the chef keeping everyone engaged and making the meal preparation a fun spectacle. Even better, the food was absolutely delicious—perfectly cooked, flavorful, and satisfying. A great spot for a fun night out with family or friends. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z29MLUxREAE",
            "text": "Customer service was really nice; they made sure that all of our needs were met throughout our time there. The food was amazing; general tso took my soul. Definitely ordering that again for my next visit."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cjhqMU1REAE",
            "text": "My staff and I had a wonderful time until the Manager, Danny, ruined our Entire Experience. There were 9 of us having a good time. Then Danny came to our table and told us we were too loud. Understanding the complaint we lowered our voices. Then our waiter came to us with the bill saying that he was told we asked for our check, which we did not (Shack was an amazing waiter and Andrew did a great job cooking for us). Danny gave a bogus excuse saying  he “thought” we asked for our check. He smiled and attempted to patronize me suggesting he made a mistake. I and my group felt totally singled out and disrespected. Danny needs to be reassigned, if not fired. When I asked him for his name, he rudely replied “Danny”. I asked for his last name and he again rudely replied “you don’t need to know that”. At the end of the day, paying customers should Always be treated with respect. I will NOT go back as long as Danny manages the place.\n\nWhile your lengthy response is duly noted, there are several inaccuracies in it. First and foremost, at Absolutely No Time was inappropriate language used; Especially not the “N” word. As professionals out for an office event, that would be totally unacceptable. I don’t use the word and never allow anyone in my presence to use it. As parents, we would never disrespect anyone’s children - another blatant lie. If the two hour policy was an issue, the professional way to handle it was to simply say so and we would have simply paid and left. No one mentioned anything at all about policy when coming to our area and there were no customers waiting to be seated. Finally, your response is indicative of the comment Danny made as we were exiting your establishment- “You people are funny” - with a snide smirk on his face. I will do as suggested and send an email. I just wanted to note the inaccurate inconsistencies in your response. Respectfully, I stand by my opinion and will do as I see fit to command respect."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OTRyMEtnEAE",
            "text": "The manager Danny was very rude and said that my party of 9 wan too loud. However, before fixing it they be had ordering drinks for everyone. Then they issued the bill which we didn’t. After we was bought the bill we were made aware that he had issued the bill and stated that he thought someone asked for a bill which no one did. This is poor service and would never advise any big partying to come to this establishment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MnBlVTNBRRAB",
            "text": "From entering the establishment the host had a offputting vibe— no smile, hospitality. When seating us she slid shoved the plates aggressively maybe she was having a bad day idk. None the less when seated the server came took drink orders. One of the best pinas colada’s I’ve had hands down. Andre the cook was really dope he had a lot of energy through the meal while singing the whole time. I think he was a great personality to enjoy a meal with. When it came down to the food I got a mami sushi which was fresh and tasty. I felt like the proteins tasted like soy sauce and no other flavor but soy sauce. It would’ve been nice if teriyaki or a spicy sauce or even garlic butter was offered But my brothers filet mignon was delightful as well as the scallops, dumplings & noodles. I wish the flavors were more tasty & versatile but none the less a great experience. Would return for the showman ship & to give the food another try."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ3B5dDN3RRAB",
            "text": "This place is always awesome..."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc2VuUUt3EAE",
            "text": "Nice cozy place to grab a quick bite. The staff is friendly and welcoming"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncXRHRElREAE",
            "text": "Amazing atmosphere and tasty food! The best part about this place is it's service and staff! Such a lovely experience. Would recommend, especially for families and for special occasions"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbjVmbDJBRRAB",
            "text": "Great sushi"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZ3BfLV9nRRAB",
            "text": "The host could have been friendlier we came in said hello and she just said there’s a 20 minute wait and walked away.  When she came back she was nice and seated us.  The food was tasty and the portions were huge.  The cook was nice and engaging they even give guest cute silly blow up crowns . 18% tip is automatically added to the bill starting with parties of 2 20% tip is added for parties of 5 . Service was fast we were in and out in a hour and a half. They do not accept any type of digital payment just a FYI . I would definitely revisit :)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeG9qX25RRRAB",
            "text": "I took my son there for his 18th birthday and everything was amazing. The staff are wonderful very professional and polite. The food was amazing and it was healthy portions as well. It was a wonderful experience and I will return again and I also spread the word."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMk5YZ0VBEAE",
            "text": "I have visited several times now and the food has been consistently great every time <3\n\nThe first time was for lunch - visited with a co-worker and we only ordered the rice with chicken and pineaple + two sushi rolls (both dishes came with a small plate of salad and a small bowl of vegetables tofu soup and the bill only made around USD$40... everything was really good.\n\nThe service during lunch was pretty slow the first time despite being almost empty but the food was so good I came back with my husband :)\n\nThe second time was for dinner - we ordered an appetizer of fried dumplings (pork) which were p e r f e c t ... two beers, water, one General Tso Chicken with rice and broccoli + 1 Amigos sushi roll of 8 pieces... everything made only USD$68 (INCLUDING 18% tip!!)\n\nThe food for dinner was so good, I feel like going back every weekend to try something new :)\n\nThe service was very good this time, it was actually perfect, our server was somehow always around the corner checking if everything was alright, if we needed something else, if we were enjoying the food... the orders came out really quick and the place was very neat and clean.\n\nThird time service was pretty good and very fast; we ordered again the General Tso chicken with white rice and broccoli, the something curd steak with white rice and broccoli, the shrimp tempura with fried vegetables and 2 beers and the the bill came up to around USD$65 dollars - the main dishes were again very very good - not really a fan of the appetizer though but happy to have tried it anyways (but I will not be ordering that appetizer again 😂)\n\nThe Asahi beer was very good - first time we tried it - wouldnt mind having a couple of these at home since we really enjoyed it.\n\nWhen we ordered take out for the first time we ordered one pan fried pork dumplings as appetizer + Chicken Sesame with rice and broccoli + one Orange Flavor Shrimps with rice and broccoli and they were both pretty good 🔥 made a total of USD$41 or USD$42 dollars - LOVED the  Orange Flavor shrimps 👌🏻\n\nLast time we ordered we got the teriyaki chicken style with white rice, salad and miso soup by mistake (we had requested the teriyaki rice with brocoli instead for ny husband) and he then was pleasantly surprised 😂\n\nWe tried their vegetable dumplings for the first time and we were definitely not expecting to get what we got, I believe even the dough was made of vegetables 👌🏻\n\nWould definitely recommend them and continue returning :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd3Jqb3FBRRAB",
            "text": "This is a nice spot in the Kingsbridge area. The atmosphere is very chill and the staff was pleasant and friendly. The chef was entertaining and we had a great time singing songs while he cooked and did tricks with the food. The only con was my food was too salty and now I know to ask for less soy sauces or whatever they used. The rest of the meal was delicious. I highly recommend this place for a casual fun family meal."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbThmM3BRRRAB",
            "text": "My family and I recently visited Flame in the Bronx to celebrate my mom’s birthday, and it was truly unforgettable. From the moment we walked in, we were greeted with warm smiles, and the staff went out of their way to make us feel welcome. Not only was the food absolutely delicious—every dish was perfectly prepared and beautifully presented—we had delicious appetizers, scallion pancakes, shrimp shumai and gyoza, the sushi was my favorite along with the hibachi performance - but it was the service that really made the evening special.\n\nOur server Pinky was incredibly personable and kind, taking the time to chat with my mom and make her feel celebrated on her special day. They surprised her with a small birthday dessert and drink, and Kenny who prepared our food was talented and fun, which brought such a genuine touch of joy to the night.\n\nThroughout the meal Pinky checked in just the right amount, ensuring we had everything we needed while allowing us to enjoy our time together. My mom left with the biggest smile, talking about how special the staff made her feel. I highly recommend Flame for any celebration or just a wonderful meal out—they really know how to make their guests feel valued and appreciated."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSb1lqUzJBRRAB",
            "text": "We dine at the sushi section of the restaurant and the service is a tad slow.\n\nThe sushi is fresh and made deliciously. Their drinks are pretty delicious too.\n\nThis Japanese restaurant also has a hibachi section, where you can invite your friends and family for some good food.\n\nBathrooms are relatively clean.\n\nThe decor is delicate and balanced on the sushi side. The hibachi side at night is an eye catcher."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMU9yMExREAE",
            "text": "Prefect place to have a Hibachi meal, good location easy to get there. Large portions of food, drinks could be better. Good service and staff, nice atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNHNpZXd3RRAB",
            "text": "Myself and some friends came to celebrate a birthday here. Great experience and a wide range of cocktails with various spirits. It was the chef's first day and he was super outgoing and very personable, he made everyone laugh. We enjoyed watching him cook and will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNnNpWFRBEAE",
            "text": "Hibachi is a really exciting experience. We really enjoyed our time there. It is entertaining the whole time, you never get bored. The food was pretty good and the service was excellent. I highly recommend having this experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMTQ2R21nRRAB",
            "text": "I'm stuck, giving this review. The food was great I would definitely come to this place to eat again but I was not so happy with our server and the customer service. We waited 15 minutes at our seat before anyone asked us what we wanted to drink then another 10 minutes before our order was taken. Everything seemed like chaos, I don't know if it was that the fire alarm was carelessly blaring and going off for over 25 minutes before it was shut off.  but the Chef was off, his jokes or the normal hibachi stunts we not on point, he just wanted to cook the food and get out of there. The Chef kept covering his ears while the alarm went off, it seemed like it threw him off. About 18 minutes of the alarms unpleasant and painful sound, I started to get a headache and wanted to leave the place but my spouse convinced me to stay and was a bit upset because we had already been seating down for about 35 minutes. After the alarm stopped, our chef continued to cook, but we were too busy looking at the chef in the other table since he was the only one trying to make the costumers feel comfortable again in the whole restaurant. our cook finished cooking and left quickly. another thing that concerned me was that though someone at our table was allergic to shrimp, all the food was prepared in the front when customarily the persons dish should be cooked in the back and apart for health reasons. Another thing that surprised me was that they didn't even offer a discount or just a free desert for the 25 minute inconvenience of the fire alarm noise. I ended up taking my food home, the headache caused by alarm was unbearable but the food was good the next day. Maybe I will give it a try one day again. who knows."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMU12VzFnRRAB",
            "text": "The Riverdale location of Flame is a great place to bring everyone for a fun & tasty meal. Whether it is two for date night, the family for a night out or a few families to celebrate a birthday or other special occasion, the staff at Flame is very helpful, the food is plentiful and very good, and the show is as good as anywhere else you may have been. Stop by for happy hour and then enjoy a great meal.  You will not be disappointed.\n\nUpdate:   get 19 of your closest friends and rent the party room!  It's the best.  Private and intimate without being removed from the rest of the restaurant.  Book it and you won't be disappointed!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dUlfbWhnRRAB",
            "text": "This place has great food and is very convenient if you live in the Bronx.  They are located in a small plaza so there is parking available for free.  Definitely recommend to anyone looking for Japanese food in the Bronx!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNXY3b253RRAB",
            "text": "Great food, great vibe, great taste. The chef was amusing and put on a great show. He had us laughing the whole time. Suitable for children as well. The chef made sure all of our food was exactly how we ordered it while paying attention and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc2Z2ZzJBRRAB",
            "text": "First time visiting this restaurant. Took my mom to celebrate her birthday as she has never had hibachi before. We had a great time. Drinks were good & our chef was entertaining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0X2JqWHZRRRAB",
            "text": "Great hibachi spot and perfect for celebrations.\n\nAs a vegan, I was a bit concerned that I wouldn't be able to have fried rice without the egg, but our server was great and made sure to note all of our dietary preferences. He also made sure to inform the chef that the food needed to be cooked without butter (they substituting oil) and the kitchen made me a separate bowl of fried rice without the egg.\n\nThe cocktails are also nice and the ambience is more aesthetic than most hibachi places I have been to.\n\nOur chef was very entertaining and gave us quite the show. He was funny and nice and he made our night.\n\nLastly, since we were celebrating, our server was kind enough to bring out the cake that we brought and he sliced it and served it for us.\n\nWe will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaF9ieGhnRRAB",
            "text": "Flame is a stylish hibachi restaurant that offers a fun and flavorful dining experience at a mid-premium price point, with meals averaging around $50 per person. The chefs entertain with classic hibachi tricks—think onion volcanoes and quick knife skills—while grilling fresh, high-quality ingredients like tender steak, juicy shrimp, and perfectly seasoned fried rice right in front of you. The atmosphere is lively, and the service is attentive, making it an ideal spot for both casual nights out and celebratory dinners. While it’s not the cheapest option, Flame offers great value for the experience and quality of food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX0s3VDd3RRAB",
            "text": "IF YOUR LOOKING FOR GREAT FOOD ATTENTATIVE STAFF AND CALM ENVIORNMENT GOO HEREEEE !!!! My partner and I went here because he never had habachi food. We took our 7 month old with us we got in around 4 to 4:30ish for our early dinner and it was absolutely amazing from start to finish. We had the entire restaurant to ourself on a Monday afternoon and it was delightful. We got seated in booth and my stroller wasnt a problem they brought us a seat for my son to sit in which was his first time in a high chair at  a restaurant. We got the drink menu and the meal menu. We didnt even wait like a few minutes later a chef came out with the cart filled with our fresh food and babe ordered a flame rum coconut i must say it was a delicious cocktail blended to perfection 10 thumbs up to the bartender cause the second one was even stronger absolutely amazing blend of colors. They had low music and looked spotless. Minimalistic vibe and smelled clean and fresh. The chef was absolutely the best he said his chef name was toyota like the car not only did he make us laugh and sing and put on a show but he also was so kind and careful with the fire as to not scare the baby. It was such a great experience that my husband wants to come back once a week because the food was delicious steak well done. Seasoned to perfection and they even gave greyson 3 different toys and surprised dad with saki liquor.I laughed so hard my stomach hurt after words. The bathroom was a 10 and incredibly cultured I really appreciate the cleanliness it smelled like lemon and oranges and the bowl is made out of bamboo. When we got up and left the staff even held the door for us in the rain.Its been a very long time since we enjoyed a restaurant like this. Deserves 5 stars and more places should follow behind this amazing etiquette. We will becoming back with a big group so our family can enjoy this experience. 10 ✨ starsss"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkczlDQXJBRRAB",
            "text": "I dined at Flame on a Thursday night for my mom’s birthday. I booked reservations online and was glad I did because it was more full than I anticipated.\n\nThe hibachi chef was super friendly and engaging. As far as food goes I should’ve expected it to be a tad salty seen as different sauces would be used during the presentation. The food was salter than I would’ve liked. Mojito was really good though.\n\nOverall, the ambience was nice and the staff were friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNmZuLUVREAE",
            "text": "Visited here for a birthday celebration. The cocktails were strong enough to make an impression and very tasty. Overall excellent service, and fresh, delicious food. The staff was friendly and attentive, making us feel welcome. Would advise to make reservations ahead of time to avoid wait times. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NnJmTGdBRRAB",
            "text": "The staff was friendly, the food was good and very filling. The show kept the little kids entertained and as an adult I found it enjoyable as well. I also like the ambience of the place, good decoration."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVbU5yN2hRRRAB",
            "text": "Went there for the first time yesterday with my sister.. my Piña colada was the best .. The entertainment from the book was pretty amazing .. overall it was a 7/10."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bThTMklnEAE",
            "text": "Love love love this place!!! Went there Aug 10th to celebrate my Aunts Birthday and even tho I got there late, they treated me like I arrived on time. I had the best Lobster, shrimp, scallops with veggies dinner. Absolutely delicious n our server, Binky n her son treated us like family. Definitely recommend this place. Next time I'll post more pics. I'll def be back. I'm so happy it's in the Bronx bc it's easy to get to from Westchester. Can't wait to go back."
        }
    ],
    "reviews_count": 72
}