{
    "name": "Riverdale Thai & Indian Cuisine",
    "place_id": "ChIJl9hlmkXzwokRe-OOWhAgzWo",
    "grid": "BX8",
    "address": "318 W 231st St, Bronx, NY 10463, USA",
    "rating": 4,
    "user_ratings_total": 196,
    "phone_number": "(646) 582-5620",
    "reviews": [
        {
            "date": "수정일: 55분 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodmFlbDBnRRAB",
            "text": "Indian menu: Amazing flavorful food! Love the balance of the spice and richness of the food!\n\nThai menu: ordered it once and it was horrible. Threw it out. Will stick to the Indian side of the menu."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abGJGcFBaa05sZVdoRVZFZ3RhWEZZZVd4ZlJrRRAB",
            "text": "Super good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS2JreFpUalptUkcxRVVVeFNWRVJ4Y0hoUGNIYxAB",
            "text": "This is the worst Thai food I have ever had in my life. It was a huge waste of money. Bland and dry. The delivery service was horrendous. My food took over an hour to arrive. My food was not hot. I do not recommend anyone eating here. Completely disappointed."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTlprUmhXRTFwWVdWS1ZGcHhkMHhPTTNBdFNXYxAB",
            "text": "Krunal and his wife are the best neighborhood people out there. They care about their community, they are hard workers and they are just great people overall.  The food is just as good as the service and the spirit in the restaurant"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1FVaG9SbWQ1VGtKdk5reG5UVVpaUjFCdmNFRRAB",
            "text": "Food was overcooked and also had very little flavor, it tasted like it was mostly soy sauce. The order time said 15 minutes. It was about 30 minutes. Also the place has a Rating pending sign. Some of the staff were wearing flip flops in the kitchen"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVVJIVmtXRjltTTJKYWRrOW5WR2xWWDBka1VtYxAB",
            "text": "Got the chicken tikka masala and panang curry, highly recommend! Will be ordering from here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdllWRnZZMmh6YkZCMVJtTlRWMTltV0U0d01rRRAB",
            "text": "Very mediocre.  Got to dishes neither ver good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMVlUTlZVMXBuVkZNMlVHWkhSVjgwUzFKVFdFRRAB",
            "text": "I only use delivery but every time it’s delicious. Ibrahim is a great delivery guy. Very fast!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaU4xTXhabUU0YnpSR2R6WTNWSFZGTTJkdFNtYxAB",
            "text": "Great ,great food and such a nice delivery guy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKaVl4OG1NMEwtYWd3RRAB",
            "text": "I was debating between 3 and 4 stars, but settled on 3. I've gotten food from here a few times (all vegetarian, all takeout) and it's quite inconsistent. Generally, the food is a bit bland (not in terms of heat but flavor). Also, I've never been to an Indian restaurant that didn't give chutneys with the food. Riverdale badly needs a good Indian Restaurant, and I was hoping this would be it. Perhaps if they step up the spices and make it authentic instead of catering to the neighborhood's bland palette. I'm gonna give them 1 more try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKakc3LURBN1lfM3hnRRAB",
            "text": "⭐⭐⭐⭐⭐\nAbsolutely Delicious & Worth Every Penny!\n\nWe had an incredible dining experience at Riverdale Thai and Indian Cuisine! Everything we ordered was fresh, flavorful, and beautifully presented. We started with the chicken samosas—crispy and packed with perfectly seasoned meat—followed by a warm, comforting lentil soup that hit the spot. The chicken satay was tender and came with a rich, creamy peanut sauce that was just right. But the star of the night was the pineapple fried rice—a perfect balance of sweet and savory, served beautifully.\n\nThe Thai iced tea was amazing—sweet, refreshing, and the perfect way to cool down after the meal. The prices were incredibly reasonable for the quality and portion sizes. The staff was friendly and attentive, and the atmosphere was cozy and welcoming.\n\nHighly recommend this gem—can’t wait to go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMbmgxZVdjblpDcUdBEAE",
            "text": "The chicken samosas had more peas than chicken. Very disappointed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VObkxxdlNXN05mWFBBEAE",
            "text": "Didn't pay attention to my order at all. Sent one wrong item, and forgot one item completely. 1/3 items correct on order."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPMlNsTnVpeC12bmhnRRAB",
            "text": "This restaurant has great service but the Thai food is more Indian than Thai."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGZ5OG53RRAB",
            "text": "Good food and good service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMm9HVHFnRRAB",
            "text": "good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX01UcVhBEAE",
            "text": "Amazing takeout place.  The food is always delicious and  they provide generous portions.  Tonight, we had the coconut chicken, with naan, basmati rice and chicken samosas.  The staff was very friendly.  I am glad we picked them for our dinner today."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdTRqRHdBRRAB",
            "text": "First time we had great Indian food with the lamb briyani. Tonight we tried the Thai it was awful. Those are definitely not curry puffs, more like empanadas and terribly dry. The chicken fried rice had no chicken which they admitted was a…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NTdMdGJREAE",
            "text": "Small casual place with eat-in and takeout. Delicious food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3al9EUVRnEAE",
            "text": "Tried their pad Thai and it didn’t even taste like it… try their Indian but avoid anything that’s advertised as Thai."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbklMOXNBRRAB",
            "text": "The food and Service is very good. i forgot the name of the employee but she was very attentive"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncXZuajF3RRAB",
            "text": "Very sweet people and samina the waiter is very attentive and sweet"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaVl6cGtnRRAB",
            "text": "The food here is hit or miss. The last order had the worst paratha. We ordered three and two of them looked like they’d been ravaged a wild animals before they were packed. And they were cold and hard. In all fairness, we’d never had this before with them, but still unacceptable.\n\nOne time the food NEVER showed and I called the restaurant several times.  They kept saying they would check but they never followed-up. I had to get a refund from seamless / grubhub.\n\nPrices are good, but likely because quality and consistency are so spotty. Fine to order from here, but know that it’s hit or miss on both the food quality and consistency."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdXJ6Wkt3EAE",
            "text": "Food was awesome..👍👍"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMk9ESW1BRRAB",
            "text": "Antona she is a host and server , amazing food no complaints"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cmVqZlB3EAE",
            "text": "Food is delicious and always ready before I arrive to pick it up. 10/10, fully recommend!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLThtUEl3EAE",
            "text": "The chicken tikka masala was sooo amazing. So is their veg samosas and their garlic naan. Definitely coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdzR5bG9BRRAB",
            "text": "Love this place! The food is so flavorful - the best in the neighborhood. Highly recommend the chicken tikka masala, rich and creamy with a bit of tang, malai kofta - warm and comforting, and the onion chutney always adds a nice touch. Their samosa chaat is not to be missed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMlBLTUh3EAE",
            "text": "It's either a hit or miss. The past few times I have ordered from here weren't that bad. However, the food was VERY clearly low quality. The samosas were big but tasted like canned veggies from the grocery store, not even fresh. The naan was just bready and hard..ifykyk. And if you get the flavoried naans, they BARELY have any flavor. Sure, you can smell the garlic, but it's not garlicing. What truly angred me to do this review is when they got my order wrong. I got CHICKEN tikka masala. Tell me WHY they gave me PENNER tikka masala. If you don't know, it's basically cubed TOFU. LIKE WHO ORDERS THATTTTT. Like they couldn't have even bothered to check with me and ask if i ordered the CHICKEN?!?! The disappointment i felt when i ate that darn tofu... ong aint never felt so let down and angry by FOOOOOOOD. CHICKEN. I ASKKED FOR CHICKENNNN. WHO GETS TOFUUU. sorry. I am a hard-core meat lover. anyways i js wanted to rant. Do Not Recommend. Mediocore at best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIajZiUlVnEAE",
            "text": "I searched on line for an Indian restaurant around where I happened to work 2nd time with my MTA life for 11 years. I tried their Roti, Malai Kabab and Goat Biryani. I tasted them the one better than the other. Many restaurants are stingy with their meat proportions and some over spicy. This place I found very generous in quantity and their quality was beyond my expectation.  It was mildly spicy as I expected.  Their prices were very reasonable and on the low range. One more thing, they offered a free soda for me too. I only ask to keep it up this way and wish them lots of luck."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIejZ2dEFnEAE",
            "text": "Too much Joe Biden prices, hopefully when trump wins, everything goes back to normal price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibC1qYTRBRRAB",
            "text": "I have never been to a restaurant, but I always order food at home! The cuisine is adapted to European tastes. But the dishes are very tasty, aromatic, spicy. No complaints! I would make an option for lovers of hot and spicy, to feel all the spices. Well done guys!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaWQtLW1BRRAB",
            "text": "Amazing meals, chaats, samosas, breads, and desserts! The service is wonderful and consistent. Everything is well-seasoned made as-in, although I recommend trying medium or hot versions if you prefer spicy. The sink for hand-washing for dine-in customers is accessible. I have ordered delivery several times from Riverdale Indian Kitchen and these folx always go above and beyond. When I had ordered for pick up and was running late, the women managing the orders called me simply to check if I was ok. The vegetarian/vegan menu is clearly labeled and some dishes can be made vegan by request. This is a place that I will continue to order from."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyXzk3b0NnEAE",
            "text": "The food and service is wonderful , samina was a true delight . Me and my husband are coming back to enjoy the rest of the menu"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOU16VW1RRRAB",
            "text": "I visit this restaurant often because the service by Antora and food is excellent.\nI highly recommend  them you won't be disappointed!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd3RPOGdnRRAB",
            "text": "This was the worst Chicken Tikka Masala EVER: bland sauce (like tomato sauce) with NO spice or flavor at all! The chicken was VERY dry. I ordered a Dr. Pepper & got Diet Coke instead (no phone call about the substitution). When I complained, he claimed Dr. Pepper is a diet soda, so it was a good substitute. I don't drink diet beverages, so it's just a paperweight!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd3VyZkVnEAE",
            "text": "Top quality Indian in Riverdale. Several excellent vegetarian and fish options.\nMango Lassi and Rice Pudding delicious accompaniments. Fish Tikki Masala superb."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodklhblpBEAE",
            "text": "Good food & good service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeEpPX2VREAE",
            "text": "I usually go to pick up food from this place, however recently I had to order food from the restaurant but the delivery person (who has been working there for a while) comes to my building and calls me to pick up food from downstairs. When I told him my foot is fractured and I can’t walk that’s why I am ordering food in; he tells me, oh sorry I can’t bring food up because my back is broken (and denied to take the stairs to deliver food to my door while I am injured). The food is average and so is the service. The only reason I ever went in there was because I wanted to support my community, but this kind of behavior to their customers will only lead to loss. However the person taking orders usually a girl, is very sweet. I hope they hire better delivery people.. because the service is terrible right now.\nDue to this today I am ordering from a different place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGc1lLOEtnEAE",
            "text": "Zero ambiance since the place is literally a ghost kitchen. It's a hole in the wall front facing cashier with a door leading to a hidden kitchen. The service is non-existent as it is completely dishonest from the onset of the order until the return of the unedible product. I ordered basic samosas as I always do as a tester before making full orders. The Samosa was a good size that's the only good quality it possessed, it is literally bland and made with the lowest quality ingredients available. The outside breading tasted like it was old reheated soggy dough, the inside was literally CANNED AMERICAN SUPERMARKET mix vegetables. It was made with literal hundred-year-old canned foods! They didn't even bother to go to the Patel brothers in Queens to purchase locally available ingredients. Spice you ask? Nope, not even a little. They could have used spices but why bother, I mean there are already green beans and corn in the samosas right? How about those chutneys you ask? Same level as a childhood watercolor food coloring experiment put to shame. Then I was told everyone likes this food and the recipe is supposed to be this way. Yeah, not one self-respecting person of Indian descent would eat this slop.I bet they do not dare feed their families this joke they call Indian restaurant food, I told the cook, the cashier, and the delivery boy they should all be ashamed and stop selling this utter trash to the unsuspecting public. Do not waste your hard-earned money on this sham of a ghost kitchen. Worst samosa in an entire lifetime. Never order here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweHJ6VThnRRAB",
            "text": "Highly recommend their Daal tarka,beef curry,goat curry,,best indian food in town.❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdzgzNm5RRRAB",
            "text": "Food was good but they took a really long time to make our food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbDcyZGd3RRAB",
            "text": "Nice food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbVAzUUt3EAE",
            "text": "Terrible and Expensive.  A Goat Curry that was a plate of Bones. Very salty food and they had never heard of 🌶.  As close to real Indian food as McDonald's."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dTZEQ193RRAB",
            "text": "Amazing Indian food, I love it! Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dThEUE53EAE",
            "text": "Amazing Indian food! I love it. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX19IZFV3EAE",
            "text": "I really enjoyed my first visit here. The food was spectacular. We started with an appetizer of Chicken samosas and the fight was so light and crunch. The filling was also great. I had the chicken curry and it was so savory. The SAUCE hit every spot of happiness.😍😍. Tried the nan and it was so soft and freshly made. My daughter tried the chicken tikka masala and she loved it. I would recommend for anyone trying Indian food for the first time or if you love Indian food. This is the spot and will be my spot from now on."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazhYUTdRRRAB",
            "text": "The food cold and the rice was hard and not even warm not happy at all. Will never order again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSaU1XWWxRRRAB",
            "text": "Food was delicious.   I had the chicken tandoori and it was scrumptious.   Welcome to the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLTRIRmlnRRAB",
            "text": "Incompetent & dishonest. They confirmed my delivery order in writing. I waited more than one hour and called - they promised it was on the way. I called again later - they insisted it was still on the way.  Finally, they admitted they had never even prepared the order - they lied to me."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbkxublVnEAE",
            "text": "This is. New place arround 231st street towards Riverdale. I would say food is average or below average as I gave a try today. I got lamb biriyani for main and Rasa malai for dessert.\nIt was not worth for the money for sure. Coz rice was cook separate from the meat. And the lamb was on the top spread over rice. and had food coloring for appearance. Lamb was over spiced and hard. Also 6 prices of meet to be exact. I didn't taste anything other than mint and tamarind. Meat was sour because of it.\n\nAlso no nuts,raisins, ghee or yogurt flavors, which are main components of biriyani.\nAbout rasa malai, It was little tough not soaked enough in the marinade. The worst rasamalai I ever had. Marinade was just milk and sugar. At least they not give try to put cardamom and reduce the milk to get flavor.\nOther than all this critics place ambience is ok. Tables and chairs nice, they have tandoori outside so people can watch how it prepared.\n\nI was curious about all the 5star reviews... but seems like thats all from freinds or employees. When you have new place like this it's not enough if you not doing the right things. In the beginning you will have businesses because people trying new place. But after it will not. So be honest and try to do better on the flavors and taste of the foods. Hope you will succeed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdXJUcnRnRRAB",
            "text": "I just called the restaurant and told them there's a hair in my food. The gentleman's answer to that was that no one ever complaints as if I'm lying when all I want is to eat my food. So you who answer the phone and thought I lied there goes the hair mix in the fritter. Think about it twice before ordering from this place."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaEttZ01nEAE",
            "text": "Yum lentil soup wasn’t what I expected though. Below is picture of lentil soup (bottom) and non restaurant orange chicken (top) Not able to crop."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0aEpibVR3EAE",
            "text": "Always a pleasure eating here.  If you like Indian food you will love this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLLTdfTE9REAE",
            "text": "I am really shock how great their food is. I  liveing in North Riverdale for a while now and I am glad I found this place, The chicken tikka masala hit the spot!!!!! and the goat curry hmmm and the price is not bad at all, I really love this place :) keep it up"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlekpmY2pRRRAB",
            "text": "Great food .great service . I really love this place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDeTZlYnFRRRAB",
            "text": "I love returning again and again to Riverdale Indian Restaurant. I've been fortunate enough to eat inside and these days pick up or deliver from this wonderful restaurant. It's so convenient with multiple buses stopping right in front, subway station a few blocks away. Most importantly, the staff and management really care. Everything is super clean, the absolute lovely and courteous staff, when calling in my order, it was ready early as I picked up this time. Take it from Professor Jan, it is a wonderful experience and truly outstanding food from the nice people here. Delicious vegetable dishes I ordered this time and certainly in the past, chicken and other menu items are outstanding. The samosas are really tasty with delicious filling! You won't be disappointed, and the prices are super reasonable and great! The portions are large as well. Everything is delicious! I will enjoy visiting here again and again. My appreciation to the fantastic people and food from Riverdale Indian restaurant/cuisine."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNc2F1UzZnRRAB",
            "text": "Delicious food!! The nan is so yummy..they have different types of breads. A large menu. Clean environment. They are super nice there even made a mango smoothie for me and my friend on the house. Will definitely go back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbnVhRG1RRRAB",
            "text": "Surprisingly good! Having come from England where there’s an Indian restaurant in every village, I wasn’t thinking I’d find anywhere very good in the Bronx, so what a surprise. Very tasty, not very oily, good balance of spices and chili, good size portions and affordable prices. Nice"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXX2E3eHFRRRAB",
            "text": "I placed an order for pickup and when I arrived home I realized I was given a completely different order, of much lesser value, no less. The manager handled it very poorly and did not offer to replace my order. He offered me a discount on my next order. When I placed that next order, he cheated me out of the discount he was offering. I will never order form this restaurant again. They do not value their customers at all."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjODZ5dWxRRRAB",
            "text": "Took an impromptu family trip here on the way home from a seldom family outing to a park during quarantine 2020. The surrounding area is very quiet & clean. The place was very clean. They follow all the social distancing & mask requirements. Thus was my first time eating Indian cuisine & the food was amazing. Our large family ordered many things. Chicken samosas were lovely, especially when I spooned extra sauce from the Chicken Tikka Masala onto it. We also ordered mix seafood curry, chicken vindaloo & chicken makhani,  each came with basmati rice. The portions look smaller than expected due to packaging but they were good portions & definitely worth the price. We also had the mango lassi with were good. My daughter ordered a mint lassi & did not like it but that's just her tastes & being experimental. All in all, this was an exceptional takeout order compared to quite of the few we've done these last few months."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlZ3FlVTRnRRAB",
            "text": "We absolutely loved our order of Lamb Rogan Josh, Saag Paneer, and garlic naan.  The lamb was super tender and flavorful, the saag was creamy with large chunks of cheese, and the naan was homemade.  Plus, delivery was super fast. Highly recommend giving this place a try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLThQVmx3RRAB",
            "text": "Got chicken Tikka Masala. Chicken was kinda hard. Not soft at all. Decent food I guess but the portions are small and the price is staggering. I paid almost $18 for the Tikka Masala and a small rice. Probably won't be going back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbDZpMGhnRRAB",
            "text": "Good to see a decent amount of vegan options! Thanks for that. The service waa very friendly. I personally liked the masala, but not the samosas (lots of cinnamon) and naan.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdW96c2Z3EAE",
            "text": "I placed an order with them for a couple basic menu items and my order was cancelled, saying they couldn’t fulfill it. I ordered vegetable samosas appetizer and a soup—weird.\n\nThis is a reply to their reply:  I ordered through Grubhub where the order minimum is $10–$12 for Grubhub Plus members to receive free delivery—this is clearly stated and you would not fulfill the order.  Why would you offer a $5 off orders of $15 or more if your order minimum is $25…?"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MWNyNGhBRRAB",
            "text": "Ordered vegetation and got meat! I was excited to try this restaurant but will never go back.\nI am vegetarian and ordered vegetable samosas and a couple curries. I bit into…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5ak8tdEF3EAE",
            "text": "I wrote a review about this restaurant when they initially opened and I'm reviewing again because I was so upset about the negative reviews.  I am not a friend or family of this establishment. I am an individual who enjoys good food.\n\nThis is and continues to be the best Indian restaurant this side of the Bronx. Before Riverdale Indian Cuisine the only Indian restaurant was up the Hill in Riverdale proper, and I always wondered how they stayed open, as they served those ready made Indian packets you find at Costco.\n\nRiverdale Indian Cuisine's food taste fresh and authentic. It is flavorful and they are mindful of the American palate (so not too spicy...but you can ask them to turn up the heat). I've always had the chicken dishes and the vegetarian options. I'm very picky about lamb and seafood and will only eat these at places that specialize in lamb or seafood. That said, the dishes I've had have been finger linking good. The naans are made fresh and if you're luck right on the spot. The mango Lassi is superp!\nPre-Covid, we came here every week. Now we are trying to support a different restaurant each week (you know...spread the love of our local establishments). The people are super friendly and always have a smile to share. I know they just went through a major renovation which accounted for some of the mess that I saw at pick up and, while my family and I have never eaten there, perhaps once this pandemic is over....we will celebrate  by enjoying our favorite food in this wonderful hidden gem of the Bronx....ok Riverdale...."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbXBQWUhnEAE",
            "text": "The worst Indian food I’ve ever had. Watery chicken tikka masala. Rice over seasoned. Also messed up my order and never brought the protein portion of my meal. Agra Grill is way better."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcUpyemZREAE",
            "text": "I’m soooo disappointed.  I feel they serve me the leftover .. Rice soggy .. nothing to do with Indian. Disgusting"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJN3FLUVl3EAE",
            "text": "This place has the best Indian food in the neighborhood (and beyond). The curry is so flavorful and thick  withspices, not watered down like the other places. Quick deliveries and great friendly service in the restaurant! Highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaU0tczdnRRAB",
            "text": "Excellent service. Amazing authentic Indian dishes. I had the Goad Shrimp with Basmati rice and the Lamb Kabab.  The Simosas are delicious.  Friendly atmosphere. Clean and orderly. Will be back."
        }
    ],
    "reviews_count": 71
}