{
    "name": "Metate",
    "place_id": "ChIJY4egG7_zwokRzfCjNkCrQAI",
    "grid": "BX8",
    "address": "3515 Johnson Ave, Bronx, NY 10463, USA",
    "rating": 4.2,
    "user_ratings_total": 397,
    "phone_number": "(718) 543-4444",
    "reviews": [
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcElmNlhREAE",
            "text": "Sort of bland and small portion sizes.  I'm going to chalk it up to a bad night because the place is typically busy.\n\nUpdate (8 years later): So, it took 8 years, but I finally gave this place another chance. The food has gotten a little better, so I raised my rating. A group of 6 of us ate for $100 (no drinks, no apps, no desserts), which isn't bad for the area. The food is decent, and I was debating 3 or 4 stars, but went with 3 because it's not something I'd crave or seek out.\n\nIf I'm being honest, I was little annoyed they couldn't toss in a side of plain chips (Chipotle style) on a $100 order, but I get they need to make money."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1Frc3RTRFU0VHpSVVptdzFNRFpqZW1vNFNtYxAB",
            "text": "Really great bunch!! Highly recommend."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOR1VHbGFPVEZZZGs4eWVWSTRlbGR6WnpFMExWRRAB",
            "text": "The service was slow, had to keep asking for things multiple times before finally receiving it. The taste of the food was okay, kind of bland, the drinks were good. The atmosphere was nice. This restaurant can do a lot better, it has potential, but you can tell the workers just don’t care much."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oZlNEY3djSEIyWlZKS1lWOW1kMUV3ZWpWYWJYYxAB",
            "text": "Excellent Mexican Food"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdnRIRTNRRRAB",
            "text": "Update:, been visiting after the new management took the place and is great!  Same chef, same delicious food! I still love this place!\n\nOct 2025\n——\nlove Metate!\nBeen coming here for years; the food's great and always tasty. The staff is super attentive. My favorites are the frozen margaritas during happy hour, the mole, quesadillas, and the guacamole bar. And don't miss out on their bomb breakfast on weekends; my kids can't get enough of the taco-pancakes!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ00wTlZZMDE1U2paSmNXVmZZbGN0TlhwZmJYYxAB",
            "text": "Amazing people, amazing atmosphere, and even more amazing food! Best Mexican restaurant I’ve been to. Highly recommend to anyone looking for a good time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUGNVRnZTMnRRY1RONWRIVXlWakZPWms5MFNIYxAB",
            "text": "New ownership and far worse food. Stay away from this place. The owners have ruined the food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VU1HNHhOVzFvYjNac1pteDRaMXB2VUZGVGJVRRAB",
            "text": "The manager told me they are under new ownership.  Prices are up and the food quality is down."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STWFESmtPRXhrUWxwMWRrRnlVamhyUmtKeVUwRRAB",
            "text": "Great food, service, and drinks~ would highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MFEzcFNOekZRT0U5UVJuQjRjVzVoWjBwRFNsRRAB",
            "text": "the food tastes excellent and the staff is delightful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReFVqVm5lRzloWTNWWU0ya3hkbkZQVTBsWFZIYxAB",
            "text": "I had an amazing experience thanks to Ahmed. From the moment we sat down, he was welcoming, respectful, and very helpful with the menu. He checked on us all the time without being intrusive and made sure everything was just right. It’s rare to find someone who genuinely cares about customer satisfaction the way Ahmed does."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbFgxaEtXbGRtZUROVWFWTTRYMUZRVG10cWRsRRAB",
            "text": "New owners now charging a delivery fee are you kidding\nPrices are high enough\nNot ordering again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcmMxWkJVamhxZUdSV1dIUnVRMHA2Y0U5c2NGRRAB",
            "text": "Used to love this place. New owners replaced all the staff. Higher prices and lower quality food. Hopefully it improves…."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3VQNDZnRRAB",
            "text": "The service and management at this restaurant was better and more consistent prior to a year ago.  My wife and I were frequent visitors at Metate.   Unfortunately on the last 3 plus visits my wife and I note their service and food has NOT been what it used to be.  It has degraded much.  Of course if you are going in for just drinks you may have a better experience.  However, going in for dinner chances are you will have a disappointing experience.  The owner who used to be onsite frequently has left the business to incompetent staff and supervision.   Food, for example my pork chop dish was hard and rough.  A dish I use to order frequently and enjoyed.  For those who are not aware of culinary skills; when you cook frozen meat without defrosting it first will result in hard rough cooked meat.  It will not be tender.   Regarding their service, you will sit at your table for what could be 10 – 15 minutes without any greetings and no offering whether you want a drink or water upon sitting.  Most restaurant training manuals say that a guest is to be acknowledged by a server “immediately, if possible,” even if no service can be rendered at the time.  Regardless, an order for beverages should be taken within five minutes.  On many occasions the food is served without utensils at the table; you have to remind the server on more occasions than we should that you have no utensils.  On some occasion you will sit with your food on the table while you wait for some minutes to receive utensils.  This both food and service unfortunately became a frequent experience for us at this place as much as we tried sharing these issues with the staff to correct because we use to enjoy coming here.  This place has turned out to be a hit or miss.  For the price, it should be a consistent hit.  Consideration given that no place is perfect and now and then you will run into hic-ups.  But frequent almost daily hic-ups are the result of something not going right.  If you want to experience Mexican food then this is not a recommended choice for you.  You may fall into the miss syndrome and end up disappointed and throwing your money away because you will be expected to pay for both the food or drink you turned away disatified plus the alternate plate or drink you ordered.  You will get a lot of push back if you contest not paying for your disatifaction.  There are many other better Mexican restaurants that are more consistent with their food and service.  You have been advised."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcWN4TnVHdXB6WURREAE",
            "text": "I went on Sunday’s morning and food was great. The service was warm and friendly"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUEZyNU9GbWJMVk9REAE",
            "text": "I’ve ordered many times from Metate and it’s always great—but I finally went in on a Friday night and it was even better. I sat at the bar and the bartender was so warm and welcoming. I tried the watermelon margarita and it was the best margarita I’ve ever tried. The service was excellent and made the whole night feel special. Food was delicious, I ordered birria plater. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMR0d0czNvMmZxeFNREAE",
            "text": "my family order some food there and never again the burrito was the worse i ever tried"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJam16S25YN3JHY3Z3RRAB",
            "text": "Great Mexican food . A bit overpriced though . You can definitely get cheaper food with the same quality elsewhere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReE4zUURBEAE",
            "text": "Best mexican spot in the New York area.  Finding this quality and low key atmosphere is so hard to find on the east coast.  Best fajita's, soups, guacamole and margaritas.  Forever a fan of this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNHFIal9nRRAB",
            "text": "Decide to come here after leaving another restaurant, just for drinks. The place did not disappoint!! Even thought it was packed, but it was Valentine’s Day. My friend and I were able to sit at the bar while our husband’s stood behind us. The place is really small and  narrow. The bartender was very friendly. Our drinks were delicious, I had a cucumber margarita. It was so refreshing. My friend had a blue berry margarita, also very tasty. I wouldn’t mind going back on a less crowded day."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdC1EajVRRRAB",
            "text": "I order steak fajitas and the meat was tough as nails. If you want genuine Mexican food go to Mexico or much better Mexican restaurant in the city. I’m never going back there again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaExhUU9nEAE",
            "text": "Food is great"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPLXV6YnBBRRAB",
            "text": "Authentic family 👪 run Mexican restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNFpIa3lBRRAB",
            "text": "Great authentic Mexican food! Wonderful service! Can’t wait to go back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbWNUMlh3EAE",
            "text": "Very fresh food and the artwork is beautiful.  Also the Mexican music is the icing on the cake"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdnNUVTdnRRAB",
            "text": "I wished the restaurant was bigger, but it was a lovely place and the waitress was lovely."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaTYtR2ZBEAE",
            "text": "The service was alright, it was a Friday evening but the staff was not as attentive as they should have been; husband got their steak and onions and the steak was mainly fat and the cook was off causing him to not feel well. Was able to get an alternative option but still had to pay for the steak.\n\nUnsure if it was just a bad day; this was our first and last time getting food from here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibk43VXNnRRAB",
            "text": "Thank you guys for amazing days , I just get the best birthday in my life with you , the food extraordinary and best taste and the staff very friendly!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeEpqMzB3RRAB",
            "text": "great restaurant. nate was great at the bar, great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMklQa0NREAE",
            "text": "Great place and phenomenal drinks with great Food! Definitely recommend coming here."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcC1TaXh3RRAB",
            "text": "Súper bueno!!! Excelente comida y el trato genial!!! Muy recomendable 🙌👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bDRXX1B3EAE",
            "text": "good place and service, employer people is very efficient and friendly. The food is very very good  and drinks is the bestselling 💯🤤❤️🇲🇽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NTZIYlpBEAE",
            "text": "The food is very great, and drink is the best and the People services eficient The girl in the morning is very great and good service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cDUzTEV3EAE",
            "text": "This little restaurant has fabulous food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6aF9lSENREAE",
            "text": "Excellent service. The foos tastes very authentic and the employees are very nice and attentive. Every time i go the girl on the bar area is very nice and takes good care of me. Definitely a must go to"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6czc2dWx3RRAB",
            "text": "Very great drinks and food, everyone is friendly and very efficient 👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6alotMVNBEAE",
            "text": "Ok I tolerated this spot for a little too long.  Much better Mexican within a mile radius closer to Broadway.  The mole is fine, spicy for a suburban palate, but the worst was the “frozen” margarita that has the consistency of plasma.  When I asked if I could switch to a regular margarita because it was sloshy, they said yes, but I’d have to pay for it.  So the drink just sat there looking sad the whole time while I ate my mediocre meal.\n\nMi Lindo San Miguelito and Taqueria Sinaloense are much better and a fraction (maybe 4/5) of the price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6c2EzemJREAE",
            "text": "Food and service was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUblpEWExREAE",
            "text": "Love metate. One of my go tos!!\nI’ve always enjoyed anything I’ve tried from.\nMy favs are the chicken quesadillas and the tostones with the garlic sauce!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULWVQVC1RRRAB",
            "text": "This spot is so good!\nJorge and Nate are absolutely amazing, they are so sweet and attentive. I absolutely love both of them 💙 ! The chicken tacos are to die forrrr!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULWVPeFN3EAE",
            "text": "We love Nat and Jorge! They are patient kinda and the lobster bisque soooo gooood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULWVQQ0NREAE",
            "text": "I love Jorge and Nat they are good servers and make you feel welcome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULWFQZGZBEAE",
            "text": "The drinks, food, enevuorment was wonderful, jeorge and Nate are the best bartenders here we appreciate them ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaE9TSGxRRRAB",
            "text": "delicious food. Best Mexican in riverdale"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOWFmYU9REAE",
            "text": "Such a wonderful place.  The serivce was wonderful, and the food fantastic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOWNTeGxBRRAB",
            "text": "This place has been a mainstay of our neighborhood. Ordering for delivery or pick up or dine in has been wonderful. The staff is welcoming and I’m thankful to have this business in my community."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOWZDQ0xnEAE",
            "text": "Fun local hang. Food is great. Service is excellent. We love the atmosphere here. Always a fun experience. We are loyal customers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdVo3dGxBRRAB",
            "text": "Obsessed with the shrimp burrito. Delicious happy hour margaritas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNnBYLTdRRRAB",
            "text": "I love this establishment it’s a Great local authentic Mexican Restaurant. The make the fresh guacamole right by the table. The Flavor profiles in the food are excellent and the chips are so fresh with just a hint of salt. My on the rocks passion fruit Margarita had me lit off of one drink. I ordered the Birria tacos they were so freaking so good and my partner had the steak tacos which were delicious. Loved my elote that came with my Dish. Staff is friendly attentive and super kind. Parking outside is meter only and free after 7pm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMTVHaXh3RRAB",
            "text": "Came with coworkers for happy hour and had a great time. Great service, food and drinks! Excited to come back and try more of their drinks and desserts!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtZ3NTMmlBRRAB",
            "text": "This place is pretty great. Wait staff is friendly and attentive. The happy hour prices are great and the drinks come out extremely well made. As for the food, immaculately made. We had the pork chops and the torta (pork) came out hot,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScl92SkRnEAE",
            "text": "Stopped here for Cinco de Mayo, it was crowded, but got a table within a few minutes. Place is small so seating is limited . Has outside seating & a bar with some high top seats. Food was really good. Had some tacos, hard shell & soft shell. Chicken Tamale was really good. Fresh Guacamole that they make there. Chips & salsa for the table when you sit down. There was a worker dressed in a Mexican dress giving out free Coronas for Cinco De Mayo Servers were friendly & attentive. Will go there again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bjZHSUZnEAE",
            "text": "I tried their breakfast menu. The taco pancakes were a delight to the eyes and stomach! They are served on a Taco holder. You eat them just like you would have a Taco.   You can ask that an ingredient be taken out, if you prefer you not have either the whipped cream, sliced strawberries, drizzle of chocolate sauce, or sprinkling of powdered sugar. I recommend this for a morning celebration of good news."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlelpIb2d3RRAB",
            "text": "Hola a todos chicos! Hace menos dos meses que fui con mi esposa acá, no es el gran restaurante mexicano, pero la comida fue buena. La atención fue regular, están siempre mirando sus móviles que lo qué pasa con los clientes, al camareros son un poco lentos.\n\nHi all guys!  It's been less than two months since I went here with my wife, it's not the big Mexican restaurant, but the food was good.  The attention was regular, they are always looking at their mobiles what happens with the clients, the waiters are a bit slow."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNa1lxZUNnEAE",
            "text": "The restaurant was packed. We got the last table close to the bar area. The food was absolutely delicious!!! I had a chicken burrito and my friend had the grilled salmon. The service wasn't the best but okay. The music was a bit loud for my…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHenNuMU5BEAE",
            "text": "Found this little place in Riverdale. Great Tamarind Margaritas, fresh Guacamole. had the Tostones with Chorizo, Tostones were great but it needs some mojo, as the chorizo was dried. My steak with rice and onions was actually made medium…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMVpYNDRnRRAB",
            "text": "I live close and have been here a dozen times or more.\n\nOrdered a to-go delivery of 2 orders of beef fajitas and had a margarita while waiting (about $60 all in).\n\nI asked for cheese for the fajitas - and was told this would be $2:50 and needed 3 more tortillas (each order comes with three) - that is about $5 more. I paid for extras and discussed that I didn’t think this is good business.\n\nThe food is okay - fine for being the closest Mexican restaurant.\n\nI understand there was/is pandemic but if I spend $500 a year at the restaurant I expect that you can toss in the cheese and a few tortillas or you just don’t value my business. Ok - will shop somewhere else."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa3NUS2NREAE",
            "text": "Great Mexican restaurant.  The food was delicious.  Guacamole was so fresh. The watermelon mojitos were delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLWJXNi13RRAB",
            "text": "Very nice waitress and my frozen margarita was excellent.   I would go back ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ck0zV1d3EAE",
            "text": "Loved the food. Really delicious, great flavors. Will definitely be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGaEktX0JBEAE",
            "text": "My husband and I got fish tacos, chicken tacos and an order of metate nachos. The food had no taste and it was like thrown on the plate. No presentation at all. I do not recommend this place at all. I will still prefer Serrano Mexican restaurant which is also in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkZ3U2dGRnEAE",
            "text": "I had dinner delivered. I ordered Metate Nachos, 3 chicken tacos and enchiladas verde. The food was terrible. The nachos were soggy and tasteless and the chicken tacos on hard shells were also soggy. As if they reheated in microwave. I will never order from here again or go into the restaurant. For their over priced food it should at least not taste like cardboard. Yuck!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LWRLV19nRRAB",
            "text": "The food is spot on. I don't like soft shell tacos but these are amazing. They do have hard shell tacos as well. The prices are just right. The margarita was one of the best I've ever drunk. I give it 4 stars though because depending on who you get the customer service can be lacking. Most of the time its fine though."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdTVxMVZBEAE",
            "text": "Good food and drinks.  The margaritas are delicious and strong. We had the steak tacos and were very well done and tasty. The pork tamales were spicy and good.\nThe waiter Nathaniel was very professional and friendly.  He informed us about different menu options and was very attentive."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMTRHVkZBEAE",
            "text": "I've looked over some of the other reviews, and feel better about my low rating.\n\nThe food quality is good. The food is consistent, and is pretty good. I might have rated them 4 stars for the food alone.\n\nWe've only ever ordered delivery from Metate, and nearly every order has had a problem. Usually something very small, which makes it worse, since I wouldn't want to call in such a small correction.\n\nOnce I ordered a side of tortilla chips and they were missing from the order. They were for my kid so I actually made the driver drive back with just the tortilla chips. Most recently, I ordered a side of sour cream, and it was missing from the order. It was for me and I didn't want to make them drive back with a few tablespoons of sour cream.\n\nOtherwise, the food is pretty good. I order from here when my kid insists that we have to have Mexican food, otherwise I look for other options first."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbmJQYVRREAE",
            "text": "Great little gem. Definitely order the watermelon margarita. It's refreshing and delicious. They make their guacamole fresh.  I ordered the burrito with steak.  Every bite was flavorful.  The place is small and gets packed.  The service is great.  Real authentic Mexican food. Looking forward to coming again real soon"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bHJMQkJ3EAE",
            "text": "Metate review\nI had an unpleasant experience with this restaurant tonight. I went online (seamless) to see the menu and choose what I wanted. I decided to call the order in and pick up to avoid delivery and other fees. I picked up the food only to find the order was not what I expected when I got home. Maybe I should have checked the order before I left the establishment but Who does? Anyway, When I got home I  found one item was incomplete (missing a key ingredient) and the order of tacos did not come with rice and beans which it says clearly on the seamless menu website that it accompanied the tacos. I call the restaurant to complain and the person says that tacos do not come with rice and beans anymore and they are working on correcting the online menu. They offered to re-make the other item correctly and I could either go pick up or they could deliver it . While I appreciate the offer to correct the item, now I need to go pick it up or wait for an undetermined amount of time to have it delivered. As you can imagine I am not happy for the inconvenience and so I ask if he can include the Rice and beans to make up for the errors and he said no. On that note, I decided I would return the food and get my money back. Not to mention, It was pretty expensive too. 18 dollars for three simple tacos. I understand that inflation affects prices and I appreciate the hard work that restaurants go through but 6 dollars a taco is a bit much. Not once during this whole ordeal  did he apologize for the mistake and the trouble I went through. The person I interacted with was rude as well. Needless to say, I won’t be going back. Fridas tacos are much better (and affordable) anyway. Go there instead."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbEt5Y0d3EAE",
            "text": "I’ve been to this restaurant so many times and I really want to love it but they lack consistency. My go to plate has always been Enchiladas Suizas, it’s usually really good but on the last occasion it was VERY spicy and now they just refuse to make it for me. I’m not one to cause a scene ever and I’m pretty sure I just swapped dishes with my mom that day. Today I ordered a Burrito and disappointed again. The burrito is made up of cheese, chicken and beans. That’s it! Lettuce, tomatoes and sour cream are on the side, no rice (as I’m finishing up this review I found the rice all the way at the bottom of the Burrito!), no guacamole. Chicken is ok but the beans lack seasoning. Just a very strange set up. I’ve also had the taco salad bowl thing and that was mediocre at best. This will probably be my last visit. Giving two stars because my parents really like the Fajita Mixtas and the salmon. Oh and the frozen margaritas are good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVNnJpa3p3RRAB",
            "text": "Almost $14 for this ... the rice and beans tasted stale... this is the worst quesadilla I had ! The girl who answered the phone was unprofessional.. never again !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5dUtucl9RRRAB",
            "text": "Really delicious. Flavors are spot on. Portions are generous."
        }
    ],
    "reviews_count": 70
}