{
    "name": "Blackstone Bar & Grill",
    "place_id": "ChIJT4ODrb7zwokRqSIp6IIoyQ0",
    "grid": "BX8",
    "address": "3713 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 422,
    "phone_number": "(347) 346-6004",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVFJscEdjRmRqWDBOemRuVktOR05uUWpSRFNFRRAB",
            "text": "Food tastes mediocre and I got bad food poisoning from one of their chicken sandwiches that lasted two weeks."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFltSjVMVE5JWjJWSmJITlNkMlZ4UXpRMU9FRRAB",
            "text": "Great spot in Riverdale. Excellent food,drinks and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNkxXdFNlRVJ0UTI1TVkxUlpaRUZNV2t0aWRuYxAB",
            "text": "I would definitely recommend this restaurant and bar"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd3JhUFN3EAE",
            "text": "Charged us full-price during happy hour... be careful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRU56Sk5VekJhYkZCSVlVSlVlblpNYjBsTWVYYxAB",
            "text": "Decided to have dinner here with family and friends on a weekday. Majority of the food we ordered was delicious! Pasta, Texas burger, tacos, Shrimp appetizer Chicken Sandwich. We also had wings, I wasn't the biggest fan, they weren't horrible though. Service was a bit slow with 1 server, but it was fairly busy for a weeknight. Overall, would dine here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSlluRjFZa2w1YWpsU1dUbEpSRGhvWkZGdmExRRAB",
            "text": "Great drink and food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NGRTMW9kbkY0Y1MxVk0xbFJORFF6UVdaQ1YyYxAB",
            "text": "Awesome place. Food is great and the people are 😎"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVGIwMURaMWwyTTNKQk9XUnVPWFZ5UWpCVFJXYxAB",
            "text": "Katie the bartender is a bartending powerhouse ! Love her vibe and fantastic service. Busy day with teachers last day and she is bringing it !!!!! Way to go !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPR3U2OGZRNnZlblZ3EAE",
            "text": "Best Burger in the Bronx – Plus Great Drinks & Even Better People!\n\nBlackstone Bar & Grill in Riverdale is an absolute neighborhood gem. The burger is hands down the best in the Bronx — juicy, flavorful, and always cooked just right. The grilled fish tacos are another must-try: fresh, zesty, and full of flavor.\n\nThe atmosphere is warm and inviting, and the staff make all the difference. Steve, the owner, is always welcoming and attentive, and the bartenders are top-notch — friendly, fast, and they pour a great drink. Whether you're there for a quick bite or a night out, you’ll feel right at home.\n\nGreat food, amazing service, and an all-around good vibe. Blackstone is everything you want in your local bar & grill."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN1BvTTI5bE55eHBnRRAB",
            "text": "Sports bar, Friendly atmosphere, great food. Truly enjoyed my time. Definitely going back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeWo3N0d5cHRMOS1nRRAB",
            "text": "Excellent wings (Buffalo) and great bartender"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOcUJpdnllNWFHbDFRRRAB",
            "text": "Great experience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc2VEeVZREAE",
            "text": "One of the best burgers I've had in a really long time. I got the blue burger with bacon and barbecue sauce on the side. Delicious and shoestring fries that I haven't had in a long time. I was there with my friends and we all enjoyed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZzdDNlBREAE",
            "text": "BEST FOOD AND DRINKS!! servers always serve 🙏"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbUo3bFVREAE",
            "text": "The French fries are wonderful. The burgers are very good. I expected the honey chicken sandwich to be more flavorful… it was just OK."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLThXanRRRRAB",
            "text": "My brother and I came here last night (Saturday night 04/12) he’s been here a bunch of times and raved.. last night was my first time joining him. I definitely enjoyed myself . The bartender was great (attentive but not overbearing)  the food was great.  I got the chicken sandwich and he got a burger , both very solid choices. Will absolutely be back & 10/10 recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b3BPU1ZREAE",
            "text": "Blackstone’s has the best bar food in NYC. No one else comes close. Their nachos can’t be beaten. They have the best chips to toppings ratio. Simply delicious! Their fries are addicting. Best wing’s anywhere. Always consistent in size and taste. Plus they have been voted best burger! Seriously, you have to eat there. You’ll thank me after. Grab a beer or cocktail while you are there. I love this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReFkyR1pBEAE",
            "text": "Occasionally do instacart and Uber Eats on the area. After I was finished decided to try a local place , I picked a good one! Nice atmosphere, food looked good didn't have any, the staff was excellent 👍.\nWould like to come back and try the food."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdWFXSHpnRRAB",
            "text": "Excelente 👌"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeHFYYlh3EAE",
            "text": "Great place to be, Great food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bF96d2xnRRAB",
            "text": "The Blackstone Bar & Grill in Riverdale, Bronx, is an absolute gem that stands out as a true family establishment. They deliver exceptional service, incredible food, and a welcoming atmosphere that’s unparalleled.\n\nLet’s talk about the food—it’s nothing short of phenomenal. Whether you’re in the mood for a classic cheeseburger, savory tacos, or a perfectly crafted fish sandwich, The Blackstone offers a broad and diverse menu that caters to every palate. Their selection of drinks, from beers to spirits, is just as impressive. It’s safe to say this is the best food you’ll find in all of Riverdale.\n\nThe service is impeccable, and what truly sets The Blackstone apart is its owner. In a way that harkens back to the golden days of the 80s and 90s, the owner embodies a genuine care for his establishment and his customers. His dedication is evident in every aspect of the business, ensuring not only satisfaction but also safety and well-being for every guest. This level of personal investment in customer care is a rarity these days and speaks volumes about the integrity and quality of this establishment.\n\nIt’s no surprise that The Blackstone Bar & Grill has become a mainstay on Riverdale Avenue, outlasting many others on the block. This is a testament to their commitment to excellence and the loyal patronage they’ve earned by consistently delivering exceptional experiences.\n\nIf you’re looking for a place that values its customers as much as it values serving amazing food and drinks, The Blackstone is the place to be. Highly recommended!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMmUtQ0JnEAE",
            "text": "Why is this place so anti Semitic? IN RIVERDALE????"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdDltT2tnRRAB",
            "text": "Great pub great food and the service was brilliant with our server Sophie. She was very busy and took care of everybody with ease and a smile. Definitely will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudDZEZnBBRRAB",
            "text": "Food was very meh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOC1tT0d3EAE",
            "text": "Recently checked out this establishment on a Saturday night and had a wonderful time! The food was very tasty, fresh, and plentiful! Although I had a Bud Light I did order a bar drink but a delicate one, LOL! The atmosphere was a vibe, the wait staff were extremely attentive making sure all patrons were good and had everything we needed. It's not very big on the outside but once you go in it's actually a long and narrow eatery with big screen TV sets behind the bar and enticing blue lights. They do have outside seating but I chose to sit inside. Definitely recommend this place for a bite and a drink after work or on the weekend! Rory and Rosie were extremely attentive, kind, and hard working. They made sure me and my brother had everything we needed. We will absolutely return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbGZUOEtnEAE",
            "text": "Great place to watch the game, have lunch or dinner. The staff is above and beyond always.\nHighly recommend this place to everyone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId3VELUFnEAE",
            "text": "Great hometown place to eat. Food was fresh and really good! Good portion sizes too. We were visiting our daughter and wanted to check out area places to eat. This was one that caught our eye...and then our taste buds!! Would definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3ellDX1pBEAE",
            "text": "Best burgers I have ever eaten…\nThe whole experience was amazing and the food was great.!!\nI ll be back..wonderful food,service and hospitality atmosphere was so refreshing and relaxing. Thank you.!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiXzVDdUNBEAE",
            "text": "Tasty food, great service, I recommend their vegetable nachos with added avocado and a side of their avocado sauce."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiblBmb3hBRRAB",
            "text": "I got the Apple and butternut squash salad when I went to eat my salad I found a bug in it. I work in the food industry so this tells me they definitely don’t wash their salads…. What a disappointment. My whole appetite is gone…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNTVTUTJnRRAB",
            "text": "Food was good. Service was good, especially for having new staff. Would've liked a better selection of hard/spiked teas and seltzers since I have celiac disease and can't drink beer, but other than that it was great. We all had a blast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicDRuOWZREAE",
            "text": "Love Blackstone! Food is always delicious, staff are great, and drinks are delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURFLXA2R25BRRAB",
            "text": "I love this place. Very comfy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycGY2M0FREAE",
            "text": "Hand down the best place on Riverdale for a quick meal and drinks ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdnBXSDFRRRAB",
            "text": "Nice neighborhood bar and grill"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ1otM2ZBEAE",
            "text": "Horrible service over priced.. service was so bad! Worst part I saw the bartender / waiter biting his nails and blowing his nose and really digging in there and not once went to wash his hands!!! Rude never once came to ask us if everything was ok or if we needed anything else. What a waste of my hubby’s hard earned money. Never again😡😡😡😡😡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbmY2bzVBRRAB",
            "text": "Great food, Lunch ordered is always Hot and Very tasty. Great Spot to Eat and Unwind 🍻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbWJITXZ3RRAB",
            "text": "Mom's birthday party. Awesome day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULVBEZEpnEAE",
            "text": "Went in for riverdale restaurant week..we had chicken wings and tacos..2 drinks each..my drink was perfect!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaGZDODRnRRAB",
            "text": "Very nice place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbXNULXFRRRAB",
            "text": "Local Sports bar feel, they cater to all sports and clients young and old.\nFood is great, consistent.\nDraft beer rotation is solid, they keep it local and interesting with their seasonal pics, but you can never go wrong with their own Pilsner.\nQuite frankly, the best buffalo wings and blue cheese combo in the area. Burgers are nice and juicy with fresh topping.\n\nSteph is always amazing and attentive behind the bar on the weekends, as well as the rest of the staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MWRiRXZnRRAB",
            "text": "The quesadilla I had, was fantastic! Definitely coming back for that.  Unfortunately- even on a not busy afternoon, I had to flag down the bartender for a drink every time.  And it’s not as if he was busy - he was standing at the end of the bar chatting with other customers for about 10 minutes without paying attention to the other 4 people at the bar.  I had to verbally try to get his attention in order to order another drink.  That’s not a sign of a good bartender."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NGNpVjBRRRAB",
            "text": "Love the place 🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLW9mN0xBEAE",
            "text": "Very relaxed and calm ambience. 😌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eV9Xa0F3EAE",
            "text": "One of my favorite haunts!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dXJpUkV3EAE",
            "text": "Great loaded nachos, stuffed burger and fries. Good tap selection, beer was nice and cold. 2 nice big screens in the back and down the corridor...perfect for warching the games. They need a better tea selection for the those not drinking alcohol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOclBUczJnRRAB",
            "text": "Very good beer selection, and surprisingly really good tacos. I did not expect those tacos to be so authentic and good but they are. Eill definitely come back here again for a quick bite and a beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxc19MMjRRRRAB",
            "text": "Great little neighborhood place. Especially if you want to watch a game! Has that Cheers vibe! Check it out in person. Cozy area toward the back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeE92RlZ3EAE",
            "text": "Good food. Good music. Good Entertainment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWXy1QOUdBEAE",
            "text": "Cool sports bar with a variety of good draft beers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKM29xeHF3RRAB",
            "text": "First time visiting this place in lower Riverdale.  The service was excellent, and the owners were attentive.\nWe had the fish and shrimp tacos. The fish was cooked perfectly and the shrimp had a the perfect spice.  We really enjoyed the arugula salad. It had bacon, red onions,  and blue cheese crumbles. The dressing was perfect and not greasy.  We will definitely be back.\nYou must try this place is you're in the Riverdale section of the Bronx."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnAtcFh3EAE",
            "text": "Excellent service. Wings amazing, flavor of the chicken sandwich amazing but It wasn’t crispy. Salmon blt was good but too fishy if that makes sense. Fries and drinks also very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NnFqVEd3EAE",
            "text": "Bar atmosphere with high top tables, some tables in the back & outside seating that’s on the sidewalk & in an open street shed. All the food was good but a little pricey. $11 for a French onion soup & $14 for a bowl of chili. Chili comes with cheese but I had it without. See pic. Will go there again though."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5d09xRVRBEAE",
            "text": "Great drinks, well made food and friendly staff. It's a nice a cozy place in my neighborhood.  Give you the big city experience (whatever that is) without having to leave the area.  Make sure you try the Grilled Chicken sandwich which pairs well with a Moscow Mule.  Great spot, you won't be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMmQ2RVl3EAE",
            "text": "Introduced to BBG by one of my favorite colleagues. We try to link once a month for lunch. On this occasion it was my 2nd time dining here and we came in for dinner.\n\nIt was a raining evening and we took an empty table at the back. There were a few people at the bar but for the most part not too busy however a steady flow of deliveries going out.\n\nThe menu is simple and straight forward, we were able to take advantage of a couple of the HH drinks. My favorite colleague ordered the Honey butter fried chicken sandwich, which was huge. I ordered the avocado grilled chicken wrap. Both orders came with French fries.\n\nI started with a couple a fries first when I realized the wrap contained bacon. This was an oversight on my part because I do not eat pork. Unfortunately, I had to send it back. I asked the waitress for a plate so I could continue snacking on my fries while I waited. She insisted that it wouldn’t take long and that they would do the entire plate over. So I waited, my wrap returned solo. When asked about my fries I was told I would have to be charged for a new order of fries because the others were dumped. Not a major deal but admittedly, a little annoying.\n\nOverall a cool/simple local spot that I don’t mind stopping in with my FC.\n\nJust A Note:\n\nCheck out their HH."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcDllOExnEAE",
            "text": "Excellent local bar. Food is good drinks are good and staff is very polite and courteous. They also have games at times. Def good vibes and good ambience as well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbXRpUFRnEAE",
            "text": "Horrible quinoa burger. Yeah yeah I know who orders such things to eat. But I ordered it during lent and I regretted ordering it. I just ate the Fries and some cola. The server gets 5 stars from my end as he was attentive and respectful, but that burger lol."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLX3RmN1p3EAE",
            "text": "LOVE Blackstone!! The drinks are phenomenal and well priced and the food is surprisingly delicious. Real restaurant quality food in a pub setting. The salads are fresh and unique, the fries are the best around and the burgers are perfectly seasoned but the WINGS..... ARE WHERE ITS AT.\n\nSteve and his staff have been staples in the community and great people. Support small local family owned businesses!!\n\nBest drinks bartenders and food. The outdoor seating area is cozy and comfortable"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMTZuVlN3EAE",
            "text": "Mediocre food, ok drinks.\n\nNothing personal against this place, the staff is just fine.\n\nHowever, the food is super bland. Minimal seasoning if at all, over cooked or over fried. Wanted to give this place a second try but it really wasn’t worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCalpDMnZBRRAB",
            "text": "Delicious food and large portions. Reasonably priced. Great staff!!! Very clean."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNX3EtUmRREAE",
            "text": "Love this neighborhood hang out. Good vibe. Reasonable prices. Upgraded food. Great selection spirits on tap."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ODQzSmZ3EAE",
            "text": "This place used to be amazing Pre-pandemic and well into it. But now that things have improved, Blackstone has just gotten worse. I’ve ordered from here several times a week to what turned into once a month. But after today, never again. Their food is honestly disgusting. Their quesadillas (I know, how could they screw up something so simple!) are just disgusting. They increased their prices and went cheap with their ingredients. The “pulled pork” is a mix of processed pork and chicken and the cheese is rubber. Not to mention the puddle of oil it laid on. See photo for proof. Never again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJLWNIMHhnRRAB",
            "text": "Awesome place to hangout in Riverdale,great service,my waitress Annemarie was so cool,appetizers were perfect  (Buffalo wings white sauce was amazing never had a sauce like that before)food is fresh,ambience is laid back and relaxed,Thanks Guys!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaODhLVW1nRRAB",
            "text": "Our waiter was absolutely amazing! She was wearing athletic clothes and it was as if she was working out! She literally was jogging from one table to the next. We were here for several hours watching the game and she did this for every table. I was super impressed! The food was excellent bar food! I highly recommend this restaurant!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMUt6dlF3EAE",
            "text": "We needed a bite to eat late on a Friday night and it was one of the few still open that weren't blasting music at an ear popping volume. Cool little spot and nice staff. The food however was just ok. Not terrible, but seemed more of an afterthought to the bar menu?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN1lpSnNnRRAB",
            "text": "What a find! Delicious bites - the honey garlic shrimp and fish tacos are divine - and an incredible, hard to find IPA selection. My only quibble is that they don't update their website with the latest and greatest beers because if they had, I'd have gone there a lot sooner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcS1DNEV3EAE",
            "text": "Exceptional food and service, great atmosphere. Love the main dishes and the fries especially. The waiters are always kind and don’t give me any problems with anything. Highly recommended."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdHVLSjB3RRAB",
            "text": "Great service, great food, great music, and an all around amazing environment. The bartenders are awesome. They give everyone attention to make sure everyone gets what they want. They're also really funny too. Plus you can watch sports on…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4d3RXZ0dnEAE",
            "text": "The areas I gave it four stars are only because I'm not a fan of merengue, today's Hip Hop, reggaeton nor any of that music (I'm old school because I'm older), BUT the bartenders are lovely individuals and I'm a good service guy. Especially my girls Steph and Christiana. All of the bartenders and waitresses/waiters are good mannered young folks, the Oyster Fest (they have two of them 🙌🏿) are great and the owner Steve is a good guy. The manager is a winner too. Great bar food, good food period and a variety. Drinks are pretty decently priced (it is Riverdale, so rent is real) and there are curbside seating options. Great for weekends and Sundays are excellent for sports, as they have MANY televisions and true fans. Try it, you won't be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4emNfanJnRRAB",
            "text": "This place is a family staple. My 3 yr daughter loves this place for the sliders and solid music they play. They have a great beer selection, especially the IPAs. Food and service is consistently spectacular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOTV1NkJnEAE",
            "text": "Needed food late night. Called from my car at 12:45 a.m. kitchens was closing in 5 minutes.  I placed my order for buffalo wings/ crispy.  Pulled ups, parked, sat inside to enjoy my wings a cold beer. Staff was attentive. This is the spot for late night / early a.m. in Riverdale."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMl9hTzFnRRAB",
            "text": "I went to watch a NFL playoff game; the place was quite nice for watching the game. It wasn't too crowded, easy to get to by bus, had a good bar with many TVs, and cozy. The Stuffed Burger was REALLY good, and the Rum Punch was tasty and plentiful. Staff was nice, bathrooms clean; I had a good time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Mjl2dG9BRRAB",
            "text": "I took a star off because on the website, the happy hour fries is listed as $4 but it rung up as $6. I notified the bartender (I was sitting at the bar), and she said “the system has it for $6). Everything else was fine, except for the price discrepancy.she didn’t try to resolve the issue…I had a glass of wine, chicken quesadilla and fries during happy hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsakpLUmpRRRAB",
            "text": "Such a cool little pub, and the food was amazing!!! Blackstone is proof that bar food can be FOOD! So many amazing flavors on tap and the people behind the bar were pleasant and accommodating, no hovering just making sure your good and seeing how they can make your experience better. I live in Queens but Blackstone would be the place to make me drive the hour to the Bronx..also the owner is a friend to the community and our Veterans which speaks volumes to his character."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla3RLaXZRRRAB",
            "text": "Conventional neighborhood sports bar; good to mediocre food options; friendly, adequate service, decent rotation beer selection, and endless ESPN. Bonus point for an interesting mix of personalities and multilingual eavesdropping; vibe is overwhelmingly macho, borderline toxic at times. Apparently, it’s an excellent day-drinking destination with serviceable outdoor seating (provided the double-parked cars and delivery trucks aren’t idling right next to you."
        }
    ],
    "reviews_count": 75
}