{
    "name": "IHOP",
    "place_id": "ChIJyXw9tZfzwokRc6nf8NxstrE",
    "grid": "BX8",
    "address": "5645 Broadway, Bronx, NY 10463, USA",
    "rating": 4.1,
    "user_ratings_total": 2931,
    "phone_number": "(718) 549-4565",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oS1dHTkhUMUpSUzNCRlJqSjNaRWhxVkcwNWVWRRAB",
            "text": "Best staff I have ever encountered at any IHOP I've visited."
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaTVDZXN3RRAB",
            "text": "The best pancakes"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ock4xWkxlV0ZtVEVGdExUWmZZV2xQT0haWFRXYxAB",
            "text": "Nice people"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFIwUmhTbEJYVFdWVE1DMXRTREY1VnpOc1lWRRAB",
            "text": "Muy mal servicio, pedi una hamburguesa clásica, en cuanto me estaba terminando las papas habia un pelo, le digo a la mesera y ella trae a la mecera ,lo que ellae dijo que era raro porque todos traen puesto protedigo  el cabello, queriendo…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcVpubHpia2RvV1RsWVZVUlNUV2RWWTNGeVdrRRAB",
            "text": "Went here this morning for Sunday breakfast with my husband and son. The place smelled like a mildew, the booths are very tight in the section they sat us in. Our server was friendly but extremely forgetful and we had to keep asking her to bring items that either went with our order (like the order of pancakes that come with the breakfast sampler, the Pepsi my husband had asked for, sugar for the coffee, the ham that I asked to be substituted instead of the sausage links which was thrown on the plate when it was bought back to the table). All the food was bought out lukewarm and the overall experience here was disappointing and took the comfy feeling out of a Sunday breakfast with family. Definitely wasn’t worth the $75 we spent. Won’t be returning here and won’t recommend it, go to a different location."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSd01Wb3pZekI1VVdSeFNXRXpURlpmWkhGV2QxRRAB",
            "text": "Guys are amazing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd1YzcEhjMFV6YlRGTFlUUk5aVXQxV0hWMVkxRRAB",
            "text": "I had a great experience with Ambar R!\n\nThe service was fast, great and efficient.\n\nThank you for making my dining experience amazing!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdmJEaGlOWFZpVlU0NVdWbHlVaTFQY1d4eGJYYxAB",
            "text": "Juan was great! He was attentive, efficient, accommodating and the ambience was pleasant. Very pleased"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cVdETlFlRWN3VEc4d04yRnpaRkV4ZWxGeWJYYxAB",
            "text": "Great service from Nilo T."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWGRtRmhVa2huUlhwc1NHcE5NM2xJY1VGaGVIYxAB",
            "text": "Nilo is the best"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFFrUlZRMVJ2VWpsNGNsbFBSbXRPUWxOYVVXYxAB",
            "text": "I went to eat breakfast with my son this morning, the lady who will sit you in the table was, trying to sit me in the back. I ask very politely if we could get another table. She was already rude. We sit in a table vey uncomfortable. I politely ask one of the best server who been there for year Juan a very nice guy, he said I could moved table. The lady came to me screaming at me why I move table screaming at me why,  and started screaming in front of everyone in the restaurant and she started arguing with Juan, I just walked away from the restaurant. I been going to this restaurant for more than 20 years and never, have experienced something like that. It’s very sad that your customers who been coming for almost 20 years get treated that way. It was very embarrassing."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNFNsbEZaMlpCWTBwU1FWbGtZVEpEU1ZKMVZrRRAB",
            "text": "Todo estuvo bien el buen servicio de Sr Nilo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NVdreGxjMngyYlV0ME4xaHNNVE5XTkVvMVZGRRAB",
            "text": "Been coming here for a year now, pancakes are amazing! & Amber is friendly and provides great service !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Uk1WWkxZelF0V2pObFVrRm5WREpUTWs5TFUzYxAB",
            "text": "Amber gave us amazing service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeWJUWXhNRVJUVjJ4SlEzWllURFJpTkd4cmRXYxAB",
            "text": "Good service! Nilo was the best waitress!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JdGRteFdOWFEzVFZFMGF6Wk1aazlpYUVwS1lYYxAB",
            "text": "Nilo is an excellent waiter."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbFIwOWtkek52TmswNFRqQjFNMlp0WWpkeVdIYxAB",
            "text": "Vine desde República Dominicana y excelente servicio una persona muy agradable y amable la señora Xiomara del salvador"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VlMzSlpWMFZFZUdWb2FVdzNhbU5LZWxaUlRtYxAB",
            "text": "Loved the customer service here. The food was amazing, will definitely come back with my son again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVGRYRkhVR1kyVXpSUFNHWk1ibEZrZWxsU1JHYxAB",
            "text": "Ambar was friendly, speedy and polite. Food was served hot and prompt. Music was diverse and set a great tone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUWQyZDBUVTg1TWxWWGEyRTJRMjh5YkhkM01uYxAB",
            "text": "Just waited 40 mins for a to-go order, and it’s the wrong food. Smt"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaFRGcDBYMkY0VEZnemFEbEtlRjh5Y3pVeFdWRRAB",
            "text": "We were told the credit card machine was down, when it came time to pay!!\n\nSmH"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUGVYbFpiREpUZFhkdGFYRkZOM1ZLY0ZWbWJXYxAB",
            "text": "Great and fast service and the food was good, definitely a great stop if your looking for a nice affordable breakfast"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSWJUQlVRVmswZGt4R1pIZGlWbk4xYkdORGNrRRAB",
            "text": "It was calm quiet waiter was on point with our food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NelN5MHRVVkp3TmtKVGVYcHNSVEZhY1haNFdXYxAB",
            "text": "Very good place for breakfast lunch and dinner"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOXZpSjBRRRAB",
            "text": "A Wonderful Experience at IHOP Kingsbridge\n\nAs a Hispanic individual who grew up in Harlem, the IHOP in Kingsbridge holds a special place in my heart. It was the only IHOP my parents trusted, and we used to make the long journey from 110th 7th Ave to have Sunday breakfast with my siblings. Now as an adult with my own children, I still seek out IHOP locations for great experiences.\n\nRecently, I revisited the IHOP in Kingsbridge with my family, feeling a bit skeptical due to a past negative experience. However, this time around, everything was exceptional. We found parking easily on a busy Sunday, and were seated promptly. Our server provided fantastic service, being attentive and courteous throughout our meal. It was a stark contrast to my previous visit, and I was truly impressed.\n\nOverall, our visit to IHOP Kingsbridge was wonderful, and I'm delighted to have had such a positive experience with my family. I highly recommend this location for a delightful dining experience."
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFRIUmplWHBSU2paRlVGQm1TbnAzWDNKU2MxRRAB",
            "text": "可"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFlWTlFkVTl6WWxGUWVXaDZPRWt3Y25SUU1rRRAB",
            "text": "Good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQmFsQXpUMlZ6YldjeGVsSnhlalJEYTJoNGNIYxAB",
            "text": "Franky was such a great server!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV1dYZzBVV0pRZW1Wb01XRlNTVGxxZFVsVlIyYxAB",
            "text": "Our experience at this restaurant was ruined by the terrible service we received from our server, Nilo. From the very beginning, everything felt rushed. He offered coffee the moment we sat down, but there was no warmth or welcome just a clear sense that he wanted to move things along as quickly as possible.\n\nThroughout our visit, Nilo never made eye contact, didn’t check on us, and completely forgot our drinks which another server had to bring out. We had to flag him down just to get napkins, and it was obvious he wasn’t interested in providing even the most basic customer service. He spent most of his time running around putting in orders and printing receipts, not paying attention to the people actually sitting at his tables.\n\nThe worst part? As I walked past the bathroom, I overheard Nilo complaining out loud that customers are “just asking and asking.” Once he noticed I heard him, he immediately stopped talking. That moment made it very clear: he doesn’t like his job, and he has no interest in serving customers with any level of care or professionalism.\n\nAnd despite all this, he still had the nerve to ask for a tip. I’m someone who always tips for good service but this felt completely undeserved. We didn’t feel welcomed, we didn’t feel valued, and frankly, we felt like an inconvenience.\n\nI hope management seriously reconsiders who they allow to represent their restaurant. This kind of attitude and behavior drives customers away."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNWFVRkxkMGRpV1dsbGQyNWZOblJrTXpWNmVsRRAB",
            "text": "Steak omelet with fluffy pancakes 🥞  delish\nIhop might just have the best pancakes around.\nService is very upbeat and attentive... dumbs up"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Nek4ySTJXVGRZTjNkWVFVSm5XVXR0WkV3NWRFRRAB",
            "text": "My experience at the IHOP was lovely and quiet.... It was for my special needs daughter birthday weekend turned 3yrs old so wanted it to be calm and special birthday 🎂... I enjoyed the singing Happy Birthday and greatly appreciated always and the IHOP choices to eat is the 💣 bombs and we'll put together ☺️☺️☺️☺️☺️☺️☺️🥲🤤🤤🎉🎉🎉💗💗💗"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMGRYbzFNekJMVDI1Rk5qQmtjWFV6YkVac2JYYxAB",
            "text": "Clean facility and quick service , our server Sharmane was wonderful hard working and kind ! Highly recommended location !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KV1ExTjRSbHBSVW1rdFlUaFhVWEkwZDJKRGJuYxAB",
            "text": "Long wait to sit and order.  Service is terrible and wait is ridiculous 🙄"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU2RuTTNMVmhWTTFkZlZ6aEpNMlJMU25veE0yYxAB",
            "text": "Muy bueno y lo recomiendo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc1JFUkZUMlpZWlc0d1FsVlRiSGh1TTJFMlpHYxAB",
            "text": "I ordered my food to go. My pancakes were fluffy and tasted good, but the rest was just mediocre and they didn't pack the vanilla sauce that went with my Tres Leches pancakes. In fact, I didn't like that I had to dress my own pancakes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQbl80dC0ycDhxd3Z3RRAB",
            "text": "The Ihop on Broadway is great place to go but when they get over packed and the workers that take reservations takes names and tell people the wait time they need to be more respectful to the customers. They tell you a time but when it's time for your name to be called they will get upset because they pass over your name and then tell you that they called you when they no they didnt. because they are so many people waiting to be seated. It becomes very overwhelming understandable but understand where you went wrong and correct it don't lash out when it was your mistake."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMFprTllRVnBEZVZWaVZrSnBNWEZEYkU5WGQwRRAB",
            "text": "It is what is\nNice overall, missing some healthier options\nAll in all nice VFM and pricing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKRE95ZFN3bWEtdzFBRRAB",
            "text": "Place smells dirty, food not the same as it used to be"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMLS1udmo0ZzlTaEdnEAE",
            "text": "We come here from time to time. Today we came with our adult son for brunch. We had the poblano omelette, the steak and eggs and the pancake and eggs special.. We loved them all. Delicious! The service was excellent. Our waitress, Natasha, was friendly, helpful, and knowledgeable. We made changesand additions to our meals and she was gracious and accommodating. The coffee was endless. Though the place is always busy, we were seated right away.  There is also free parking. I highly recommend it. ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNckpwclhyNHJlSnRBRRAB",
            "text": "Classic comfort food, quick service, and affordable prices. Great spot for a casual breakfast or late-night pancakes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNR3pnS212X3VMQXFBRRAB",
            "text": "Well its under new management and you can see its not the same, took my husband for his birthday and they sang one birthday song for two different parties🙄 in top of that I get charge for the icecream they brought out .. omg not a great experience, but food & service was ok👍🏻"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLblFxTlRBM3VfejdBRRAB",
            "text": "I've been coming to this IHOP for many years more than the other IHOP restaurants around New York this one is by far the best version that cooks the best food they feel always fresh and delicious most people that work there are surprisingly super friendly however there are times you will encounter at least one worker with a rude attitude like I understand working in a restaurant can be mentally draining but please don't be rude to your customers I suggest the IHOP manager of this establishment train their workers to be friendly with no rude attitude other than that I will come back to this IHOP again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQaTdtb0REMEstUTdRRRAB",
            "text": "They expanded this location! The waitress was a stern and didn't allow my son to get what he normally gets. Had to order an extra dish to make to work for him. But I had plenty of pancakes coins to pay for it. We've been here so many times before we moved, so we are glad they expanded the space. It can get long waiting for a table around holidays or Sundays"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKajZxLWZxbmR5NlV3EAE",
            "text": "Excellent staff and very helpful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJT3F0OVB3OXJEZ3dnRRAB",
            "text": "This place is never empty. Sometimes there’s a wait to be seated. Otherwise food comes out pretty quick and the staff is cool."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV3ZtdEN1MjlhYkNREAE",
            "text": "Food was excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT19tdlRfNEtxbU13EAE",
            "text": "You can't go wrong at IHOP for breakfast! Ask for waiter Juan!👌🏾"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJMmV2Yy0xMl8teGtBRRAB",
            "text": "I was in the area and remembered this location. When I entered, it looked like it was being renovated. The foyer had two doors, one for take out,  the other for dining.\nThe dining area was completely empty and looked nothing like an IHOP.. Even worse, a blue tarp covering what should be a ceiling.\nA young lady tapped on the window next to me, and I gestured I wanted to eat. But after waiting for five minutes, with no one coming out, I just walked out having wasted my time.\nYou would think for a breakfast place that opens at 7:00 am, there would be people there after 9:00 am."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZWJnUHlDMWEzSnJnRRAB",
            "text": "Food was really good but the waiter rushing me to order I get you got a job but still going to ask for a tip after ...the kitchen need a tip jar"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcklqMXdBRRAB",
            "text": "ㅎㅎ 이렇게 구질구질한 아이홉은 첨인데 애들이 너무 쉐이크가 맛있었데요. 음식도 많지않았어요. 보통 아이홉 늘 음식이 너무 많이 나오는데 여긴 딱 먹을만큼 줘요.\n친절은 했어요. 별을 3점준건 그저 장소가 별로여서"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OE9lNkJ3EAE",
            "text": "This place is very cramped. Like there is very little room between you and other patrons. My pancakes were good but not fluffy enough for me. Otherwise a great experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyemRuOU9nEAE",
            "text": "When I was younger, this was one of the only ihops in the city. This was waaay back … when the establishment only hired female waiters. I came here just yesterday with my family and was happy to see that most of the place hasn’t changed.\n\nThe updates to the place are minimal but it still has a vintage feel. Unfortunately, the service wasn’t too great. To offset it, the food was good quality. I would come back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMzRTUXlBRRAB",
            "text": "I got the chicken fajitas omelette and one of their breakfast crepes! Absolutely worth every dollar & I was very satisfied with both the food & customer service. Staff was very welcoming but it does get very busy at this location."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNjQzcTlBRRAB",
            "text": "Lo pero de lo peor , el servicio es malo malo malo , los meseros  no está coordinadas , no saben ni que hacer , está sucio , noooooo lo recomiendo , el encargado solo estaba ocupado en sus cosas , no pone atención a las personas que llegan , el joven que nos buscó mesa era el que lava los platos , muy mal servicio . Tardamos 39 mm para q nos pidieran la orden , esperamos 10 minutos para q nos buscaran mesa , es de lo peor"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadnRmOHVBRRAB",
            "text": "I haven't been here in such a long time, and the inside looks absolutely terrible. And the coffee was old tasting, as my mother-in-law said. It tasted like a double brew and that wasn't nice at all. The crepes weren't good at all, not thin like at all. The turkey sausage wasn't good either. IHOP at this particular location was horrible. And the service was not nice at all either. I won't be back here again that's for sure. This location used to be great , not anymore."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncmNDN2dRRRAB",
            "text": "The staff is friendly food comes out pretty fast one the cleaner ones in the BX..."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcDZibWxnRRAB",
            "text": "Visited while looking for a place where we could have pancakes that wasnt too far and that had parking available... Ordered\n\n- the sample breakfast, which had two pancakes, two bacon stripes, two pieces of ham, two sausages, two scrambled eggs and hasbrown\n\n- the 2x2x2, which had two pancakes, two bacon stripes and two scrambled eggs\n\n- one apple juice and one hot chocolate\n\nWe think the concept of the place is pretty cool and offers a wide variety of breakfast options\n\nThe food was alright - better than I expected honestly 🤣 the pancakes weren't really my favorites - I prefer the ones my husband and I make at home.\n\nThe hot chocolate was alright... - a very fair amount! I did not love the fact that my cup looked a little bit dirty on the outside, that it was very watery and that it didnt look very appealing without the cream on top - but it just tasted sort of alright 🤷🏻‍♀️\n\nOur server was pretty good, she was very friendly and very quick - she kept visiting our table to assist us with drinks right on time, taking dirty plates as soon as done with them, helping us with the check etc - she was pretty nice 👍🏻\n\nWe paid a total of USD$39 + 18% tip - which was like USD$46 dollars... I dont find the total to be really that reasonable for what we had: pancakes and eggs...? maybe it makes more sense because of the quantity of food put on your plate..? My conclusion about the total paid is confusing... even to me! 😂 I believe the amount paid to have breakfast in any other small restaurant would be fairly similar - I just feel like we paid almost 50 bucks to have breakfast at Mcdonalds 🤣\n\nBut anyways - happy to have tried IHOP and to have enjoyed an American Breakfast experience!\n\nI don't think I would return to one for breakfasf though, maybe I could give their lunch or dinner menu a try - but I dont really feel like I have a reason to go back for breakfast!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN3AtY213RRAB",
            "text": "The service here is some of the best we have had in NYC. Protein pancakes are super tasty and filling. It’s a strange little set up but overall a great experience. Car park available if you drive. Free coffee or soft drink refills is a bonus."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdDlYUDh3RRAB",
            "text": "Samantha was great! Thank you for making me feel welcome. I told her I'm from Delaware and our IHOP NEVER gave us portions like this I barely was able to eat it all. Samantha that you fir making me feel welcome in NYC."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOTRleU5nEAE",
            "text": "Super popular IHOP with a longish wait time, but it's well worth the wait. There is an amazing array of pancakes and crepes to choose from, and the staff is always friendly and polite."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNzc3WjJRRRAB",
            "text": "This IHOP is notoriously crowded. We waited for 25 mins for a seat, but it was worth the wait. The waiter was very nice and prompt. He would occasionally come and check in on us without being intrusive. Besides the wait, this is a good place to eat. But, please don't go there, I don't want my wait to be longer than it has to."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNHJfdTBnRRAB",
            "text": "A Breakfast Lover’s Paradise – IHOP Delivers Every Time!\n\nIHOP is hands down one of the best places to satisfy a breakfast craving, no matter the time of day! Whether it’s an early morning start, a lazy brunch, or a late-night pancake fix, IHOP never disappoints.\n\nThe menu is packed with a variety of delicious options. Their signature pancakes are always fluffy and flavorful, with just the right amount of sweetness. The stuffed French toast is a must-try, and their omelets are loaded with fresh ingredients and cooked to perfection. If you’re more into savory options, the country-fried steak, burgers, and loaded hash browns are just as satisfying.\n\nOne of the things I love most about IHOP is the welcoming atmosphere. The staff is always friendly, accommodating, and quick to refill coffee cups with a smile. Even during busy hours, the service remains efficient, and the wait times are reasonable.\n\nThe restaurant itself is clean and cozy, making it a great place for a family breakfast, a casual date, or a solo meal when you just want some good comfort food. Plus, the prices are very reasonable for the generous portions you get.\n\nIf you’re looking for a place where you can enjoy a delicious breakfast at any time of the day, IHOP is the perfect spot. Highly recommend their seasonal specials too—they always bring something new and exciting to the table! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcF9tTnZRRRAB",
            "text": "The food is excellent, the place is spotlessly clean, great atmosphere; and the staff is very accommodating.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMTl6c05REAE",
            "text": "Quick and great customer service, fresh food. Only come to this place during the weekdays. On the weekends is a long waiting time."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRd05taFB3EAE",
            "text": "I ordered crepes with meat, mushrooms and cheese. The meat did not taste like real meat. It was tough, dry and with an odd chew to it. It was very bad and extremely oily. It had maybe only 2 mushrooms and the  crepe itself was not fresh. It…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydlppbXB3RRAB",
            "text": "Came here on a very Hot Beautiful Day with a very Positive Vibe on my Day Off, only to just be served with a Negative Attitude Waitress name Frankie. After taking out order. He noticed I didn’t appreciate his attitude. I guess killing them…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNkp5eGJ3EAE",
            "text": "Asked for mashed potatoes. I mean I know they use instant, but it seems like they can't mix water and powder properly. Its so soupy, I almost need a spoon. Nothing is seasoned. And they have tiny salt and pepper packets. $16 for a small amount of shaved turkey, mashed potato soup and decently steamed broccoli, even though one big piece is clearly starting to turn. I'm just hungry enough and I'll finish my plate because I already sent it back once. This reminded me why I stopped going to IHOP in the first place and started cooking more at home. At least the server was nice. That's the only reason its at 2 stars."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aUo3TWhnRRAB",
            "text": "Server was very nice.  Food was very cold and so was the restaurant. Thankfully we ordered hot chocolate. We weren't happy at all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdjhUWU9REAE",
            "text": "Great breakfast experience but service staff not too personal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cy1tcnVBRRAB",
            "text": "This is one of my favorite locations to visit. Be prepared for a wait to be seated, since this is a popular location. The food is great and our favorite waiter Frankie ALWAYS makes sure your food comes correctly and hot. When you visit ask for Frankie. If he's not available, ask for Renny. You won't be disappointed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdlB1eGdBRRAB",
            "text": "This place was too small for my liking. I was with 3 other people & we were sat in one of those booths. The 4 of us could barely squeeze into the booth. The service was great though, but the food could have been better. All in all I would eat here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkLU9udTJRRRAB",
            "text": "Great and quiet  place for breakfast Monday to Thursday, but at the weekends, it's crowded and noisy. food is flavorful."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKd1luem53RRAB",
            "text": "Omelette was made well (not overcooked & not undercooked), waffle was made well, french toast was made well, eggs w/ bacon & hash browns was made well, chicken tender was dry and overcooked."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhZ29ybU9nEAE",
            "text": "I wanted a good breakfast, but had little time.  The staff helped.  Got me in and out with great service. The food was good too!"
        }
    ],
    "reviews_count": 74
}