{
    "name": "Bronx Alehouse",
    "place_id": "ChIJ55NROaPzwokRN3XI3TLJty4",
    "grid": "BX8",
    "address": "216 W 238th St, Bronx, NY 10463, USA",
    "rating": 4.5,
    "user_ratings_total": 2510,
    "phone_number": "(718) 601-0204",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRlowaHJlVjkzVTBsWE5IaFVVRzB3WlVrM1dYYxAB",
            "text": "The music, the great food and the delicious drinks are definitely a vibe. You must go!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWFRFTjBVV3h2YUhkSGExOVlPRU5XUVVOM1ZWRRAB",
            "text": "Alehouse is a great spot! Their wings are really good, and the mac and cheese is definitely worth trying. They have a solid selection of beers and cocktails, and the service is always friendly and attentive. I also like that they have darts — it adds a fun touch to the atmosphere. Overall, a great place to hang out, grab some food, and enjoy a drink!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1VrTndiakF4ZFhKR1drMW9ObXhGWldwZmJVRRAB",
            "text": "We loved the experience here! The drinks were delicious and the service was very nice.\n​However, a persistent issue is the availability of their cocktail menu. This is the third time I've visited and found that several drinks weren't available. They boast a menu with excellent variety, but the actual availability is inconsistent.\n​The food is quite good, but grouping it with the wavering drink availability brings my overall rating down"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMU5UWm5kRWRqU0RWWExURmxNRmRJUW5wQ2FGRRAB",
            "text": "I had a very disappointing experience at this establishment due to the service I received from my waitress. I specifically ordered a Don Julio Reposado tequila shot, but instead she served me El Tesoro without mentioning the switch. I immediately recognized that it wasn’t what I ordered. This felt dishonest, as if she was trying to pass off a cheaper tequila for the premium one I asked and was willing to pay for.\n\nWhen a customer orders something by name—especially a high-end spirit—there should be full transparency and respect for that order. Being served something different without acknowledgment is unacceptable and comes across as a scam. It’s unfair to the customer and damages trust in the restaurant.\n\nI enjoy dining out and don’t mind paying for quality, but I expect honesty and accuracy. This experience left a very bad impression.\n\nHi, I can confirm this is the correct location — 216 W 238th St, Bronx, NY. I have the receipt from my visit, and I can also provide the names of the female waiter, the male waiter, and the bartender I reported the incident to. So there’s no mistake about the establishment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMmVXZFpVSEZHVm1GUWRuRkNjRUZ3ZWxWclRWRRAB",
            "text": "I love their happy hour that starts at noon as well as their beer selection but allow me to say this about their outside seating service: it is dam near nonexistent except for a tall beautiful black woman from a few months back and a young man named  Norie who served me last week. These two people were the ONLY ones that were attentive to me in all the times I sat outside to drink. I was actually surprised how much Norie checked in with me, because aside from him and the aforementioned, I was often treated as an afterthought. Very often i would even go inside to the bar myself to get my own refills!\nAgain, they have a fabulous happy hour and i do like the out of the way  location with my bus stop across the street. The food is decent if a little overpriced for bar food but at least its not as bad as The Bronx Public. Again, if you sit outside then hopefully your assigned server is Norie!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUVpYVk1iVFEzWkVOemRXUndPVVJLYlhnMWJFRRAB",
            "text": "Stopped in for dinner after spending the day at the Bronx Zoo. Ordered sandwiches and truffle fries. All were delicious!! Servers were kind and attentive.  Only downside was finding parking."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kb09VdFRja2xzYUY5U1VWRkhYM2RhTjJRNVJXYxAB",
            "text": "Finas atenciones"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWWNHOUVVWEZ3ZDBWUVZIbDNZVWxaYjNsMWJHYxAB",
            "text": "Nicole was amazing, her personality and energy made it super easy to get along with. The food was great, I big backed and crawled home 😂"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nd05rNWFaR050U2tNMVNFSnJYekJXZW1KWFJHYxAB",
            "text": "Had the server Nicole V & she was absolutely incredible. She was so friendly. Very quick and efficient. So sweet"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa05rbFdURkphUlVwMmFWQkJNRE5LWWtKQ1MwRRAB",
            "text": "I have to say hands the level of service was superb along with my burger! The guard was friendly and willing to bring out a menu. All the staff was on point from water with lemon to napkins. It was very busy as well so kudos to the team. My burger was delicious very juicy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMlowTk9RMDkwTWpaaGNtOUtYMGR5ZG5kWFVsRRAB",
            "text": "I read somewhere this place was dog friendly.  I went, service was great, even gave my dog a water bowl.  Invited some friends to show them a second time, everything was fine.  3rd time I was told only outside.  Looked at the prices and thought it was too expensive to not be comfortable.   Good spot, just need to remove themselves from the dog friendly listings.  Really wanted those wings."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM2NVZG9VbXd5TFcxSWJsWldWV1JPU0ZkdE0xRRAB",
            "text": "Came in and just stood waiting for over ten minutes. Didn’t even bother with me. Just stood on the right side of the bar mingling"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WllVeFpNVGxNWkZkMFRXeHVaa2xoVVVZM2JHYxAB",
            "text": "Place seemed cool but the service was bad. Walked in and placed a to-go order. Was told to sit by the bar til my food was ready.  It was only about 4 other people in there when I got there.  After waiting for 35-40 mins, I went to ask the lady who took my order about the food.   Turned out it was ready for a while and had been bagged up and just sitting in the back for a while.   I was given food that anyone would consider cold.   Waste of time and money."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21walYyMW5RVE5QVlhWSE1saGxMVll0YVdwVWMzYxAB",
            "text": "Excelente lugar para compartir y tomarse cervezas artesanales y propias del lugar. Totalmente recomendable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjelR6TnlXbEIwWkVWRlpUTnRXRjlIWkZoNk0zYxAB",
            "text": "Service was great until I got home and realized they forgot part of my order. Drive back and thru gave me melted ice cream which leaked all over the bag and ruined my food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWFIxQk5XbEZUYzBoSmNGbENUMHhsVUZkRWRIYxAB",
            "text": "Great service but the food wasn't that good. I still would recommend this place though."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xelNsUjNkVkpKYjFsSFdtNUlTbEZNVld0UVFuYxAB",
            "text": "Good service and good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcFQyOUtVek5wT0daV2RUbFZXbUZwWVdWeVJtYxAB",
            "text": "I love this bar. The wings are great, but the chicken sliders are my fave! The French fries are a must! They have a lot of beers on draft, if that’s what you are into. But also make a tasty old fashion! The staff is friendly. This place never disappoints."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbVEwTnFlR1p6VG1WeFJIQm9hMmhaTVZKNlEzYxAB",
            "text": "Excelente lugar! Y la atención atención muy buena! Te da a probar de las cervezas artesanales!!! Lo recomiendo"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNTdhUU9nEAE",
            "text": "Came here on a Tuesday, it was trivia night which was kind of dope. Me and the wife enjoyed 20 wings! (Honey Sriracha, pineapple teriyaki, candied sweet chili and mango habanero). Double cooked, traditional! They were all on point!!! Had a order of Mac and cheese with brisket in it! Perfect! The waiter, Owen! Shout to the homie for holding us down with everything. Including the drinks. I'll definitely be pulling back up soon."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQk0yZGxhRUZhVFhFMlJVRnpURTFrZVRReVUzYxAB",
            "text": "Great beer selection and bartender"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMVFWOVFXRjlCZUZWcGRVVTNjREZTUlU4d01VRRAB",
            "text": "Terrific happy hour. Lovely and service-oriented staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaU9DMXhMVE40Y21OU1MyaG5UVWxLU1ZkTFNsRRAB",
            "text": "Warm, comfortable and welcoming.  Brunch is excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTGVERkpZMjh4UjBFeFJGRmlOemxHUVhCVlJFRRAB",
            "text": "The service was lacking and rude. Got approached about 6 times by workers they looked like they wanted me and my friend to leave. I was still drinking. I got annoyed with their behavior and didn't order any more drinks. They took long to bring utensils and water. My alcoholic beverage tasted like syrup. The food was mid. The flavors used on the dish were off. The only thing that saved the dish I ordered was the corn bread on the side. Then our waiter asked us to leave claiming there were people waiting for a table. Mind you there were many tables available. There were people who weren't eating or drinking sitting on tables. We were cordial and still tipped decent despite the bad service and mediocre food. I would not be going back to this bar/restaurant. There are plenty of places that have proper etiquette and much better food and drinks. 👎🏽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdU1rVm9aRjlYT1hGVWNVMTNiVXREY1hCNVRWRRAB",
            "text": "My go to place for a dozen or so lemon pepper wings."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cGNxbEhBEAE",
            "text": "The large craft beer selection, the food and crowd."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbFlsbExZVVZFYjB0ek4zaHFZbU5zV2psVmRtYxAB",
            "text": "This Bronx pub surprised us!\n\nMe and my friend were looking for something different from the usual fast-foods you can see in The Bronx and with a focused research we encountered this place. How could we know it was THIS good??\n\nStarting from the atmosphere on the inside you feel like at home, on the road and in the subway. What's better?\n\nWe ordered an appetizer: buffalo wings with two different sauces and some kind of potatoes you can find at ALDI too (but that's the only not good thing about it).\n\nWe then ordered two hamburgers and they were not great... they were excellent! Never ever had something as good as that. A solid orgasm.\n\nGo there, thank me later."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWlRVcFhXSEJuTUV4eFZtcEtkVTFrZGt4WlMxRRAB",
            "text": "Food was great and loved the beer selection. They should offer a flight."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oemJIQXhTVXR5TlUxUldWOXphaTF2Y1ZORE1FRRAB",
            "text": "Service was incredibly awful, server would take decades to come by (with venue being at 30%, if that). When ordering he was unhelpful in notifying what beers were available (seems they were out of 90% inventory, but did not care to mention it upfront?). Needless to say, not worth the visit, take your support to next best brewery for a better service and atmosphere!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odFYxWTNUR05UY1VKa09EWkZZM2RNWTJac1JuYxAB",
            "text": "Fish tacos 🌮 was best!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMFVHdGFhMGx5U0hOaE16RnJlRzl6TW05aGRXYxAB",
            "text": "Went for the happy hour initially but I was really hungry so it wasn’t really worth it for me to do the small bites. I got the Thai chili and mango habanero wings. They were cooked well and I liked the flavors I had. The truffle parm fries were fresh and very well seasoned.\n\nI had the pink lemonade sour beer, the taste was great. They offered me a sample first to try. While the taste was great the beer was lukewarm so I recommend asking for a chilled glass. Wayyy better.\n\nThey also have a beer club that’s free which I thought was cool, special deals on Wednesday for members.\n\nI put 4 stars for the atmosphere because it was really hot in there since there was no A/C."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQmVUZEVOakZQVFVWTE1tYzFVbWQ2YVVWbWEwRRAB",
            "text": "Always good food and drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkb1dWRnhialpRUzJaa1JHTXdSMncwVG5WTWJVRRAB",
            "text": "Over all experience was good, I was invited as a guest in a group of course. However, I will go again this weekend and I will update my review."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSU1sTlZXazEzTkMwMlZESTVUR2hKUWpGcVlWRRAB",
            "text": "Food is good for the most part. Was told I couldn’t sample certain beers because “the abv was too high” which is a new policy the owners might want to reevaluate. Part of the draw is being able to sample a beer before committing to one."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFYxUnRZMUp5VjAxc1pFUlVhMWRIYlVwemMwRRAB",
            "text": "The most aggressive waitress i ever seen she keeps shouting and rushing to make orders also there is other waitress was nice but i am talking  the lady mid 40’s i guess which was serving  our table with my date she was so annoying i really regret leaving tips. Other wise i like the place and vibes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbFZGUnljamN5UVVOMmFsWXlhVk5oVW5jMmNFRRAB",
            "text": "That jerk chicken bowl was so good! I would go back just to have that dish. Great atmosphere in here and service is awesome"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQ0V1dHJVeUwzY2dnRRAB",
            "text": "People like me wouldn't exist in this industry if it wasn't for BXA, period. If you work here, you have an important responsibility to always represent this space as best as you can through beer suggestions & great service. I'm glad it's been standing for well over a decade."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwX01Ud1JBEAE",
            "text": "Mango habanero wings are to die for. Great beer selection."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NUpfR1dREAE",
            "text": "I have been coming here for many years even before the pandemic and it never disappoints. The food and the service are great! If I could change one minor thing it would be the music. But I get it, it’s a bar so they play a little of everything. Their wings are delicious. My favorite are the mild buffalo, bone in. They also have a large selection of beers. If you’re not a big beer drinker I suggest the blueberry moonshine lemonade, so tasty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aWEyZjN3RRAB",
            "text": "Great food and super friendly staff. They clearly maintain good safety protocols (over and above what I've seen in other restaurants).  I had the grilled chicken wrap with fries. It was delicious. The flavors hit you at different times. From when you first taste it, when you chew and when you finish. It's been a while since I've had a rating experience like that. Well done!\n\nThe drink is their homemade apple cider with some rum (because, why not?). Normally, this is a cold weather drink but my server suggested that she ice it up for me.\n\nThis is great service, since I would have assumed it was cold on a warm day like today.\n\nOverall, a great experience!  Definitely on my list of places i need to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eWItVGp3RRAB",
            "text": "Good sports bar type vibe.  Plenty of beers on tap.  Burgers are very good.  We sat at the bar and didn't have to wait on anything.\n\nFood was tasty, drinks cold.  If you're in the area and hunting, give this one a visit.  Good local place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdTlUX0lBEAE",
            "text": "We first started with the fried Mac and cheese. Delicious, it was cheesy crunch and taste amazing definitely a must try. Then we ordered the turkey chiptole burger. It was great my boyfriend and I Loved it as well. It was juicy and it tasted so good. The truffle fries and the sweet potato fries was good and crunchy definitely good fries. The dessert was churros and ice cream. The churros were crunchy and the ice cream was well paired with the churros. The servers were nice and friendly. Overall great place to eat and enjoy."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpajVXWmFnEAE",
            "text": "Update: I used to love this bar but somehow, it's not the same as when I used to go. Food is good but the drinks are not great. Maybe it was a bad day for them but my margarita was one of the worst I've had. Service went down as well. It's unfortunate but maybe it will be better in a different visit if we go back.\n\n2021: This is such a great bar with good food and awesome service. Nice place to go in the Bronx if you want good bar food and a tight selection of specialty beer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwM1lHNjBBRRAB",
            "text": "Good tap beer sports bar for the area.  The menu covers essential bar food and a good selection of burgers and sandwiches.   The place is spacious and good for a large crowd.  Many TVs were on for different games.   The food is good with decent portions.   Good place to return after work!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNnNlNnVnRRAB",
            "text": "Attentive and kind, paired with yummy food and great happy hour prices! Was not too crowded which was a plus as we were having lunch after work. Thank you will be back again! Additionally had several options in preparing the food ex. Types of cheese, the way onions were prepared, meat careless. It doesn't sound like much but other places tend to get annoyed with request of customization. Also Blake's Cider Triple Jam was delicious, and I normally only drink margaritas 😊"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlM2FLcUJBEAE",
            "text": "The location was great, clean location and friendly staff. It was a beautiful day to take my family out to lunch. The food was delicious I myself thought as well as my family. They have outside sitting and indoors as well. We took the table with the open window which was the perfect weather to enjoy both elements. The only reason I am giving them a 4 Star's ⭐⭐⭐⭐ instead of five is because We ordered appetizers to be served before we received our meal but they gave it during our meal which beats the purpose of being an appetizer and the other thing was we ordered mayonnaise which in most cases you would think restaurants would just send it to you but at this one they charge this. $0.50 per container cup which we found kinda odd. But overall our experience was great!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcmVuZUhBEAE",
            "text": "Food is very good so is the service. We started with the wonton nachos with pulled pork. The pulled pork was very good, I would have preferred chips or homemade potato  chips instead of the wonton chips.\n\nWe had the maple bacon bourbon  boneless wings and they were very good, the smell of the wings made your mouth water. Personally a little more bacon bits would have been great.\n\nMy wife had the Thai chili wings which she always enjoys"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N2UzdllBEAE",
            "text": "I came here with my local friends, who really recommend this place. Amazing place with friendly atmosphere)\nNice interior. Really good prices!\nDelicious beer and chicken wings!\nYou can ask for small samples to try the beer before ordering.\nPolite stuff.\nIt's clean there)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXZESzdRRRAB",
            "text": "For the price, this place doesn't have good food we wanted wings and regretted not going to Buffalo Wild Wings next door, because we were also craving Mac and Cheese and unfortunately we were disappointed. We ordered the Philly Cheesesteak egg rolls and it is definitely not steak the sauce was the only good thing about this dish, then came the mac and cheese im really bad when it comes to complaining about food at the restaurant so I simply asked for some pepper to add the flavor and it didnt help it at all the breadcrumbs was too much nothing had flavor then came the wings - honestly frozen wings from costco are way better and not only that the wings were fresh off the chicken because it still had feathers on it we always finish our food honestly and this was the first time we didnt finish something. Only good thing here is the beer selection but even the temperature was off super warm glasses of beers. I give this place 3/10 and it is because our server was nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcFBDREhBEAE",
            "text": "Had a wonderful pulled pork sandwich; soft, savory, sweet. Friendly service, and a lovely drink. French fries were a bit soggy. The fried Mac and Cheese isn't what I was expecting-- drier, needed some salt. I really wish they had a dessert…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXXzd6UmZ3EAE",
            "text": "Great sports bar with the usual drinks and vibes. Popular spot. Inside & outside dining available. Very spacious. There's happy hour which is 2-4.  Brunch is until 3 only on Saturday and Sundays.  Nice place with great service.  Enjoyed my Sliders here.  Definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeGNTVXp3RRAB",
            "text": "What a great place to stop when cycling into the city on the Empire State Trail. It took a while to get served, but there was a nice beer selection. A classic Dave’s Pale Ale paired nicely with the southwestern salad. Nice place to eat and relax after miles of peddling!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMktPeFFREAE",
            "text": "Juicy, well seasoned, fresh tasting and big 1/2 lb cheese burgers (fries included - had the tator tots) with L&T on toasted buns. Onion rings were $2 extra, fresh, crispy and tasty. Lots of seating indoors with two separate rooms away from the bar, each with designated rest rooms plus plenty of outdoor seating as well.. Great atmosphere to watch sports and for beer enthusiasts (great selection and knowledgeable waitresses) or simply just to hang out.\nOnly reason why I'm giving them 4 stars is because it took them a while to attend to us, menus weren't given nor did we have any bar code to scan (I had to go to the bar to get it), they never checked up on us (I would've bought another beer if they did) and I was charged $2 extra for the burgers for some reason."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxd012end3RRAB",
            "text": "Haven't had the chance to sit and eat but if my deliveries can come out perfect the 2 times I have ordered...They have these candied wings that are cook perfectly and the flavor is addictive. My food is always warm when it reaches and packed neat. New spot for sure"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbUtHelhBEAE",
            "text": "Bronx Alehouse is a BX favorite and I always enjoy coming. Today, the service was lacking big time. Their entire staff looks new so I’m not sure if they know what they’re doing. The food was good tho, minus a couple kitchen errors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeU9LVVVBEAE",
            "text": "Good beer nice vibes dope local place. Fun place nice games fun atmosphere. Change there beers often to mix it up it’s a great list.  Also have some local beers I enjoyed my self. Also get the wings"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNS1LQWRBEAE",
            "text": "Regular here but the steak tacos have gotten bad, nothing but fat. Just slimey chunks of fat no edible meat. Waste of my money I cannot eat this . If you guys can fix this please do!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOE5qNmZBEAE",
            "text": "Decent standard American fare, typical bar food but less greasy and sloppy. Travels well and the portions are fair along with the pricing. The fish tacos were a standout, crispy with a sweet salsa; very nice. Cajun fries were a tad spicy and oversalted but if shared they should be fine."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaGFtZmtnRRAB",
            "text": "Used to be a nice place for coworkers to come together for drinks and appetizers after a long week. Went recently and the food came out on time. Our table was a little close to some cars, but with the pandemic we took what we could get. It took a bit for our table to get cleared off, but our server was kind. Will return again some day."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacE11aS1BRRAB",
            "text": "Food and drinks were good. Definitely recommend a good after work spot or just to chill hangout and unwind. They have trivia on Tuesday which was fun. Also the jerk ribs are everything if you can handle some spice lol.  My boyfriend specifically came back here for them and took a order to go."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZlA5YVNzMHFpU0p3EAE",
            "text": "We came here on a Monday after work. It was early so there weren't many people there. The happy hour was until 7, so the prices weren't bad. Our server apologized in advance for any tardies cause he was alone, but we didn't feel it. He was attentive, and our food came fast as well as our drinks."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NGUzcUNnEAE",
            "text": "This sports bar is absolutely incredible for engaging in lively sports discussions.   This place is a personal favorite of mine, thanks to the amazing variety of vegan options they offer.   I'm absolutely loving their mouthwatering vegan wings, not to mention their delectable vegan burgers and \"chikn\" sandwiches, all perfectly complemented by their wide range of vegan condiments.\nDefinitely should try the slamimosas.. yummy\nI do wish they had vegan ranch sauce to go with the wings, but that’s an easy fix BRING YOUR OWN.. lol"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwd2J5T1B3EAE",
            "text": "Came here to try the wings! Although I still don’t understand the double cooked thing they were still good! The sauces were a tad lackluster. The garlic parm fries were to die for! I’m not usually a beer drinker but they had some ciders on tap that I enjoyed. I will come back to try different things the menu has to offer.they also give delicious freshly popped popcorn while you wait for your food.\n\nFoodie IG: alexandra_andco"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOHVYR0lREAE",
            "text": "The location is very convenient with the train and bus at the corner. Close to Van Courtland Park, so if you were there during the day, get a bite and a drink afterward. Very nice staff, nice setup with a combo of bar, stool tables and regular plus outdoor seating. Well planned. The wings are not good. They seemed either cooked way too long or refried, then they arrived cold, literally chilly. Southwest  Salad with Carne Asada was a big but...the Steak was cut into very small pieces (hard to fork them up, it looks better than it was, my camera), I asked for it without tortillas, but there were tortillas, so I guess it's premade then?"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcjRPWDNBRRAB",
            "text": "Cozy little spot close to the subway. Went for brunch.I had the chicken and waffle which was ok. The price is affordable. Service was good, didnt have to wait too long for the food. I was given water and popcorn before the meal. I love the popcorn!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnaXVXTkNBEAE",
            "text": "We got here it was a 20 min wait but we were seated in less which was great. It was all down hill from there it took forever to get the drinks we ordered the cocktails were not good at all better off going draft beer which there are definitely a lot of those I believe maybe 100 different beers. We placed an order for a burger with old bay fries and wings sampler which is 18 wings with a selection of sauces I think 5 or six, so we chose 3 different ones. The food took almost an hour to arrive and the wings were very under cooked the bone and meat were still pink when we bit in, they removed that from the bill and the burger was tasteless I don't know if this was an off day but we won't be coming here again. Our sever was very nice and apologetic I would've  given him a shout out but unfortunately I can't recall his name."
        }
    ],
    "reviews_count": 66
}