{
    "name": "Dale Diner",
    "place_id": "ChIJNR-s5ZbzwokRJCvuqY6hbEk",
    "grid": "BX8",
    "address": "189 W 231st St, Bronx, NY 10463, USA",
    "rating": 4.2,
    "user_ratings_total": 808,
    "phone_number": "(718) 549-4445",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdmRUbHFaVzU2VUY5dmJGWjJRblkzWkZOdlpuYxAB",
            "text": "The best place for mexican food period"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVFFVZzVUR0ZRZDBoaVVsUm1OamRKYkVsVVNIYxAB",
            "text": "The food from this diner is ok, but I’m leaving this review to talk about the service. I was there with two of my friends, we ate and everything and then came time to pay. One of my friends gave her card and the waiter came back and said her card didn’t go through and he tried twice. My other friend gave her card, so the waiter came, took her card, and gave it back with just one receipt without saying anything (usually they give 2-3 for the merchant and customer copy, but we didn’t think much of it). We left the diner and halfway down the block the waiter is stopping us saying that he didn’t charge the card. This was very confusing as all 3 of us saw him take my friend’s card and give it back after he said the first one didn’t go through. We informed him that he did take the card, and he said he never charged it, so what did he do with the card when he took it in the first place?? When we all went back to the diner, he still kept saying he never charged the second card, in which my friend kept saying that we saw him take the card and thought he charged it when he gave it back. I don’t know why he got mad for a mistake he made, and he didn’t even admit he was wrong or try to apologize. As mentioned in the beginning, the food was ok, definitely had stomach problems right after leaving, but be cautious with the servers"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcU1sWlZlVjk0YmxNd1lXVkZhMHBXTWkxNVNVRRAB",
            "text": "Courteous staff and great food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM2EzcFBWbkJNVTI1aFZFNWFSME5aYkdSd1NrRRAB",
            "text": "So friendly!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUmRUZHhTVUpWWTFoNGVEUTJjR1p6VFd4cllsRRAB",
            "text": "We go here once a month for breakfast.  Food is good atmosphere is good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c1puSnhiMWxWU2paT05GUndORVppYTNOWFZtYxAB",
            "text": "Had a good breakfast with my friend. The waitress was so kind and sweet"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BeGJraHhTekp4ZWpKNFZIbDNVSGMzU0ZrdFdIYxAB",
            "text": "Nice diner but because of an unpleasant experience with a waiter there I'll have to leave this review. Don't get upset with me because you placed the order incorrectly."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNXBLTTNRRRAB",
            "text": "Always a nice place to go for a good meal...This place was 24 hours...now it closes at 10pm...nice people working here...always with a smile 👌🏽👌🏽👌🏽"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScVlYUmZRMEkwY2tsR1VFOVVZbVZ5TkY5d2MyYxAB",
            "text": "took a blind date to this spot ((last minute and she lived within the neighborhood))\n\nFood was distasteful. Price were unfair. Atmosphere is not even to be discussed ☠️ very concerning"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJSER3ZWpmcGJqODNnRRAB",
            "text": "Food was good and hot   went  over and above  with  service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJM0htTm5jbk8yTVVBEAE",
            "text": "Awesome!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWNlcDV3RRAB",
            "text": "We were looking for a traditional diner and this was it. Service was great and efficient, food was really good and flavorful as well. I hope this gem stays in the neighborhood because it’s one of the good ones!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMmFxNm1BRRAB",
            "text": "Great food. Great atmosphere.  And the service was spectacular.  I always enjoy dinning here. Thanks guys."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN1oyVkh3EAE",
            "text": "Nice neighborhood diner.\nGood variety of food, taste good, like the environment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMHBfM293RRAB",
            "text": "I have been coming to this diner since I was a kid. The food is yummy. The service is very warm and kind, and the prices are pretty affordable. The burgers are made at your choice of temperature and are juicy and charred. My favorites are the omelettes. The pancakes and belgian waffles are also yummy, you can ask for toppings. Service is fast, it can get very busy sometimes but still well worth the wait. Coming here gives me that feeling of nostalgia."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdUszRjdRRRAB",
            "text": "Not bad!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LVBIRG9BRRAB",
            "text": "It's one of my favorite places for breakfast."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdVBUajhRRRAB",
            "text": "💋💄🤢RED LIPSTICK ON THE RIM of my cup found!!! Always loved coming here, great food. However today ON March 8 2025 at 12:00pm I was given a cup with RED lipstick 💄 on it & I don't wear lipstick ever! To top it off I always use straws because I never drink from the rim of cups & today I saw red lipstick on the rim of the cup, we told the waitress who at first didn't acknowledge the situation, she took the cup & that was it. After I said \" wow i can't believe no apologies\", thats when the waitress said sorry............. please please tell your dishwasher this is unacceptable & nauseating to have this experience & i no longer feel comfortable eating out any longer. Very disappointing, Please do better this is disheartening. DALE DINER was one of my favorite places to eat growing up, I'm sad about this. Amazing food, but disappointed in this happening."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMTc2eDBnRRAB",
            "text": "Splendid service and servings."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eHRqTEZREAE",
            "text": "The service is always great.\nThe food is always delicious. A nice atmosphere. They do not rush you out like some diners do. Very friendly the staff is too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cUxmY253RRAB",
            "text": "They used to be great but now they don’t deliver. Or they say they’re too busy or can’t be bothered. Wouldn’t recommend them for delivery"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN3JIYkVnEAE",
            "text": "Went in here because we were in the UPS store, and we were glad we did. The burger I had was good, and the breakfast my wife had was exactly done how she wanted it. We will definitely be going back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbHQta19nRRAB",
            "text": "Great place to go for breakfast and lunch reasonable pricing ... owner and workers go above and beyond  to make your stay special"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNnFIeU93EAE",
            "text": "The food was good the servers are nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNub09fS3JnRRAB",
            "text": "Wonder service. Been going to this place for over 3 years now. The Server Chris is wonderful. He is like family to every person who walks in. We all appreciate him. Great service and company."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwOGFENVZ3EAE",
            "text": "Excelente servicio lo recomiendo."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQweHZ2ckVnEAE",
            "text": "This diner is very cozy and because its a hidden gem it is a great place to go for a quiet chat with a friend. Staff should get a better tip from patrons that desire this type of unmentioned service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTR2czhBRRAB",
            "text": "When doing my mother landry and this diner is right next door. I decided to go eat breakfast. Love the diner style of the place and service was fast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3c3V1VGN3EAE",
            "text": "I visited this place for the first time with my family last week. It was better than I expected. The place was clean, the food was good and well presented. Prices are reasonable. Friendly service and calm atmosphere.\n\nNo complaints and recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURic2RHQzJRRRAB",
            "text": "Hadn't had an Irish Breakfast in over a decade, but was glad to have had it at Dale! The combination of meats (white & black pudding, sausage link, & sliced ham) was not overwhelming, but a perfect assortment of flavor. It was a nice change of pace to have well-done meat but soft & fluffy eggs & home fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycU1fVmNBEAE",
            "text": "Great and friendly ambience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbE9tUlBREAE",
            "text": "Best diner in the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNktTWkNREAE",
            "text": "French toast was top notch\n@bobby_d_customs"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdDhpdjZnRRAB",
            "text": "The oatmeal I ordered was barely cooked!!! I had to finish there job and cook it fully when I got to work!! The old cooks were so so so much better!!! This place isn't what it use to be!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdjRTY3VnRRAB",
            "text": "The food was good but a little cold ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbjRYaWZnEAE",
            "text": "One of the worst dinners in the Bronx.. bad service terrible food.. sanitation very suspect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX2FLSHpBRRAB",
            "text": "Ordered chicken tenders, one of them was still raw\n\nI would check out goldmine cafe next door instead. They are amazing! I only came here because it was full."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bmIzRm1nRRAB",
            "text": "The place is clean. The waiters is are very nice and welcoming. Bathroom is very clean food is so good. My child loves it and so do I. Very peaceful to grab a bite. It’s not expensive at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cnJqQ1BBEAE",
            "text": "Who ever the waiter was on Saturday March 16th 2024 around 5:30pm was the worse. He ignored me acted like I wasn’t there. Then I saw him in the back DRINKING A BEER!!! while looking at me. It was the worse customer service I’ve ever had. He should not be working there. I did not tip him. Things could have been different. Hire better staff. Food was good can’t complain."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NU1XeXN3RRAB",
            "text": "Food and service is phenomenal. They're very warm and welcoming to children."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkLTZ5NEVREAE",
            "text": "I live in NJ but stopped here while working in the Bronx... Server \"Eric\" is a true gentlemen 👍👍…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbGRfQ1BnEAE",
            "text": "The place was amazing honestly but what I witnessed at this place I wouldn’t bring my dog to eat here … The waiter gave me the wrong meal after I ate out of the plate he took it and gave it to another customer I was very disgusted after witnessing him, give a customer a plate that I ate out of ..: very very unpleased… That’s very unsanitary. I was scared to eat my meal after witnessing that. NOT TO MENTION I ordered a well done steak and got medium rare.. the service was great and very fast"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbHBXX3dBRRAB",
            "text": "Esta bonito el lugar"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaX29pdzBBRRAB",
            "text": "The food is always so good! My family and I love this diner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dVotY2p3RRAB",
            "text": "Very clean and furniture looms new. The seating was very comfortable.  The host greeted you with a big smile and quickly took your order. Great food and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMTl1bDlBRRAB",
            "text": "I’ve been coming here for years the food is great I recommend people to come here I come almost everyday ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaDQ3Y2NnEAE",
            "text": "I go to this diner from time to time. The service is great and the food is delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeG9yNHFBRRAB",
            "text": "Amazing service and excellent food. Waitress was incredibly helpful and knowledgeable about our food selection. Coffee, tea and dessert were delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1dm9UUjJBRRAB",
            "text": "Food was great, staff was very kind, attentive and quick! The prices were very fair and food portions were big. Will be returning for sure!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZaTlyTXpRRRAB",
            "text": "EXPERIENCE was literally amazing. Very great Quality food under low price. Definitely recommend place to go. The staffs are very friendly and helpful. Inside is clean. I believe you wouldn't disappoint by going there. They have variety of foods. You should try once."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdUt6Um5BRRAB",
            "text": "I ordered their beef gyro and chicken quesadilla.   Was sadly disappointed.   The Beef gyro was 3 strips of the commercial frozen strips. Not beef, mixture of mystery meat.  Didn't look, smell or taste like beef.  Should not advertise beef.  The Chicken quesadilla had large chunks of onions and peppers.  Very little chicken.  The quesadilla was very greasy but strangely didn't have a lot of cheese??\n\nThey have indoor dining.   No outdoor dining."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb3ZLNXFBRRAB",
            "text": "This is a regular spot! The food and coffee are usually tasty. Comfort food at its best when you don’t feel like cooking."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbGUtcjlRRRAB",
            "text": "Delicious food, the waiter was very busy but I understand because at that moment was full restaurant and was only him, the counter girl is some rude and she never answer when someone said thanks."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxeE1pV3NRRRAB",
            "text": "It was pretty good. Had a chicken noodle soup as well. Didn't take a picture of that.  I was hoping they had the beef barley which is my favorite soup there.  Still a definite go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaEs2bXF3RRAB",
            "text": "This is a nice place for a quick meal. The prices aren't bad & the food is really good. The only problem I'd have with this place is the portion size of the plate. I ordered a burger & fries. I had to pay extra for adding some grilled onions & I swear I literally got like 10-15 french fries. All & all though service was great & the food came out really quickly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaEx1blNBEAE",
            "text": "I haven't been back in a few years because management was rude and fired my favorite waitress for talking to the customers \"too much\". The menu has broad selections though and the chili is good with the loaded potato. However the a/c is never on for some reason so you may get a bit warm if the kitchen is busy or it's a hotter day outside. Great coffee."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKc3BycXJ3RRAB",
            "text": "This has to be me and my husband's favorite diner in the Bronx!!!! Just go go go!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeXRpZ3BRRRAB",
            "text": "Amazing , very affordable food in a nice restaurant. Waiter was fast and nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OHQzb09BEAE",
            "text": "Ordered online and arrived relatively quickly for delivery during a busy time.\n\nBoth sandwiches (Cheeseburger and a Philly Cheesesteak) were hot and tasted…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWX05QZFN3EAE",
            "text": "Muy bueno el lugar 👍  lo recomiendo\nEl chico que estaba en el mostrador  muy amable muy buen servicio"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLN01LaGRREAE",
            "text": "I live near here and have been here over 10 times!!! U tell me what I think of it!!!!!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNDVmUHF3RRAB",
            "text": "Best dinner in the neighborhood! I'm here like once or twice a week. Good Burgers and Pancakes at reasonable prices."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MzZYSDFnRRAB",
            "text": "The food was amazing, *small portion size, and yet very good. I got the BBQ chicken sandwich and my husband got the honey mustard chicken sandwich both very good. Our qaiter was very friendly and nice, however, the guy behind the counter seem to be less helpful over all to the patrons. I suspect there may have been a language barrier."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLZ2RidF9BRRAB",
            "text": "Update from last review.\nI'm still not going there because of the way they treated me and my son..\nYou sat in the back. And all we could smell was the bathroom. The bathrooms are dirty and smelly with urine on the floor. All the time.. when I ordered my food. Flies are flying all around us. One of them went in one of our drinks.. I want it a new drink. And the waitress told me I have to pay for the first drink with the fly in it. Your nasty to charge me for that drink. This Waitress  has black hair . She is short and looks Latino like me and my son..\nShe was very rude. Telling me my son drank out of it already. Before the fly flew in it. I've been taking him here since he was a child. I'm not going back. It looks clean but try it eating in the back of the restaurant near the bathroom. I've always looked a lot of things about that restaurant but this was the last straw with the flies in my son's drink 🍻"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzM3NXUkFnEAE",
            "text": "My family’s experience here has been always so pleasant. Our favorite waiter is Chris, always so attentive, my 4-year old daughter loves him. Their food is really good and they give you a good amount for the price and I love the Sunday morning specials."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeU5xRkxBEAE",
            "text": "Came here today waited 15 mins for the waitress to greet us, ordered an appetizer for my kids. 10 mins later the waitress took our order after she greeted the table next to us. 20 mins after that the waitress gave the food to the table that came well after us. We waited 10 extra minutes, no appetizers or entrees were served to us. We left.\nNever again. SMH this place gives diners a bad name."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0MkozWkdnEAE",
            "text": "Food is generally good and plentiful, like many diners.  Especially fond of their hickory burger (in \"mere\" 8 oz size or two-meals 12 oz size).  I like their waffle fries too.  Matzo ball soup is not bad.  People are nice as can be and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNM2VULWN3EAE",
            "text": "Better than expected but not amazing food. Service was great, server was very attentive but wouldn't be my first choice. I had the western omelette with side of bacon. The bacon was super super crisy and burnt. It was like eating hard…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1dXNYRHRnRRAB",
            "text": "They won't update the info on the google site and the website is down. I have requested from them to update the info after we took a cab to the diner at 11pm. To find out it was closed. $20 down the drain. They don't care. Nobody could tell me who the new owner is and there was some spanish guy who did not speak english, who was the manager. They put no effort in fixing these things. They lost a long time customer."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cThTeTlBRRAB",
            "text": "Very good customer service,food is great!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMjg2NWl3RRAB",
            "text": "Clean restaurant (for Bronx standards). Service and food is ok."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNjh1TnlBRRAB",
            "text": "I have been dining at Dale's for about 20 yrs now. My experience has always been a pleasant one. The service is welcoming. The wait time for your order is acceptable. The seating area and restrooms are clean. Oh and the food... it could be…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5OF9URENBEAE",
            "text": "I'm a regular that comes here, and their food is always really good. Tried a bunch of stuff on the menu, and personally, I really love the chicken marsala if you wanna treat yourself.\n\nAnother go-to menu item would be their panini's, they're always really yummy. You can always ask for extra condiments other than ketchup as well, such as sour cream, butter, etc. If you come on Tuesdays, please do try their beef barley soup! It's made fresh and served only on Tuesdays and it runs out by the evening because it's their best one. Their chocolate cake is the best dessert other than the apple pie or cheese cake they offer. Their waffle fries is really crispy and good, reminds me of chick-fil-a.\n\nOne of the workers there named Kim is always super accommodating, approachable, fast (!!!) with getting orders out, and sweet to anyone who walks through the door! She's the reason I always come back other than the food.\n\nPrices aren't that bad in general for a diner in a busy shopping district, and overall, the quality is great compared to other diners I've been to. It's a nice spot to get something to eat, it's comfortable."
        }
    ],
    "reviews_count": 73
}