{
    "name": "An Beal Bocht Cafe",
    "place_id": "ChIJxTOdjLvzwokR5HWDbnyl2jw",
    "grid": "BX8",
    "address": "445 W 238th St, Bronx, NY 10463, USA",
    "rating": 4.6,
    "user_ratings_total": 659,
    "phone_number": "(718) 884-7127",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMVIzSmZXWFZIWVhwQlNqQnhVbmRrU0Vwa2VtYxAB",
            "text": "This is a Jewel in Riverdale.\nTiny but great. I had the Bangers & Mash when I was there.  The serving size was good for an early meal but the price was a little steep.  However my overall experience was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabWRXaFpRblZpTlhOd1kzUlJWSFJ1UnpCNFVuYxAB",
            "text": "Great Fish and chips!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUmIwNXJRMWQxV2tScU1WSlpUWEEzZVhsa2FVRRAB",
            "text": "Great Irish pub. Always good music."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfemVtc3VRRRAB",
            "text": "Wonderful atmosphere and great music!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUGEzVlRUM2RUU21ReGNtTkdVbVUzU0VnNWExRRAB",
            "text": "Cool spot.  Very kind staff, very cold beer.  Didn't eat but food looked good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR2JUQjBWakl6VGxkTGVUTkJTRmxuY0RWWWExRRAB",
            "text": "Nice place to enjoy a small drink"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaU0xQmlZblV3TlRkNmJUYzRRblpMVjBocFdGRRAB",
            "text": "Wonderful Irish pub with friendly staff, great music, and great neighbors."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRFQxQjZjWGRGV0dkR1RISTRPRlJ1YkVWdVYwRRAB",
            "text": "1st time. Bit crowded. Best fish/chips ever."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQMlVsczY5dnNYTWhnRRAB",
            "text": "An Beal Bocht Cafe is a nice hidden gem restaurant! This restaurant gave really homey and cozy vibes. They have traditional Irish brunches like fish and chips, English beans, grilled cheese sandwiches, and sunny side up eggs. But what takes the cake and beats everything are their fries, their home fries are so good! The service here is also very good, the waiters are friendly and informative. The food also comes out pretty quick and they even have live music on the weekends. This place is very festive, and can also get pretty busy and crowded. It’s very old school, traditional, and cozy here! The prices are also decent, you can get meals from around $10-$20! So if you’re in the area, stop by here! The only criticism I have here is that they should just have the name of their restaurant more visibly written, so people can know the name of the place.\n\nPrice:$10-20💸\nRating: 8.5/10 📝"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKU0ktdHpmbk1PNWFREAE",
            "text": "À very happy place.\nGood fun, drinks, friends and live music.\nSlainte! 🍻🇮🇪💚"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTUtdXJBRRAB",
            "text": "Awesome spot. Super cozy. Irish breakfast is a must. Lots of meats, to the point they offer ‘half meats’ for about $4 less. Even their “vegetarian” Irish Breakfast is 🤤.\nOne of those businesses that charge you for using your card, so try bringing exact change. Not sure why they don’t give back coins, but just bring the exact change so you don’t have to pay an extra card surcharge or have to wonder why anyone would think it’s ok just to not give you your correct change.\nOne of the best restaurants I’ve eaten from in Riverdale."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OElYSkt3EAE",
            "text": "An authentic neighborhood pub with Irish pub grub ☘️\nA real treat when Trivia Night or live music is on the calendar."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNWRmd3lBRRAB",
            "text": "Went for trivia night the past two months. Love the dedication from the hosts they put on a great show. Bartenders are cool  and the guinness is solid. Have really enjoyed all the food I've had here too. Fun spot overall."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOE9TcnN3RRAB",
            "text": "Cocktails were a little too sweet for my taste. Service is good. Happy hour appetizers, prices, and sizes, and the food in general is good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbXJLbjlRRRAB",
            "text": "Great place for traditional Irish music every Sunday."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeFBLbVh3EAE",
            "text": "As an Irish person I gotta say this is a must visit in NYC! Not only do they have a great range of Irish food and drinks but the Trad on a Sunday ja the best in the city. It’s a one of a kind spot and well worth a visit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmei1TdThRRRAB",
            "text": "What a terrific little cafe this is! Love the neighborhood vibe and tasty brunch - and the bluegrass music. Will definitely be back."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dVkyZlVREAE",
            "text": "Love their brunch! Great place to meet people and experience art, music and culture! An Beale Bocht always cheers me up."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYekpmWm9BRRAB",
            "text": "Friendly, cozy, personal, casual, intimate Irish pub. The food is pretty good, but the service and atmosphere are what set this pub apart from others. The Irish folk music on Sunday afternoons are delightful. One can tell it is a definite neighborhood haunt in Riverdale. Great place. Cheers!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtLTlibVZ3EAE",
            "text": "Love this place!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcFpQMlF3EAE",
            "text": "Alon is the man"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc3A2QUNBEAE",
            "text": "When it's good it's sublime. When it's bad it sucks. Luckily it's usually good....."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuX2R1Q1hBEAE",
            "text": "Iconic music house, a place many call home! Always love coming here for the staff and vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaGJ2M3dnRRAB",
            "text": "An Beal Bocht is a special place. Food is good, people are better. Nice warm environment with a strong emphasis on live music. If you're driving, parking can be a bit tough, but something always comes up."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueXVhUmxRRRAB",
            "text": "Snug, cozy little Irish bar close to Gaelic Park. About 8 or 9 outdoor tables for at least 4 ppl, including a couple of 6 person picnic tables.  Was there on a nice weather late September Saturday afternoon.  Sat outside with the bride & another couple.  Very nice Guinness pints.  Service was good.  Both couples each split a burger & curry chicken.  Both dishes very good.  Wish my local was this good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcVlhWjlnRRAB",
            "text": "A home away from home"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIN08yWEtREAE",
            "text": "Always great food and live entertainment most nights. A great spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OThTMzlBRRAB",
            "text": "Amazing food, customer service, indoor/outdoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWR5aGRBEAE",
            "text": "Honestly had a great time in this bar. I got some wings and fries, and they were good. My experience was great until someone nearby was complaining about the cheesecake. But realistically, who orders cheesecake at a bar?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dDkzclRBEAE",
            "text": "I ordered bbq wings and it was drenched in sauce, it was unappetizing. My friend ordered the house cheese cake and the waiter brought out this (picture below). The service wasnt the best, when we kindly asked if we can be served a different plate instead of this cheese cake the waiter still charged us for it. The atmosphere was alright not the best but they tried. It was honestly not a great experience overall, I would definitely recommend Blackstone Bar and Grill which is a couple of blocks up the hill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdTdIM3BRRRAB",
            "text": "I’ve been here multiple times and they’re always giving me and and my friends attitude when they ask for our IDs. I was just there 2 nights ago and ordered a bunch of drinks and tipped and when I asked for a water they said they were too…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMjRMS3p3RRAB",
            "text": "The food was fine but this might be the best bloody Maria I’ve ever had. Super balanced, the right spicy. I might come back here just for one of those 🍹🍹🍹"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMHI2aS1nRRAB",
            "text": "Came here for brunch and I really loved it! Ordered the American breakfast which came with bacon, eggs, home fries and toast. Was delicious and priced very well. The atmosphere was cute and they even had live music in the other room. The staff is super nice and accommodating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OWZhVzFBRRAB",
            "text": "A truly NYC Irish bar.  Good food,  great drink,  good music and the best crowd."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkLTlmOWlRRRAB",
            "text": "We were there quite late. Drink was very good but the food was not that great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0LUptYmhnRRAB",
            "text": "Brought our baby and had a great Sunday afternoon pint listening to live music! Even met other folks who brought babies :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROcWIzQ2hnRRAB",
            "text": "Took a trip up to Riverdale for lunch.  Met a friend up there who recommended Au Beal Bocht cafe. An absolutely adorable little place. A short walk from the subway.(Up a very steep staircase)  Very charming place. The staff was extremely friendly and helpful. Had to wait a bit for a table. There was a large party in back that I believe took up a lot of the seating this place has. Food was great. We had the traditional Irish breakfast and the omelette special they had. Delicious!  Brunch came with a free drink. We got the mimosa. It came in a medium size ball jar! It was yummy and left me with a nice buzz.\nI totally recommend this place. If you're up in Riverdale or wanting to visit definitely stop here for your meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWczRLM0xREAE",
            "text": "Two stars as both the Guiness and Captain Lawrence were diactyl bombs. It's a lovely pub, but you need to clean your taps."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdGRQemlRRRAB",
            "text": "Had hamburger and white beer with a friend. Great service, live music, best local bar around Riverdale."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdFkzSi1RRRAB",
            "text": "What are wonderful place? The food was great. The services on believable what a nice time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ2IzRHZnRRAB",
            "text": "We love Beal Bocht for its atmosphere, good drinks, people, staff, decor. We have been coming here on and off for years. We have had lunch and dinner and the food has always been good, nothing fancy but comforting and just right. But today, a Sunday, we arrived during Brunch and we were excited about the opportunity of something different and of course the complementary Mimosa. I ordered the traditional Irish breakfast (1/2 portion) with eggs over easy, my husband ordered the American breakfast with eggs over easy as well. Our orders arrived extremely fast but (and I wish I took photos), the eggs were overcooked, the home fries completely dried, almost burned, unappetizing and not to be eaten, my husband's bacon looked old and dried. All looked as if it had been cooked the day before and was reheated in the microwave (I am pretty sure this is what happened!). Thank goodness the mimosa helped the food go down...We told the waitress when she came to clear out the plates that the home fries were absolutely horrible, she agreed that they looked overcooked and apologize but did not offer to rectify the issue. I will never have a brunch at Beal Bocht again, too bad, they have a great opportunity to make it very special. I will come back for a drink, music and atmosphere. But really, I am wondering how it is possible to mess up eggs and bacon!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bXRLbHdnRRAB",
            "text": "What a wonderful restaurant and bar/pub.  It's filled floor to ceiling with ambiance. You get very personal service from the amazing staff (sometimes in that uniquely Irish way).\n\nThe food is better than the traditional basic pub fair.  They have a great dinner menu with Shepard's Pie and the lot.  Today I had the Chicken sandwich with a side of fries.\n\nIt was very fresh, and the bread cracked slightly as I bit into it.  This is a must for a toasted bread.\n\nIf you're in the neighborhood, please, please stop by and enjoy An Beal Bocht.  They have both indoor and heated outside seating!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLTlUVTl3RRAB",
            "text": "Tasty brunch options and good coffee!  Hubby raved about his blueberry french toast.\n\nOpen mic nights and live music on certain nights."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzOXVUcXJBRRAB",
            "text": "Great bar with a great friendly atmosphere. I’ve been here a few times over the years and I’m always happy to go back. I’ve enjoyed open mic nights and Sunday brunches. All good. Big thumbs up and I hope to be back again soon."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweDhuSk9REAE",
            "text": "No TVs or anything but that forces you to talk to different people. As someone who goes to bars often I can say I stayed there longer than I usually do at other bars because of great conversation. Met several cool people while I was there.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbzczeWd3RRAB",
            "text": "A real pub in NYC! We LOVE our local. The staff are friendly, the beer selection is on point, and the pub grub is tasty - try the Gaelic Burger with a side of onion rings. There's live music and good times to be had at An Beal Bocht."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrLU16V2dnRRAB",
            "text": "This place has my heart. It's so easy going, the bartender was so kind and even though she was the only one there we were never left waiting! Love music was fun too. Love the ambiance. You can really feel the local love when you're there.…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaGItXzB3RRAB",
            "text": "When we ever come to NYC again, we will visit this great Pub again! And maybe we meet Joan again!! The dusty 45s are unbelievable!!! Greetings from Germany"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2MGN2bW53RRAB",
            "text": "Great burger. Do wishbone carried some higher percentage brews. But those they carry are very good."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLWZuOC13RRAB",
            "text": "Great locals hangout place to get your drink on and sometimes listen to fantastic bands. I went there to listen to the John Dough Boys and the locals were very freindly the bartenders were fun and the drinks were very reasonably priced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLTZXV3pnRRAB",
            "text": "Overall a nice place for lunch or grabbing a drink. Foods pretty decent though the fries could definitely use more seasoning. The outdoor atmosphere isn’t bad but the table is kinda far away from the booth seats and the back to the seat isn’t very comfortable. Other than that I have no complaints, the service was good and the outdoor area is definitely dog friendly. Would recomendable 👍"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHX3FEVXZnRRAB",
            "text": "Super friendly staff.  Two rooms which gives it a cozy feel, but also lots of capacity.  I only ordered a sour from the bar, so I can’t comment on their food yet, but next time I plan to try their Irish fare.\n\nThere’s a little live music jam here sometimes, and the venue is very appreciative of the music and seems to get it.  I really enjoyed my time here."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncTY3RVlBEAE",
            "text": "One of the best bars in the area. Friendly staff, good vibes, no TVs. A propper Irish bar. (And amazing Guinness)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwX2RyeDNBRRAB",
            "text": "The best and most authentic restaurant with a stage in Riverdale near Manhattan College."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaDV5RDZnRRAB",
            "text": "Good traditional Irish pub.\nGood food and traditional music poetry readings and entertainment.\nFriendly service without feeling rushed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdV9uOTl3RRAB",
            "text": "Irish breaker is worth trying! Calm and easy environment and friendly people."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdmFyZU5REAE",
            "text": "The best Irish pub in New York, hands down. I have been coming here for 5+ years now and it just feels like home every time. They have wonderful live music, in-house theatre productions, and really tasty food and drinks at reasonable…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNmFma1NnEAE",
            "text": "Great Irish pub, fantastic atmosphere. Live music throughout the week. The staff is phenomenal. They’re frequently busy so table service can be a bit slow, but it’s always good fun—my go to neighborhood spot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aFBIaUVREAE",
            "text": "Always a perfect place for a perfect pint. No tvs to interfere with conversations. Big smiles and friendly faces from servers who appear to love their jobs. This Mainer who visits NYC frequently believes it is the best pub in the city."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBekthMDFRRRAB",
            "text": "What a great local place for a good meal and good beer. We went on a Saturday and the band was amazing. I am going back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLUlpQ2J3EAE",
            "text": "This is what a REAL Irish pub is all about: a relaxed ad hoc community center/social club that feels like a little piece of Ireland has been airlifted into the Bronx. Great local vibe, colorful non-obnoxious clientele, great music, great place to fritter away the evening hours. One of the best pubs in the boroughs without a doubt."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURram9lQm1BRRAB",
            "text": "Fabulous staff, great ambiance and lovely crowd. The music was spectacular. Intimate space, without feeling crowded . Lots of laughter and quick wit to go with your wine . The food is excellent! Great bloody Mary’s as well !  A good ol’ fashioned , authentic Irish pub !"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbDRpQUZREAE",
            "text": "Simply the Best there is if you’re a musician or a vocalist like me.  Eric runs the place every Tuesday nights for open mic.    And he runs it rock solid.   I’ve never as much seen quarreling going on between anyone there,  nice community.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXb3J1TzF3RRAB",
            "text": "A great neighborhood spot that always has a good vibe. 5 stars for the small business/local love, but 3 stars for the food.... The first time I went there pre-pandemic, without asking they subbed whip cream on my pancakes because they were out of fruit. And just recently, I ordered the veggie burger but it didn't come on a pretzel bun like the menu stated."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzdWNTWjFnRRAB",
            "text": "Sunday fun day Session.. 4 -7 The best Traditional Irish music."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNFbFBXNXRRRRAB",
            "text": "Good food, good service, good beer selection and a damn good Guinness pour. Cool events like live music or poetry on different nights throughout the week.  Also, a good eclectic mix of people that visit; you'll see a young person from Manhattan College sitting with a guy in a suit sitting next to a hip middle aged mom.\n\nTip: if the weather is good, get there early to snag a seat outside."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdDdPM2NREAE",
            "text": "Great neighborhood bar. I went on a Thursday night and the two bartenders (Keely (sp*) and Keith were very attentive and quick! The live music is a great touch that you don't find often midweek. Since there is no cover charge; be kind,…"
        },
        {
            "date": "수정일: 12년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcUstQ1pnEAE",
            "text": "Easily the best bar in Riverdale, though that's not saying much. Families are welcome during the day and they have great bands at night without a cover charge. Bartenders are friendly and drink prices are reasonable. The only downside? The food is absolutely horrible. Go eat somewhere else, then hit this place on your way home."
        }
    ],
    "reviews_count": 68
}