{
    "name": "Riverdale Indian Grill",
    "place_id": "ChIJax-Ryy7zwokR2TVWAWJatv0",
    "grid": "BX8",
    "address": "5225 Broadway, Bronx, NY 10463, USA",
    "rating": 4.3,
    "user_ratings_total": 103,
    "phone_number": "(718) 825-3030",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRlZHeExaVFpWVjJ0WmFrWlJZMDlWZFROWVlVRRAB",
            "text": "UPDATE- They are back open and better than ever. Delicious food quick delivery food arrives hot and fresh. Calling them was excellent and they are kind people. My go to for Indian food.\n\nI love this place but they never pick up phone and are randomly closed. Please do better your food is amazing and I will remove this review once they do better. If you’re closed atleast remove the store from online ordering this is becoming a hassle."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdExYWmZhM0paTkU5blJYbHlaVnBvTnpOak9VRRAB",
            "text": "Really good food, was very impressed. Will eat here again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QlIwZHZVVFpIZDBGWGFXMHlkSFZ2ZGxkb2MyYxAB",
            "text": "Would give them zero stars if I could. I placed an online order and they never showed up."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSk5uQmhZemswYzIxVmVFZFFZbWRTZDAxSlRWRRAB",
            "text": "Excelente customer service. Great flavor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVHgyTUxtaEotVGtBRRAB",
            "text": "Best Indian restaurant we have ever had that is nearby to us. Butter Chicken is listed under chicken makhani is a must have! Flavorful, fresh, delicious 😋 will definitely order again. We are very happy and content with the way it was made not spicy at all with amazing sweet and delicious seasoning! Naan bread was also very good! Ordered on uber eats app it was a smooth transaction! So happy we found this spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKUFpqSVh5X2YzbzNnRRAB",
            "text": "Cancelled my order an hour after it was placed!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMlp3Y21tcFlDX05nEAE",
            "text": "Great place to enjoy an Indian cusine.\nLoved the chicken Biryani, butter chicken and nan everything was super fresh. Highly recommend it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdlBEVWd3RRAB",
            "text": "Food was so delicious this is my first time having traditional food and it was the most beautiful delicious feeling every bite was a piece of Indian culture you can taste the vibes and perfection that was created when making this meal I will forever eat here and I will always appreciate this absolute blessing from this Indian cultural experience..\nThank you so very much compliments to the chef."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMnRLTUl3EAE",
            "text": "Great indian food at a good price point. Delivery is good but why not take a moment to sit down? Service is kind, restaurant is nice, and you can take a deep breath and ground yourself for a moment."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbi1TUVF3EAE",
            "text": "I have now had two delivery experience that have caused my to give them this low rating. Today just put the icing on the cake. I ordered a chicken vindaloo, plain naan, and chicken samosas. I sat down, excited to eat my meal. As usual, the chunks of meat were drenched in the vindaloo sauce. I fished them out, and placed them next to some rice. When I cut into one piece, it seem a bit more tender than usual but nothing that alarmed me. But after having a second piece, I quickly realized that they had send me fish instead of chicken. I called them, expecting them to be apologetic and quick to repair their error. Quite the opposite - they were upset to find out that I had already taken bites of the fish, saying that it was more expensive than the chicken. When I mentioned that I could have been very sick if I had a fish allergy, they literally said, \"That would have been your fault since you ate it.\" They refused to send a replacement that day and instead said that the next time I ordered, I could \"make a note\" and they would send the dish again. Sending a replacement would have cost them and additional $15. Now they've lost me as a customer along with whoever else might be turned off by this level of poor customer service. If you have allergies, take care because this restaurant won't do it for you."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcmQyZDJnRRAB",
            "text": "Ordered take out and got very small proportions for prices on the higher end. Not worth the money"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NS1ETXhnRRAB",
            "text": "I was looking for a high quality Indian restaurant in my area and I finally found it! The chicken tikka was a bit too sweet for my taste but I believe that was my fault as I insisted it be mild, next time I’ll try medium and hope it’s less sweet but not too spicy!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbjZlQVp3EAE",
            "text": "Very good food. Their service is very good. Delivery on time.  Thanks"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbHF1dEFREAE",
            "text": "Absolutely terrible service. Delivery was 2 hours late and they refused to give me a refund and made me wait around as the delivery driver took 2 hours to make an 8 minute drive. I don't know if he was jerking it in his car or if that whole…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ015anRBRRAB",
            "text": "I ordered chicken biryani, vegetable and chicken  samosas, saag paneer and Naan. Fresh warm food. The spices were a good level of heat not too spicy. Raita was my least favorite. Sauce lacked flavor and was a bit too thick.The chicken samosas, chicken biryani and green chutney were my favorites!! Will definitely recommend and order take out again"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN05iSkR3EAE",
            "text": "Very pleasant lady with great customer service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcEpESlBnEAE",
            "text": "Love love love the butter chicken with garlic naan."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeHNYZjhnRRAB",
            "text": "We ordered the chicken makhani, methi malai chicken, naan and vegetable samosas - and it was all 10/10 ✨\n\nwould definitely order this again"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQemFPTnRnRRAB",
            "text": "Food is very good but so much oil in curries. Wish you could remove most of that oil. Otherwise very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ0tibzJ3RRAB",
            "text": "My dad was from India. Food is excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWNhdG1RRRAB",
            "text": "I went for dine in this restaurant and seriously they are very bad at hospitality. I honestly loved the food but they need to hire friendly servers.Especially the old lady is very bad at serving  food ,she treated me like as if she is feeding me for free."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ05xN2pRRRAB",
            "text": "everything excilent ,but lunch dish very small."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N3JxZ3NBRRAB",
            "text": "Chicken kebob, masala onion rings.... delicious 😋…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieF9QWWZ3EAE",
            "text": "This place is a 10/10. I’ve been here twice. And they’ve never failed to cater to their customers. The food here is so good and taste so delicious. Such a wonderful place🤗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNF9UM0hREAE",
            "text": "this place slaps!!!!! the naan was perfect & the food was large portions, 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidzRlSXhRRRAB",
            "text": "I got food poisoning from their food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURib01maWdBRRAB",
            "text": "Samina our server was awesome.\nThank Riverdale Indian Grill.\nAwesome good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaVlEenJ3RRAB",
            "text": "the food (bengan bartha and paneer tikka masala) was excellent! our host Saminah was so great too, we really appreciated her attentiveness and care. would highly recommend and will be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMm9ERnJBRRAB",
            "text": "This place has authentic, delicious, freshly made curries and the people care there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTgtU01nEAE",
            "text": "Always purchase my usual here. Chicken Makhani meal and Garlic Naan. They never disappoint!\nFood is delicious and the staff is always friendly and kind, whether pick up or delivery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeUsyMm1RRRAB",
            "text": "Chicken Tikka Masala, garlic naan, and  chicken samosa were all great with wonderful presentation and exquisite flavor. The mango lassi and strawberry smoothie are so smooth and creamy! Highly recommend for Indian food to anybody in the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6XzZMdzRRRRAB",
            "text": "Fantastic Indian food. I had the lentil soup, lamb Rogan Josh, and saag paneer. All three dishes were great! Samilla did a great job taking my order. I will definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6M183UFpREAE",
            "text": "The food was really delicious, Samina our server was really nice and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OW9HT0xBEAE",
            "text": "There for is excellent. They adjusted just the right amount of heat to my Chicken Vindaloo.\nRecommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNHFUc2RBEAE",
            "text": "We tried this place for the first time after shopping at the Target nearby. Ordered sag paneer and vegetable korma, which were delicious (it's on the sweeter side, if you prefer that)! Samina was very sweet and provided great service, even gave our toddler a free ice cream! We will be back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd3R2UGFREAE",
            "text": "Samina, and the whole atmosphere was amazing. Food and service was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREazVmZXB3RRAB",
            "text": "Best Indian food in the Marble Hill/Riverdale area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaU9yUmtRRRAB",
            "text": "This place would get 5 stars if the portions weren’t not so small! I’ve been here about 3 times,  their chicken tikka masala, Lentil soup and garlic nan of course :p was oso good. I did try the mango shrimp which sorry not sorry it tasted kind of soapy. Otherwise! I was pleased with their environment and customer service :). MANGO LASSI run dont walk."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cXFTOU13EAE",
            "text": "Me and my daughter went to riverdale, we tried the chicken tikki massalla, pani puri, rosemary naan and samossas. It was the best Indian food we’ve ever tried, the chicken was moist and so was the rich. The best drink I recommend is the mango lassy , 10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbHMteDNRRRAB",
            "text": "Just the best kind of place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxb3BiQzJBRRAB",
            "text": "Take out - shrimp biryani was delicious, mango lassi above average, palak paneer below average"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMmNTWnRnRRAB",
            "text": "A Barbie doll told me about food in a way that grabbed my attention with her voice. Her tips were super helpful for picking out what to eat. I also really liked her hijab; it looked amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGb1oyYXN3RRAB",
            "text": "Samina was amazing and was so helpful. The tikka masala was the best I’ve ever had! Definitely will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcUw2bnpBRRAB",
            "text": "I had an awesome dining experience – the food was incredible. Special thanks to the server who made it all the more special with her fantastic service and friendly greetings. She was amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdzZ1RmhRRRAB",
            "text": "They Brought Us Dirty Glasses To Drink Water Out Of As Well As The Wrong Order Of Food. The Waiter Told Us That's What We Wanted To Eat !! And We Said \" Nnnnnnooooooo We Ordered Something Else 🙄"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaGVUQzJRRRAB",
            "text": "Ordered takeout - tikka masala sagg paneer and garlic naan. Naan is some of the best I’ve had in a long time! Everything is super fresh and delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc2ZEVG9RRRAB",
            "text": "Chicken tikka,tandoori chicken,vandi marsala,garlic nan are the best,highly recommended, best Indian resturent in area ❤️🥰"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNnZhV3ZBRRAB",
            "text": "So good! I think they brought down the spice level for me because this restaurant isn’t as spicy as the other Indian restaurants I’ve been to. I was kind of relieved by that, haha. I love Indian food but the spicyness gets me sometimes. So worth it though!\n\nI had the chicken achari and it was delicious. I want to go again to try their other dishes, especially their samosas!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX0t5ZVlnEAE",
            "text": "I was looking for and Indian food place and I found this hidden gem. It is nice cozy place with welcoming atmosphere. The staff was professional and accommodating. Food was amazing. Perfectly balanced spices and the Garlic chili Naan was out of this world."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKX0l5WG1BRRAB",
            "text": "Excellent food and great service , I will go back Definitely."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMlpHUGdnRRAB",
            "text": "Went there on Friday and it was an amazing experience. Service was fast, everyone was kind and helpful.  Food was amazing, delicious and fresh. Samosas are to die for. Korma chicken and Tika masala were very flavorful. I highly recommend this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNVBlTXhRRRAB",
            "text": "Incredible! No more trips to queens for Indian! Marble hill has terrible take out and had no good Indian, as both the one in Riverdale and inwood are not great, so I was skeptically excited when I saw this little spot on my drive home. Tried it today and it 100% delivered! Service was great, location was clean, food was amazing! I got vegetable samosa, malai kofta, chicken tikka masala (had to get a safe choice just in case) and garlic naan. I ordered take out and the moment I walked in I was taken back by the smells coming from the kitchen. The moment I saw my garlic naan had cilantro I knew I hit the jackpot, as most Indian restaurants don’t do this. And my malai was perfection. The rice pudding was also so delicious! Sorry for the terrible picture but I couldn’t wait any longer to dig in. Now I just need to try the rest of the menu! I am so ecstatic about this addition to the neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaExHQWZnEAE",
            "text": "We ordered on doordash and tried to look for an indian spot with with great reviews. We found this place to order but we’re disappointed we spent money on how little we received. We ordered shrimp curry for $18, chicken biryani for $16-$17 and a few other things like vegetable samosa, paratha, sodas etc. The biryani was too spicy to finish, samosa tasted kinda old and the shrimp curry was such a small amount. Wasnt worth the order and we’re disappointed. We know dining in is probably a better experience but we live far and hoped ordering would be just as fair. Disappointing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3F2MEVnEAE",
            "text": "This our first time here at this restaurant. I enjoyed the food  and quit vibe. Great flavors. Will definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOHRyVDV3RRAB",
            "text": "I had a horrible experience today with a woman who was at this establishment\nI was at Riverdale Indian Grill on Broadway and had just finished ordering my takeout This Asian woman was sitting about 3 tables diagonally from me. I was on my phone.  She said something about “…phone.”  I asked her if she was speaking to me and she didn’t reply. Again I asked if there was a problem.  No response. I went back to reading on my phone then this woman threw a whole cup of water from across the restaurant at me. No provocation on my part. I asked her why she would do that. No answer just a nasty look. The server of the restaurant came out from the back;  there was water all over the floor and on me.  I told her that this woman had thrown water at me. She didn’t say anything to the customer although I had just placed a $60 order.  I called the police and waited 15 minutes. They never showed up. Finally I got up told the woman at the register that if they keep allowing her to do that to their customers they will loose clients.  We loved the food here have been recommending it but no more.  Very disturbing. I have lived in this city all my life I have never experienced something like  this.  Sad to say we will not be frequenting this establishment. This place didn’t make me feel safe at all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd3B2YlNnEAE",
            "text": "The restaurant perfectly followed my request to make the food spicy enough for my taste, but not too spicy for me. :) The chicken korai was delicious! The rosemary naan was completely COLD by the time I got the order (they didn't wrap it up in foil). (Beware: I tipped the delivery driver $4 online, but he was incompetent and couldn't find my house for a long time! If I was going to get delivery from this place again, I would withhold the tip until the delivery person actually arrives.)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlakpTelN3EAE",
            "text": "My partner and I are DoorDash photographers and we came to shoot the menu here. All the dishes look amazing and we tried some of them after shooting. Very good flavor and lots of spices. They have so many options for vegans and vegetarians also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdU02SVR3EAE",
            "text": "Excellent range of South Asian options, all halal meat and with plenty of seafood options. There are over 30 vegetarian options and many of the dishes can be made vegan with \"Impossible Meat.\" Comfortable dine in with recently renovated and new furniture and friendly service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMmJHWVZ3EAE",
            "text": "Went there Friday with sister. Great food, Tika masala was amazing,Nan bread delicious. Place was very clean and clean bathroom as well. Staff was friendly and food arrived fast. Great mango drink. Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScHBpc2dnRRAB",
            "text": "Ordered delivery and the food was delicious! We're a little far and we hope they continue to deliver to us. We got Saag Chicken, Lamb Biryani, Daal Tarka, and Begun Bharta."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtc3BQTHh3RRAB",
            "text": "Food was super delicious and very authentic! Customer service was also great and prices are reasonable for the amount of food you get! Only thing is food took a bit to come out but I think it’s because they make it fresh!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob3BlNURnEAE",
            "text": "Ridiculously More expensive and smaller portions than any other Indian place in Manhattan and Brooklyn. The math doesn’t add up, considering this place is in the upper Bronx, never dining here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOUpQMzZBRRAB",
            "text": "Food was amazing !!! And customer was even better . Definitely will be back ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSak0tbG13RRAB",
            "text": "The food is really bland; a description I don't associate with Indian cuisine. I will find another place for my cravings."
        }
    ],
    "reviews_count": 64
}