{
    "name": "BOKAGUÁ",
    "place_id": "ChIJSZqrpoLzwokRF2ejcHPZcPY",
    "grid": "BX8",
    "address": "3541 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.6,
    "user_ratings_total": 1165,
    "phone_number": "(718) 766-0050",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMlp6TkhVVXhrUld4SGNYcElPRGR2VTFZeVdrRRAB",
            "text": "BOKAGUÁ is not just a restaurant it’s a full sensory experience that earns its spot among the best restaurants in New York.\n\nFrom the moment you walk in, the warm lighting, vibrant music, and modern tropical decor transport you somewhere between the Caribbean and Asia, creating an atmosphere that feels both upscale and inviting. We started the night with their signature Limonada de Coco and a smooth martini, perfectly crafted and beautifully presented. Each dish that followed felt like a story the Mofongo Dumplings were a creative twist on a Dominican classic, the Caribbean Oxtail Samosas delivered deep, rich flavor with a hint of spice, and the Strip Loin Ssam turned dinner into a hands-on, flavorful adventure. Every bite felt intentional, a mix of tradition and innovation that made us stop and savor.\n\nTo end, the Dulce de Coco Enyucao’ a cassava and coconut dessert with passion fruit caramel was a tropical dream that lingered long after the last spoonful. Between the music, the presentation, and the hospitality, dining at BOKAGUÁ feels like stepping into an experience where culture, flavor, and style collide a must-visit destination for anyone searching for the best restaurant experience in New York City."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TllXOXBUbWsxVUZodk1rUllUMUY1UVdwS01sRRAB",
            "text": "Carla was the best! She provided great service, recommendations & took the best pictures!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWR2FqVjVRWE15Yms5TE1tcHBkVjh0V0VkR1lsRRAB",
            "text": "Mi sobrina, con mucha ilusión, eligió este restaurante para celebrar su cumpleaños, y lamentablemente fue un gran error. La comida estuvo buena, las bebidas también, y la decoración del lugar es bonita, aunque el espacio es bastante reducido, Sin embargo, el servicio al cliente fue pésimo. Llegamos alrededor de las 9:30 pm y, hasta las 11 pm, seguimos consumiendo y celebrando sin interrumpir el servicio. Aun así, la gerente se acercó —en medio de nuestra celebración, mientras nos tomábamos fotos cerca del baño— y nos levantó la voz delante de todos, pidiéndonos que termináramos los shots y entregáramos la mesa porque, según dijo, había un grupo esperando hacía 30 minutos. Fue una situación sumamente incómoda y poco profesional.\nDespués de una cuenta considerable, no merecíamos ese trato. No es la manera de dirigirse a clientes que están celebrando ni de manejar un restaurante que dice ofrecer buena experiencia. La falta de educación y tacto del personal fue inaceptable. La gerente argumentó que solo se permite estar dos horas, pero esa información nunca fue mencionada al momento de hacer la reservación ni por el camarero durante la cena.\n\nUna gran decepción. No volveríamos ni recomendaríamos este lugar.\n\nMy niece, very excited, chose this restaurant to celebrate her birthday, and unfortunately, it turned out to be a big mistake. The food was good, the drinks were nice, and the decor was beautiful, although the space is quite small. However, the customer service was terrible. We arrived around 9:30 pm and continued ordering and celebrating until 11 pm without interrupting any service. Despite that, the manager came over—in the middle of our celebration while we were taking photos near the restroom—and raised her voice at us in front of everyone, asking us to finish our shots and leave because, according to her, there was another group waiting outside for 30 minutes. It was extremely uncomfortable and very unprofessional.\nAfter a rather large bill, we did not deserve that kind of treatment. That’s not how you speak to customers who are celebrating, nor how you manage a restaurant that claims to offer a pleasant experience. The lack of manners and tact from the staff was unacceptable. The manager also claimed there was a two-hour limit, but that information was never mentioned when making the reservation, nor by our waiter during dinner.\n\nA huge disappointment. We would not return or recommend this place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcVoxZDNUV1JUYW5GNFpsaFplRTAwVjBGWU9GRRAB",
            "text": "I was at this place last night Saturday October 25th celebrating my birthday with my family we were a group of 7 people, I had a reservation at 9:15pm we were eating and drinking when my family and I started taking pictures, we had ordered a round of shots when a girl arrives I guess she is the manager or the one who handles the reservations because she was the one who greeted me when I arrived .. she approaches us and tells us to please take the shots because she needed the table where we were because she had another reservation and we were all in shock because we literally felt like we were being kicked out of the place when I tell the girl but I also made my reservation and I am consuming we continue drinking and ordering shots (it was already like the third round of shots that we had ordered). She tells me that reservations are only valid for 2 hours and I told her that they have to put that information on their page so that the client knows and does not have that bad time and she told me that they had that information on their page but today I looked for the information and I do not see it anywhere on their page !! I was very disappointed with that, apart from the fact that we were a group of 7 people consuming, you can imagine that we are not talking about a bill of $ 600. We are consuming and paying our money, I traveled three hours to receive that disappointment, even on my birthday."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbFQxZEhURXBYV21WcU5FaDRlV1JzZGtocmMyYxAB",
            "text": "The food, the place, the atmosphere, and our waiter Dioni made our evening truly delightful! Thank youQ"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ac09FSkxZa3RKUkhveFpWaDJVVFZEVWs0MUxWRRAB",
            "text": "Great food and service by Adonis!! Carolina the Manager was awesome as well, we’ll be back very soon!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcVRXMUZVR3BWT1ZOelptZ3RiVUo2TVZCNFgzYxAB",
            "text": "Un excelente servicio por parte de Dionis y Carolina"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNGVtSlZVMFl3ZEhKUFVsRkpVRmxFTWxWdVlrRRAB",
            "text": "Dionis and Carolina were super helpful and great. The food was amazing and the host made sure she accommodated us. Extra thankful for her. Thank you to the team. We will be visiting again!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cWJrOUZkMVZ4ZFhkWk5tUXhjSEpSTFhwQlZrRRAB",
            "text": "Dope little Dominican spot in Riverdale! Dioni took really good care of us. The food and cocktails were delicious! We’re definitely coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRU9FZzRMVVo0ZW5SWWNEWXhNV1o0WjFsamRtYxAB",
            "text": "Why don’t we have more places like this?? Came down from Westchester for the vibe and good food. Service was amazing - Dioni was so helpful in offering recommendations and checking in how we were enjoying our dinner. Will definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "la",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dlpWQnlkSGxSWVRKU1VYSjJiSFJVWVVKYWNtYxAB",
            "text": "Lo maximo\nExcellent servicio de dioni"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS09IZFhaREZVVDBwVlNuVTVWV1ZYYVVadGJYYxAB",
            "text": "Todo rico y excelente servicio de dioni"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUVFWVjFTVWd4V1U1cVIwSk1TMFZTVkdSR1IyYxAB",
            "text": "The place is beautiful for a date night . The service is good . The food was pretty good the only I would say is they constantly run out of things on the menu especially the things I happen to like example the steak and samoas which is unfortunate other then that the place is a nice addition to the neighborhood."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NFRHdDVOR1puUjNkemVIUndTVmxRTVZGeFgzYxAB",
            "text": "Overrated, extremely rude staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdU4xWkVMWGRFWWxoaWIzWktZa2w2UkZWRmRWRRAB",
            "text": "My friends and I were there this past Sunday night to celebrate a birthday and were disappointed. I guess our expectations were too high. Decor is nice, I must say, but music was loud. Service was totally impersonal. Made us feel that we did not matter as customers. I found it pricey, compared to other places in the neighborhood. Food was ok, but presentation was nice. Therefore, I'm giving 2 stars- 1 for decor and 1 for food presentation. I would recommend you go out and try it at least once. You may have a different experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTGJ6ZzVZMk5MYVZkUmJHTldRbFl0YjI1VlEzYxAB",
            "text": "Good food, excellent service and the attention from the staff is exceptional!! Good vibes and the best atmosphere! I loved it and I recommend it one hundred percent! Thank you @bokagua team!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d1RFTjRYME52TmtwNVYyNDNTMEp1WkZCRldtYxAB",
            "text": "Bokagua is such a cool spot! The food and drinks were really good and surprisingly affordable. The ambiance is romantic with chill vibes, and the hospitality was amazing. Definitely worth checking out!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVWNDMVlhRGxuTURWdVFUWTRaRkpDYTB0RFFtYxAB",
            "text": "The best agave in all of NYC! Ask for their select premium brand Agave Rey!!!! Gracias Bokagua"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUFZqaEJOM1pZU0hscWNqTlRiMmRhUkVGVVlsRRAB",
            "text": "I had the Coconut Lychee Martini. Compared to other places, it was a bit sour because they add lemon to almost every drink. However my bartender Juan was very attentive and prepared my drink without the lemon. It came out perfect! I was able to taste the real flavors of the coconut and the lychee.\nEnvironment 10/10. Not too crowded.Not too loud.\nI also ordered the lemon grass shrimp dumplings. They were delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRVlWRlViak5ZWTFwd1kwdGpRVFpQTjBsVE5GRRAB",
            "text": "I wanted to love this restaurant after hearing so many great things. The food and ambiance were both excellent, but the overall experience fell short due to poor planning and communication.\n\nWe booked a 3:30 p.m. brunch reservation through RESY, but the day before, we were asked to move it to 3:00 because the kitchen closes at 3:45. While that was understandable, this information should be reflected in the booking system.\n\nService upon arrival was attentive and friendly. However, several menu items were unavailable first two, then more as we placed our orders. By the time entrees were ordered, many options had run out, leaving only three dishes available for our table of six adults and two children.\n\nAlthough the food we did try was flavorful, it was disappointing to have such limited choices and no acknowledgment or accommodation for the inconvenience. For a brunch service (already limited menu), running out of half the menu well before closing time is unacceptable. Better coordination between kitchen operations and reservation times is necessary."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kb1UxYzRaRFJzWkhKMVdVYzFPSGc1WDFwdFYzYxAB",
            "text": "This place is closed. Windows have paper on em.\n\nJust an update, courtesy of the staff, I mistakenly thought this place was…"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMldsOUNTakl6WWxkdU9WWkxiM2xxV0hNM05XYxAB",
            "text": "Amazing food and service. Highly recommend!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGVXcHpPVmRvVTNGUE1uUm5RWEpQVW1wTWFWRRAB",
            "text": "Buenisima experiencia y atenciones los platos muy buenos. El servicio simpático. Me encantó el Coconut lyncheen Martini y el postre de “el enyucado”. Recomendadisimo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONlZrODVjREpaY0VSSFVFaDZYMWh6T1hWQlpIYxAB",
            "text": "Have been for lunch and dinner with friends who all have different tastes. We've always been able to find things everyone likes. I suggest ordering a few dishes and sharing as the portions lean towards tapas style. The staff has always been friendly and knowledgeable about the dishes. Would visit again and recommend for those looking for new dining options."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMGJEQnJZMUp1T0RONVFsQldNMG94WTI5cFJVRRAB",
            "text": "Buen ambiente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVFZEUllSMXBpWkcxNlpGUnVNVmRIZVRWRVUxRRAB",
            "text": "Amazing experience! Pablo was great! Food is delicious"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abVV6ZEtVbkpGT1hsWWRUSkdSRkZWVkhGaWJsRRAB",
            "text": "Excelente ambiente, Dionis atenciones de primera y una comida exquisita!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNWRUQmlTMWx4V1RSSmFWSkViemhGWVdaU1VIYxAB",
            "text": "It is a pleasant place to be. Authentic & main stream simultaneously. Well Done! ✅"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWFkwVmlNbEZKYWtWaWRrczRhMUJhWXpSS2NVRRAB",
            "text": "Excelente servicio por parte de todos. Diony gracias mil por la experiencia."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMVVubG5MVGhuZGtSYU5sQnVPVVZNUWxkSGJYYxAB",
            "text": "Excelente servicio de parte de todo el staff. Especial Diony."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlZXTXdhRTVyT0dwUGVtNVVOakV0VDJwSmVtYxAB",
            "text": "Everything on menu is delicious 😋"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMVNteHZOblY1Y1hCWGNucFhiMjh6TUdSclJFRRAB",
            "text": "Servicio 100 de 100 y comida 100 de 100\nDioni el mejor, muy agradable!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1pXeHJhWEZmY2pKTFVtVjRNV3hyUkRoVFlVRRAB",
            "text": "Dioni gave us a excellent customer service, he is into this"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNWFYTTFjVWhOV1d0SU9XOUtYMGh3YXpoeFRGRRAB",
            "text": "Food was very nice and got provided with excellent service from Dioni."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeWVEWlZjazFWY0dacmFGUnlaMVozUkd4YWFtYxAB",
            "text": "THE BEST. SETH WAS SO GOOD"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVlVsVnlRM2xmYWs5UFRYVjZZazVLTURSaVZrRRAB",
            "text": "Ambient was great especially the server Dionis was excellent, deff recommend the food 10/10*"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUVkyMTJSekV6T1dnNFVDMTFablpuWWt0UGIzYxAB",
            "text": "Dioni is an excellent waitress and the food is amazing and tasteful"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd05Xd3dlakExTjFReVdrcE5ha2RYVkRkUFVYYxAB",
            "text": "The food was good and service was amazing. Dioni was excellent!"
        },
        {
            "date": "1달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSc2FtMXVOV3RPUTNOeWRuTnBUMk5KVFRKeGRWRRAB",
            "text": "Comida exquisita! Excelente servicio de Dioni"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR01WUnlTVlJYWm5Cck0yWlZZamhRV2t0TlRXYxAB",
            "text": "Dioni was the best at serving us, he knows what to recommend for you to have the best to eat"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WFYxODRhbWhZUkRaRWQycFhVV04zTlRkV00xRRAB",
            "text": "The only downside to this evening was the music was a bit too loud for me.. but I’m old! Seth was the most amazing server ever!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZdE1FdFpSMUYzUlV0b05HSkpTVXB4YTJwblFXYxAB",
            "text": "Seth was delightful and took great care of us!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSVVqZHFaMjlyT1dweE9ETkVOVTA1YVRoVWJVRRAB",
            "text": "Dioni fue Fenomenal!!! Su atención y recomendación fue excelente!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU1dGSndTazlyVFZGM1JrZFlUSEJwT1RsU1RHYxAB",
            "text": "Place is really nice, and food is delicious and exotic 😋 but music is too loud, so depends on what type of place you are looking for, this might be a great option; for my friends and I, that we gather to talk and get updated bout our lives, talking is really hard, but for enjoying the dj and some drinks this is 👌 perfect"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZlNHNVVWMloyT0hOdFJrZ3piVUZ4V0hsWlYxRRAB",
            "text": "Love the atmosphere. Seth was very attentive and helpful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWelZrODRia1pEWWxwWWQyTXhSRkJ2YkdaMFgwRRAB",
            "text": "First time at BOKAGUÁ and it was amazing all thanks to SETH M he did an amazing job from start to beginning! Will be coming again\n\nWhat a great night"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vd1NWUlpVM2syTnpOWVRVcFdWa28zV0UxeGFHYxAB",
            "text": "Our waiter Seth went above and beyond. His recommendations, his speed and charm made the experience at Bokagua very special. But let’s not forget what we came here for, the food!!!! 10/10 will definitely come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWU1VcFpjMnR6VlZGNGRGRm9VekZqUjJWVE5GRRAB",
            "text": "Seth was amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjelprZFRaVTVRWjI4d1QycENVRFZ2UldoMU9WRRAB",
            "text": "Food and atmosphere were great! But Carla truly made the experience. She was so knowledgeable and gave us excellent recommendations (which is saying a lot since I came with very picky Dominican parents). She made everyone feel welcome and was incredibly sweet. I’d come back all the way from California just because of her!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tob2JWOXJVR2wxTTBGWWQxQkhXa2hrVVdwNlltYxAB",
            "text": "You have to try this place! The food is delicious and the service is attentive.\nThey are small plates meant to go with your drink. And you must try the deserts!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd2VGaHVOa3R1YlRSU2JqTlpNbUZsVmtkclZYYxAB",
            "text": "I thoroughly enjoyed the food, the service, and the overall ambiance. The presentation of both the food and the drinks was truly remarkable. It was a wonderful experience! I was there to celebrate my wife's birthday, and the staff even sang her a happy birthday song when they presented the dessert, which was quite delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKenB6Ny0tMktXVWNnEAE",
            "text": "This place is overrated when it comes to the food, is regular food, not exquisite as described in some of the reviews. I came in with a high expectation given the reviews, for instance, I read “best lobster fried rice,” etc, and it turns out is just a standard rice, not authentic in the slightest. The cocktails are okay. I think the atmosphere is better than the food and the drinks, which is what’s being used to advertise the place (they did great on the decoration and vibes) and the food does looks good, just does not tastes as good as it looks. But go try it yourself."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SlQwbExUV2sxYW5CSFVYZEJRMVZVYWxaVmRIYxAB",
            "text": "Was here for a dinner, I was amazed by the ambiance! It's definitely a small, intimate,  and cozy place. The food selections are towards the smaller portion like tapas. The presentation of each dish was well thought out! I ordered the braised short ribs, the steak ssam, and oxtail samosas. Would definitely come back and try other dishes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNVZtUTNNSGxZWTNCMVFWaEVNbkkyV1VsRU9YYxAB",
            "text": "So my friends and I (3 of us) went out to celebrate my best friends 30th! Out of all the food the Dessert was the best. Looking up this place on google the menu looks extremely innovative and encouraging to want you to come, visit and eat with them. The service was good but our server kept getting lost and taking forever to return. The place is beautiful and the decor makes it feel like the restaurant is high end. The octopus was really salty coming off the grill. It was cooked right but overly salty. The sauce was really good. The sweet plantain puree with the short rib was probably the worst dish. The meat was tender but because it was laid on top what I thought would be genius purée it actually was extremely disappointing and left a bad taste in the mouth. We notified the waiter but his feeble attempt to get it off our paycheck made the experience lose a star. You can say that it wasn’t accommodating in that sense. Our drinks were really good but my drink the white was too overpowered with sour or lime juice. Could not finish it. We did enjoy the samosas with the sauce. The garlic rice was great but the box it was served it lacked the function it meant to have. All in all the food wasn’t really anything truly different or as incredible as the menu reads but the ambience is great and we still paid our meal even though we didn’t like a dish and asked for it to be taken off the check. It’s not about paying but more so letting you know that that dish is a DEFINITE HARD NO. My friends and I LOVE FOOD our check was $350 with tip and it was only 3 of us and we did not care to pay. So yes things are pricey and I believe this comment above was necessary to post on here to let everyone know how the establishment serviced us. Thank you."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SME1VZEhNR2xoVkdaNmVrTTRORU5aY0RGeFNuYxAB",
            "text": "As of June 19\n\nCame a 2nd time and service was horrible!  Apparently the kitchen isn’t open during opening hours and rather than tell us; they had us wait close to an hour after we ordered our drinks to come and take our order.  We ended up leaving.  Sadly won’t come back again\n\nAs of May 18\n\nNew favorite spot in Riverdale, @bokaguanyc - love their brunch and the vibe. Cocktails were super creative and tasty, and the fusion of cuisines was awesome. Need to go back for dinner, but so far, wonderful experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMFUyZEtTV04zU1ZKcGNHSlNWVlV6WTJnMWJGRRAB",
            "text": "It’s so nice to see a refreshing new restaurant join the beautiful neighborhood of Riverdale. This place is amazing! Beautiful modern decor, sort of speakeasy with a moody tropical vibe, nice chill music, great customer service, delicious food and cocktails. Feels like you’re in the meat packing district of Manhattan, cool and hip. My husband and I had an early dinner on a Monday and there were tons of seating. We live in the neighborhood and past by it often, it is packed in the late evenings and weekends. Server was very knowledgeable about every dish and was very careful in his recommendations since my husband has a seafood allergy. We highly recommend this place and will definitely be going back with family and friends. Please add a chocolate dessert!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dE5UTm5SV2hJVVZkemJraFBTV05GUlZOQ1gyYxAB",
            "text": "Most ordered items are that for a reason! The oxtail samosa was an immediate stunner - the pastry was delicious and paired with perfectly cooked and seasoned oxtail. The pork belly with the toronto dumplings was perfectly cooked. The short rib dish was perfect. As were the sides and drinks. Top notch service, food, and ambiance. Will be coming back to try more!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkV1VqVkxlazVwYVc1MWNWUjZRekowWVdJelUzYxAB",
            "text": "Our waiter, Seth, was amazing. He was gracious, sweet, informative, helpful, and made our experience so nice! Had my birthday dinner with my girls and it was so fun! Food was also sooo delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM2JVbGpUSFl4YjNCQ1pGWmhZbVpJT0ZweVFrRRAB",
            "text": "I want to thank all the staff for making me feel welcome and providing the best service.\n\nI went on my birthday, alone, sat at the bar and Brian took such good care of me. He designed a drink just for me, a virgin mojito.\n\nEver since, I’ve referred friends and visited with friends because\n\n1. I love the food\n2. I love the ambience, beautiful decor and music\n3. I appreciate how amazing the bartenders, chefs, & servers are, I look forward to more drinks and great times at this amazing restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYS1ocnVnaTh5ZGdRRRAB",
            "text": "Carla was amazing and provided spectacular service throughout our dinner. We were celebrating my father in law’s birthday and it couldn’t have been more perfect. The food and drinks were tasty, delicious and better than we could have expected. The octopus was soft and succulent, the red snapper was crispy and moist, short rib was tender and spiced perfectly. Everything was a la orden y perfecto!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYWJITkRYMFJRUldWT09HOXZhblZrV0ZKaFdWRRAB",
            "text": "Visited the site after seeing it on my socials media page. It boasts a small and intimate setting. The food and service were above expectations and the drinks were made to perfection. Though a bit on the pricy side (at $120 per person on average), it’s well work the visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM09GbExTRjlDTW1oV2FqZGtiamMwYTFjelUxRRAB",
            "text": "Cute spot , loved the food and vibe . Took away a star because it’s not much space and i  felt like i  was bumping the guest next to me . Took another star because our waiter tried to get over on us . Tip was added which was fine . We paid half in cash and the other half on card . He over charged the card to keep and tried to pocket the rest of the cash . Once we mentioned it , he tried to backtrack ! I did Not like the dishonesty . Other than that , the food was delicious ! Def get the lobster fried rice and the seafood on fire ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cek0wdHdTSGg0YzJaeGRVMUhTRnBPVUdod09IYxAB",
            "text": "Absolutely gorgeous place the atmosphere is amazing and the service is superb Carla our server was super nice and helpful. She was knowledgeable about the menu. The music was chill and the FOOD 10/10."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNGRuaEJhRkZMWDA0dE9VTnBiVE5uVDBwalZIYxAB",
            "text": "Went here for a birthday party and it was a party of about 20 people, which was probably too many for this place since it’s small but they made it work. There was a prefixed menu for the party and the food was decent - dessert was the best. The experience was amazing and the staff were amazing. Would definitely recommend for a date night or for parties of 8 or less."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdGVEbGpOVzF6Y0ZaVmQxVkhVek5NU2xKTFZWRRAB",
            "text": "Carla was sooo amazing, she made my entire experience worth while. Ive been wanting to visit for some time and the food and ambiance did NOT disappoint!! Literal food orgasms -the menu was so well crafted. I’ve traveled many countries and to think that a place in my own hometown -the Bronx- would hit the way it did ❤️ I’m just at a lost for words. New favorite place!!!! I’m trying everything because the chef did not disappoint."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kd1prbzBSRTlhVFc5dFZWODNXbmxaUjFkV2FGRRAB",
            "text": "LOVE!!! What a wonderful experience!!\nDrinks were great and food was just amazing. Service was excellent. Definitely recommend & will be returning. See you again 👍🏽"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneDkyemhnRRAB",
            "text": "The food and service was good. Elizabeth was very nice and attentive. The food was good but I wish they were bigger portions. I liked that the food had a blend of Asian and Dominican. The Samoas were amazing. The music and environment were great.  The place is very picturesque and social media worthy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeU1GZHdTWFp0TjB4MVIzTjZkeTFzYzNGMlNIYxAB",
            "text": "Amazing! Carla, the server, was incredible, she was always attentive to what we needed, very polite, and super friendly. Loved her. Food was great! My personal favorite the Duck confit tortellini. The dessert, the coconut one W O W! To die for!! Drinks, my husband ordered the Margó and he drank it like juice, so delish! Mine was Forest Fire, not too spicy, with a kick of spice. Loved it! Definitely coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25semJWWktkbTR6YlRVMlZXNVVSM1Z5ZEVkVFdtYxAB",
            "text": "Dioni was our server, provide great recommendations on the menu! Food was espectacular! Drinks were strong and tasted amazing!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdzZhd3VnRRAB",
            "text": "The food here is amazing! We had the lobster fried rice, the seafood, mofongo dumplings, octopus, empanadas…everything was really good. The drinks excellent. The atmosphere is very beautiful and waitress service was good. The only downside to this place is that weekends they book a lot of parties and we had to wait a while for our table. It’s a small spot and it felt overcrowded. We also felt rushed to order because they were trying to free up tables, being that people were standing around in tight spaces waiting. Oh and you must have a reservation to go on a weekend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvME1ESW1nRRAB",
            "text": "We used to come to this spot back when it was Mamajuana Café, and we were drawn to the unique concept of Dominican-Asian fusion. Unfortunately, the recent changes to the space and experience were a letdown.\n\nWhat was once a spacious and lively venue now feels somber and overcrowded. The tables are packed in too tightly, making it hard to feel comfortable while dining.\n\nService was disappointing. They seated us without even providing menus at first. When we finally got them, they had clearly been used by another table and were just passed back to us, which felt unhygienic and careless. The staff didn’t offer any recommendations or show much attentiveness throughout the meal. To top it off, the tipping process at the end was way too pushy and came off as rude.\n\nOn the positive side, the octopus dish was delicious, easily the highlight of the meal. The lychee drink, however, was just okay and didn’t stand out.\n\nOverall, the experience was underwhelming. Not terrible, but certainly not memorable. I don’t see myself rushing back anytime soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYnk5cXVKX3FEa2RnEAE",
            "text": "Food and drinks were delicious. The decor is beautiful. Our server Pablo went above and beyond. We will definitely go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLakgtc0RLdmJhbXpnRRAB",
            "text": "10/10 experience!! Pablo was an amazinggggg waiter, very knowledgeable on the food and with the most amazing recommendations. Bokagua exceeded every single expectation I had, I look forward to coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM05FaHpVMnhIT1ZjdFRXRlJSVUZ3UTJWbVIxRRAB",
            "text": "I’m in love with Bokaguá\nAll hail to Chef Paulette Tejada for her Asian- Dominican fusion food creations that are absolutely delicious and captivating. I appreciate all the attention to detail, the precision in the food presentation and best of the quality of the food is 👌🏽\n\nJust know I’m even more proud to be Dominican because of this restaurant. Talk about good representation, this is it!\nI really wish you guys the best & many years of service ✨\n\nFood Review: (1-10)\nKorean fried chicken Wings: 8\nMofongo Dumplings: 9\n( all because I ran out of pork but it’s a 10 😂)\nLobster Fried Rice: 10 👌🏽perfection\nSlow Cooked Crispy Octopus: 10\n(I love how meaty this is and paired with the rice is just so good to me)\n\nDishes I plan to try on my next visit:\nRed Snapper, Oxtail Samosas and Fire Grilled Shrimp\n\nCocktails: 1-10\nOld Fashioned 10\nLimonada Coco 7 (sweet)\nBachata En Fukuoka 8\nMartini en Boka 10\nLychee Yuzu 10\nTamarind Mojito 8 (sweet)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQQ2I1NXlQbWZIZ1RREAE",
            "text": "The food, atmosphere and decor are outstanding 🙌🏼 I am Dominican despite my married name - I can tell you 100% the food was beyond delious with a creative twist.   If you are expecting your average bodega deli cooked arroz con pollo, please keep walking - this is a dominican/asian infused restaurant - not El Fogon !  As a latina, we need to support each other.  Especially a business like this; that goes above and beyond in every way.  I dont understand how anyone could leave a poor review.  We dined here for Mother’s day.  They had us pose for a table photo and before we left they presented the photo beautifully printed in a wax slealed envelope!!!  They also gave all of the Mothers a rose at arrival.  Gracias Bokaguá for a Mother’s Day I will never forget 🌹"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFZEUldRM0F6Y21Ga05FSk5jSEZVZVhKNWVsRRAB",
            "text": "Great food, ambiance and service! Dioni was super helpful and attentive throughout our dining experience. Also LOVE the playlist; would definitely recommend for a date night"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3ZmRFlREAE",
            "text": "Had a girls’ night here and loved the vibe! The decor is super cool and really sets the tone for a fun evening. It was a bit on the small side, but that didn’t interfere with our experience at all. We each enjoyed our drinks—loved that they came in different, unique cups. The short rib was absolutely delicious—perfectly cooked and seasoned. Everyone at the table was happy with their meal. It was a little pricier than expected, but no regrets. I’d definitely go again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSFdqQnVMVUpQUlZoSkxWbDBVa3g2YldweVduYxAB",
            "text": "Mi had the lobster friend rice and it was amazing. A lot of lobster in the dish. My only concern was that there was no host when we entered and waited some time to be greeted and seated."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOXFDSjRBRRAB",
            "text": "My friend took me out for dinner for my birthday and Pablo was our server. He was very welcoming and attentive to our requests. He doubled check anytime necessary for us to have the best service at Bocaguá. Definitely recommend this place and maybe you get him to be your server. 10/10 experience. Will come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdlBhTVlBEAE",
            "text": "First time here and I should say it was a great experience. The food was amazing as well as the drinks. The appetizer was to die for, truly enjoyed it. Darlyn our server, she was fantastic, informative and sweet, really enjoyed having her assisting us through our dinner. Will come back soon!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbkpwckhwbXBHUU9REAE",
            "text": "I have been to countless restaurants, but this one compelled me to write a review. A big shoutout to Pablo for the amazing service!\n\nIn addition to Pablo, the overall staff, food, and atmosphere were top-notch. It almost felt like I was in downtown Manhattan instead of the Bronx!\n\nPlease come and spend your money here—you will not regret it! I give it 10 stars and I will definitely be returning."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcWRWUk1OM2N6V1dWR1FVRk5RMDh5WkhBMlozYxAB",
            "text": "Un lugar muy acogedor, música moderna y un servicio excelente, la atención de nuestro camarero Dionis y la rapidez en traer nuestros platos de entrada en la persona de Serling fue impecable.\nLes recomiendo"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaTlyMXZRRRAB",
            "text": "I loved this place the atmosphere was very pleasant and gorgeous and the food was very very tasty definitely recommend. And to add, the service was very lovely everyone was super delightful and friendly. However I felt a little rushed while eating everything was going very fast but otherwise I definitely recommend this place!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLTZxMVl3EAE",
            "text": "The best dining experience Ive had in sooo long! Everything from the drinks, the food to the service is 5 stars. The food was incredibly flavorful and beautifully created. Darlin was our server and she was so sweet and informative. The Manager Carolina will light up your night with her incredibly welcoming energy and amazing personality! So in love with everything this restaurant had to offer, can’t wait to come back! Thank you all for making my birthday dinner so so special!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGM2MkVnEAE",
            "text": "Good was simply well executed, the flavors were cohesive and Pablo’s service was impecable. The only recommendation I have is that for a time limit of 90 mins the orders should be taken sooner, but the restaurant was very busy on a rainy day.\n\nAs a chef I appreciate a well executed fusion along with amazing drinks."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcXJPdDJBRRAB",
            "text": "This my third time coming I brought my girls with me this time around. Our waitress Eric was the bomb not to mention that he became our photographer and he was not annoying about it. The music is amazing which allow you to have good conversations with the people you with,  which for me is very important and I luv the fact is a non smoker place, luv it not your typical uptown loud and hookah madness restaurant, luv it. Very classy which my friends really appreciate it. I really enjoy the food, honestly in my opinion the food is top notch. The flavor of the food is amazing. The drinks are so beautiful made that even if you don’t drink in my case, it would make you to still try it. Overall I recommend this restaurant to everybody. Ohhh!! And the place is beautiful 🤩 decorated, the vibe and the environment made the restaurant the perfect spot for a date. 10/10 Luv it!!🦋🫶🏽"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGREZVVBEAE",
            "text": "Place was beautiful, the food was delicious.  Dishes were very tasty and it does accomplish the Latin/Asian fusion really well! Our waitress Karla was knowledgeable, nice and efficient.  Overall had a great experience and we would like to return for dinner!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnNyaFpREAE",
            "text": "Came with my sister after work. Sat at the bar with my sister. Food Blew our minds. It was an experience. The vibe, the food, even the service. Elisa was out bartender and server. She was so welcoming. We plan to come back prepared to stay longer and enjoy. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kS1pqbFVTMVZ4TFVjNVoxbE9jVzFuVHpoWVJHYxAB",
            "text": "We had an amazing experience with Carla! Our group was a large party of 12, and she handled everything flawlessly. Carla was incredibly attentive, organized, and on point throughout the entire meal. She even brought out a birthday cake, which made the celebration extra special. The service was top-notch, and thanks to Carla, everything ran smoothly. We will definitely be coming back!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVHJ6ZkNyeXItOFdREAE",
            "text": "Tienes que preguntar por Elisa desde que llegues al lugar, tuvimos una mala experiencia con la reserva la chica que la hizo no agendó el día correcto pero gracias Elisa   tuvimos una excelente experiencia del restaurante, nos conoció nuestros gusto con solo ordenar el primer trago. Querida Sigue así con tu excelente trato… sin ti la experiencia no hubiera sido la misma."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZjJ6Y1hIbnR2Z0lnEAE",
            "text": "Pablo was our host for the night and he was amazing, always checking and making sure everything was to our liking. The decoration it's modern and beautiful. Music upbeat and entertaining. Perfect for date night. Definitely try the lychee sangria."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJU093ZHl5cnR5LV9nRRAB",
            "text": "Wonderful ambience and decorations, drinks were fantastic in nice presentation, it’s just that the food didn’t live up to the expectations we got 2 small plates and 3 large plates for 3 people, portion smaller end but still overall a great place for a date or grab drinks"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcUtHdFpnEAE",
            "text": "I loved the ambiance!!! This place feels like a very upscale NYC restaurant away from the city. Food was amazing and Elizabeth was wonderful as our bartender and server. She made my experience so special! She made me every drink on the menu with tequila! She was the best. Love love this place!"
        }
    ],
    "reviews_count": 93
}