{
    "name": "El Economico Restaurant",
    "place_id": "ChIJ2yqw9pbzwokRIRRNfHVb3tw",
    "grid": "BX8",
    "address": "5589 Broadway, Bronx, NY 10463, USA",
    "rating": 4.1,
    "user_ratings_total": 445,
    "phone_number": "(718) 796-4851",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNGVrUmlOREUwU0hORVJGbFVVMXBoTmxGeFZrRRAB",
            "text": "One of my favorite places in the bronx"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R1UwNVRZVjl2V1c1d1dreHJNRTB4UmxNeFVHYxAB",
            "text": "Great food I had the codfish (bacalao) and my boss had the goat stew\n👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWWMzZGhOMU4xWDNSNVN6RjVUMDl6WldwSE5HYxAB",
            "text": "For the past 14 years I knoe this restaurant, the food always has been good."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMGRWUTVVWFExWVRWRVpHYzFZME42TTNGMVFXYxAB",
            "text": "Muy buen servicio , el mejor sazón dominicano, mencionar que la cajera Larissa es muy simpática y tiene buen servicio al cliente , recomiendo 100%"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1EyZHhZV0p6VkhwelMyZG9Na0p3VlhsS1lsRRAB",
            "text": "I am ashamed of this restaurant, cause I never had a problem and today I had a problem. I ordered a whole chicken with green plantains. I told the lady that they gave me small container of green plantains which you didn’t even have a whole one of plantings and I call back she had an attitude, and I told her that she didn’t have to have an attitude that she needs to explain to the customer What they’re getting, and I felt that that was wrong"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdFF6Y3dXbkJ1VDFwRk4yZFZhR0ppZUhneGJFRRAB",
            "text": "Yo ordené chicharrones con tostones ayer para cenar. Los chicharrones estaban sobrecocinados, secos y no sabian para nada fresco. Los tostones estaban latigosos y bien malos. Fueron hechos con platanos congelados y no platano verde. Todo estaba tan mal en la orden que toda mi familia está con el estomago malo hoy y dando viajes al baño. Sean mas cuidadoso con la comida que ustedes le envian a la gente. Cuando uno compra en persona ellos hacen los tostones al instante y uno los ve. Cuando uno ordena para delivery le envian lo peor porque uno no ve nada. Una vez yo ordené para llevar chicharrones con tostones. En vez de decirme que no tenian chicharrones me pusieron pernil en la orden. Me di cuenta al llegar a mi casa porque no revisé la orden. Si piden para llevar revisen su orden antes de salir. No vaya a ser que como a mi le metan gato por liebre. El servicio de comida es algo que debe tomarse en serio y tener mucho cuidado."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZUM5Y2pOejRtNU9BEAE",
            "text": "Very friendly staff and very good food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvX3ZEcm1nRRAB",
            "text": "Very unpleasant staff, they talk about you right in front of you especially when they realize that you don't speak Spanish. They act like gate keepers when ppl of non spanish decent come in to their establishment order food. They will talk…"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyZ1plUTZ3RRAB",
            "text": "I recommend all dishes.  I've tried numerous dishes n I like them all.  Love the food n the ladies that work there are nice n friendly. Thank u always fir your service n your food.\nI order all the time from here.  I recommend,:)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cjhESXhRRRAB",
            "text": "Stop here to get food here i would not normally stop at a place like this it's it's borderline bottom of the barrel the food was edible a bit bland and the service is mediocre wouldn't recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN09pVEhREAE",
            "text": "Very Rude, Very Racist. Used to come here as a kid and now I won’t be going back because of the horrible treatment. If I could give a -5 as a review I would."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaWRUd1ZREAE",
            "text": "La comida es buena pero lo malo es el servicio porque pides una cosa y te dan otra ,si compras en este restaurante revisa tu orden antes de irte para no llevarte una comida que no has pedido"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdHRyRlV3EAE",
            "text": "They are extremely racist. They take Spanish people's order before anyone else. I waited patiently to get my ticket for chicken. They lady sith the red hair then took the order of a Spanish man that just walked in. Then she serviced another Spanish man after she told me to wait. A black man paid for his food and was there before me and she didn't even attempt to give him his food. She continued to serve everyone around us. I ultimately left and went where I am a valued customer. I live in the area and never experienced utter disregard like I did today. I don't recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYakp2SmxRRRAB",
            "text": "The food was bland. It made me sick, and I wondered how fresh the food was. I ordered rice, beans and rostiserriee chicken. The mojo sauce seemed old as well…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeS1qY1VBEAE",
            "text": "They only Cater to Hispanic people not African Americans I was standing on line and the lady acted like she didn’t see me ! When I spoke up and said something she told me someone else would take my order, when the customer was standing behind me. This has not happen once but a few times ! Everyone should be treated equally. The lady at the register told me that she said “ next “ in Spanish . When I was looking right at her and she never said anything she made eye contact with me once and then looked pass me. I’ve been coming here for years and I won’t be coming no more"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dExfSmFBEAE",
            "text": "Comida buena"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdTVPR0dREAE",
            "text": "Buenos precios"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMX2RiSjF3RRAB",
            "text": "I ordered some pork belly(chicharon) and asked the lady who took the order on the phone to make them crispy. I also ordered a side of Yucca. When I received the order, the chicharron was burned. It was basically inedible. I guess they understand crispy to mean burned. The yucca was also bland.\n\nNote for the cooks at this restaurant:\n\nCrispy refers to a crunchy skin while the meat remains tender.\n\nPlease to the staff at this place try to understand your customers needs and if you are not sure ask questions. I’ve never met anyone who likes their meat dry and hard. It’s just common sense.\n\nBy the way when the food arrived it was cold.\n\nWhile I threw most of the chicharron away, a family member ate a few and got sick from it. Luckily it wasn’t that serious.\n\nI think these people need a food inspector to check in their restaurant to make sure they are following hygienic protocols, because I don’t think they are.\n\nSo please beware, many people have die from eating contaminated food.\n\nPlease say NO to average and below average food!!!\n\nWe deserve better!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNEpqc3hRRRAB",
            "text": "Small restaurant, lack waitress service. But overall thename speaks for itself"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMHVXdV9nRRAB",
            "text": "Buena comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENXJpREFnEAE",
            "text": "This place has good food and is very inexpensive. A single plate of food with a side of beans, can cost you as little as $9 and the double order of food can. Be as little as $15 this order comes with a plate filled with meat and another filled with rice. With a side of medium beans. Which is enough to feed two people. They sell constantly so their food is always fresh. No matter what time you get there. Enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bThyN3dRRRAB",
            "text": "Good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MWVqcUNBEAE",
            "text": "I have visited this business since my childhood. My uncles, parents, and all my relatives used to eat here after work or on their days off, either dining in or taking food home. We never had issues. The women working at the counter were always friendly, always smiling. The same when paying at the cash register. But I don't know, in recent years, they have changed ownership, I suppose, and the staff as well, leading to a drastic change. The people there, especially those working at the front, always seem busy. That's not the problem. The issue is their attitude. They look at you with complete disdain if you're not from their country. And even though I'm of a white complexion, it's not that big of a deal, but just for not being Dominican, I would say, they have a very arrogant attitude. And if one complains to the person at the cash register, total support, I think they cover for each other. The customer service is terrible, terrible, terrible. How do they expect someone to give them a tip with such an attitude? And they don't just expect it, they demand it, that's the worst part. I'm giving it one star because that's what it asks for, but honestly, this business doesn't even deserve one star. Moreover, people are even drinking at the counter. That never happened before. This business is going to fall soon. I'm warning my family and friends not to go to this place because the people are rude. Lately, I've noticed that the food is coming out disgusting. Zero, zero stars, I would say for this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkajZDMl93RRAB",
            "text": "Bad service. Drunk people. Cold food.\nI used to visit this place every day when I lived around the area for their goat stew. Visited yesterday and surprised how badly Their quality went down, food was grimy and the meat felt like rubber. I used to love this place, but it’s now lost its Latin cuisine magic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkM3NTMEJREAE",
            "text": "Today my wife and I decided to come into this place had come many times with no problem, until I companion my wife she was trying to order but it was too much interruption couldn't get a chance to place my order, until the cook came out the back with a metal tray filled up with cooked whole chicken and while my wife try to order the cook made a disrespectful comment I was behind her quietly observing the situation he had told the female employee to feed her right away she looks Hungry and kept repeating the same word until I jumped into the conversation and told him off and we had walked out of that disrespectful place. I will contact the food administration to file a suit against your cook for prejudice and races I will ensure that your place will be investigated."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLTVYOUZ3EAE",
            "text": "Food was really good. The women there are very nice and funny."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0OE5uR1h3EAE",
            "text": "Everyone here is friendly.  Even the customers will send a smile your way."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4LXNyR2R3EAE",
            "text": "Good service. Gets full. The food is good. Usually a different menu every day. Good place to hear music and have some beers."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCN2QzNmZ3EAE",
            "text": "Very good spanish food I love it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb191aWVnEAE",
            "text": "Good food, good prices"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN1pmWmFnEAE",
            "text": "Muy buena perfecta"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGa0tqRWV3EAE",
            "text": "Not like it use to be.when the lady is not there in the back the fried food, no Bueno. Siempre overcooked. 3rd time in a row this happens. Sooo disappoin!ted because this was my favorite spot. How do you overcook chuletas is beyond me\nSMFH !!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGelpyLXhRRRAB",
            "text": "Expensive but worth every penny"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dmJpTlV3EAE",
            "text": "Excelente"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MGVXN01BEAE",
            "text": "No es un restaurante para comer dentro. Sugiero que se compre comida para llevar. Hay que remodelarlo. Es estrecho e incomodo. La comida es deliciosa...pero el servicio si decide comer alli no es bueno."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeHNxVnpBRRAB",
            "text": "Been coming here for over 20 years and the food is just as delicious then as it is now. Great prices and service. It’s the best of Puerto Rican and Dominican food. Try it, you won’t be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMXBIR1pBEAE",
            "text": "This little mam and pop joint lives up to its name, the food is great and so are the people...everybody in the neighborhood knows that this is where you go...not that other place...pick up when you get off the 1 train, or get it delivered, or sit down and have a nice meal with a cold beer...nothing fancy, but everything you need"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweTk3UVpREAE",
            "text": "A smaller Dominican restaurant  yes they have seats to eat in,  if you'd like,  but this isn't a restaurant like that to have a date. It's a smaller place with good food,  I usually just pick up to go or call it in for delivery  The food is good Dominican food  One of my go to's when I'm in the neighborhood  I've had different dishes from them and they've all been delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNTV6emdBRRAB",
            "text": "Amazing great food and environment and take out services are great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKX3A3aUNBEAE",
            "text": "I went restaurant yesterday and ordered Civo with rice and ganduales. In person my lunch plate was large bones and cartilage.\nThen gave them a second chance tonight because the Chivo is amazing, they closed at 10AM even though Google and they approved 11PM close. I traveled and wanted a great dinner and they let me down. Great inconsistent restaurant,  socks because it used to be incredible value and nice people. Maybe they are too busy to remember why they are busy and living on the legacy of used to be great food and service.\nI won't return for 90 days, let them figure it out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM3BpZ01nEAE",
            "text": "Nasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MEpxNXBnRRAB",
            "text": "El Economico Restaurant employee tried to over charge me for a small plate with a few sweet plantains and little bit of pepper steak for lunch, instead of charging $7 to 9 dollars she mentioned to me that she has to charge me $17.50 for small plate. That is a highway robbery."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcHBtOU9REAE",
            "text": "This was a great place! As the name suggests, you can eat a lot for a great price. Everything was so savory and authentic. I found the seasoning salty, but I normally eat low on salt, so just be aware that this is how Dominican food usually is. They have a wide menu selection and everything seems to be cooked right and fresh. Highly recommend this place!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcDVxM1R3EAE",
            "text": "Wonderful inexpensive real Dominican food and ambiance. Love the food, the counter top seating (although there are tables in the back and upstairs), the drinks (fresh orange juice, coffee more like an extra large expresso... for less than 2.00$..take that Starbucks...ice cold Caronas with the slice of lime). There's all kinds of delicious food; I love chicken and rice and beans. Also the stew. Feeds me for 2 days... maybe 3 for 7.00$  Where can you beat that in NYC? It's always super busy but the noise just comes with the territory; gives the place more flavor. I've been eating here since 1998. Not much has changed and that's one of the things I love about El Economico. I can always count on excellent food at affordable prices. I don't speak Spanish and not once has anyone gotten my order wrong over that 20 year span nor have I ever waited more than 5 - 10 minutes to be served. They even deliver. What's not to like? It's easy to get here situated on the Broadway just shy of 231st St. I highly recommend El Economico."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdWRyczVBRRAB",
            "text": "A staple in the neighborhood for 10+ years. The food doesn't disappoint, offering authentic Latin fare for great prices. Always great for a quick meal."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMmV6ei13RRAB",
            "text": "Whenever I'm in the Bronx, I have to come here! Food was delicious as always and super affordable. I got three beef stew lunches for $7 each. The portions are good enough for me to make two meals out of one. Too bad I can't come here more often since it's an hour away from my home :("
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdHJ6eFVnEAE",
            "text": "The breakfast was delicious and it made my day. Service slow and only if you are a Male they pay attention."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeWIzV0ZnEAE",
            "text": "Yo this place is garbage. The food was cold. The give you small portions. The service is the worst. The waitress was drinking beer and hanging with her peeps when she should of been taking care of the customers.....we weren't the only table she had. If you wanted to hang you should of called out. And she gets upset when we complained about the food being cold. But her peeps got their food on time and hot....dont go here.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZzlleS1RRRAB",
            "text": "Their food is always amazing! My boyfriend loves their chivo, the only thing is that right now they are understaffed and the tables that they claim to clean are always still dirty. I think they should be sure that the tables are spotless after each customer who dines in. Otherwise, great food. They need more employees though. The chef is great at what she/he is cooking!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN0themdBRRAB",
            "text": "If you love a bowl of rice with a side of rice and even smaller side of various sized bones and extra fat and minimal meat... This is the place to eat. I've gotten the goat here twice and was basically given a tin full of rice and a bunch of fat. Would not recommend whatsoever"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOHN6Z1d3EAE",
            "text": "The food here is really good and it’s the best price you’ll get anywhere near the area. I haven’t had any complaints with customer service or anything else and I’ve been here several times. There is better tasting Dominican food in the area but it’s all a lot of more expensive than this spot. Overall it’s good food at a great price."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dEw2SFl3EAE",
            "text": "The food here is delicious. Simply put, damn good Spanish food that Dominican's and Puerto Ricans love to indulge in!!! Tonight I had a Cuban sandwich that was so satisfying that I wished I didn't have to share. You know what I mean? Of course you do. It truly is like home cooking in the best traditions of Caribbean cuisine."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4OE9LamF3EAE",
            "text": "BEST!!! Been going here for years. Delicious food their arroz con guandules is everything! They’re friendly to me because they know me but I can see how some would feel they were not greeted or something. This isn’t some top shelf…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtN2VfMWp3RRAB",
            "text": "Ellos Se Hacen Los Buenos Parece Que Un Personal De Una Tanda Trabaja Mejor Y Atienden Mejor Que Los Otros, O Será Que Los Cocineros Son Haraganes o Te Atienden Para Salir De Ti Rápidamente?? No quería Dar La Queja Pero Al Parecer Y Por Varios Pedidos que He Hecho Están Friendo Con Aceite ViejO, Los Tostones TRASNOCHADOS Los Fríen De NuevO Y Te Lo Mandan Así, Una Vez Llame Para Decirle De Los Tostones Que Estaban Viejos Y El Delivery Vuelve Haciendo Gestos Hacia Mi… Con El Dinero No Se Juega Y Con El Hambre De La Gente Que Está Confiando Su Salud Y Su Estómago  A Ustedes, Hace Media Pedí Chicharrón De Cerdo y Hasta Lo Mandaron Crudo Parecen Que Mandaron Lo Primero Que Agarran Hasta El Hambre Se Me Fue y Aquí Uno Hace Sacrificios Para Conseguir DinerO Y Está Gente Juegan Con Uno…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBN0x2WS1RRRAB",
            "text": "The seared salmon was served on top a salad of fresh arugula, cherry tomatoes, and capers, nicely dressed in lemon vinaigrette.  For dessert, having read so many complaints on Yelp about the cheesecake and/or the chocolate pyramid, I ordered the tiramisu served with fresh berries, and I'm glad I did.  It was very good.\n\nThe over the top decor is worth seeing, and the service was friendly and impeccable.  The waiter, Vladimir, was terrific and could hold a conversation with you in English or Russian, your choice, no problem.\n\nA lot of people have problems with this place but maybe they're not using it correctly.  This is not a fine dining venue with cutting edge cuisine for special occasions.  It's a faded tourist trap (coffee is $8) hanging on by a thread.  Don't expect too much.\n\nI'm a fan of the business lunch--the restaurant is not crowded, the service is good, the price is right, and these plush surroundings are a cool oasis in the chaos of midtown.  And yes, there is the banquette where Sydney Pollack wooed Dustin Hoffman in \"Tootsie\"--you really can't beat that."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNjRqUWt3RRAB",
            "text": "Sabor,calidad,y atenciones....\nBendiciones a su equipo de trabajo....\nFranklin y mayelin,glenny,moreno y mas"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNmRfV0tnEAE",
            "text": "I came here hungry. I was not dissapointed. They made sure to take care of me. I asked for rice and beans with ribs. They gave me a good portion for the price. This in any part of nyc is a steal no matter where you go. Honestly this place could have charged alot more for the quality of food they bring to you. Thank you."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bHBTa2pBRRAB",
            "text": "Placed an order at 2pm. Was told 40-50 minute delivery. I called an hour and 10 later to find out the status of my order. Lady picked up and said the driver didn't know how to get here, that's why it hasn't been delivered. Told her politely why must I call to learn this, she apologized and said the driver will call me to ask me for directions. Told her to use GPS it's 2020, she said he rides a bike to deliver, like if that justifies why he can't use his phone to use GPS to deliver the food. I give them the benefit of the doubt and wait for a call. 30 minutes pass no call, I call back to let them know I havent received a call and I wish to cancel my order that's it's been an hour 40 mins already. She quickly puts some other person on the phone who continues to ask me where is it that he's going to drive I told him dude use your phone's GPS. It's a 12 minute drive, get it together. He apologizes and claims he will deliver it himself by car. Going on 40 minutes since that conversation. In total I've been waiting 2 hours and 15 minutes for a delivery that should've taken 40 to 50 minutes. First and LAST time I order from here. Horrible experience. Food finally arrived. He claims the lady that took the order was new. Regardless get it together. Had I not called I would've been sitting at home like a jackass waiting for my food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLaElTdThRRRAB",
            "text": "Combo # 1 and the pernil is our go to. I can eat the food everyday it’s so good. Reasonably priced and better than El Malecon. I love their rotisserie chicken.I got hungry just writing this review."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcHBha0NBEAE",
            "text": "This is the first time getting food from here..I was in the erea ,they have a restaurant by my house that I go to all the time..so I said oooooooohk ,let's eat . 🤦🤦🤦🤦 My food was soooooo damm greessy .and it looked like I ordered Cajun. They must cook everything in same damm oil. When I opened the bag you can  smell the oil..IM GONNA PASS ON THIS LOCATION .."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncnNfdURREAE",
            "text": "They have really good cuban sandwiches. Alos, the staff is super nice. If you get thirsty while you are waiting, they'll get you a glass of water if you ask nicely. I f you are picky, they're lenient about taking things out or even sometimes substituting things."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdFBHbHFBRRAB",
            "text": "This small mom & pop Dominican restaurant rocks when it comes to roast pork shoulder aka “pernil”.\n\nIt’s my go-to during Thanksgiving, Christmas & New Years Eve for the past 5-6 years.\n\nTheir pernil is always soft/tender & thoroughly cooked, juicy and seasoned very well & the crunchy skin is to die for!!!💯\n\nTheir prices ($) are economical, hence the restaurants name “Económico”…\n\nI honestly don’t always eat there & it’s been a while since the last time, but their weekly dishes I have tried were also tasty & fairly priced…😌\n\nTheir staff may afford to be a bit more welcoming, & their location a bit of renovating (that’s just my opinion) but one thing is for sure - you can not go wrong with their “PERNIL”…👍🏼\n\nBlessings!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aWE3TU1BEAE",
            "text": "Good food, large portions & fast service. The best bang for your buck in the area hence the name of the restaurant. The lunch size plate is enough for 2 meals. I just finished yesterdays leftovers."
        },
        {
            "date": "13년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnN1lESVp3EAE",
            "text": "I stop in here whenever I'm in the neighborhood for empanadas. They make them fresh to order, they always hit the spot, and best of all, they're only $1 each! The service can be a bit distracted and abrupt, but the food makes up for it."
        }
    ],
    "reviews_count": 64
}