{
    "name": "My Kitchen Flavor",
    "place_id": "ChIJgcC-WtrzwokRGIJugJl4XQA",
    "grid": "BX8",
    "address": "269 W 231st St, Bronx, NY 10463, USA",
    "rating": 4.9,
    "user_ratings_total": 15,
    "phone_number": "(347) 821-8089",
    "reviews": [
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVFg1cldoNXBtRFFnEAE",
            "text": "Me encanta, delicioso y saludable!\n\nI love their homemade recipes!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNDRXdlpREAE",
            "text": "Polite service , delicious food and pastries. Will come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3X0piSVFnEAE",
            "text": "My daughter and I came from North Jersey for treatment my dad is having locally and we decided to walk over to this restaurant based on the reviews online and the pictures. It DID NOT DISAPPOINT. The food was so good and tasted like Mamá’s home made food! It rocked so hard I had to video call my mom about it!! My daughter is super picky and I don’t eat out much because I prefer cooking my own meals but I didn’t have much choice with our pit stop being much longer than we anticipated. We did not regret it.\n\nIt’s a clean, well lit, nice cozy spot.\n\nI had oxtails with rice beans and chicken and my daughter had malanga with eggs and fried cheese! Very well made. It tasted fresh because it was! Nothing reheated or just sitting there. If you are ever near here, make sure to make a pit stop here.\n\nThe natural juices were delicious. She had pineapple and I had maracuya!! Yes it tasted very sweet. BUT I also don’t add sugar to anything so anything with sugar will taste super sweet lol. We don’t have pictures because we basically devoured our food 🤣🤣🤣 but believe the hype!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieUl6Y3R3RRAB",
            "text": "Excelente ambiente, servicio y comida."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdEszZnZ3RRAB",
            "text": "Very delicious food, and generous portions. The family staffs are nice and friendly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdV9IQVl3EAE",
            "text": "Delicious food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaHNiSE9REAE",
            "text": "Cute little small restaurant. Bright and clean. Really delicious food. Classic dishes oxtails, rice with noodles, chicken wings, caramelized sweet plantains and my favorite corn soufflé aka corn cake. Fresh juice. Watermelon juice was awesome"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNweTZhd1VREAE",
            "text": "Lets start by saying the moment you walk in you feel like you are home. lovely vibe. Delicious homemade Dominican food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdnIzb0RnEAE",
            "text": "Delicious Dominican Food! They treat you like Family!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKellDNU53EAE",
            "text": "Great home cooked food! Service/staff super polite and friendly. I felt like I was at my auntie’s house, food was delicious just like back home ! I had the mangu with tres golpes ♥️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dy12cmFBEAE",
            "text": "The best oatmeal ive had in years! Beautiful, pick up spot for authentic Dominican Food. presentation, details, the service omg..  They also do catering for corporate, and personal events. they have a salad bar for lunch.. yuuum"
        }
    ],
    "reviews_count": 11
}