{
    "name": "Salvatores of Soho",
    "place_id": "ChIJ82dpUrnzwokRI2qNB26-RBU",
    "grid": "BX8",
    "address": "3738 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 810,
    "phone_number": "(718) 548-7499",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNGVucDZjRVpmVmtZdGJVMDFSV2RHWjE5RlVVRRAB",
            "text": "Food was alright, definitely not as good as I had heard it was. Service was decent. I had the chicken marsala lunch special, it was definitely not what I expected a chicken marsala with pasta to be."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MmJ6UkNWak10VjBkNFIyaGhkMHBrTTJwNGJsRRAB",
            "text": "Sal’s a a real Gem in the community.\nOrdered the Lamb Shank w/green beans, mash w/side order of broccoli rabe. The lamb was so tender & delish.\n\nLove coming here & never disappointed!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVmVraE9OV0kyVXpGd2JWRTRWazF6UjNsbkxVRRAB",
            "text": "Great restaurant family friendly\nGreat pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdExVcHJNMHBSYjBodExWcE1UVjlHUm5kaWFYYxAB",
            "text": "Was in the area visiting from Connecticut and I took my 3 daughters here for lunch. The pizza was phenomenal!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQ01sQjNXVlZxWkc5ME5tbHZjRlJNZUMwNGFHYxAB",
            "text": "Best linguini in clam sauce I've ever had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMllURnlaMHBUWkZKUk5YQjJlRVpRWlRSQlpVRRAB",
            "text": "Great corner pizza joint.  The Sicilian deep dish pizza is fantastic.   Your group better be hungry if you order one of these"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1p6aHRkVWhFUkdaWk16bE1YM1pVY0RoclUxRRAB",
            "text": "Eggplant on a slice and spinach pinwheel. Delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaVkyMU9TWGhCYW01dWVITnRWM2RqZEY5WVkwRRAB",
            "text": "Ordered the spaghetti & meatballs lunch special with capellini pasta and extra sauce with a glass of ice water. The two meatballs were served sliced on both sides of a serving of al dente capellini. A generous portion of extra sauce was served in a separate bowl. Freshly shaved Parmesan cheese was presented in a stainless lidded container. The meatball slices were generous and soft and flavorful. The marinara sauce was thick and flavorful. It was a simple lunch but flavorful and filling. In the past I have enjoyed the exceptional chicken parmigiana, now one of the cheaper entrees on the main menu, and the tasty sausage and peppers. (These are offered with either pasta or salad.) I have never had their pizza which is one of their main items. Salvatore’s of SoHo is a destination Italian restaurant on Riverdale Avenue on the Bx7 bus route well worth the cost."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMFVGbFhlSEJoWlcxWVVWOW5RVVl3YVZWRGNWRRAB",
            "text": "I absolutely love the food here; yes, I am a FOODIE!😉"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVmFuUTJMVGxPZVZwcFluVjBNelJVUTFWTGEyYxAB",
            "text": "This is my local spot and I'm gonna keep going there... but I just need to mention this to the universe: I felt like eating in the night before last and ordered the lasagna and what I was served was just so sad.\n\nFYI, Sal's - \"lasagna\" is not meat sauce, random broken flaps of separately boiled lasagna pasta, and ricotta on a plate with melted mozzarella on top. It was too embarrassing to even mention and whatever it's still food. For future reference, though, it's ok to say \"Apologies, sir, but we ain't got no lasagna tonight. How bout some ziti bolognese?\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFMzUnZZMkZOV2taRFFWZzRkWEo0ZDNCalpFRRAB",
            "text": "This place is fantastic, the food is delicious, and the service is quick and friendly.  The atmosphere is very relaxed, it feels like you're having dinner with family.   I highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdmR6VmZUMjVvZGxsNU4yUnFURWxwTUZSeFYwRRAB",
            "text": "Very bad service and horrible customer service as I didn't  get my order correct 3x"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ2NqUGtRRRAB",
            "text": "Wounderful food."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbVF5Y1NscU9XaGhnRRAB",
            "text": "I'm writing to share an important update to my earlier review of Salvatore's of Soho. Mario, one of the owners, has completely changed my perception through his commitment to customer satisfaction.\n\nLess than 24 hours after my review, Mario personally reached out to me on Yelp and Google, demonstrating genuine concern without seeking public acknowledgment. This immediately impressed me. Mario's private approach showcased his focus on resolving issues instead of seeking validation. Unlike many business owners who publicly respond to reviews, Mario chose a more private approach. This showed true character; he wasn't interested in a public display, but rather in genuinely resolving the issue. It indicated that he prioritizes getting things done correctly and caring for his customers over seeking public validation.\n\nGiven that Salvatore's of Soho boasts almost a thousand positive reviews and a five-star rating, my negative review could have easily been overlooked. Yet, Mario still reached out, demonstrating his active involvement and daily attention to customer feedback. This truly highlighted his dedication to his family-run business and ensuring every customer has a positive experience.\n\nWhen Mario and I connected the next day, he introduced himself as one of the owners, emphasizing Salvatore's of Soho as a family-run business. He explained that a manager wasn’t on-site the day of my visit because he and the other managers, all of whom own the restaurant as well, were celebrating his daughter’s birthday. However, he quickly clarified that his staff knows he and the other managers are on call 24/7. He beautifully articulated that this family restaurant isn't just an establishment; it's their home, and he wants customers to feel the same sense of being \"at home\"—acknowledged, cared for, appreciated, and well-fed.\n\nMario was incredibly personable and spoke with my mother and me for over half an hour, taking full accountability for the issue we encountered. For an owner of a popular restaurant to dedicate such a significant amount of time out of his busy life and schedule to speak with customers he'd never met speaks volumes!\n\nMario listened to our concerns and reassured us about the strong fraud prevention policies for his business and customer safety, though he would make exceptions if circumstances like mine arose. He mentioned that had the staff called him about the situation, he would have made an exception for us.\n\nAdditionally, Mario ensured that sensitive information was always shredded before disposal, as customer confidentiality and safety are top priorities. He also discussed rising prices due to inflation, which is why it was so important to him and his family to have his customers experience an enhanced dining experience.\n\nHe beautifully articulated that this family restaurant isn't just an establishment; it's their home, and he wants customers to feel the same sense of being \"at home,\" acknowledged, cared for, appreciated, and well-fed.\n\nDuring our discussion, Mario emphasized the significance of valuing his staff’s hard work. He expressed that he doesn’t want his employees’ energy, efforts, or food to go to waste because of any misunderstandings. Mario’s dedication to supporting his employees and fostering a positive customer experience is truly admirable.\n\nAfter our call, Mario sent a follow-up text, thanking us for our time and the review. He explained that our feedback helped him and his family improve customer support and staff. He reiterated that he would speak with the employee with whom I had an unfortunate interaction, emphasizing his desire for his employees to treat customers like family and the importance of maintaining high morale. Mario shared his understanding of how negativity can spark a ripple effect, expressing his genuine wish to shield his staff, employees, and customers from any negative influence.\n\nHearing Mario's importance in his business and his genuine desire for the best for his staff and customers speaks volumes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQWHhycFA5dXJTM1dBEAE",
            "text": "Reviewing restaurants isn’t my thing but I got really horrible service here today May 31, 2025 between 6:45pm and 7:30pm. I came in for a walk-in order of a large pizza pie and four beef patties that I was going to take out. It was also my first time here and got a bad impression. First, I had to walk down to an atm to withdraw cash because they said they don’t accept Apple Pay or Zelle transfers.\n\nWhen we finally got cash and placed an order, we had to wait for our order so me and my 9-year old sat at a vacant table where there was no indication that it was reserved. A female waiter with dark brown hair came to ask me and my son to leave the table for another set of dine-in customers. We would have gone out to wait but it was really windy so we had to wait indoors. I felt humiliated and devalued by this waiter. She simply told us to go stand at their already crowded counter where we had to keep moving to permit waiters and other takeout customers to get through. You shouldn’t make your customers feel that way or prioritize dine-in customers over takeout customers. Or you make appropriate arrangements for takeout customers that walk in to have appropriate places to wait."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR3Q0UGZzeS1DTnVnRRAB",
            "text": "I had a good lunch at this place.\nI ordered grilled vegetables with spaghetti with mariner sauce and grilled chicken. It was good, and portions are honest.\nI was disappointed by the chocolate mousse though, which was not tasty."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHZhNWZBEAE",
            "text": "What happened Salvatore’s? You have changed your sauce! I have been a long time customer of yours for many years, and I always said that your pizza and your sauce for all your sauce based items was the best in NW Bronx, and in the top contenders for all of NYC. But something has definitely changed. The color, consistency and taste is a step down to bland. The last couple of meals I’ve ordered in the last month or so I noticed the change. At first I thought it was an “off night” for you, but now after multiple orders, I taste the change, for the worse.\nThere is a classic saying, “if it is not broke, don’t fix it.” This would apply here. Please go back to the classic sauce taste you always had!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGF1R3BBRRAB",
            "text": "Food is good but bad service at the counter, waitres very attentive"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcHRMS0R3EAE",
            "text": "Pleasant"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRenRqYl9RRRAB",
            "text": "I and my family have eaten here several times and the food and service are consistently excellent."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcjhDLXNnRRAB",
            "text": "One of the best pizza places in Riverdale."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDR6bVBBEAE",
            "text": "OMG!! I love! I love! I will return!!!! Thank you"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMS1Pd1ZnEAE",
            "text": "The best food and company."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd2N5aEN3EAE",
            "text": "Best food for the money"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXZxSm1RRRAB",
            "text": "Amazing place. We will definitely return"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNG9EVTRBRRAB",
            "text": "Ordered from here before so I was just ordering again as it was pretty good back then. Today, I ordered spaghetti with meatballs, their capellini alla mario, and fried calamari. Calamari is just soggy, bland, below average. The capellini alla mario is just way over cooked. Soggy and just broken. Very watered down. The shrimp is just bad. Old, and when bitten in, just crumbles. Powdery in short. The spaghetti is the same problem. Soggy and bland. Lacking in flavor. Overall, will not order from here again."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1d2RMcjV3RRAB",
            "text": "I just picked up a large pie from Salvatore’s, despite traveling in 20 degrees temperature the pie traveled well. It was warm,tasty and oh so delicious! The dough this time was more thick and yummy! The cheese and the taste of the dough itself, was consistent in the taste. A great place to dine in or take out!\n\nGreat pizza, as always. The server was courteous and warm, but not extraordinary. They have kept the pizza consistent in quality and taste. I have not dined in since the pandemic, but the food is consistently good. I especially enjoy the shrimp parmesan, it is so cheesy and the shrimps are huge and delicious! Salvatore's is one of Riverdale's gems and if you have not yet tried their food, you should! I just wished they had a bigger space."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdXZISHVBRRAB",
            "text": "A neighborhood institution. Great for dining in with big, delicious portions that will cram your table (try any pasta with the vodka sauce, and the spinach rabbe) and fill your belly.  Amazing pizza every time (go for the white pie with your favorite topping or the meat lovers if you're ready to go to heaven), and great, fast service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcHFyMnVBRRAB",
            "text": "Always a fantastic dining experience. I have been coming here for quite some time and it is a family favorite. Thank you very much for the fresh food and incredible service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueDR1T1h3EAE",
            "text": "BYOB! The large pizza is huge, good for sharing among 4 people. We really enjoyed the mussels posilipo so much that we also ordered the clams. You can skip the garlic knots as they weren’t very garlicky. The service was prompt!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeTVXS2d3RRAB",
            "text": "BYOB!!! The pizza and penne alla vodka hit every time! Great food along with fast & friendly service keeps us coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHBYd0ZREAE",
            "text": "Hands down one of the best restaurants in Riverdale! The food is tasty and good portions. Also, it’s a BYOB so enjoying a great meal with friends and bringing in a few burgles frown the liquor store down the block offers a great meal and you save on the wine! Tremendous and the owner and wait staff are extremely pleasant!\nOur favorites:\nBroccoli Rabe/Garlic\nPasta Primavera\nEggplant Rolletini"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURid0otWmN3EAE",
            "text": "Whole Bronzini fish"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNkpIN21nRRAB",
            "text": "Was in the area and stopped in for some lunch and let me say it did not disappoint. The waitress was so sweet and very attentive. And let’s talk about the food everything we ordered was delicious . Rate this gem 10/10 everything tastes so fresh. Highly recommended this restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMHRYX2dBRRAB",
            "text": "Riverdale gem. You get it all, in this one little place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbk5mQmNREAE",
            "text": "Food was good, service was good and sat outside on a beautiful day. No alcohol, byod."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNC1LNWlBRRAB",
            "text": "Awesome atmosphere and great food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXJpbXhBRRAB",
            "text": "Food is okay, I would absolutely dine-in here rather than go to Bella Notte’s. Hot food is better than most riverdale “Italian” joints. Pizza is ok, if you have no where else to go and you’re stuck on the block"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcXBHcWVREAE",
            "text": "Excellent dishes for a quaint pizza restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmZlYzV3RRAB",
            "text": "Free bread, very tasty, fair prices, recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeW9uTTB3RRAB",
            "text": "Incredible pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeXNUaXpnRRAB",
            "text": "Get the spinach wheel"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd09yazJBRRAB",
            "text": "Is a small but very familiar atmosphere, manager great, service can’t ask for more attention ☺️ employees very friendly very good. And even better you can  buy outside and bring your favorite ❤️ wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NmZLbTV3RRAB",
            "text": "Great pizza . Love it in and outside seating ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ME5MZ2d3RRAB",
            "text": "First time trying Salvatore’s of Soho and I must say, the food was excellent and the service was great. We placed a large catering order for a party and they were on time with the delivery and all the food was correct. The dishes were all crowd pleasers and the quality of the food was fantastic. The sausage and broccoli rabe were a definite stand out with the large chunks of roasted garlic. The calamari was crispy and delicious.  Thanks Sal’s!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNXB1N2VnEAE",
            "text": "Love coming here. Portions are big and the food is always satisfying. First time sitting in for a pizza. Mini Neapolitan and white cheese pizzas were so good. Took two slices home. The ricotta cheese on the white pizza was really really good. $40 w tip."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCelpPbU1nEAE",
            "text": "Great service! I ordered ahead because I had to get back to work, my customer suggested this spot and I’m so glad I took her advice. I found a good spot to park while I ran in, left my car running that’s how much I was in a rush and they…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeElURTVBRRAB",
            "text": "On the top of the hill on the corner this place is  located. Wanted  to try some pasta dishes here,  was seated outside right away then, was handed the menu. Did not really  dine inside; however many guess chose to sit Inside(hot outside) . Staff was directed and simple not really engaging or super enthusiastic but got the job done.Only soft drinks are served here, so people that like wine or spirits with their food  this is not the place.. overall good family environment Manu is not complicated nothing on the menu you will probably  never have not seen or tried will jump out to you at all.."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNWJxZ0lREAE",
            "text": "We love Salvatore’s , it’s the most delicious pizza we ever had in NYC-reasonably priced, cozy family-friendly atmosphere and easy going staff. Summer is the best ~outdoors with Mama Lisa’s favorite or Mario’s favorite And  BYOB... in love...we stick with pizza, never had pasta dishes so I can’t judge."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHb3RHVy1RRRAB",
            "text": "Small Italian Ristorante in the Bronx with excellent FOOD and good service. Mangia, Mangia.. The garlic bread was really good. We ordered the Fried Calamari with Zuchini sticks, Eggplant Parmesan, Veal Piccata and Veal Francese, Cannoli,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdkk3UDNnRRAB",
            "text": "Absolutely horrible service. Waited 47 minutes for food. Owner said people usually just order appetizers. Food came room temperature."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcV9DMENBEAE",
            "text": "Delightfully A Decades Long Tradition Of Consistent Authentic Featured Dishes.  Vinny Is A Hospitable Customer Service Oriented GEM 💎…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkX01USEN3EAE",
            "text": "From the outside, this place does not look like anything special. It just look like a cheap pizza joint, but believe me, this place is a gem in this neighborhood. The menu is vast and incredible good. I've been going to this place every Friday and my goal is to try every dish on the menu. Besides the food and  incredible service, this restaurant let's you bring your own wine, this is a plus. I give this place a 10 out of 10"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGODk3dlVBEAE",
            "text": "I ordered a large salad and seltzer for delivery. I find that they give a lot of food for the money. I ate half of my salad and I have the other half for lunch or dinner tomorrow. I got my delivery pretty quick. They said my delivery would arrive in 30 minutes, but he arrived with my order in less than 20 minutes. I am very satisfied with the food and the service. My experience was great and I will be ordering food there again very soon. I highly recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQtNE1rdRAB",
            "text": "Eggplant roll amazing! Pizza floppy and thin. Staff very nice! I will be back for this eggplants…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWMWNlSHhRRRAB",
            "text": "A great little gem in the Bronx. They have the most delicious Italian food I ever tasted. The employees are so courteous and accommodating and the best thing it's around the corner from my aunt's place. I'm definitely going back there soon! A+A+A++++"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdkw2UHZnRRAB",
            "text": "I waited over 47 minutes for my dinner.\nDinner wasn’t Hot. The waitress didn’t come around to offer a second round of drinks. Place looks unkempt needs a good detailed cleaning. The owner told me that people usually order appetizers while they wait 🤔 so in other words you have to eat more food in order not to wait 47 minutes…."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPc1BENGpnRRAB",
            "text": "Delivery came super fast.  Margarita pizza is missing something I can’t put my finger on it but it just doesn’t satisfy me.  This style of pizza is not my preference (thin flat crust) - but the taste is good, and the quality of the ingredients are excellent!  The taste was definitely fresh - the pasta dishes looks worth a try.  The staff are friendly-  place looks clean and like a great vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NnA3Z0hREAE",
            "text": "Friend  sent me a chicken parm from them. Took one bite and the chicken tasted like old hardened meat. Took a second bite from another section of the chicken horrific! This past summer I went to buy a slice. Pizza was oily and droopy.  When I stated this to them their look was like oh well. Explore another Italian place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZNC1DQ0xnEAE",
            "text": "Great food! I went there for the first time a few weeks ago and it will be one of my go to restaurants when I'm in that Riverdale area. I had ordered the shrimp scampi with spaghetti.. It was very, very good. The menu is typical for an…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvb3NUMkhnEAE",
            "text": "Went for the first time today with a group of co-workers. We had made a reservation because we were 9.  The staff was attentive, courteous and professional.  They kept the garlic pita bread coming as we were ravenous. The food was good.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d3ZDZkt3EAE",
            "text": "Went back here for the first time in about 5yrs and it was so nostalgic! I used the love going to Sal's as a kid / growing up and it was so great to be treated to the same great experience that I remembered. The food is delicious, the portions are great, and it's such a home-y great vibe. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNV9Uc0dREAE",
            "text": "Great local place, staff was friendly,  A must \"stop and get a slice\" place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MFktZ2pnRRAB",
            "text": "This place is best described as either a totally amazing hit or a total miss with both service and quality. I’ve ordered in, picked up and ordered delivery at-least 10-15 times. With the service, there’s a huge discrepancy between the older gentleman working the counter and the younger man. The older man- has this old Italian charm, he is warm very welcoming, sweet and seems happy to be there, will hand you the food directly with a smile. The younger guy seems unhappy, is borderline rude, doesn’t make eye contact and is super short and just kind of slaps the food on the counter. As for the quality, the pizza is either the most delicious thin crust pizza I’ve ever had in my entire life or…it’s extremely burnt to point it taste like ash. Like black burnt, like surprising that they could allow that to go into the box and out to a customer. These experiences are genuinely 50/50 which is why I described it as a hit or a miss."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcXBXcXB3RRAB",
            "text": "I've been here several times over the last year, and have always enjoyed it.  Most recently, i went with my husband and 2 friends, and it was - once again - great!\n\nSpaced out tables for outdoor dining, clean and sanitized, and very friendly service.  Our waitress was so sweet and friendly.\n\nThe menu has many options and the specials were an added bonus!\n\nWe ordered the following:\n\n- Spinach Ravioli in a Vodka Sauce (very tasty and flavorful)\n- Eggplant Parm with Linguine - huge portion and very yummy\n- Baked Ziti with Chicken Cutlet - nice sized portion and perfect balance of sauce and cheese and seasoning.\n\nThey serve a warm bread in the form on wedges with the meals, and it is excellent.\n\nA great experience overall!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNl91ZWxnRRAB",
            "text": "Can’t go wrong with anything here\nPenne ala vodka with grilled chicken"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbllpSTlRRRAB",
            "text": "This place is amazing as always.  Used to live in the area 2 years ago just moved back with my wife.  Went the other night for dinner and it was great.  Walked here with our dog and there where no tables left outside but they had no problem bringing a table from indoors outside for us to sit.  Food entrees where tasty and good portions and great price.  Pizza was very good as well.  We also placed an order for catering for the following Saturday.  We ordered half tray of penne and chicken parm.  The delivery was on time, food was perfect temp.  Everyone loved the food.  Even my nephew who swears he doesn’t eat penne al la vodka came back for three servings.  Prices are reasonable and will def be going back for more great food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ak9hS2FREAE",
            "text": "You can bring your own wine 🍷."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBM2RxSDJ3RRAB",
            "text": "Great place for friends and families to meet for pizza and Italian specialties."
        }
    ],
    "reviews_count": 69
}