{
    "name": "Arnaud Steak & Seafood",
    "place_id": "ChIJq3zJouLzwokRXNa1oSCB4zw",
    "grid": "BX8",
    "address": "5686 Riverdale Ave, Bronx, NY 10471, USA",
    "rating": 4.7,
    "user_ratings_total": 61,
    "phone_number": "(718) 884-8448",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMFRVczFWRlJTVDBNdGVqTTVNRk5OWm05TlVuYxAB",
            "text": "I spent my Halloween night here. In fact, this is the second time I’ve been here. I LOVE when they said welcome back to me!!! The service and the atmosphere couldn’t be better. The raw clams with sauce were delicious and surprising. All the plates were good looking and the experience was amazing. I plan to go there again and celebrate my birthday."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUmNuaFNXblJGVkhaUkxXZDZSRFpwUTJOMGVXYxAB",
            "text": "We had a great time here. The food was amazing and the staff were super attentive. They were nice enough to accommodate our picky little eater. Looking forward to going again soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2JVaG1TVGt3VjJ0RlZHMVlNRWMzTUdWNk1IYxAB",
            "text": "We came here 7/26 for our anniversary dinner. The service was attentive and the food was incredible. The crostini with a dip of rich cream of mushroom soup instead of a traditional bread basket is a pleasant surprise. The oysters were beautifully cleaned and fresh. The octopus with romesco was tender and delicious. The scallops were perfectly cooked as was the ribeye with herb butter. The fries are addictive and the creamed spinach superb. The passionfruit pisco sour cocktail was perfect as well. They gave us the flan bread pudding for our anniversary dessert which was a great texture and not too sweet. All in all, a wonderful meal. The music was also on point all night.\n\nIt's definitely slightly on the pricier side, but the food was amazing and the service impeccable. They should be busier! This will be our go to for special occasions. That being said, there is plenty on the menu that is reasonably priced including the sandwiches and salad. We will for sure be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMVFrcHpMVzFaUmxKUlZGY3ROMlpGVVZCeU1rRRAB",
            "text": "It is a wonderful place. The owners were amazing and helpful in setting up my parents' anniversary. Highly recommend,  as their steaks are delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aR2VIVktNWFptZFRGTWVHSmhlSFZGVDFsU2RVRRAB",
            "text": "We recently celebrated our niece’s bridal shower at Arnaud Steak and Seafood in Riverdale, and it was nothing short of fantastic. From the early planning stages to the final moments of the event, the experience was seamless. The food was delicious, the drinks were excellent, and the staff went above and beyond to ensure everything ran smoothly.\n\nOur servers, Annie and Angel, were outstanding—attentive, professional, and incredibly kind. Alex, the bartender, was equally impressive. Not only did he keep the drinks flowing, but he also showed a level of care that truly stood out. He noticed that my mother, who uses a wheelchair and has upper body weakness, might struggle with a glass cup. Without being asked, he served her ginger ale all evening in a plastic cup with a lid and straw. That small, thoughtful gesture meant so much to our family. Thank you, Alex, for your kindness and attention to detail.\n\nArnaud’s is a perfect venue for any small, intimate gathering. The service, food, and ambiance are second to none. We had a party of 30, and every guest left happy and impressed. Thank you to the entire Arnaud’s team for making our girl’s bridal shower a truly memorable event."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MFluYzBWMUp1YTFNNFpURkZZM2d3VWtaamRVRRAB",
            "text": "Celebrated Father’s Day here for our first visit and we had an amazing experience! Such a nice steakhouse in the neighborhood. Beautiful ambiance, service was attentive and great and the food and drinks stole the show. We started with the grilled octopus and got the filet steak and sea bass everything was excellent. We will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaFdGRjRSRE0xWVhsQ05HNXNVM0pLZFc4M0xXYxAB",
            "text": "We hosted a wonderful birthday party at Arnauds recently. Our guests had a great time and were blown away by the beautiful space, and even more by the quality of the food and drinks. Everyone at the restaurant was so warm and welcoming. Elizabeth was a pleasure to work with in organizing the event and ensured a smooth and enjoyable experience. We would highly recommend Arnauds for events and celebrations."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaGVxSG5BRRAB",
            "text": "This is the most amazing place to go to, I do not like to go to the city its way too much traffic and no parking, I LOVE it here and next door at YUKKA, This place it the absolute best place around for an upscale amazing dinner and a night out!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MElLRTN3RRAB",
            "text": "Honestly from the bartender having a curly mustache to the perfect roasted duck, this place is legit. Its a great add on to Riverdale and I think its here to stay. Will certainly be back. Its one of the few places around here fancy enough for a dinner date or anniversary, yet affordable enough for just a random night out. Certainly will be back. Good job guys you are doing great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbXNQY193RRAB",
            "text": "The food was ok .. I don't feel the need to go back but I would like to give an advise ..  please please hire a real bartender that know how to make drinks..good luck"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbnJpVEt3EAE",
            "text": "I went to celebrate Valentine’s with my husband, and the service from our waitress was exceptional—she attentively clarified all our questions about the menu. I had the grilled octopus and the rack of lamb, both of which were exquisite. The ambiance was perfectly suited for the occasion. Highly recommended—I would return many times."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnc3VMcEZ3EAE",
            "text": "We came here last night for Valentines after eyeing the restaurant for quite some time. The atmosphere was lovely, the host was calm and welcoming even on a busy night and the waiters/busboys were fantastic in presentation and attentiveness. The food was spectacular, a wonderful variation in dishes with exquisite taste. I have to say that this was one of my favorite dining experiences in a very long time. My lamb was cooked to perfection as well as my husbands steak. We had a phenomenal evening and are looking forward to enjoying another date. We very highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbk11eTB3RRAB",
            "text": "Waited 1 hour for escargot and then an additional 45 minutes after that for a steak… asked for an extra drink and it never arrived. We got offered someone else’s food. Our food went to a different table. The cutlery was crusty. Terrible terrible service. Waiter didn’t even give us a name!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZzVYalh3EAE",
            "text": "I can’t talk about this place enough! The food, atmosphere and service were superb! I made a dinner reservation and was seated immediately upon arrival, my table had the porterhouse steak, filet mignon, creamed spinach, and mashed sweet potatoes ( purple potatoes). Everything was cooked to perfection. If you want to celebrate a special occasion or take that special someone on a nice date, this is the spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbk1qeEZREAE",
            "text": "A great dining experience! Very controlled and decorative environment, the staff took care of us with much care and respect!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbU9xS0RREAE",
            "text": "I want to give a big shout out to everyone @arnaudsriverdale, the service was a amazing;  the food & drinks were great, flavorful we had a dinner party of 35 guest & everyone was raving of how delicious everything was.  Thanks to Alex & Annie for serving our guest & to the owners Elizabeth & Eddie thanks for making our evening a memorable, and pleasant one. Maria & Charles✌🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNUszcjZRRRAB",
            "text": "On a Tuesday night we had a party of seven and the food and service was, as usual, amazing. The grilled octopus is a must have and is second to none is the 5 boroughs. The steaks are done to perfection and easily compete with the best steakhouses in NYC. The only thing that doesn't match those fancy NYC places is the price. Arnaud's is much more reasonable then Keens or Old Homestead."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURuOXNkUxAB",
            "text": "Came here for a spontaneous date night and it did not disappoint. My husband and I liked everything we ordered. I especially enjoyed the French onion soup and Mac and cheese. Service was great, I’ll definitely be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucklUNTZRRRAB",
            "text": "Exellent food!!! Unusual and surprisingly tasty choice of ingredients. High-end presentation! Knowledgeable and super friendly staff. All in all a great experience! Will be definitely coming back here to try more dishes next time we’re in the area. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNIek5FNBAB",
            "text": "Fui el día sábado por la tarde la atención de Ani y el bartender (que no le preguntamos el nombre )fue muy buena atención probamos el pulpo, caracoles la tártara de carne, las costillas y diferentes tragos ( lamentablemente no había potter house stake ni tampoco tomahawk ) eso significa que es muy pedido regresaremos para una segunda parte todo está muy bueno excelente comida servicio y ambiente"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMzduTHNnRRAB",
            "text": "We had the Chilean sea-bass with risotto and the hanger steak with creamed spinach. Perfectly cooked and seasoned!\n\nThe vibe is casual upscale and much quieter than the Latin bistro next door. A welcome addition to the Riverdale restaurant scene."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyay1TdXVBRRAB",
            "text": "I love duck. I have had duck so many ways in my 50 years of life and Arnauds makes the best duck I have ever had. This is not an exaggeration. I thank God for this place in Riverdale!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc19QdHVRRRAB",
            "text": "Loved the Lamb Chops, Filet Mignon, and Bacon Macaroni au Gratin! Also, try their great varieties of mixed drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaGVmUTF3RRAB",
            "text": "From walking in, we had such a wonderful experience. Alex goes above and beyond. He suggested great desserts! Annie was such a great server. She asked us about our allergies and made sure we were accommodated. The bartender Omar was so helpful and accommodating. Overall best restaurant experience. Thank you to everyone here for making our family celebration special."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOW91TjlBRRAB",
            "text": "I took my mother here for Mother’s Day and the food was phenomenal and the service was even better I highly recommend this place for those who are looking to try some place new"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdXByakZ3EAE",
            "text": "I went to dinner for Dine out Riverdale after a Broadway matinee. I thought I would support the local restaurant instead of eating in Manhattan. We had to flag someone down for water. The ceviche was tasty. However, I ordered the duck breast. I am accustomed to having it medium rare with a crispy skin. The plate I received was not that. The breast was gray and unappetizing and the skin was a flabby slab on top. They asked if I wanted a different entree l decided against it since my husband was eating his food. They never asked if I wanted another glass of wine. We decided against the dessert from the prixe fix menu because I did not eat dinner. I was charged $22 for my appetizer instead of the $50 for the prixe fix. The manager did not come to our table to give an apology. Not very good customer service and not so great food for the prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUME4ya1pREAE",
            "text": "Great food and fantastic service. Had escargot and Branzino.  Was delicious. Will go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdllyM29nRRAB",
            "text": "Stopped in for dinner the other evening. Everything was what one would expect in a fine dining spot. Compliments all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMExMbzFnRRAB",
            "text": "Amazing place to have a meal at when in Riverdale!  A must go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMmQ3MnF3RRAB",
            "text": "No website? No Yelp page? Doesn’t open till 4. Places like this are annoying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkd3JqcGZREAE",
            "text": "Loved it!! Highly recommend that you get the red wine reduction and slather everything with it. Wine and cocktails were also top notch. Really excited to face such an amazing restaurant in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMEp2Q19nRRAB",
            "text": "Elevated yet relaxed\nExcellent food\nCame in late yet they were very accommodating\nWill have to come back\nAnnie a very present hostess"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0N3NPdFh3EAE",
            "text": "My wife and I have now gone to Arnaud's three times.  Each time we've ordered something different.  Each visit has been enjoyable. This last visit was probably the best.\n\nMy wife had the lamb, and I had the Chilean sea bass.  Each dish was served and presented beautifully.  The sea bass had a light brown seared crust, holding in the heat and the flavor.  The lamb had a unique bed of sweet potato, and was ringed with seasoned pear slices.  I made the sea bass disappear, and my wife had to take home half of the lamb as the portion was hearty.\n\nOur drinks were exquisite.  The artist behind the bar built a mezcal / cucumber spicy drink for my wife.  I had bourbon / scotch / maple cocktail that was fantastic - not sweet yet flavorful and enjoyable.  I'll come clean: I had 3 of them.\n\nWe were there for the opening of Arnaud's.  It's obvious that they've ironed out all the wrinkles, listened to customers wants, and created a comfortable establishment with a steak and seafood menu that is unique to the area.  You expect to see a place like this in Boston or Portsmouth.\n\nThe fact that it's here in Riverdale, within walking distance of my apartment is almost criminal.  If that's the case, then I am going to be a repeat offender."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMzVmRWlRRRAB",
            "text": "My husband decided to treat me for my birthday 🥳. I had an amazing time the food was absolutely delicious and the staff was very attentive and professional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROd3QzSE13EAE",
            "text": "Absolutely fabulous food, we had Filet mignon, duck and lamb and all were amazing!! Dessert the same. And the service was incredible, such fantastic waiters. We are looking forward to going back and are thrilled for such a great restaurant in Riverdale"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObFA3WmZnEAE",
            "text": "Had dinner there last night...Food was definitely good had the creamy clams partner had seafood paella both dishes great portions and taste spot on\nWill be back.for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdHFQMXNRRRAB",
            "text": "I cannot stop raving about this experience. Nate, our waiter, was so patient and kind. He really took the time to answer all our questions and check up on us when needed. His suggestions were spot on and I’m so glad we had him.\n\nThe food was amazing. I had filet mignon with bacon Mac & cheese and Brussels sprouts, and my partner had the t bone steak with mashed potatoes. Everything 10/10 and we’re hard critics.\n\nDessert was amazing. I had crème brûlée and he had chocolate cake with ice cream.\n\nNot many people there, as it’s a new restaurant that not many people know of yet.\n\nTo the owners - I suggest working on your social media marketing for the restaurant. It’s a gem and the best way to get people coming is your socials."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcmRhNTd3RRAB",
            "text": "Did not even know this place was here, I live nearby and had reservations at another place but they were overbooked, I stopped in was able to get seated for a party of 5 people. The T-Bones steak was amazing, will definitely be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLWFmUjlnRRAB",
            "text": "My friend had a new year's eve reservation, and the service was shockingly lousy. We waited 45 minutes for a waiter to take our drink orders, and then were told that they were out of several items, including crème brûlée and filet mignon. We never received our oisters and my friend never received her ginger ale or mashed potatoes. We ordered a second round of drinks which never came, and we eventually asked our waiter to cancel the order. He offered no apologies and told us the previous night had been crazy. Not being prepared for a night like new years eve and then trying to justify this horrible level of service is absolutely absurd. Do not give your money to these people, they didn't even try to make things right."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaFlUTS1RRRAB",
            "text": "Went here when they first opened and everything was great, so we were excited to go back for New Year's Eve. Unfortunately the service was so bad I'm not sure I want to go back any time soon. It took almost 45 minutes for them to even take our drink order, they were out of multiple items including filet mignon, and we ordered oysters as an appetizer only to have our steaks come out first after which we said we didn't want the oysters anymore. My girlfriend also did not receive the mashed potatoes she ordered and with it taking so long to get the server's attention, we would have been finished with our meal by the time they came out, so we asked them to cancel that as well.  With all of these mishaps, the waiter was very dismissive seeming like he didn't care and making an excuse that the restaurant was busy the night before in regards to being out of so many items. when my girlfriend ordered crème brûlée and they didn’t have that either, she finally asked for the manager and the waiter was visibly frustrated. The his credit, the manager did try to make it right, covering our drinks and providing a voucher for a free dessert next time, but it will probably be a while before I give it another try. I especially would not want to have that particular server again. I only give it 2 stars because the steak was quite good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdnJyYXF3RRAB",
            "text": "Great restaurant!  Wonderful salmon tartare and lobster bisque. Service was perfect (thanks Nathan!)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMzhUeEV3EAE",
            "text": "The ribeye steak was perfectly cooked, tender, and packed with flavor. The roasted duck breast paired beautifully with the farro, creating a delightful combination of textures and tastes. The overall dining atmosphere was excellent, enhancing our enjoyment of the evening. We look forward to returning for another culinary adventure at this beautiful restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaEtlUWZREAE",
            "text": "Excellent food, superb and attentive service, top notch quality steak at a reasonable price. 5/5."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbTZ2WndnRRAB",
            "text": "All food ordered tonight was very good and tasty. Our waitress Kilsarys was wonderful and very attentive.  I will be returning. great addition to the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbTlQV2h3RRAB",
            "text": "My group was awaiting the opening of this restaurant. Tonight's visit was nothing shy of great. All food ordered out did the next. Our waitress Kilsarys was very pleasant and knowledgable. She also went along with all of our silliness. I will be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsZzlueVdREAE",
            "text": "Had previous experience in the sister restaurant Yukka from the same owners and were expecting the food to be as good. I’am  amazed by the quality and of this food.\nI’am glad to have a place like this around.\nFrom the appetizers to the desert everything was delicious and well balanced.\nWe tried the salmon tartar, octopus, branzino and the sea-bass. I can still taste the flavor in my mouth.\n\nI really enjoyed and my family as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsX3RuVlpBEAE",
            "text": "A definite hit…. Superb cuisine, a chill, sleek atmosphere, with lovely and attentive service…. A whole different level of dining experience for this area. I doubt you’ll find food this sophisticated anywhere in the Bronx and through much of Westchester. Each dish was well conceived and artistically plated. Burrata, tomato and figs was excellent, salmon tartare and avocado - topped with caviar - was extraordinary, filet mignon perfectly medium as requested- probably as good as any superior steakhouse, and branzino as fine and delicately executed as I can remember. We must return and sample the rest of the menu. With food at this level it merits a long and satisfying meal and deserves diners who will appreciate the art and quality of this kitchen. This meal was so good, it was an event."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMnR5WW5BRRAB",
            "text": "Food and service was excellent. I hope the admin reads this review and can update the photo of the menu online.  More business maybe if they can look before they come. 🤣"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsLTdXakNBEAE",
            "text": "What a great restaurant.Worth the trip here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsellxcG9nRRAB",
            "text": "Food, drinks and service was wonderful and thoroughly enjoyed my dinner"
        }
    ],
    "reviews_count": 50
}