{
    "name": "The Johnson Diner & Bar",
    "place_id": "ChIJ40AyFgDzwokR5CAjuSBKlcU",
    "grid": "BX8",
    "address": "3533 Johnson Ave, Bronx, NY 10463, USA",
    "rating": 4.2,
    "user_ratings_total": 119,
    "phone_number": "(315) 677-7665",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNmJqQlRUMGhITTJwc2J6TkliMkpvYkZGcU1rRRAB",
            "text": "We will not be returning. Twice a week regulars was not enough for Peter, the owner. After my breakfast order was cooked incorrectly for the second time, and sent back, I opted to not order anything. Peter felt since he didn’t charge me for food that was cooked wrong and not consumed that a complimentary $3 cup of coffee was too much for my inconvenience. Told my wife and I , “we don’t need customers like you”.\nHe no longer has our business."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSU5qSmFaa2xWV0VSQlUzcDZiWFIyUm01cFprRRAB",
            "text": "Food is good place is clean ample seating area."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFVqWlBlVU5oZGxkS1ZVNXdhR2RyUjNoMU1WRRAB",
            "text": "Food is always delicious. Service is pretty speedy and attentive. Quickly becoming a neighborhood favorite. Just wish the prices weren't so steep. But with fresh and delicious food, I can't complain too much!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNExYWkdUMEpXWkVoSmJYZzJhbGRYVG1OT00xRRAB",
            "text": "Great food, good service and super clean.   Have eaten there several times and each time the food was on point     Great shakes, pancakes and sandwich platters.   A lot of good food for the price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVVpGZHFUVk54ZFRsUlVIbGZTVjlsVjNGMVkzYxAB",
            "text": "Everytime I come to The Johnson diner I look forward to seeing Daniel! By far the best bartender I have ever had! Wonderful drinks and is willing to make drinks that are not in the menu. Daniel is very professional, wonderful attitude very welcoming, he makes my husband and I feel like home. I 101% recommend Daniel. We need bartenders like Daniel wonderful drinks, service and what I call a perfect person.!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSVUxcENibE5MWVd4UFdIRTVUVzFtUjFwaE1rRRAB",
            "text": "Daniel consistently delivers exceptional service. He is the definition of a professional bartender: incredibly attentive, even when the bar rail is full, He made sure my wife and I felt welcomed and taken care of throughout our visit.We always ordered an Espresso Martini, and it was executed flawlessly—rich, perfectly chilled,\nIf you are visiting Johnson Diner, make sure to grab a seat at the bar and say hello to Daniel. His energy and skill makes the whole dining experience better. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM1FXdzBjVFpSY1d3elVISlROWEpJTkRZd1kwRRAB",
            "text": "Great appetizers and egg cream. Wonderful waitress"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVkxWlBiVTlIY21kaWVrcFJOVXRuT1Raak5rRRAB",
            "text": "Always good food ! Good service\nThe dream combo !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMllVNTVNMmd3WW1WUlRYcEhMVFF6WWtndGNIYxAB",
            "text": "Looked nice from the outside, but once inside it was terrible. Cashier ignored us, we waited 10 minutes just to be seated in a mostly empty diner. Sat another 25 minutes with no service at all, not even a hello. The kids even asked if they were being racist since we’re hispanic. After about half an hour, we left and went next door where the staff was welcoming, fast and overall great people. Disgraceful customer service in the Johnson diner, never coming again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201emJGaFpOa2xzTVhoVGEwSTBka3RFZEhkRlduYxAB",
            "text": "I visited this place with a party of 5. As soon as we walked through those doors we felt a negative ambience. We waited too long to be acknowledged and seated. The employees were apathetic. I decided after 40 minutes of inadequate service we needed to get out of there and spend our money elsewhere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ga1NXZDVSbmxyU1dVeVdrWktjbFZSVUZCclRYYxAB",
            "text": "Out go to place for any meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVIweFhWa1pKUkhBNGJEQlJRbTlzVjJGNFZtYxAB",
            "text": "Pleasant atmosphere, good food! I have been here many times and tried different dishes. A 'shout out' to Danny for his stellar service, attention to detail and friendly personality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM2VFZHpWa2wyU0ZOVGRHTXhibmM0VDNwNlltYxAB",
            "text": "3rd time is not the charm..never going back!!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMUl6QlVBEAE",
            "text": "We went back to the Johnson Diner only this time we dined in. Let me tell you, The Johnson Diner is an excellent place for great food and excellent service! Our server, Daniel, was prompt and very efficient.  He checked in on us often and always availed himself to us. What a great dining experience! We have been ordering from this restaurant for some time now and  they consistently provide excellent high quality food, comparable prices and leave you with lasting  experiences. Please give them a try and ask for Daniel, you will be very happy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSalkxTkZVVGwzTUhCd01WSXRaRVJ5TVhjMGFVRRAB",
            "text": "Great food. Omelets and everything we tried were great. Lovely atmosphere. Outdoor dining if you want. Been there about 4 times. Service has been pretty bad. Still worth it for the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab2REZFdaazFsVXpJNGJVeG1VMWRXVW1ReGQxRRAB",
            "text": "The Johnson Diner Bar  is hands down one of my favorite spots in Riverdale. It gives you that classic diner feel with a modern twist—and the food is always on point. My go-to dish is the roasted lemon chicken with potatoes. It’s packed with flavor and cooked to perfection. Their chicken soup is also incredibly comforting and delicious.\n\nWhat really makes this place stand out, though, is the service. Daniel, the bartender, makes some of the best cocktails I’ve ever had. He’s super friendly, attentive, and makes you feel right at home. It’s rare to find someone so consistent and kind in the service industry.\n\nThe prices are great too, especially considering the portion sizes. Unlike other places that charge more for barely anything, The Johnson gives you real value—you’ll probably even leave with leftovers.\n\nPete, the manager, is always welcoming and kind, which says a lot about how the place is run.\n\nIgnore the negative reviews—they seem more like noise from competitors than real experiences. This spot is the real deal, and I’ll definitely be back again soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twamNqQnRUMlZmT1ROV1prWXRiMEphTFZsUFRWRRAB",
            "text": "The food was really good, especially the Disco Fries. The waitress was super nice and accommodating. We were greeted by three different staff members. My nieces and my sister are regulars. They have turned this out of towner into a returning customer."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMlZqSjRUVFZzTVRac2RYZFBaRlJDWDFnMVkxRRAB",
            "text": "Quick question: when you think of ordering from a diner, a salad with tuna salad, what comes to mind? If it's an appetizing mound of tuna atop a salad, then you've come to the wrong place. I ordered a Greek salad with tuna salad on it and was so disappointed when the \"mound\" was missing! Instead, the tuna salad was served in the form of teeny pinky-nail sized tidbits  sprinkled throughout the salad. You couldn't even get a decent forkful of it! For that reason, I won't be ordering from this diner again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MGVHcFBSazVoZURWVFFtNUZTa3hJT0c0dFZVRRAB",
            "text": "Greek themed restaurant with amazing food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TlVIVTNVbEZqWTBOQmRYVmFZekp0TFhoUWVsRRAB",
            "text": "Good food,wonderful service, calm,inviting atmosphere."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcXRUTjhBRRAB",
            "text": "I had a great experience at Johnson Diner! The staff was incredibly friendly and accommodating, Peter the manager made us feel welcome from the moment we walked in. The food was absolutely delicious and fresh! Portions are big and the prices are great. Everything we ordered was served hot and tasted homemade. Definitely a spot I’ll be coming back to!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1drWk1iblEwTjJSc2JXZERTV280YzJ4dWFtYxAB",
            "text": "Came with 3 other friends today and for the third time in as many weeks, we had to seat ourselves and had to ask the owner for menus, water, and service. These owners have no social skills and don’t care. The atmosphere is cold and unfriendly.\nThe food matches the atmosphere. I ordered whole wheat toast with my eggs and I swear that I had to cut the toast with a knife it was so hard.\nThese folks only do a business because there is no competition, but, let me let you in on a little secret. Down the hill on Tibbett avenue (5 minutes drive), you have the Tibbett Diner. You may have to look for parking and maybe wait 10 minutes for a table but all their food is excellent and, at reasonable prices. The owners actually greet and smile at you.\nMy favorites, best pancakes in Riverdale and their Chicken Pot Pie featured on Fridays, is wonderful.\nEnjoy!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbFRVRk1RVlZqYzI4eVdIbHBNV2RaTnpodWVIYxAB",
            "text": "Extremely bad experience. The food was terrible and the service even worse. No one greets you at the entrance – guests have to seat themselves. The waitress (short, Black woman) was unprofessional and very rude. Twice they told us that the meals we ordered were not available. Everything was overpriced for the quality. I definitely do not recommend this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJYUFxX0xJbk9YSlVnEAE",
            "text": "The food wasn't good, and the service was slow. The Diner wasn't busy and the staff couldn't even pay attention to details."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYjM4TExEcktqOERBEAE",
            "text": "First off, let me say that the service here is beyond phenomenal. I ordered online and seamless dropped the ball. Food was waiting over an hour to get picked up after the restaurant closed. After waiting two hours, I went to pick it up, and it was worth the drive.\n\nSomehow, the food was still warm and tasted great. California wrap was tasty, and the wings were great. I will order from this place but not from Seamless."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOR1MtcGk4OGVqOHdBRRAB",
            "text": "The food is awful omelet was overcooked and the home fries had no color or flavor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJM3dxSmI0elAtY19RRRAB",
            "text": "Great food and service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKdlVxX2oyLTlyOUtREAE",
            "text": "Hamburger was very good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveTV6UDd3RRAB",
            "text": "Great place when it first opened, the food was on point and the staff was excellent! In the last few months, the food has declined in quality. Their homefries used to be great, but now it's pretty dry and starchy white potatoes; the eggs are a bit more than \"diner browned\" and are quite overcooked. The downtrend has been sad, I LOVED this place when it first opened and came in and supported frequently! Not sure what changed, but after I went a few weeks ago, I decided it was my last visit :(."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFppOTh3RRAB",
            "text": "Good food nice diner atmosphere"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvck9tWGpnRRAB",
            "text": "I visited The Johnson as a couple on a Saturday midday time. It wasn’t very busy which should’ve made for ease of customer service being the day before Easter weekend. They didn’t even decorate the place. We sat at a table right near the counter so you really can’t forget us.\n\nOur waitress was a young twenty-something brunette who showed no experience or respect for customers. It took awhile to get the food. Which was a rib-eye steak & grilled veggies. The other was eggs. We were never asked or enticed to order anything else. When we felt we’re done we asked for the check.\n\nPeter, the owner, was sitting at the counter on his PC & our waitress was standing by him. I watched them for minutes just chatting & looking at the screen which looked like it had scheduling going on. You’re a waitress w/present customers why are you there?!\n\nIt took me to have to walk over to them to remind her to charge my card bc she never returned for it. Earlier while eating I even saw customers having to get their own menus bc none was given to them.\n\nThis place is HIT or MISS. The waiting staff seems to be a constant turnover. Waiting staff here seem to be good or bad you never know. I’ll be staying away for a long time until I hear or read otherwise."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvckthM3BBRRAB",
            "text": "The service is horrible. We were seated and had to wait 20 mins before a waitress came to our table to give us the menus. Then we waited another 15 minutes to put our  orders in. Once we received our food the waitress never came back to see if we were okay or to see if we needed anything. When we asked for the check the waitress gave us the check and left. I waiting about 15 mins and then couldn’t wait any more so we just got up and paid. This has happen a few time we tried to see if it would change."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveGI3Y01BEAE",
            "text": "Gyro has good amount of food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaTdpdExREAE",
            "text": "For months, while renovating our kitchen, we used to eat every day at this place and try every meal and option. Without exception, we loved all the breakfast options, which come with unlimited coffee refills."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLXQ3NUtREAE",
            "text": "The service was great. The server was Spanish   She was so sweet and attentive to everything.  A not so desirable lady came in.  She even gave her menu and was attentive to her.  In which that lady with someone else went to complain that she did not help her.  Which wasn't true.  The server was even attentive to her.  I think they were just looking for the trouble.  I hope the manger knows the type of employee he has and did not indulge in that client's behavior and tactic to get a free meal.  I was impressed because I would not have gone near that lady.  She looked like trouble.  Anyway the food and service was good.  A little pricey but good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdUptSGpBRRAB",
            "text": "I've been here a few times and the food and service are both great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NDV5dGpBRRAB",
            "text": "Our server Crystal was fantastic. Such a sweetheart and very attentive. Place was very clean and comfy. Not pricey. Chocolate cake was amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dDQ2WGRnEAE",
            "text": "Just went there for the first and last time. Had a $39 rib steak that was like roadkill- tough, gristly, flavorless. The owner was disinterested when I voiced my concern and was actually rude, said he did not care. A total waste of money. Avoid."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MTl1eFZBEAE",
            "text": "Can’t go wrong with the Bacon Cheeseburger deluxe.\n\nOne of the better burgers I have had in a long time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LXNTQmd3RRAB",
            "text": "Ordered food for takeout from here and it was delicious! I ordered a grilled chicken sandwich on a gluten free bun (like hello???) and it had to be one of the best sandwiches I’ve ever had. The staff was friendly and the atmosphere was so cozy and retro.\n\nWill definitely be coming here again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3NPajVnRRAB",
            "text": "First time here and we love it!  Muhammed was a great server who was friendly and gave great recommendations.  Place was clean and we loved the french toast bites.  Definitely will be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX2ZXcnRRRRAB",
            "text": "Classic NYC dinner.  Super clean, friendly staff, good eggs.  Nuff said."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbW9YM3RBRRAB",
            "text": "Absolutely adored this place. The food was delicious and fast. The service was wonderful. My waiter was a sweetheart, and extremely kind. This is definitely a community diner, lots of regulars come here. I could tell since many customers were greeted by name. Definitely coming back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndGJqeFR3EAE",
            "text": "Food was very delicious. Our server was friendly. Ambiance is very nice, lots of seating."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaW82T0l3EAE",
            "text": "Love the food and service here. Shout out to Muhammad!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdzhhUjNBRRAB",
            "text": "I have eaten here several times and have had fairly decent service. The wait staff us always been polite and recovered well if there was an error with our order. I am writing this review as I hope this will make a change for what I am about to comment on.  While sitting down for our meal on a Sunday morning I witnessed the owner/manager sit down to have food for himself near the host/POS station. While this is not uncommon and generally Ana acceptable practice, I observed multiple issues that are not acceptable and are actually health code violations. As it appears they were understaffed today,  the owner/manager had stopped eating in multiple occasions to assist where needed. He would eat, use napkin and touch his face then go to the POS, answer the phone etc. he treated customers touched menus removed his own dirty dishes and reset the seat. However not once did he was his hands. He then proceeded outside with his coffee after putting on his winter coat with a cigarette in hand. He then returned less than 5 minutes later took his coat off, picked up a receipt off the floor. Then assisted the busser because they accidentally spilled dishes at the table by the door. The owner preceded to grab a bar towel and clean up  the table. He then greeted regular patrons that just entered and touched one of their hands. He went back to cleaning the table and still had not once washed his hands. This entire time there was a huge amount of cross contamination which would have played a very low sanitation grade. I feel it’s important that I post This for several reasons. 1, there aren’t many restaurants in riverdale to have a nice sit down meal. 2, if this is how the owner/manager is performing in front of the patronage, it makes me question how the staff is being supervised and held accountable and how the sanitation standard of the back of house. Please Johnson Diner, do better. I want to be a regular customer at your establishment"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbi1fVmlnRRAB",
            "text": "Popped in for a late lunch/early dinner.  We both ordered omelets- so good, so much food, piping hot, and so reasonably priced!   Excellent service, and staff were really nice and accommodating.  Oh, and the coffee was excellent, as was their chocolate milkshake.  We will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOTk3T1RBEAE",
            "text": "Great place quick bit to eat food was great"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMGJpcTFnRRAB",
            "text": "We had a family gathering today 12/29/24. There were 14 of us. Our waiter was the absolute best. Food was exceptional. He was so patient. He was so professional in dealing with the adults and the kids. We are definitely doing this again. Thank you so much."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NmNQTUhBEAE",
            "text": "Great service. Quick, pleasant and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6X3VmdHRnRRAB",
            "text": "This Diner is just what the neighborhood needed. Who doesn’t love a good diner. Establishment is clean and staff is amazing. They’re vibrant knowledgeable of the items on the menu plus so nice. Went on Saturday maybe a 7 minute wait. It was a beautiful day so I ordered a Frozen Froze with a fat cheeseburger with onions rings. The portion sizes were huge and so flavorful. My partner ordered a omelette with bacon and avocado. We really enjoyed the food the service and having something so close to home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia2JyVFdREAE",
            "text": "The place is comfortable and very welcoming. Thomas our server was awesome he was very nice, welcoming and he even ask if we enjoyed our food and drinks it was great. The food was great as well. For starters we ordered calamari, the seasoned was good, nice and crispy definitely great. I ordered the moussaka which I haven't ate since I went to Greece. Definitely a must it was great the meat the bechamel sauce and the sauce was great, rich in flavor and of course the Greek salad definitely great. He ordered the fried chicken it had spinach and mashed potatoes. He said the chicken was tender and crispy which he definitely liked the spinach was well seasoned he enjoyed it and the mashed potatoes was also good. We tried the raspberry ice tea. Definitely good, homemade and delicious. I had the strawberry cheesecake and definitely rich and creamy and he had the seven layers chocalate mousse cake. He said it was nice and rich definitely a must. Overall the food was great and the staff was also great. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycVA2U1FREAE",
            "text": "I had a fantastic experience at the Johnson Diner Bar! The service was wonderful, and the staff was attentive and friendly. The sausage omelet was on point—cooked to perfection and absolutely delicious. The relaxing music added to the ambiance, making it a great spot to unwind and enjoy a meal. Highly recommended!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNVpPbVNBEAE",
            "text": "Wow! This place is amazing. Their food is really, really delicious! They have a lot of different options and the waiters are all very kind and attentive. They have breakfast, lunch, and dinner foods. It’s all so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqM1BLaE5REAE",
            "text": "Giving a shout-out to The Johnson Diner which recently opened its doors. They have the best latte in Riverdale. If you had a bad experience in this place, that's a shame but so far I have been here six times and the food is great and everyone is pleasant. They have a Faema espresso machine which doesn't miss the mark for a perfect espresso or latte. I highly recommend this place. Keep it moving if you're here to argue. ⭐⭐⭐⭐ ☕"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOGUtb2tnRRAB",
            "text": "Food here is delicious and reminds me of the Diners back in Michigan. The food came timely and the drinks were delicious. The only conflict I had was the buser took the plate while I was still eating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNVpQaUJREAE",
            "text": "If you’re nearby and looking for a place to eat delicious food, this should be your #1 option! The food is amazing, the service incredible, and the restaurant is clean and nicely furnished. I will definitely keep coming back because this is my FAVORITE place to eat in the Bronx!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycHFQdGpnRRAB",
            "text": "The staff are very kind! Shira is great and not dry and whatever D B said! And let me not get started on the food! Definitely will try again. I especially love the frappe ☺️♥️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cm9lRWFnEAE",
            "text": "I had their california benedict with home fries which was good (:!  We ordered French toast bites for the table alongside their fruit mix, which had pineapples, strawberries, blueberries, and it was super fresh ams sweet!☺️💛 The French toast bites were also perfect. Not too sweet, which allowed for the syrup to help carry that flavor <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d3FiYV9nRRAB",
            "text": "Amazing dinner . We had Tina as my server and she was so sweet and amazing . It was my birthday and the Tina and Demetri gave me a free cheesecake and a shot! They were so sweet . The food is hot and fresh and the atmosphere is really nice and chill. Highly recommend this spot and I’ll be back whenever I’m in the city"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNic19DeXJRRRAB",
            "text": "Excellent food served by their lovely staff. Place is very clean, the food is fresh and the menu is varied without being overwhelming. I’ve eaten here quite a bit since the opening and can say that the salads are excellent as are the soups. The Johnson Diner knows their market and they will have a very successful run in Riverdale. Thank you to Sean, Shira and Sydney for the friendly and attentive service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNUlHbTBRRRAB",
            "text": "As someone who has been going to the previous diner, Blue Bay, for years, I was extremely happy to see another Diner come in. I have been to the Johnson four times so far and have been very pleased. The one thing I hope they fix are the potatoes that come with the egg dishes. I always look forward to good home fries and don't really care what style as look as their is some crisp and they are flavorful. Here they are  are soft almost like boiled potatoes with some spices on them. This is an easy fix and hopefully they will change this. Otherwise I am very happy with the food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUc0lLdVRnEAE",
            "text": "UPDATE: just had a delicious beef moussaka and Greek salad, hubby said his turkey burger was delicious. Nice fresh salad and coleslaw. Water pitcher for table had plenty of ice. Service great. A bit slow getting our check because suddenly got crowded but owner jumped in and paying by tap on waitress’s device super quick. Best of all, front padded bench now has tables along it - there was a happy crowd of school kids eating there, enjoying the open windows.\n\n********* (original review below)\n\nWait staff doesn’t list choices, for example, I ordered grilled cheese, “Is American cheese okay?” made me think that’s all they had so I had that - turns out they have other choices (cheddar, mozzarella, Swiss) and I’m not sure about bread choices besides rye because those were not offered up either. I’ve had excellent guacamole with fresh chips previously but today, it wasn’t that fresh and chips were stale. Did not touch the coleslaw because it also didn’t look fresh and, on an earlier visit, a fellow diner said the coleslaw tasted off. The menu is not accurate (oatmeal does not come with cinnamon as promised and the fruit on the waffle is pretty sparse and I thought I noticed something about blueberry compote but that didn’t come. Syrup not great-could offer real maple for an extra charge. Sunday special listed leg of lamb but waitress had to go into the kitchen to ask if they had, and they didn’t. Carver sandwich roast beef listed but not available.) One server was actually running with plates of food then running back to the kitchen (REALLY dangerous for him and others, not to mention nerve wracking for diners trying to relax.) Milkshakes good but don’t come with long spoon (iced tea doesn’t either) or with a wide straw, which you need for a milkshake. Bolognese pasta had a nice fresh scoop of ricotta on top, sauce a bit too sweet but otherwise good. Excellent rice pudding but definitely need more dessert choices because we want to go there often! Nice to have water pitcher right on the table but it’s room temperature so I asked for a side of ice, which quickly arrived in a plastic cup. Wait staff served drinks after bringing food instead of before. Lentil soup really good - would be nice to have a vegetarian soup choice every day. Broccoli was fresh and cooked al dente (good!) and mashed potatoes good. Pancakes good, would be better with better syrup. This review after 6 visits of really wanting to love this place. Finally, because they did not replace the tables Blue Bay had in front (long, padded bench there with wide open windows nice but at a cost), there is no way to seat a group of over 6 - and even in their larger booths, that would be a squeeze if all adults."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMF9XQmd3RRAB",
            "text": "Blue Bay is a tough act to follow but I love The Johnson. The \"updated\" look of a 50s diner is great and everything I've had off the menu has been delicious. I love that they have a full bar. The staff is friendly and courteous. Shira was great. Friendly, funny, sweet and helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUX0ltLXlRRRAB",
            "text": "Classic diner with a classy refresh vibe with nice, new booths and tables. All the basic food choices I look for in a diner, with the added bonus of a bar/cocktail menu. Excellent friendly, prompt service. I loved the Bronx theme art and photos on the walls. It’s great to have a diner in the neighborhood again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybHVPc2FnEAE",
            "text": "This place checks all the boxes. The environment is clean, charming, and welcoming. The menu is eclectic, the food is delicious and comes out quickly. But highest praise goes to the waitstaff, in particular our waitress Shira. She was so kind and helpful, knowledgeable and attentive. She is great with kids, knew exactly when we needed something and took the best care. We’re coming back for the food, but mostly for Shira."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIanRHSVlBEAE",
            "text": "Ordered online, they messed up my order before I arrived and had me wait which is fine, things happen. After receiving my food and returning home I saw that none of my order was right, even the things I paid extra for. When I returned, the owner blamed me for taking the wrong order. After checking that the order was correct this time, the owner began arguing and swearing at me so I left. Have eaten here a few times before too. Food is overpriced and nothing special. Do not plan on returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNnZLc3R3RRAB",
            "text": "Just super.  Very attentive service from Sean, and from the conversations Jimmy was having with the locals who came in for takeout, this will be a place that really cares about its clientele.  My wife and I came in for a maiden visit, and we were just about stunned by the freshness of the ingredients (split pea soup, chicken kabob, Greek salad with falafel).  If you're tired of tired diner food where everything seems to go straight from freezer to fryer, this is the antidote.  And I couldn't have made a better chicken kabob at home, which is the point of redstaurant-going.  Clean, friendly, and happily full of diners.  Long may they flourish!"
        }
    ],
    "reviews_count": 68
}