{
    "name": "Moss Café",
    "place_id": "ChIJj-Dtqb_zwokRYlU6uDe6ya4",
    "grid": "BX8",
    "address": "3260 Johnson Ave, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 638,
    "phone_number": "(347) 275-5000",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM2QwZzBRMVJ4VVdJMlNWSktVakZET0VWSVJHYxAB",
            "text": "One of the better options for clean and tasty lunch/dinner in the area. I especially love the salmon burger and the tofu sandwich."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKd1kzTmxSMHhyTWtWSGFHbDZWM0ZIUkZoWmNXYxAB",
            "text": "Great spot to come to especially in the morning as they have a great selection of breakfast pastries such as their seasonal apple danish (with or without cream), rhubarb danish (warmer months), muffins, scones and a good selection of coffees. They don’t have coffee syrups as everything they make is homemade but they do have other sweeteners. For lunch or dinner, you can grab a yummy salmon fried rice bowl or a generous greek salad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNE5qTjRjMmhuZERkc01EZFRUbWhoT0RkeWRtYxAB",
            "text": "Pretty good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c2JWcDJSSGRhU0RBMFYwd3dOVmxTTW1sUE5IYxAB",
            "text": "Love love love it! Fresh and delicious each time I’ve been there! Highly recommend - lots of vegan and vegetarian options! They’re always so friendly also!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNllXVkNlbGRhTlU1T1YybHdjRlpIZEU0MGIwRRAB",
            "text": "Just a great place for wholesome food, snacks, etc."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsemRUa3plbk5YUkVaUVJIbzVWSEJMUmpjemNVRRAB",
            "text": "Moss Cafe was incredible!!!!! Especially the cashier (Casey). What a delight she was!! Definitely coming back!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWU5reGhjM1poVmt4S01tNDNSRWxwZWs1Q1dIYxAB",
            "text": "Something different enough to be interesting compared to the usual cafe food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNE1VSjFjMlZzVGtSVVVVNUZYeTAwTVVsbVgzYxAB",
            "text": "A lovely cafe with tasty healthy wholesome food, often organic. Lots of vegetarian and vegan options. Great coffee. Friendly helpful staff. A true gem in the community!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUFpWRnNRV3hVTlZSb1dtaFZOVVYwY1VwTGFVRRAB",
            "text": "Had only come here to pick up quick coffee/pastries and finally came for lunch (apple scone was one of the best scones I've had in my life). Service is friendly and professional for sure, but not fast. It took 30 minutes from my ordering for me to get my lunch (veggie burger) while my friend's lunch came out in about 15 minutes.\n\nThat being said, the food was amazing. Her Greek salmon salad was fresh and bountiful. She also had the special homemade ricotta toast with fruit compote which was also delicious! My veggie burger was really, really good, though I wish there was no cilantro in the aioli.\n\nI also got the peach muffin which was just okay (also found out after ordering that it was vegan and gluten free), there was barely enough peach to qualify as a peach muffin as it was only sprinkled on the top. I also got a chocolate croissant and a peach almond scone to go for the family. Croissant was decadent and rich. The scone was good, but again, please don't call something \"peach\" if you are just going to put a few pieces of peach on the top. I'll definitely be back. Coffee is also really delicious, I've had the flat white and the cappuccino."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaU1EWklOMEpwV1dvd2NXd3liMjV6U0d4aVVVRRAB",
            "text": "This was the first part of my bday celebration.  I appreciate every part of this place and the food was perfect.\nIt's not close to the train. But it's a quick and cheap Lyft ride. I forgot a Pic but we had the breakfast burrito, and the sauce on the side was delicious.  Very happy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214QmVITjBhaTF4WVdrdGNsQmlUWHByTWpWTVMwRRAB",
            "text": "Order an ice coffee and scrambled egg with onion, cheddar cheese and brocolli (special today) and it was almost 30$$$. Wasn’t good either. Runny watery eggs and not tasty. Will not do that again. Coffee very bitter. Stick with the pasteries!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWE1qQkNkREYxZFRGMmJGOVVhSHA1ZFU5NU9GRRAB",
            "text": "This morning I asked for coconut milk on my late, by the time I got a sip of my coffee it tasted funny but I trusted they delivered what I asked for—yet it’s not the first time and now I’m sick because of their mistake. I thought maybe the first time or second was an error but maybe they aren’t paying attention. Food allergens are so dangerous."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMWIwUnNOMDloVlRSS1dYQkNRVmRVVUZoVFNHYxAB",
            "text": "Im so happy to write this review. Moss is a delight to go to. Everything is fresh, healthy portions and so delicious. Smooth no bitterness to their coffee, an impressive tea selection and cool beverages. It’s a kosher farm to table eatery filled with an array of food choices to satisfy your palate. I love the kale salad. Some may say it’s slightly overprice, but I see it as I pay the price and receive back so much more. Im happy they are here in Riverdale."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kemNFVldOVGwyWkRSTmJsQlNTbnBsTFV0RFdWRRAB",
            "text": "I have never felt the urge or need to give this place a try, primarily because I did not feel like the invitation extended to me, however I decided to give them a try and let me tell you, the place was nicely laid out, though small.  It was neat and clean as well.  The latte was superb!  The pastries and scones were out of this world delicious and the service was prompt and excellent! I have now been there multiple times and my experience is consistent on all counts. Fresher than StarBucks for sure. If you have not yet given them a try, please do— you will lick your fingers and smack your tongue."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobldGODNlbHA1ZW1kUVlsaHdSR0pEU1ZCbVNGRRAB",
            "text": "Delicious!  Looking forward to going back when I'm in the area"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFl6UnBURVZpTWtoSlJraDBVWHBVTmxWeVJFRRAB",
            "text": "My boyfriend and I frequent Moss Cafe, as he lives in the area and it generally is a great spot albeit overpriced. Today we went to treat ourselves and had a terrible experience.\n\nWe arrived around 1:10 and ordered by 1:25. By 1:55 we noticed that every person who arrived after us and ordered even more complicated food was served first. We simply wanted a pre-made pita that literally only needed heating up with a compote and ricotta on top along with a breakfast burrito containing mostly eggs. How is it possible that my pita came cold and took 50 minutes to be brought out?\n\nI may not be a chef but I know damn well it doesn’t take 50 minutes to heat up bread. We were served by 2:10 which was an hour after our arrival. I understand it takes time to make certain meals, but how can a more complex meal ORDERED AFTER US come out promptly?\n\nWe will no longer be getting our sweet treats here and I will be telling my friends in Riverdale to avoid your establishment unless they have six years to wait for a pita."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLVzgyNFRFNk9QOFVnEAE",
            "text": "How did this restaurant convince us that WE should be paying THEIR employees a living wage through adding tips into the price?  So I pick up a salad to go and it’s $28? With a dink $34.50 plus tax.\nFood is delicious but the prices are really steep."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLQ0wwc2J5MGRhblJnEAE",
            "text": "Good fresh food, wraps, drinks, fram fresh items. $$ a bit overpriced."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdTQ3SlQ3aXN6alBBEAE",
            "text": "We are Mushroom lovers.  So before visiting the area for work, we searched for restaurants with dishes featuring them. That is how we found Moss Cafe. We stopped by for the Mushroom Cubano and the Bibimbap bowl. Wow did they deliver!! Everything else we saw  come out looked fantastic too. Finally judging by the amount of people coming visiting on a Thursday afternoon at 2, you may want to order takeout or allow extra time because they have a well deserved dedicated fan club."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS3V6ZXpRcGR1ZjVnRRAB",
            "text": "Fantastic food and great vibes. Food was great we had the shakshuka and the moss egg sandwich (out of this 🌎). The coffees were great especially the pistachio latte. And last but not least after a lot of back and forth we picked from the bakery items a delicious curry/scallion cheese croissant and a. Nice buttery pistachio chocolate chip cookie.\nCan’t wait to return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUFh1NHJKek91MnVBRRAB",
            "text": "Lovely vibes and delicious food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYm1vdC1pOUlTSTJnRRAB",
            "text": "the best avocado toast that I've ever tried in the tri-state area"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcVBDUjBBRRAB",
            "text": "The spicy portobello burger is back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvenN5em9nRRAB",
            "text": "Delicious, very fresh ingredients, highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaDZ2aXdRRRAB",
            "text": "Food was pretty good. Veggie friendly"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcnJUT0NnEAE",
            "text": "Super expensive and the food made me sick. No prices listed for the specials. $22 for a cup of chili! Surprise!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRemF1ZlhnEAE",
            "text": "Great coffee and food. Nice place to hang out and slow down."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnczRLcXN3RRAB",
            "text": "Long wait for food. Crowded in small space. Noisy. Dishes looked good if you have time and patience"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc1k2NGZnEAE",
            "text": "Ordered the Bibimbap with tofu. Possibly the best vegan meal I have ever had, and it caught me by surprise.  The way the mushrooms and sweet potatoes were cooked blew my palette away. And I don't know how they did it but the tofu slabs were thick. Pure perfection. You take your chances with getting a table but we got lucky and enjoyed the chill/quaint atmosphere. Will definitely be back!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndHByNGNREAE",
            "text": "Amazing Café!\n\nThe food is delicious and fresh, the coffee is perfect – aromatic and well-made. Friendly service, a pleasant atmosphere, and everything is clean and inviting. Highly recommended!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNXREdVVnEAE",
            "text": "Descent but overpriced food.\nVery bad customer service...  they feel like they are doing you a favor by taking your order"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfN0tUNmdnRRAB",
            "text": "I had the hot chocolate and a cookie here for about $10. The hot chocolate was incredible—one of the best I’ve ever had, beautifully presented, and too good to wait for a picture! The cookie was a bit dry, as expected since it wasn’t fresh out of the oven, but still tasted great. I’d definitely come back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMFlUVmpBRRAB",
            "text": "Food was delicious service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cDduTVVnEAE",
            "text": "Cozy little cafe with yummy food and excellent service. The coffee is yummy too. I had the farmer's plate and the potatoes and greens were perfectly prepared and went great with the eggs. Have also had the shakshuka and that is great too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2LUxtMmpBRRAB",
            "text": "Very bad customer service, long wait time. Never come back again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdnZyUHJ3RRAB",
            "text": "I am in love with this place! It is literally my dream restaurant. I could eat this food every day. My only regret is that I live in Manhattan and can’t do that! Please, can you open a Manhattan branch? I will be a great customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcDRMVU1nEAE",
            "text": "I have gone here on 3 separate occasions; different days and times and each time I'm told they're not doing smoothies at the moment. One time was told because it was a Sunday and they don't do smoothies Sundays and the other two time with…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeUlQM0p3EAE",
            "text": "Ate outside in the Sukkah.  Order at the counter and the food is brought outside to you in the Sukkah.  Very pleasant experience.  Counter staff very helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLWZHZGNBEAE",
            "text": "Emily, Sagrario, Camille, and Lea—thank you so much! I placed an order through Moss Provisions yesterday and didn’t realize the delivery was set for next week. I needed it for my boss, who is sick today, and you all went above and beyond to make it happen. You were so warm and helpful. Thanks again—you saved my boss’s lunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINUozQzlnRRAB",
            "text": "Very tasty food, in a cute cafe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OC0zajhnRRAB",
            "text": "They make a great flat white!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NU9uRjNnRRAB",
            "text": "Not sure what all the one-star reviews are about. Although I have my suspicions. We had the split pea soup with homemade croutons and the special portobello Burger which came with mozzarella cheese and a spicy aioli. Both were absolutely delicious. For dessert, we had a blueberry muffin and a Danish with cream and nectarine in the middle. We went after the lunch time but the cafe was still busy. This is not McDonald's. Food is cooked to order, fresh and homemade. I don't mind waiting a little extra time for that. Considering how busy it was, I thought the wait time was reasonable. Prices are a little high, but again, I don't mind paying a little more for good quality fresh food. That's what you'll get here. I also had one of the best cups of cold brew. Smooth, no bitterness or acidity. Would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OXNTTGF3EAE",
            "text": "absolutely delicious avocado toast, super nice ambience, & my aunt said they have one of her favorite mochas ever! the banh mi left a bit to be desired — the bread was not crusty and delicious, though the tofu was quite good — but overall I liked how many vegetarian options there were and I adored the avocado toast!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cU5XNjFnRRAB",
            "text": "Good shakshuka and moss egg offerings. The pastries were phenomenal."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhckpxR3dBRRAB",
            "text": "Definitely one of my go to's for great food and coffee. Perfect place for breakfast or lunch, and easy to take littles to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMUxEWlVREAE",
            "text": "Very nice small cafe with excellent farm fresh food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX19fbWVREAE",
            "text": "Best cafe in the Bronx, kosher or not!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNm9pa1BREAE",
            "text": "Food was below average, but the service was absolutely terrible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycXE3LWVBEAE",
            "text": "I went to Moss Cafe thinking I was about to enjoy a nice meal, but little did I know that would not be the case. The first few bites were delicious but then to my horror I noticed a cockroach right in middle of my food! When I politely asked the male employee with long hair if he could refund me, he was extremely rude and offensive for no reason! To make matters even worse I got food poisoning and was sick in bed for two days! I am extremely upset and disgusted by this establishment, it is not a clean place to eat and the staff is rude. I will not be coming here again and I don’t recommend that you do either!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycXBTejhnRRAB",
            "text": "We found Moss Café looking for a parking spot.  According to Tip Advisor Moss Café is #111 of 583 Restaurants in Bronx, New York, and though we cannot claim to have eaten at them all, we’ve eaten at enough of them to guess its top five even #1.\n\nMy Bibimbap bowl (Korean Rice Bowl) was the cleanest, freshest, best of its kind I have tasted in the US and as good as anything I’ve had anywhere including Seoul – perfectly cooked Basmati Rice, sweet and savory and perfectly roasted sweet potatoes, avocado on exactly the right day, intense oyster mushrooms with Gochujan sauce with exactly the right kick to it, flavored and crunched with sesame seeds.\n\nWow"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrLThMVHBRRRAB",
            "text": "브롱스의 나만 알고싶은 맛집! 골프치고 브런치 장소로 최고입니다! 건강하고 신선한 재료, 정성스런 요리에 투샷 Stumptown coffee까지 two thumbs UP!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6b05hNjd3RRAB",
            "text": "Delicious amazing vibes cafe. Went there on a Wednesday morning, was packed! The food is generally great and they have a super unique and healthy main menu. Also very yummy pastries. The honey butter biscuit muffin is unbelievable. They hacked the muffin game with this, the way they cook it hard crunch and sweet outside with a soft inside, I couldn’t believe what I was seeing and tasting! I also got the shakshuka, pretty standard and tasty. For the ambiance, they charge. But it’s worth it. 8.9/10"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNkkyT0FREAE",
            "text": "Best casual kosher cafe in NYC (and maybe anywhere). Super fast/convenient to drive from Manhattan with its own parking lot. Dishes are impeccable, fresh and wholesome and service is included. The staff is exceptionally nice (shout out to Marin especially) and manages the crowds impressively."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWejhTN2dnRRAB",
            "text": "Nestled in the heart of Riverdale, Moss Cafe is not only a haven for coffee and tea enthusiasts but also a culinary gem with a small yet scrumptious menu that showcases the perfect fusion of flavor and elegance.\n\nMoss Cafe's commitment to a concise and thoughtfully curated menu is a testament to their dedication to quality over quantity. The small selection of dishes is designed to offer a diverse range of flavors, each crafted with precision and an emphasis on fresh, locally sourced ingredients.\n\nAlso, their delicious menu of fresh teas blew my mind. I will be coming back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MTZlXzFBRRAB",
            "text": "One of my favorite restaurants! I am in love with the respect and care shown to the farm-to-table ingredients. Props to whoever plans the menu, sources the ingredients, and writes the recipes. Homemade southern biscuit is excellent! And where else have you seen a kosher restaurant that offers soft scrambled eggs? (If you know of somewhere please tell me, I want to try those too :)\nMy compliments to the chef who pulls it off. Amazing!\nAnother restaurant on the list of “keep coming back to try everything on the menu”"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbnRTTUN3EAE",
            "text": "Cool \"City\" type cafe restaurant in Riverdale. Coffee is really tasty. Food good too. Atmosphere is pleasant if not a bit too busy feeling. The whole place feels a bit narrow. It's not large. Nice that they are part of the group of…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZenF2U0dnEAE",
            "text": "Excellent food. I had the veggie burger. My wife had the farmers scramble. Very flavorful, bun was excellent as well as sauce on Burger. Bread was very good, pastries looked amazing. It’s tight on space and could do without the political agenda integrated into the menu. Otherwise highly recommend."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeWNDWktREAE",
            "text": "It is a small, but cozy place to dine. I went there as an Asian Canadian-the workers were nice to me and my family member. The dishes were fine and refined; 3 leches cake was excellent."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMTlqLU93EAE",
            "text": "The food here is delicious. They have a nice selection of fresh and healthy options for brunch. Whether you are in the mood for eggs, pastries, salads, or lunch fare, this place has lots of items to choose from. All of their food is creative and fresh tasting. The coffee is strong, the breads and other baked goods are delicious, and there are usually daily specials which add nice variations to the menu. This place is great for vegetarians and vegans, as well as people who keep Kosher.\n\nThe dining space here is very small and chaotic. It is difficult to enjoy a relaxing brunch in this establishment, as you are always in somebody's way no matter where you are. You bus your own table, which is slightly oxymoronic, as you have to battle your way over to the bussing station in order to do so. Once you get there, the bus bins are often overflowing with dishes, and you have to be very careful not to topple the pile of dishes over.\n\nThe staff here are excellent. They do a great job at dealing with the crowd and working with each patron to make the dining experience as smooth as possible. They step in and serve you when possible and also work hard to keep the line moving.\n\nThe prices at this place are also higher than average. Every dish is quite expensive, especially considering the service that you get and the overall chaotic experience of eating there.\n\nIt is great to have a good vegetarian establishment in Riverdale with innovative and healthy dishes. Moss Café does a great job at providing Riverdale with a modern and unique place to eat. If they could somehow improve the dining experience, this place would be much more enjoyable to eat at. I know it is a small space, but there are other small dining establishments that are not as stressful to eat at."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMWUtZ1RREAE",
            "text": "Such a cozy cafe with a variety of options that fit all dietary accommodations, especially vegan, dairy & gluten-free. Came with a party of six and really enjoyed the Sunday brunch menu. Avocado toast and the open face biscuit with red onions and aioli were our favorites. Quality matcha too which is always a plus. They’re a bit expensive for a cafe but the quality of food is well worth the price."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbnFHWFd3EAE",
            "text": "Nice restaurant, cafe with friendly servers. The menu has a variety of food from Asia to Europe to Americas. Shakshuka and avocado toast were good. Better better bowl from the fridge and was just ok. The seating is nice and clean bathrooms."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cWZIekd3EAE",
            "text": "Lovely neighborhood spot with excellent coffee and healthy choices for breakfast & lunch\nFood: fresh, healthy and creative with influences from Vietnam to Europe. Great for to go coffee and pastries. Lots of choice.\nService: order inside. Food was ready quickly. Chef gave us freshly baked cookies.\nI would return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsX3RuYkxREAE",
            "text": "Vegan eats review:\n\nBibimbap Veganized\n\nFlavorful. Just the right amount of kick that enhances the flavor but doesn’t leave your lips on fire.\nPickles cucumbers and the wafer thin sweet potatoes hit the spot.\n\nLove Moss for their fried and true vegan options and how they strive to have a new dish or two that are veganizeable.\n\nAlways busy and crowded but turn around is fair for a table. On warm days there are also tables outdoors.\n\nThis isn’t a rush eats place though so give yourself time to order, receive your eats, and savor the well thought out ingredients (locally sourced)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dm9Ub0h3EAE",
            "text": "Great,creamy coffee and medialunas are freshly baked daily. Dulce de Leche croissant was also delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcDRYUGt3RRAB",
            "text": "Had delicious and very different bibimbap Korean veggie bowl over rice. Very different & very filling. And the dressing had a nice kick. friend had delicious shakshuka"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX3ZIRTZRRRAB",
            "text": "Delicious food but slightly overpriced. Healthy options, fast service. Was very busy"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3emUta0VREAE",
            "text": "I love this cafe. Good coffee, and a great community vibe.  There’s decent seating inside, and a couple tables of outdoor seating as well.  They also offer fresh brewed kombucha and a light selection of beers.\n\nI haven’t tried their brunch menu yet, but the selection looks enticing."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0MGJQdWt3RRAB",
            "text": "I tried this place today and absolutely loved it.  Every flavor is great.  The food tastes extremely fresh.  I consider the prices to be on the expensive side."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvd05YM0VBEAE",
            "text": "Grabbed lunch there as I was early for a nearby Dr appointment. Nice little place, quite decent food, with plenty of gluten free options.  Only 3 remarks of any importance :\n\n1) they have a big sign that says no laptop hours (between 11am-2pm if I remember correctly). This is good so that there are no loafers during busy hours. When I went at 12pm for lunch almost every single table was occupied by someone on a laptop. This was very annoying.\n\n2) place is quite pricey. I know it’s Kosher food, but it’s still more expensive than it should be for such light fare.\n\n3) when you pay by card they ask for a tip. This is weird to give a tip before you’ve even been served. Awkward and slightly unusual.\n\nIf I’m in the area I’d check it out again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLa1pfcDlnRRAB",
            "text": "Nestled in a bustling neighborhood in Riverdale, this vegetarian eatery is a sweet little spot. Bowls, salads, and sandwiches are their speciality, and of course there's coffee and espresso, too. I ordered the bibimbap (which was very Americanized), but I adored how fresh the veggies were, and the added sesame garnish on the rice was a cute touch. Pretty and tasty food is where it's at for me, and I felt satisfied enough on both ends that I didn't mind the higher price for a smaller meal. Many items can be made vegan (Hello! Vegan shakshuka!). For the gluten-free eater, be forewarned: The gluten-free optional does not include a gluten-free bread substitute. There is no gluten-free bread on site. Lastly, there's both indoor and outdoor seating to suit your preference, and the neighborhood is a nice place to walk after eating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcjlDdWlnRRAB",
            "text": "Good here is bussin. Definitely recommend the bibimbap bowl and all the baked goods. The people that work here are always really nice but because of the small area, it is always pretty packed. I also don’t appreciate them always finding excuses to close early or be closed for the whole day. Good food, on the pricey end, but definitely would recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cE9ueDVBRRAB",
            "text": "Been coming to moss for years now. Their staff is wonderful and always very welcoming. Everything on their menu is delicious especially the pastries. This time I got the Challah French toast and eggs and they hit the spot! Loved it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLV9tY1BREAE",
            "text": "Great variety of vegan friendly pastries and meals. I ordered many pastries, turmeric lattes and an avocado toast and it normally comes with an egg but i don't consume them. They wouldn't substitute it for anything else, the cashier suggested I can add tofu which is $5.50. Any kind of substitution would have been nice. They sell some awesome smelling candles that are a bit overpriced tho. Their restroom is excellent. Clean smelling and appearing and well stocked. There is paid parking on the street or a free lot next to the building as space permits. The neighborhood is very charming."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvX3VTQUFnEAE",
            "text": "This place is so dope!  They have the dankest most delicious kosher pastries and the best food ever.  Check the pics of the menu, pastries, and the line!! They are opening up a bakery a few doors down."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdV9lWExBEAE",
            "text": "Delicious!!\nBrunch 8/1/2021 at Moss Café:\n\n1. Moss Egg Sandwich (fried farm eggs, pepper jack cheese, our own dill pickles, harissa aioli, and radish sprouts on a house-made croissant roll).\n\n2.Bibimbap Bowl (white rice, crispy maitake mushroom, sesame cucumbers, house made kimchi, avocado, bok choy, gochujang sauce, black sesame seeds)\n\nThese are yummy!  Definitely going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdE1PY1VnEAE",
            "text": "The place is beautiful and offers shisha, and there are shows that are performed by the staff. The prices are good in relation to the quality of the place. The food is also somewhat delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eHRUZXJ3RRAB",
            "text": "Farmers plate and honey butter biscuits are a must order. They say the fish tacos are also great. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaTcyYWpnRRAB",
            "text": "It's a little place but very nice! The food is tasty, with good prices and good service. I went there on Sunday morning, and it was crowded."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NnU2UVdREAE",
            "text": "One of the very best cafes in Riverdale! Very cute and cozy spot. Perfect for a healthy meal, baked goodie, snack, or hot coffee break!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNUpPeUVREAE",
            "text": "Great coffee, adorable neighborhood. Ambiance and coffee are a 5/5. The biscuit + eggs were a 2/5. The biscuit had an aftertaste."
        }
    ],
    "reviews_count": 80
}