{
    "name": "Neem Indian Cuisine",
    "place_id": "ChIJUzIQ9RLzwokRa7YYxgZosyE",
    "grid": "BX8",
    "address": "3549 Johnson Ave, Bronx, NY 10463, USA",
    "rating": 4,
    "user_ratings_total": 295,
    "phone_number": "(347) 427-3953",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRU5reERObkZwZDJOVFVHZEdPV0pTV2xwRU9WRRAB",
            "text": "Best Indian i had in a long time! Curry is delicious also Tandory, live music on Thursdays, great place!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS2VERkpUbDltU25OUVVpMHhWMGhzVlZKZk5FRRAB",
            "text": "The owners are very disrespectful towards there drivers and do not know how to treat there drivers with respect."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeFkzQk1OMHRTVjBscWJ6QmZhVGw2WTBKVVZWRRAB",
            "text": "I was there a few weeks ago on a Thursday night for their Irish music with Mary Courtney - both food and music were fantastic.\nI always get their chicken tikka masala which is absolutely delicious, along with their vegetable samosas. Their raisin coconut naan is absolutely gorgeous, and 3 people I was sitting with all wanted to try it and said they will have it as the regular order naan going forward. I always order at least one extra so I can have it the next day at home.\nStaff are lovely and I can't wait to go back, just leaving this review is making me hungry for their food again 😋"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa0xXcFdNMVJ1WmpacFNESnZXVkpSWXpNNU5WRRAB",
            "text": "Ordered Chicken Tikka Masala and Saag Paneer. Both were diluted, very thin sauces which were not very flavorful. Also ordered samosas, they were ok, the mint chutney was sweet which was weird. We ordered gulab jamun and something was very off about it. Very off. Metallic and inedible. I love Indian food and have tried these things in many other restaurants in NYC and this one just does not cut it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4elJVSTRhMUEzWTJKaE5HbHNiMTlmZW5weWVtYxAB",
            "text": "The different flavor wings are super!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UWJrWlViV1l4UlZOeU9YaFhVMnN5VGpkdlNsRRAB",
            "text": "The worst service possible. The bartender swallowed an order of random Chinese food at the bar. When done gobbling up her boneless ribs and rice she proceeded to go on a really long personal face time call.\n\nThe delivery person sat in the corner watching YouTube videos at maximum volume while waiting for his next order.\n\nThe kitchen staff sat in the dining area the whole time chit chatting. There is zero professionalism to be found, this place sucks! Never again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vemRXODNhakZrTUdjM2FIRjFZV2hVVTNCNGRYYxAB",
            "text": "The level of disgusting that this food is is kind of impressive. Chicken tikka masala was watery and bland with two solitary pieces of chicken floating in it. That was a solid 2 on 10. However, the okra bhuna? I'm actually convinced that the people who run this place have never actually tasted indian food because the okra was raw and slimy still, in a rawish turmeric sauce. The word bhuna literally means roasted or fried, like have they even tasted their own food? Vomit inducing. DO NOT EAT HERE."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WmNqWXdRWFYyVFdKdGJubGlWVTVrVldoRVkzYxAB",
            "text": "Yesterday my daughter moved into the area. After unpacking lots of boxes we decided  that tonight we would have take-out Indian food. We ordered two lamb dishes, a mixed veggie dish, a paneer dish, 4 samosas and two naan breads. It was close to $100. I have never had such POOR Indian food. One of the lamb dishes had 3 pieces of meat. The veggie dish was just mush. The veggies were overcooked. The paneer was in a liquid sweet gravy. The garlic naan just had granules of garlic not fresh garlic. All in all it was a bad experience. Please don't got here for authentic Indian cooked food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT1JYUXlRVTlwTW1KRVNIWklVbVp2Y1ZsWk5FRRAB",
            "text": "Remarkably bad food. I didn't think I could have an okra dish I didn't like until we had food from here. Similarly, the daal makhani was remarkably bad - and it has kidney beans in it. Go figure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSFlraG1TVmx1Y2t0RkxVWm1VRFZYVm1walpVRRAB",
            "text": "My family and I have come here for many many years and always loved this place and the people working there. The only thing that really scared us is that recently the health rating was a shown as a “C”. So we no longer order from here. I truly hope that they turn this around because so many people used to love this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUmNIbFVWamhIVTJRMU4wbHNTR1pDUlZCWE5uYxAB",
            "text": "Absolutely loved my experience at Neem Indian Restaurant! The food was bursting with authentic flavors, and every dish was cooked to perfection. The service was also top-notch, friendly, attentive, and professional. Highly recommend Neem to anyone looking for delicious, high-quality Indian cuisine. I’ll definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMlkwSXhVVlp3WVRkRWVWUjFUV3RqV21wNFVYYxAB",
            "text": "The lunch menu gives you a variety of selections to choose from. It comes with samosas and a refreshing ice tea.This Riverdale venue is a quiet gem and for many of us just what is needed in the middle of a work day. Service is attentive and the meal is quite filling. A must try"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSE5WOUxTMjVyTm5WS04xSXdZbm8zWWpoR1RGRRAB",
            "text": "Ordered take out mixed curry (bhuna) with basmati rice extra hot (never again will go medium next time) but loved it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZk9GWnBWVzlDV0ZocFZWcHFaMDExYkdWWVFsRRAB",
            "text": "The stark difference from those who dine in and order in the reviews is wild. I ordered here before and it was disgusting. I must have forgotten because I made the mistake of ordering again and I spit it out and couldn’t even swallow it. It’s literally inedible. YUCK! I’m actually pissed off after paying $70 I’m sat here hungry and annoyed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRVNFMURkemxoWmxCbFVHbDRka2R0WmpNemNIYxAB",
            "text": "Ordered the lunch special from here today and found a long curly hair in my rice, YUCK.  Will not be ordering from here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OT2JESlNRVlpPVmxGMlJtRmxPVUZXYW5sYWFuYxAB",
            "text": "The food here is not that good. It's spicy to the point you don't taste anything. I ordered a mashed breaded tilapia side dish having a French salad dressing. I ordered a mushroom soup that tasted like one of those horrible tasting dried minestrone soups one gets from Manischewitz. My friend ordered an iced tea that I first tasted that was sweet to the point of repulsion to me but this is the way she likes it. However it was sweet to the point where she no longer needed the diet coke, so returned it. The samosas were nothing great but okay. I've eaten at good Indian restaurants but this place isn't it. Giving 2 stars here is me being generous."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTFYwRmFiekUyTFZGSExXYzBNMnBVUW5CcE1tYxAB",
            "text": "I don’t know why so many people give good reviews. This food was not that good. I got the chicken curry with Nan and some piazi. It was the worst piazi I have ever had😭 I had to spit it right out . The chicken curry was not that great and neither was the Nan it was too burnt . I had great hopes maybe I just got the wrong dish from here . I sure won’t order again tho just wasted my money ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLWGp1cER4am9hZEtBEAE",
            "text": "The chicken samosas were good especially with the green sauce that comes on the side. For our main meals we got butter chicken and chicken Malia, with cheese Nan. wish I took pics but I was too hungry! The chicken Malia was perfect comfort food after getting my wisdom teeth removed a few days ago. Cooked perfectly tender. Make sure to get the Indian ice tea, perfect treat on a hot day if you’re looking to skip alcohol. But if you did want alcohol, the spicy marg hit all the spots"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLUEh3UGVVa1BqNVZnEAE",
            "text": "I enjoy indian cuisine and this restaurant is horrible. Tried it 1 year ago, and it was trash.... I recently tried it again because I was craving indian food and wanted to see if they improved.... still trash. Would not even consider this indian, food is flavorless. Went for the basic chicken tikka masala and like I said it was trash, never again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VONkl5c1g4LXJQeDFBRRAB",
            "text": "Flavorful experience.\n\nWill definitely return."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb3NLMVdBEAE",
            "text": "I had such a wonderful meal at Neem! The butter chicken was absolutely phenomenal—creamy, flavorful, and perfectly spiced. It’s a must-try if you’re visiting. The employees were also incredibly sweet and made the experience even better with their kindness and hospitality. Great food, lovely atmosphere, and genuinely warm service. I’ll definitely be back soon!"
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMzd2T2dRRRAB",
            "text": "Советую вам 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvei1XRzlnRRAB",
            "text": "Decent local spot, but not the best. They price their food based on the neighborhood, which is pricey, and the only other option in Kingsbridge is quiet greasy. A huge disappointment is that they don't give a side of tamarind sauce with their samosas, which every take-out spot I've ever seen does this. The naan is hit or miss, but when it's good, it's GREAT. Overall, not super consistent, a bit nickel and dimey, but not bad once in a while."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXIydlhREAE",
            "text": "Biryani tasted like pulao with peas in it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbU9YdFF3EAE",
            "text": "Great food, endless rice, fair prices and wonderful customer service. They sometimes have live music at night as well"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bDVya0VnEAE",
            "text": "Everything sucked. I order from uber all the time and nothing sucked more than this."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bEtqbkZREAE",
            "text": "Owner is so sweet!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRamJHb3NBRRAB",
            "text": "I’ve been to many Indian restaurants across America and this is by far the best Indian food I’ve had. They have great happy hour prices on the weekdays 4-7 which includes drinks, appetizers, and meal specials. The regular menu is great and everything on that has good affordable prices as well. The customer service was superb. Nobody asked me to say anything. I’m just a blown away foodie with a new favorite Indian restaurant. Who knew the best Indian food I’ve had would be right here in the Bronx. It is a Guyanese and Indian fusion restaurant. The Sauces are made from scratch. I met the manager who was there assisting in the restaurant and greeting the customers talking to people about some of the dishes they offer and handmade sauces."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWJYU0lnEAE",
            "text": "Ordered saag paneer & garlic naan - no flavor and almost no spinach."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneGM3QlpnEAE",
            "text": "The food from this Indian Resturant was extreemly lacking. We spent about $100.00 and it was money wasted. We ordered out because we wanted healthy Indian food because our eldest son was sick with the flu. The food made him feel worse. Everything, every dish, was just poorly made and many items seemed like they had been made a few days earlier and were either reheated, repackage or refried. The Lamb in the Lamb Briyani was rubbery and old and tasted like it had been reheated in a microwave from a few days earlier. The soup left a nasty bitter taste in my mouth. I can't imagine what they put in it.  The Samosa was limp, soggy and tasted like an amature line cook with no resturant experience had poorly attempted to refry it from a few days earlier. I am at at total loss for words. We will never order here again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndWJUTEVREAE",
            "text": "I ordered from Door dash and it was so good. Definitely ordering again."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdS1LQW13RRAB",
            "text": "I had to write this review because I was thoroughly surprised by the tandoori wings in sweet chili sauce. I just wanted a snack for my office and said “why not”.   Wow, these wings were tasty, the sauce was excellent, and most importantly…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aHFyclp3EAE",
            "text": "Real chill vibes great food and great drinks.\nGet the chicken wings 🔥🔥🔥🔥"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OE9TQnpBRRAB",
            "text": "Food was delicious, service was amazing, and the vibe was really chill. Would definitely go back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OExpa2ZBEAE",
            "text": "The drinks were nice and strong the service is always amazing and the wings are the best in the business lovely establishment"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2ME1pNGxRRRAB",
            "text": "food was great, drinks were delicious. the staff was very attentive to our table, sharing recommendations to our other guests on great dishes to try. lots of specials and great prices!\neverything tasted great and they made my boyfriends birthday so special, will def be back 🥳🥳🥳"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Mk5LRGxnRRAB",
            "text": "Best Indian food and service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzM1pYMk1BEAE",
            "text": "The flavor of the food is on point, ingredients are clearly fresh, and the staff are very friendly. They provide fresh-made condiments with every meal as well. I recently started trying their mixed drinks and they are very nice and have a variety of flavors.\n\nI like a very high tolerance for spicy food and the staff offered me fresh spicy peppers to blend in, which hit the spot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2NYVm9nRRAB",
            "text": "Wait staff was extremely attentive and served authentic Indian food that was extremely flavorful and well seasoned.\n\nThe owner's wife came out personally and greeted our table and made us feel very welcome and explained a lot about where they sourced their ingredients and how it was cooked."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNXFUV213RRAB",
            "text": "So fun and great service really enjoyed the Indian cuisine feeling here definitely would return for their lunch special too!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbk1Dbmh3RRAB",
            "text": "If you’re unfamiliar with authentic Indian food, you might not notice, but as someone who knows the cuisine, I was really disappointed. The flavors and textures were far from what Indian food should taste like. I’d suggest looking elsewhere if you’re looking to experience true Indian dishes. There are plenty of places that genuinely capture the depth and complexity of Indian cuisine, but this isn’t one of them."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNklPenF3RRAB",
            "text": "Our first time here and I have to say I will be back, my kids and I loved the food, the service was good and the place was very nice. We will be back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzamRfcmJBEAE",
            "text": "Neem is always enjoyable and tasty, whether we go and eat in person or pick-up take-out.  Everything tastes so fresh and flavorful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcHBINGF3EAE",
            "text": "Great food, friendly, proffessional and attentive staff.\nFunky comfortable little restaurant. Played great music, and not too loud . We had Shrinp poori apetizer and the best Lamb Tandori ,actually best tandori anything , since my old favorite  on St Marks Place, Rose of India closed. We arrived at 7:05 clueless they had  happy hour until 7 and they still offered us wine at Happy Hour price and it was very nice. The gesture and the pinot noir.\nSorry we were only visiting the area but recommend it to anyone who lives works ir visits and loves really good authentically cooked Indian food in a relaxed atmosphere at great prices.\nWhen we get back to NY will definately return ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYblBxU2hBRRAB",
            "text": "Visited Neem Indian Cuisine on a Thursday night, and the space was fantastic (renovated!). There was live jazz playing with a laid-back atmosphere and high-quality vibes. The live music was a BIT loud but perfect if you're looking to relax and enjoy dinner without much conversation. The service was warm and attentive, with our food arriving promptly. As a Bengali, I can vouch for the authenticity and quality of the Indian dishes. The portions were generous, and the green sauce was flavorfullll. I especially appreciated the separate serving of onions and kacha moris - an authentic touch for sure. 👌🏽 Absolutely will be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMExESWdnRRAB",
            "text": "This was one of the BEST restaurant experiences I've ever had\nThe food was delicious and well prepared and presented. The service was impeccable.\nThe atmosphere was warm and inviting and the music was a perfect accompaniment. The main attraction was the owner herself. Nandy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaV9hc21RRRAB",
            "text": "What wonderful Indian cuisine with congenial service! Had the tindoori lamb, perfectly prepared. Give these folk a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNWJiclFnEAE",
            "text": "It was not a great dinner experience. Indian food is known for its flavors, which were unfortunately missing from pretty much all the dishes we ordered.\nSamosas looked pretty sad, instead of being crisp & puffy, they were soggy with too much oil, probably they were made before & fried again to reheat.\nChicken Tikka masala & Paneer makhani are supposed to have a thick texture, but they were watery. They can do better with the flavors & by being true to the dish that is being served."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNub2FLQjd3RRAB",
            "text": "Who puts coconut in biryani, disgusting biryani."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc0thX3ZBRRAB",
            "text": "Neem is fantastic!!! We discovered it only 2 months ago and have already been 4 times! The food is delicious. We try something different each time and are never disappointed. The atmosphere is nice - good for families, couples, or a group of friends. The staff is friendly and there's definitely an \"everybody knows your name\" feel. The last time we went we had the sweetest waitress. She took her time to explain anything we or our friends asked about and made awesome recommendations - for example, the rice pudding...amazing! At the end of our meal we learned she's the OWNER! We were so pleasantly surprised. We're super happy to support this local gem and will recommend to everyone. Try the mango ice cream!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREajRLM1hnEAE",
            "text": "Neem is phenomenal not only do they have amazing food but the ambience is captivating. I was so happy to be so many selections of dishes from the Indian cuisine it was truly satisfying you ever in the Riverdale area. Please do not hesitate to stop by and get a meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbmQybElnEAE",
            "text": "It's REALLY DELICIOUS!\nCraving mouth watering Indian Cuisine that makes your taste buds dance? This is your spot! Not only are their ingredients fresh and authentic but the atmosphere and ambiance is just right for a casual night out to a cozy soiree. If you need more incentive - how about a Happy Hour that extends to 7pm Monday thru Friday. Yes. Yes. And YES!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydmJiQmtnRRAB",
            "text": "My boyfriend and I visited Neem today for the first time and it was a very friendly Atmosphere.  Our food was very good and the bartender was awesome and make a special accommodation for me because I can't drink simple syrup. Everyone was very kind and helpful. I would recommend it to anyone who loves Indian food.  Thank you Everyone.  :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxOTZyY3J3RRAB",
            "text": "Neem Indian Cuisine is authentic Indian Food. I was pleasantly surprised to see the restaurant so full on a Saturday afternoon. With only 2 empty tables and two tables turning over while we were there, this made me think this place is really busy!!\n\nMost dishes were made to perfection.  Yet the poori was a bit thick yesterday as I have had it here several times before when it was light and flaky, but with the chana bazi it was still good as my appetizer.\n\nTo start my friend enjoyed the vegetable samosas and the Masala fries with Indian spices. To me they were very spicy fries.\n\nFor our entrees I had chicken kurma and my friend had the mixed seafood kurma.  We also had Naan bread.\n\nIt was way too much food and we both took home half of the appetizers and entrees.\n\nI say if you're in the mood for Indian cuisine and you're near Riverdale, stop by.  You can sit indoors with air conditioning, sit outdoors if you don't like it or pick it up and bring it home to enjoy!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtc0tyUzZ3RRAB",
            "text": "Nice little place to go to. We came at around 7pm and got a table easily. The food itself was really well-made and hot and the portions were generous. Naan was thick and warm. Basmati was great too. My only knock was that service at that time could have been better. They seemed distracted (though we were one of only two tables taken) and more than once, I had to walk to the bartender to ask for something (soda, tab). Otherwise, it seems like a great place that I would try again. The drink menu seems interesting and well worth a try."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeWZUc1NBEAE",
            "text": "Glad to try this new Indian restaurant in the heart of downtown Riverdale! Forget the place that was in this location before - it's unrelated. Neem is better-priced and tastier. We went for the lunch specials $12.95 got me a complete…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaU9PeFdnEAE",
            "text": "Had a very pleasant experience here today with my sister and her boyfriend. Looked up on google somewhere to eat in the area and stumbled upon this gem. Food was delicious, and honestly despite some of these reviews, very reasonably priced. The fun cocktails are a nice addition that made the dining experience more fun. The food was nicely presented, came quickly, and I could not find anything wrong with it. Service was great and attentive. Owner does come by to say hi and check in- not something you see that often. Vibes of the area/ decoration outside and inside were immaculate. I don’t leave reviews often or really at all, but I really felt this place deserved one. Will definitely be coming back here again and bringing friends and family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCXzdlbnBnRRAB",
            "text": "Got DoorDash, and they literally gave old, burnt and food that was not even looking right.. spent $80 for literally old food. Palak was not even palak! They just threw it in there.. mixed seekh smelled bad, and that’s not even a seekh kabob?? and the naan?? Look at the pictures.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcU42dlV3EAE",
            "text": "This restaurant looks good, is situated in a nice location, however gets trumped in the only thing that should matter, \"TASTE\".\n\nI ordered a chicken biryani, a lamb biryani, and a lamb saag.  Oh boy, if this is biryani then I am Shahrukh Khan 🤦 I'm from Hyderabad and when I began to eat their biryani I was on the verge of tears. The biryani was sweet, full of peas which doesn't belong in biryani and to top this off they didn't provide us with raita or Mirchi Ka Salan instead they gave us tamarind sauce & mint chutney. When I saw what they gave us for the money we paid I had a palm/duck face staring bank into the dishes. The chicken and lamb tasted frozen and overcooked. Saag wasn't blended nor was it tempered, infact they just threw the mustard leaves (chopped) in to the curry sauce and mixed the overcooked lamb into it. Also, not to mention every dish was piping hot smack in the middle which signifies one thing, which is the dishes were microwaved & blown to hell before serving. This was the worst Indian cuisine experience I have ever had. I hope they get better and work on their misgivings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbWQyeWd3RRAB",
            "text": "I really want to love Neem. Years ago it was a place we came out of our way for from Inwood. Now I live in the neighborhood. My three recent orders have been disappointing- lacking flavor and substance. Today I ordered the mulligatawny soup. I’ve ordered this a lot at many places and several times at Neem. Today unfortunately it is a liquid tomato soup with a teaspoon of lentils and some added spices. I called Neem and the staff are super friendly. They shared that there are three different chefs so it depends on the chef."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2a2RXMlB3EAE",
            "text": "Great local Indian restaurant. I had this spicy margarita with my meal, and both the food and the drink was very tasty. (Food was a cauliflower, potato, chickpea curry.) As a bonus they decorated their outdoor space very nicely, and you don't feel like you are next to the street at all. Strongly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyc3ZxNVpREAE",
            "text": "I eat here almost everyday for their lunch special, its amazing and highly recommend. I love it here, great service and great food. Just ask for suggestions of what to eat and its soo good. I'm In love with indian food now. Its great and you need to try it!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSZzl6RjBBRRAB",
            "text": "Delicious and nutritious food. I learned basmati rice is apparently the best in the world. Great ambiance and reasonable prices. I paid for a meal and still have enough for leftovers. I certainly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c1kyNWl3RRAB",
            "text": "This is the worst butter chicken dish ive ever had in my life. I cannot believe i paid 24 dollars to have this garbage delivered to me. This is also the first ever review ive ever posted about food in my life. Unbelievably horrible, just have to let others know!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NjdhdTdBRRAB",
            "text": "Delicious butter chicken!! Nice restaurant But unfortunately I don't recommend ordering for delivery because the restaurant does not follow the instructions/order two times they put white rice instead of the brown rice ordered and today was delivered hot instead of mild spicy ordered.\n\nThis can't happen. This is the third time that happened for a period of 6 months"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2ODQzMWJREAE",
            "text": "Great space. Ok fresh food.\n\nThe physical place is very nice. It's well decorated, has a nice atmosphere, and it's cleaner than many other Indian joints. The service is good. The servers are polite and attentive and the food comes out fast.\nHowever, the flavor is very underwhelming. I could barely taste the spices in my veggie korma - most of the flavor was yogurt (of which there was little). The spices were used very conservatively across the board. The naan and rice were underseasoned. I asked for my food to be spicy and it was honestly mostly just sweet. Barely savory. Barely spiced. And the veggies were undercooked a little, and definitely not marinated in the sauce. The semi-raw flavor of the veggies overwhelmed the flavor of the sauce way too easily. My favorite part of the meal was the masala chai, which tasted fresh not burnt, and was properly spiced, and the tamarind chutney which also tasted fresh.\nThe food is ok! It was by no means a bad meal. It was enjoyable, albeit I can't really justify the prices (which are a little higher than your average indian joint). The experience was good, just underwhelming. It didn't quite scratch the itch for rich, aromatic, spiced food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlLU5UZUp3EAE",
            "text": "Wow great food and great service.\n\nCame here for Riverdale Restaurant week and coming from the Middle East this place is def a solid spot and will return.\n\nWe had the lamb vindaloo and the poori shrimp and loved it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdEoySTd3RRAB",
            "text": "This restaurant is one of my favorites, and definitely the best Indian Cuisine restaurant … in Riverdale. In rating a restaurant, you always start with food, which is exquisite. The flavor across all choices never fails. Then you add service, which also never fails. Now, you add the atmosphere and the hospitality, and that is an experience that has made me return with my partner Damaris over and over. Finally, while the prices are great the Lunch Special if you get there before 3:00pm is one of the best bargains in town. “Love this place”"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OE1lUnRnRRAB",
            "text": "If you are looking for spicy 😋 you will surely find it here. They have happy hour as well every day from 12-7 and yes you do need your Covid Vaccine card and ID to eat inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbWJPdVhBEAE",
            "text": "A hip Indian restaurant, food was spectacular. They dumb down the heat a bit which I was thankful for but they make sure that the house hot sauce is on the table for those we need the extra kick. I got the lamb kurma which was fantastic. Garlic Naan was fresh and delightful. A little small so it can fill up quickly. Service was prompt and attentive. Highly recommend if you are in the area!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbVBEclR3EAE",
            "text": "Used to be a regular here, but the food flavor is no longer good. Ordered for taken out the last two times and haven’t been able to eat the food. Gave it another try, just to confirm that it wasn’t a one say thing. The butter chicken tasted very bland and was white and dry inside. Same thing with the curry shrimps. Samosas were burnt.\n\nService is usually great when I go in person. The drinks are good. Atmosphere is mostly nice despite the small size of the restaurant. Unfortunately, I won’t be returning."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlN19LdWxRRRAB",
            "text": "Great food awesome atmosphere and reasonable prices! Got shrimp Kumar and it was delicious"
        }
    ],
    "reviews_count": 72
}