{
    "name": "Chef Rose Restaurant",
    "place_id": "ChIJj2e1tAvzwokRJz1xmAUhKZQ",
    "grid": "BX8",
    "address": "205 W 231st St, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 140,
    "phone_number": "(929) 589-8851",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUFVHZ3RabnBCWVRSQ2NqaGZOMkYzVGxkTE5XYxAB",
            "text": "This DR family run restaurant has become a fave soon after they opened their doors on 231st St in Riverdale, Bronx.\n\nChef Rose, her hubby, and team seem to always offer their service with a smile and a side of genuine friendliness. They're very approachable and I have often spotted them on their A GAME building interpersonal relationships with the community they serve.\n\nNow that my friend, is a hard find...💯\n\nAlthough they offer a wide assortment of freshly cooked delicious Dominican dishes, I often gravitate to \"Moro de gandules con pernil, it's crunchy cuerito & maduros! 🥰\n\nI conclude sharing that I recently tasted their \"Gandules & Calabassa Guisado\" for the first time which turned out to be perfectly seasoned & tasty. I went home and told my wife all about my experience. I even returned with my wife a few days after for lunch & we ordered the \"Gandules & Calabassa Guisado\" - my wife was blown away and ended up asking me about getting their recipe! 😂\n\nHighly recommended, clean setting, spacious, airy, nice background music, and great DR food...\n\nGet by there, get a bite & say hi to Chef Rose    & her crew 🇩🇴..."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUWQxSjVkSFIyT1dwdlRuTjFXVGRmWVUxcVJsRRAB",
            "text": "The food here is so delicious and the variety of options is amazing!!! Not to mention the service. Everyone is so attentive and kind. You definitely have to stop by Chef Rose."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSWQxOTBibmh6ZDBkM1dtSnJNVXhqVEdvNWIzYxAB",
            "text": "Great Dominican food!! They have the best Majarete ever!!! Majarete is a popular Dominican corn pudding made with fresh sweet corn, milk, coconut milk, and spices like cinnamon and nutmeg."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMGJqUlRUQzFKWDBRM2RVcGlRVkpGVVZCUlJIYxAB",
            "text": "I went to this place for some great food and had the worst experience of my life. The food was flavorless,I never thought that this place would've had a warning on the door.  I should've went Lisa's restaurant on 231 and Riverdale. I won't make that mistake again.\nThe prices are too high for you to pay for this food. When the first open the doors the food was good, I don't know what happened to the chef, one thing I do know , is they need another one quickly."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcU5XZFdaSFk0U25neE5qSlpRamxNVFRSS1YyYxAB",
            "text": "Excelente lugar para ir a comer. Tienen una gran variedad de comidas, espacio para sentarse y los empleados son muy amables."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaWRIVTRkMVZmVTFNdFNHOXRiemRNVUZvelpWRRAB",
            "text": "Amazing food, good people, really spot to go for any occasion."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeGVWWm9OVzUwVFROeVpWcEdUMkV6TWxCTldWRRAB",
            "text": "Best place to enjoy a good hispanic/dominican meal with the best company as your servers. Absolutely love the place and the atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRk9HazBOalZmTWxCcFIweFVjREZSWVhsdk9FRRAB",
            "text": "The worst Pito I’ve ever had in my life taste like old chicken no flavor, greasy very old oil worst  I’ve had in my life"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVdTMTRTRk42UkVKb1NHUmlia3hHVlhkRWFtYxAB",
            "text": "Their food is decent but yesterday I was eating and seen a worm, I really want my money back because I was starving at work. Got some rice and vegetables because my stomach was hurting, after seeing that worm made me feel even worse"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFdUWkNhbGxKVDA4M1JXUkVlbnBEVm5sdlZHYxAB",
            "text": "I stopped at this restaurant while going to the number 1 train at 231 and Broadway. I ordered the oxtail, white rice, steamed vegetables and side dishes of beans.\nI was blessed to be served by Chef Rose herself ! What a friendly and very welcoming lady.\nThe food was fresh and delicious. I am a young senior athlete. I know about food and very good food. My plate was totally empty at the end.😊😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VGQzZDBlbFIyZEV4NlMwb3hkbGwwT0ZoQlNrRRAB",
            "text": "The Mangu here is amazing, and the ladies that work here are nice!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMllWRnJTRjlSYTA1YVpscEVYMVp1VWw5TVNuYxAB",
            "text": "I went there for my lunch break it’s took 23 mins to get my\nLunch special and when I got to the register they have given my order to another person so I had to reorder my food again and wasted my lunch break ordering with ten mins to eat. Very unhappy with the service and the way there is no organization and the workers need HELP"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUlZGaHFabmRZV1RkRVNYQm5aMlJrZHpONFNsRRAB",
            "text": "Amazing!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZkN6dVBncnJ6cEh3EAE",
            "text": "Fast, reliable, and exactly what I needed."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOeFUxUkpNSEpDYldOR1FrUjJjMkk0ZFZCZmNsRRAB",
            "text": "Excelente lugar para comer bueno y tranquilo 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbTdxdHJiaUxmbW5nRRAB",
            "text": "The food here is absolutely delicious, every bite feels like home cooked comfort. The staff is incredibly welcoming and makes you feel like family from the moment you walk in. It's the perfect spot to bring the whole family for a warm, relaxing meal. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLUlqc3VReDVlSG1RRRAB",
            "text": "Worth the price."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcWlwdXpOeXRDOHdBRRAB",
            "text": "Muy buena comida.. todo muy limpio y bien organizado!!! Me senti que estaba en mi pais nuevamente 🇩🇴!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRHBtNTZ3c183YlV3EAE",
            "text": "I recently had an event catered by Chef Rose, and the experience was outstanding from start to finish. She was incredibly attentive during the planning process, helping me create a menu that was both delicious and perfectly suited to the occasion. I ordered the chicken with chimichurri sauce, and it was a definite highlight—flavorful, tender, and beautifully presented. Chef Rose’s professionalism, attention to detail, and culinary skill truly made my event special. I highly recommend her for any catering needs!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNnVySTVRRRAB",
            "text": "Amazing dominican food and service! Love this place❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNk9fM29RRRAB",
            "text": "Delicious oxtails, tasty pernil, beautiful restaurant"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaFlEaGRnEAE",
            "text": "Service was good, ordered the mangu but it wasn’t exactly mangu. Seems like they added flour or potato to it, y eso no se le hecha. No valio la pena 🤢"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdHJxMmhRRRAB",
            "text": "Food is always amazing!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaVpma2lnRRAB",
            "text": "Excelente"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBZ2JEOTd3RRAB",
            "text": "I stopped into to place an order for an event I was hosting. Chef Rose personally sat with me to  take my catering order. She was pleasant and attentive to all my needs during this process. I explained my specific allergens and she made a note of it. The day of the event the food was ready on the time as indicated.  All my guest enjoyed the delicious food. I will definitely order for future events. Thank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOXZHV1pnEAE",
            "text": "DELICIOUS AUTHENTIC DOMINICAN FOOD!! We love Chef Rose and her fantastic food. As soon as she opened a restaurant I knew we had to pay a visit since all her recipes on instagram made my mouth water. Must try, GOAT STEW!! (Chivo Guisado) not everyone knows how to make it. A fan favorite in our household. The rotisserie chicken, staple of course. The pernil, Chicharron, even the sancocho just delicious. Cannot forget the authentic rice and beans or the pastelitos. Please save room for dessert because they have the BEST TRES LECHES I’ve ever had in my life! Wow!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNWFTclNnEAE",
            "text": "Ordered from Uber eats and I had to write this review to remind myself to never order from here again. I always give places at least 2 tries but the price did not match what I ordered so here I am. The chicken empanadas were dry as heck, the baked ribs were super fatty and over priced in my opinion for 2 pieces , however, the taste wasn’t bad at all! The salad was bad and when I say bad, I mean it was brown……paid around $30, absolutely not worth it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmajV5RE53EAE",
            "text": "Yuck"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZzdyb09nEAE",
            "text": "Happy to finally meet Chef Rose and taste her delicious food. Ordered catering for Christmas Eve and the pernil , baked chicken and the rice with bacon and maduros in it.  Food and service was excellent, thank you."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3VPZlpREAE",
            "text": "Amazing food. Loved it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNktmbHN3RRAB",
            "text": "I’ve been a follower on IG for a long time! The moment I knew Chef Rose opened the restaurant I couldn’t wait to try it out! And she did NOT disappoint! We had a catering order for New Years, the food was still hot when I picked it up, the flavors brought me right back home to the mother land! 🇩🇴\nThe only thing I felt needed some TLC were the oxtails, not much meat to them more fat than anything. But other than that the rice, beans, rotisserie chicken, maduros, quipes, shrimp pasta in white sauce (chefs kiss!)\n\nFrom Staten Island to the BX! I will be back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOE0zZTZnRRAB",
            "text": "Hi !! I worked Christmas Eve and didnt have time to prep & cook so I called Chef Rose on xmas eve and placed a same day catering order. I ordered moro,chicken,pernil and maduros and it was delicious.  Ordered medium trays and we ate for dinner and brunch Xmas day.  Alot of food and soo good.   I dont really like pernil and it was delicious!!! Loved everything.  My hubby also put an order the following week for his work party and everyone was asking for the info on where he got it.    My daughter who works near by tastes the food at Xmas and said wait. This is Rose’ food. I eat here for lunch daily.       Thanks Rose for everything.   Repeat customer here !!!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjhXT0J3EAE",
            "text": "La Comida es muy buena la recomiendo 100%\nLimpieza y calidad\n👏🏼"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdzdYc1N3EAE",
            "text": "I eat here almost everyday. Whenever I want a meal that reminds me of home I come here. The steamed vegetables are my absolute favorite. The only thing I’d request is jugó de cereza please😫. That would seal the deal for me! 10/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dVl6TTJRRRAB",
            "text": "Service was great. They attend you as soon as you walk in the door. The steam table is straight forward and they answer any questions you have. Take out or dining in I’ve had nothing but great experiences. All the employees greet you with smiles and the atmosphere is great. Whenever I don’t feel like cooking this is the place I turn to!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2c3EzRU5nEAE",
            "text": "Was really looking forward to this place as a long time follower but let pretty disappointed. I felt that the food was not seasoned enough. Had higher expectations for Dominican food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcHNtS3VnRRAB",
            "text": "i follow your pages through instagram and was tempted to try your food for a longtime i traveled from central nj to bx and was sadly disappointed . i had white rice with rabo and red beans the food over all tasted bland i basically got a big bowl of rice and a tiny amount of meat for a plate thats pretty expensive. the rice was too grainy and the beans were ok the maduros were all burn and had weird taste my husband had salmon and he says it was bland too and the service was horrible unfortunately i dont see us coming back"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeXFXQ3N3RRAB",
            "text": "Saludo, hoy pedi un sancocho y le digo que no quiero carne de gallina, y para el cormo el sancocho, cuando me llego solo tenia un pedasito de aullama y nada de carne, y ningun tipo viveres, eso no se hace tienen que tener mas respecto con los Pedido de entrega\n\nHello, today I ordered a sancocho and I told you that I don't want chicken meat, and for the corm the sancocho, when it arrived it only had a little piece of aullama and no meat, and no type of food, that is not done, they have to be more respectful with the Delivery Orders"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcU9DblRnEAE",
            "text": "Espectacular comida dominicana !! Wao tienen que ir !!!! No se la pierdan !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud2FiMWZ3EAE",
            "text": "Love this place and especially the Oxtail if I can get yhere early enough because it goes FAST!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaXVxX1p3EAE",
            "text": "The workers there are courteous and respectful. If it's your first time there (as it was for me), they'll explain what they're offering and bring the food to you. I haven't tried their coffee yet, but I'm definitely looking forward to it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa1pqTThBRRAB",
            "text": "The food was dry and not hot very expensive the waitress wasn't helpful and I went with more people and I feel they need better service and less expensive be careful"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWbnVITzNBRRAB",
            "text": "new & colourful on w231.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3N1ptaFlREAE",
            "text": "Got some chicken for my son's birthday, fast and friendly service/ delivery. Chicken was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bVpHaXVnRRAB",
            "text": "Amazing Restaurant everything was delicious 😋 great atmosphere, great service and Chef Rose mother in law is the sweetest I went from CT and I think I'm going again soon, hopefully I can see Chef Rose this time."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bnVxNUpnEAE",
            "text": "Para mi y mi esposa es Una gran delicia .. ofrecen un sabor del paraíso con sus deliciosos platos caribeños caseros en un ambiente acogedor y vibrante. El amable personal, las bebidas refrescantes y la excelente relación calidad-precio lo consiten en una excelente opción para una experiencia gastronómica memorable. ¡Una visita obligada para cualquiera que desee auténticos sabores caribeños!\" ¡¡Me encanta!! Gracias 🌹. ¡¡Dios te bendiga!! Caribbean Delights that offers a taste of paradise with its delicious homemade Caribbean dishes in a cozy and vibrant atmosphere. The friendly staff, refreshing drinks, and great value for money make it a top choice for a memorable dining experience.. A must-visit for anyone craving authentic Caribbean flavors!\" Love it!! Thank you 🌹. God bless!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidDg2NHF3RRAB",
            "text": "I can’t stop ordering mangu tres golpes from them! It’s delicious! 😋 can’t wait to try other selections of food they have! This is by far the best mangu in kingsbridge heights. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMF9yTUd3EAE",
            "text": "El mejor lugar de el área , comida súper rica y las atenciones de primera ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNmNQMmhnRRAB",
            "text": "Yo pensaba que la mejor comida era la de mami pero ya eso cambió, tremenda atención de todo el personal, el ambiente y la comida da seguidilla de lo buena que esta. Esta comida si tiene la 3 B"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNmNPc0ZnEAE",
            "text": "La atención es excelente, las personas fueron increíbles, me trataron como a un Rey, la comida es muy buena, osea diría que es de restaurante a la carta, la forma de hablar, de expresarse, es increíble, me hacen sentir que volví a RD, realmente la comida es demasiado barata para ser tan buena,  al final del día seré uno con este restaurante y ellos serán uno conmigo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGellEdXVBRRAB",
            "text": "Very Impressed with Chief Rose Restaurant 🌹!! Mrs.  Rose is very nice.\nI'm glad to have affordable 😊 Very Tasty meals 😋,   Another Good eating spot for our neighborhood .\nWe must support this very friendly Family  business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaXJ5djBBRRAB",
            "text": "This is an amazing restaurant with a great variety of delicious food. The customer service is top notch. Chef rose along with her beautiful family have put a lot of effort in making this restaurant feel like home. I love everything about it ❤️."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGVLVUp3EAE",
            "text": "C'est un bon restaurant, la nourriture est bonne, la viande bien épicée et le service est agréable. Le seul problème est que je ne sais pas comment ils fixent le prix des plats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaHQtVFNBEAE",
            "text": "The food was very tasty and amazing! Service was great and they make you feel at home. 5 out of 5 stars !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbWNQVWJBEAE",
            "text": "Delicious food and great service. Chef Rose is the absolute sweetest! Definitely coming back 😀"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMS1lWkl3EAE",
            "text": "The food and the service is EXCELLENT!!!!! Every single time I come into this restaurant I feel welcomed and appreciated. It feels so good to just walk in. It is very rare, to experience this consistently. I've experienced this over several months from the entire team, including the owner. Keep up the amazing work!\n\nMy dad is a very picky eater, and he loves your food. Thank you for serving the community."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd2FybFN3EAE",
            "text": "im all about supporting new businesses , but this place should do better to attract and keep new customers. The food tasted ok, not bad but nothing special.\nThe issue is my food to go was basically a big bowl of rice and a tiny amount of meat! mostly bones. The soup was not much better....scraps of meat, bones , but mostly sauce and it was salty.\nThey really need to be mindful of what they are exchanging for your hard earned money. I was looking forward to trying this place .. Well, i tried it, was disappointed. i cannot justify going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWdGNUemdBRRAB",
            "text": "Let me start by saying that the food here is delicious, there is so many variety to choose from. The service, attention, and tidyness of restaurant is A+. The staff is super friendly and welcoming. My job caters food from here for our monthly events and are happy with service they provided. Chef Rosie and her Nick are awesome. If you're in Bx area pass by.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaWRfS0tREAE",
            "text": "Stopped in for some food, we tried the mangu, oxtails, moro, roasted chicken, maduros and everything was delicious! The service was outstanding as well, we were greeted as soon as we walked in and the person who served us was friendly and helpful. Can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OXVqeC13RRAB",
            "text": "Food is absolutely delicious and rotates every day. There is however a tendency for the food to be a bit over salted. Otherwise, the customer service is impeccable and always makes me feel welcome."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqenIzUVB3EAE",
            "text": "I went by the reviews and not sure why they are positive. The food was just not good. The maduros are not fried, like they are boiled or something. The black beans…no beans in them, just the liquid. I ordered a majarete and it was so bad, I threw it out after eating one spoon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsanJMUHd3RRAB",
            "text": "Wow just exactly what we needed in the neighborhood!\n\nPlaced my first order a few mins ago and we are so happy with the quality of the food and how quickly delivery got here.\n\nDelicious food and great customer service\nCongratulations on the new restaurant wishing you the best of success"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cWRTSjh3RRAB",
            "text": "Omg! I was looking for this specific flavor!\nThis restaurant is amazing, \"Excellent service and delicious food! The staff was attentive and friendly, and the dishes were prepared to perfection. Highly recommend this restaurant for a fantastic lunchtime experience!\"\n\nFast delivery! Great job you become my favorite restaurant in Kingsbridge! Loved it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNHJDTnR3RRAB",
            "text": "I loved her restaurant. It was totally great and food is the best. I love rose and i love seeing her on her instagram videos. I was attended officially by her!!! (I don’t know if she remembers me but I was there few minutes ago with my two daughter) wish her and her team the best of the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MklMeVNBEAE",
            "text": "My first time at the restaurant, I was heading back to CT and decided to stop by for lunch. Great Place to eat with your family or to take out. The food was amazing!!!!! The sweets are delicious!!!!! And the Staff was great!!!!! Thank you Chef Rose I will be driving down from CT with the family to visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbGM2OC1BRRAB",
            "text": "Where do I begin ! I loved the vibrant colors and decor. The staff was very friendly and were patient as I decided what I wanted to try, everything looked so good I didn’t know what to order. If I can give the food more than five stars, I would …. it was absolutely delicious everything was cooked to perfection !! I look forward to going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkME1LcVRBEAE",
            "text": "The food is amazing and everything is well lit and clean. The rotisserie chicken is amazing and the stewed chicken is amazing as well, empanadas are so good! Everything I tried so far is tasty and staff is very helpful and nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc3BPRXpBRRAB",
            "text": "Most Hispanic restaurants have about the same taste. Chef Rose is above EL MALECO, MI NUEVA ESPAÑA and every other Hispanic restaurant I've been to. THE BEANS is what makes or brakes it for me. I LOVED THEM TOOK SOME HOME AND MIXED IN MY JAMBALAYA.  IF I want Hispanic food and I don't want to cook CHEF ROSE is the place FOR ME."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNWZUcm53RRAB",
            "text": "Went there today for lunch with my 2 boys. The food selection is crazy, you see the social media post but when you're their it's so many good choices your overwhelmed lol. I had the fried rice with salmon which was cooked perfectly, compliments to the cook. My son's shared the baked wings with white rice and beans which they devoured. Being that Nick makes a fuss on IG about the chicken feet in ordered it to try it out como soy de familia campesina lol wish they had the whole piece though but it was good even my son enjoyed it."
        }
    ],
    "reviews_count": 69
}