{
    "name": "Connaughton’s Riverdale Steak House",
    "place_id": "ChIJsxPtgU7ywokRKcfPsNXQYBE",
    "grid": "BX8",
    "address": "5700 Riverdale Ave, Bronx, NY 10471, USA",
    "rating": 4.4,
    "user_ratings_total": 382,
    "phone_number": "(718) 549-9946",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGalgwZzFialp1Wm5kNldrZFJlV050UzJ0NmIwRRAB",
            "text": "The capon cut was thin, unseasoned, and gray. Upsell to sauces for a mere 10.00 dollars was uncalled for since they set down house sauce after ordered. Lamb cooked well done when ordered rare. Stay away!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWmJUUjBXazFtVjA1dFVFcE1VakpWYjFGZlIwRRAB",
            "text": "I went there in business day myself around 6.30pm and it’s quite empty at that time. The vibe is really good. I ordered a ribeye steak, it serves with salad, veggies, potatoes and tomato sauce. The steak itself was large and tasted good, but some part of the steak was overcooked when some other parts just not enough. Waitress was patient but too busy to reply me. I had to say there’s a better choice for same price though overall I’m pleasant."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acVNWVlNWVVJUY205ck9FcEhSbTlYWjJaWmEwRRAB",
            "text": "The food here is pretty good in general but there are some weak points. The key lime pie doesn't have good flavor one would expect. The soups are inconsistent, either great or nothing special. I love their potato coconut soup but they haven't been serving it as of late. They make a delicious panko-breaded deep fried sole. The Connaughton’s Salad is very good. The staff here are very friendly and conversational but not attentive enough when it comes to collecting the signature slips for credit card payments at the table. Verdict is I would eat here again. Good place to relax with company in a homey old world pub setting. Well, I ate here again on July 2, 2025 and the food was great. I had a delicious cod patty, which was perfectly seasoned and came with fresh tomato slices, spinach leaves, mixed greens and avocado slices on a quality hamburger bun. I got with it some perfectly seasoned rice. I had a potato leek soup before the main course, which helped my mood and was very flavorful. I got a Samuel Adam's Summer Ale, which was light and flavorful. My partner got a piece of chocolate moose cake that looked really nice and fresh. She ate it all with delight. I got the cake on the house since it was my birthday. They sang me the \"happy birthday\" song. It was all very nice and an improvement over my last visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWG95cVMxaDV6eTNnRRAB",
            "text": "Delicious food great service. A stable in Riverdale that continues to be the top of the line. Definitely would return to try other dishes. The baked Brie appetizer was super."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbmZfYWltX3RHdk9BEAE",
            "text": "Great place full of good atmosphere and good craic"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcElxdXpRRRAB",
            "text": "Good food, always excellent service and great atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGEyYUtREAE",
            "text": "super duper awesome sauce, when i was 3 i cried until i could go. 5 stars."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUtDT3d3RRAB",
            "text": "Awesome service awesome food great staff very friendly atmosphere 👍👍👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eUpiNTVnRRAB",
            "text": "I stopped in for a takeout. The staff treated me like a special guest who was staying for dinner. Top shelf experience. Next time I will explore the entire establishment"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0l5NElREAE",
            "text": "Great food and service at this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbklqR0x3EAE",
            "text": "I ordered take out from here, the steak au poivre and the garlic mashed potatoes…and boy it was DELICIOUS 🤤 😋 ! I’m highly satisfied and I would definitely order from here again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa0xpbTh3RRAB",
            "text": "Relaxed Space with great music by Colin Taber...."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLXJfOUpBEAE",
            "text": "Great food.  Cold drinks, but a bit moody.  French onion soup is great and the mozzarella sicks are crisp and great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYb0xEaWxBRRAB",
            "text": "Love it here.\nNice place.\nPlease say hello to Rizel.\n\nLol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINHY3WTNBRRAB",
            "text": "This was a great place to order from, take-out and dine-in. I have done both, take-out at dinner and dine-in at lunch. During lunch the restaurant is usually empty and the service is quick and the food is tasty. I will definitely be returning. For take-out I placed a large order and everything was there and it was still after the 10 minute drive back. Will highly recommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNmIteVFBEAE",
            "text": "We had a great time, sat at the bar and had sandwiches.  Service was great and food was tasty.  Live music added to the experience.  I highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycU5mYXN3RRAB",
            "text": "been here a couple of times over the years. Food and service are great. highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOHJxSWp3RRAB",
            "text": "Take-out.  Hotel suggested - was snowing a bit, so limited traffic made the trek easier.  Loved the interior of the place.  Was an easy review - enjoyed the steak, veggies done right, and the salad was fresh - highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN3Rqb0JREAE",
            "text": "Checked this out for Riverdale restaurant week & it was extremely the best. Loved the waitress whom was very friendly!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MXEtQUh3EAE",
            "text": "Quick turn around on a take out order. Big juicy burger with extra thick cut fries. Really hit the spot when I was super hungry. I've also dined in once at this comfy pub. Large wrap around bar and lots of table seating. Had a big Caesar salad and crab cakes. Food consistently good. Prices reasonable for amount and quality of food. I have a feeling I'll be returning as a regular.\nUpdating - Stopped in on a Saturday night for a drink at the bar with hubbie. A couple of  cocktails each and an order of fries didn't break the bank unlike most NYC establishments. Plus a great live blues duo. Mostly a crowd of regulars. Low key, chill vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELWVLZ1ZREAE",
            "text": "We come to this restaurant regularly and absolutely love it. It’s an absolute neighborhood gem. The restaurant has a cozy vibe and the staff are all lovely people. Would definitely recommend paying them a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREX0s3aklBEAE",
            "text": "Very cute place. Live rock music. The staff was so sweet and friendly. Doloris was our waitress. She was a sweet heart."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX002XzVBRRAB",
            "text": "It’s called steakhouse for a reason. Get the steak with a nice cold beer. Excellent family place or a place for you and friend. Dolores and Claire are by far best I’ve ever had. They will take care you and your loved one. Please visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX01hZ2dnRRAB",
            "text": "PLEASE! We implore you. Come to this establishment if you like good steak, great beer, and above all else - amazing service! It’s an absolute delight and they even have live music. 10 / 10 - Rick & Pedro"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeV9EdGVnEAE",
            "text": "Nice bar...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNELWJPcTZBRRAB",
            "text": "Went to celebrate my father's 96 birthday. Very nice place and the waitresses were excellent.  The food was delicious. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbUxDblNREAE",
            "text": "This is the place! Early in covid they were the first ones to reopen and bring the neighborhood back, creating outdoor seating long before anybody put up those structures.  Now they bring in polished and accomplished musicians who play wonderful classic blues and rock and roll.   The staff couldn't be nicer, the vibe is wonderful, and the food is great; chef clearly goes out of his way to find good stuff to make the shepherd's pie and everything else. It's far better than everywhere else I've been. Thank you for keeping the faith."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNWJXNVVBEAE",
            "text": "This is a nice family run establishment in the finest\ntradition of Irish pubs.\nThe staff is top notch, and the excellent fare has been drawing the locals here for decades. Good old fashioned dining never goes out of style. They also have a nice bar setup with plenty of room for celebrating good times"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5a2ZyWDhRRRAB",
            "text": "Above all, I recommend coming for the atmosphere alone. It was great to see a sense of community within here. The scenery, music, people and of course, food really brought the place together. You'll find that it gives you a taste of Ireland both metaphorically and literally."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaEtMRmVnEAE",
            "text": "Very comfortable pub environment with great staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMDVqQzRRRRAB",
            "text": "Love the old school vibe of the restaurant. Although we when on the 31st & it was packed , the food was delicious! Everything we tasted was good from the beers, drinks, appetizers and steaks. I would highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscWUteF93RRAB",
            "text": "Connaughton's is an old world steakhouse favoured by the Riverdale political machine and different from Jake's, the other local steakhouse. I favour the Bavarian chocolate cake, but they run out of it too often. Service on the weekends is spotty. The regular servers during the week are exceptional. The menu could use a refreshing. Still, its crab cakes are wonderful. They need to work on bread for the table. That should be automatic at a steakhouse. One should expect that. Otherwise, a far more friendly steakhouse than Jake's. Price point is similar.  Park across the street in the mall lot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMFptazVnRRAB",
            "text": "I left hungry and won’t be returning! So I went in to grab a quick lunch with my husband. The food is better at Wendy’s also the quality and portions are better at McDonald’s.\nI paid 48 dollars for 1 half portion grilled chicken salad and 1 diner quality burger.\nThey don’t have a lunch menu. The bartender asked 4 times how I wanted my burger cooked. They call themselves a steakhouse with those prices they should be ashamed of themselves."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNC1IVS13RRAB",
            "text": "Had a lovely meal at the  Riverdale Steakhouse The place is very cosy with a friendly atmosphere, I had Guinness Fish and Chips. The waitress Clare was very efficient and friendly. I had a lovely dessert and an Irish coffee. I look forward to visiting again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNnVDbjRnRRAB",
            "text": "Ate at The Riverdale Steakhouse   The place is very cosy and has a very friendly atmosphere, The staff are very welcoming and food was delicious. I will definitely go back to this steakhouse when I return to New York."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMkk3bl9nRRAB",
            "text": "Warm friendly atmosphere, very welcoming, food is good, service is good, very reasonable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMk5EdmpRRRAB",
            "text": "Great tasting, delicious food. Service polite and caring. If you need anything adjusted they will. Accommodating. I go back again and again. Atmosphere truly inviting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGemRLem9nRRAB",
            "text": "We sat at the bar on Saturday night (10/28/2023 by 8 pm) after a long day of work.  We had 2 main courses (steak and fish) and drinks.  The bartender’s poor attitude, lack of attentiveness, complete disregard for what we needed—, unpleasant look on her face every time she came by, inability to describe/recommend a meal or answer a question about the different steaks, made us regret the decision of going there for dinner. Never again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a2FmWTRRRRAB",
            "text": "Actually it's very good food and the bar very clean every thing was Super  good\nAnd respect I was very happy thank you so much"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NU1hU0JnEAE",
            "text": "It really depends on who you get here for service as the weekend staff are indifferent and the weekday staff are phenomenal. Inattentive and untrained as they are on the weekends, you notice a difference in the presentation. Also, refills are only if you disturb them. Instructed to add coulis to the plated cake, they failed. Notice the difference in the photos.  Coulis, raspberry or chocolate, is critical to the taste and texture of mousse. It is not decoration. They need to retrain the weekend staff."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURaOXN0TBAB",
            "text": "The architecture was kept pristine and original  from 1920s . Amazing.  And the food menu was in the traditional  Irish pub vibe.\n\nA step back in time atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM3RySldBEAE",
            "text": "This Irish classic adjoins a huge Irish retail gift store with high-quality Irish merchandise. The food is exquisite. The chocolate cake is by far and away the best in the neighbourhood, and the service is friendly, considerate, and impeccable.  The atmosphere is not stuffy. The regulars at the separate bar are gracious and connected, and the local movers and shakers. The typical steakhouse is Jake's in Riverdale.  This one is where the old timers go. It is our Cheers in Riverdale."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbjhEVElREAE",
            "text": "This is an old school Irish bar/restaurant/steakhouse. I like old school. But hey I'm 60!\nHad the salmon special which was very good! Also came with a salad and had two tap beers with the meal. Had some local cops there too having a couple of cold ones. Can't go wrong with old school Irish places!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcmNuYVd3EAE",
            "text": "Love the traditional atmosphere especially when the servers speak with Irish accent"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeU5fUlVnEAE",
            "text": "Food and drink especially there Guinness is really good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdmYyQmxBRRAB",
            "text": "From the daily Specials I had the pork chop and it was the BEST pork chop I ever had!\nJust don't tell my wife I said that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXAyOW53RRAB",
            "text": "Waitress was not very helpful, she basically threw our plates on the table food was cold. She did not want to be there.\nWould not recommend! 😕"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cnFyQ2NBEAE",
            "text": "Happened to be in the area and contacted a friend to see if he wanted to go for drinks. He did. He is well known in this fine establishment. We were there for about 3 hours and had a great time with great service. Hope we go there again some day."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOGFiNk1nEAE",
            "text": "I discovered this gem while on a road trip; needed to stop and wait out rush hour traffic. The place has everything...it's classic old-fashioned with dark wood everywhere...dining room with booths and Tiffany-style light fixtures, a bar…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMGRicWFBEAE",
            "text": "Really good, I had the stuffed sole (with crab).\nMy 1st Irish cider, give me more !\nEnjoyable Irish music and great service, thanks Terrence.\nBest meal I’ve had since visiting the NYC area.\nHighly recommended.\nWELL, we liked it so much the first time, we returned the next day!\nThis time French onion soup and shepherds pie, both good.\nWe enjoyed talking to Dolores and Lily, very friendly.....again, this is a good place to eat and visit."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcl96aWp3RRAB",
            "text": "The Connaughton’s Riverdale Steakhouse is a wonderful restaurant that’s located in the Bronx, New York and is well known for its offering of delicious fish and steak meals.\n\nIn February of 2022, I brought Kat & myself for dinner at the Connaughton’s Riverdale Steakhouse to celebrate our Happy Valentine’s.\n\nWe were graciously greeted and superbly treated by the restaurant’s staff, particularly by our waitress, Tricia J.\n\nTricia treated us with tremendous respect and kindness, did a great job on taking our orders and made sure that we felt right at home when dining at the restaurant.\n\nBoth my wife and I found our meal to be very tasty and delicious and we were both quite impressed by how quickly our entrees was brought to our table!!!\n\nWe both enjoyed our dining experience at the Connaughton’s Riverdale Steakhouse and highly recommend for everyone to visit and dine at this great restaurant!!!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNc08yX2JREAE",
            "text": "The restaurant is in an old Bronx neighborhood, and the place definitely reminds you of an old Irish handout place in the old days.  The guests here are mostly local, and the place has a nostalgic touch in decoration as well as the food…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaHJIVThRRRAB",
            "text": "The burger is 5 stars. I’ve had a less than 5 star experience with the “specials”, but just stick to the burger and you’ll be fine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCN1lyT2lRRRAB",
            "text": "If you’re within this vicinity, please visit. My wife and kids went in after reading the reviews and boy was it worth it? The stew, the steak, the burgers and mashed potatoes? I came in from Texas on vacation and this beats every expectations I have. I forgot to mention the Irish whisky! If I return, I’ll definitely visit again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXc0pUN053EAE",
            "text": "Friendly local spot\nGreat ambiance with the beer, Inside got the old-fashioned Irish vibe\nStaffs are welcoming, especially Sean's very kind\nGood place to swing by anytime."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnODgzTXlRRRAB",
            "text": "We left there pretty disappointed.  Our appetizers were delicious but the most important part of our meal (the steaks) were very disappointing.  I got the special which was the filet on the bone and although it was okay, it was not prepared the way I asked.  I ordered it medium and it came out well done around the outside and very rare in the middle.  I'm not an expert in this area but I don't think a filet is suppose to prepared like that. It was just cooked very uneven.  I could be wrong, but you can see pic below and judge yourself.  Perhaps it's normal. My husband got the 22 oz. ribeye.  He is the son of a butcher so is very critical. He absolutely hated it.  I tried a piece and had to spit it out because it was very rare and rubbery.  He is a fan of rare so that didn't bother him.  I couldn't even chew it.  Also Grease is no enemy to my husband but there was just so much that he felt very uneasy on the ride home.  French fries were good, and being a big fan of onion rings, I did not like them at all. Bland and too much coating. The positive part of the meal... The staff was excellent and attentive, and our waiter seemed very knowledgeable.  Perhaps it was just a bad night and poor selection on or part."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOGVIc25BRRAB",
            "text": "My family and I went for a birthday dinner a few weeksago. We were a group of 12 including children. They put us in a separate section near the bar. It's two steps up from the dining room and it's a beautiful wood paneled area with a working fireplace surrounded by a carved mantle. The service was excellent. Our waitress couldn't have been nicer or more attentive. Our meal from appetizers to dessert was excellent. This is a very nice place to go to for a meal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb0tqUU1BEAE",
            "text": "What a wonderful experience!  The food was simply outstanding and extremely well priced. The atmosphere was so cozy. The owners and the staff were top notch. We had sone special needs with an elderly family member, guests who required strict gluten free meals, and numerous children of different ages and the staff handled everything fabulously. I would highly recommend this restaurant for a party of two or a party of 25 like my event.  Thank you all for giving us such a great memory!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNS1Db2dnRRAB",
            "text": "Classic Irish and American fare. Shepherd's pie, Guinness stew, steaks, onion soup, etc."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5M09fQmtRRRAB",
            "text": "Food wass delicious. Will definitely come back again. Waitress was also sweet and friendly"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNEpDT1BREAE",
            "text": "Medallions melt in my mouth, definately were better than steak."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHOWNlTUhBEAE",
            "text": "Pros: cute atmosphere, reasonable prices, good food\n\nCons: bad service! My friend got charged MORE because she asked for them to not include an item in her food (so she got charged more money for requesting less food) , the waitress forgot to add cheese to an order but then tried to charge us for it, the waitress told us one price for extra fries and then we were charged more on the bill, we had to flag down the waitress in order to get water refills/condiments/etc even though the restaurant was not busy at all… these are all pretty basic/standard requests\n\nI was very disappointed. I had such a great service and review of the Irish shop next door with the same owners (service was above and beyond at their Irish shop!), so I  was particularly disappointed with the restaurant- I want to support local business especially mom and pop shops like these. I’ll leave it at 3 stars in case I went on an off day, but if the service is still bad  next time  I’ll need to lower my review even more and won’t be returning to the restaurant"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRa2NfU1FREAE",
            "text": "This place has a great comfortable atmosphere. Jimmy the bartender is the best! There's a spot to play darts at the bar(just remember your own dates) the bar area is huge it wraps around for plenty of people. The people that are there are…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNHFQSU93EAE",
            "text": "We recently held a funeral lunch here and the experience was excellent. Delores managed everything expertly and my family and I were able to focus on celebrating our loved one. The food was delicious and there's something for everyone. Thank you!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaHY3bFFBEAE",
            "text": "We were stuck in traffic and decided to eat here and wait out the traffic. Very old Irish style pub but was pleasantly surprised, our steaks were great! Mignon medallions and the porter house.   The staff was very pleasant and accommodating, we will definitely make the trip to go here again!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2OWUyc213RRAB",
            "text": "Be sure to celebrate your next special occasion at Riverdale Steakhouse! The management and service are top notch!! Everyone is very friendly, attentive, kind & professional. Every effort is made to make your experience a memorable one.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlc1lHYUVREAE",
            "text": "Beer choise suggested by server was great but the cod burger was nothing more than fish put thru a blender and attempted to grill? Good tomato , good lettuce, soft bun and very spicy  dressing. Thank goodness for decent fries."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaDlpUURREAE",
            "text": "Let me talk to you about Delores.  She's an amazing bartender and wonderful person who really makes you feel welcome.\n\nThe food is always on point and traditional.  Can't go wrong with classic food and the Irish attitude.\n\nFamily vibes!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcnBmNk5REAE",
            "text": "Decor was very odd. The seating area looked and felt unfinished. There were a bunch of tables and chairs pushed to a corner in the back.  My pasta was pretty bland, but my companions enjoyed their food. The chicken fingers (tenders?) were very good."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMTc3dUl3EAE",
            "text": "This isn't Peter Lugers, but the food is consistent and good. The wait staff are all great. The bar serves your typical neighborhood brews you'd expect from an irish pub. They are happy and willing to accommodate order substitutions. Both the bar and dining area are stocked with regulars which is always a good sign."
        }
    ],
    "reviews_count": 70
}