{
    "name": "Aroma Restaurant Bar",
    "place_id": "ChIJiTcRSufzwokRPeIkGKyEyQM",
    "grid": "BX8",
    "address": "5523 Broadway, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 223,
    "phone_number": "(718) 601-0020",
    "reviews": [
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRmFVMU5UVlZXV1VJeFUyaEtZM0pOTFdONE9YYxAB",
            "text": "Fui ina vez y quedé encantada las chicas son muy serviciales"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd05VWkhOME42YWw5amRYTTFSRGd6VEhjeWIzYxAB",
            "text": "When my husband & I arrived, we were actually the only customers on the floor. I mean we did go around 2 pm so yeah makes sense so def not complaining. Food was super delicious & fresh. We ordered the croquetas de jamon as our appetizer & let me tell you it didnt disappoint! They didn't have much variety for their sushi, however it was just so good. My husband had the mofongo & he also enjoyed it as well. Def will be making another visit soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGZmRESkxWbGRyU1ZsTmNHUTNjRXRuYm1KamNFRRAB",
            "text": "Wonderful service and great food!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNVYyeENNMGxPY1hsclZXVTFURWMyUjBReFIxRRAB",
            "text": "Amazingly Beautiful Overall Experience!! Come Here If You Want A Romantic Date Night With Delicious Food, Fantastic Drinks & Soothing Lofi Muzik!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aVdFVkdjVUZNU1ZGWlRXaEJhM1JpT0hock9YYxAB",
            "text": "Excellent lugar, I loved it"
        },
        {
            "date": "4달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSGJsSnFWamh3VG5GRExYbGpTRFpYWDA1dVlYYxAB",
            "text": "Excelente"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYTkxOXE2eWNlUXJ3RRAB",
            "text": "The food was amazing and the service was great too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJT29tclNta3J2cGhRRRAB",
            "text": "Today was my first time visiting certainly won’t be my last"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN1AtdFZ3EAE",
            "text": "Changed to one star because the hours said they were open to midnight, only to encounter a locked door at 10:30. It’s not hard to update hours on here. It was just a waste of our time.\n\nThe food and service was absolutely fantastic. We had gone for Valentine’s Day (the day before) because we had heard good things, and we thought there was a sushi bar. But it’s not there anymore.\n\nMy partner had the steak mofongo, instead, and I had the chicken Parmesan — and both were absolutely fantastic. Cooked perfectly, and came out pretty fast.\n\nThe drinks were good, too — especially the sangria I drank.\n\nThe only issue? There was some event happening there, and there was a woman shouting on a microphone (you don’t need to shout on a microphone — kind of defeats the purpose), and then they were playing the music super loud.\n\nHowever, our waitress was great and successfully had the music turned down just enough to where we could have a conversation (and order food, because the waitress couldn’t hear us, nor could we hear her).\n\nDefinitely understand that groups are moneymakers for restaurants. But if you aren’t going to have a separate space for them, efforts need to be made to ensure that the rest of the business isn’t disrupted. We get that they would have some speaker — and that’s fine. But the music was just too loud, and it shouldn’t take a customer pointing that out.\n\nIt’s the only reason why I gave four stars instead of five. Everything else was five stars."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycDQyOWNREAE",
            "text": "A Cozy Rinconsito in the Bronx..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcUZ6cks2emRQVTFnRRAB",
            "text": "GREAT and friendly service!\nWorth the wait..Delicious food..Try the octopus, fish and pasta..."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOHVpQ0JBEAE",
            "text": "I’ve been here three times already, as sometimes I like to give several opportunities to a place before I provide a three star review. I want to be fair.\n\nMy experience hasn’t been good. The food, is good and the atmosphere is great, however, every single time, I waited too long for my food. I am talking about 20 extra minutes after all my table (3 people) received the order except me… and it was a simple sandwich what I ordered.\n\nIn one occasion the food was super salty. That occasion I did not want to give a bad review. However, the issue with the time happened again, I have no option.\n\nPrices are acceptable for the location. Drinks are good, and the restaurant itself is beautiful.\n\nI don’t recommend the place. I might give them another chance. I don’t know."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNbkpfZnZGd1llMGNBEAE",
            "text": "Mother's Day was a little less wonderful because of this experience. We arrived for our 3pm reservation as scheduled and were seated quickly which was very good. The waitress brought our menus and took drink orders. After the drinks arrived we placed our order skipping appetizers. The singer O'Brien Luna performed with a nice complimentary drummer. His sets were very good with his usual Bohemian style even a Bob Marley rendition. After his first set and thirty min break we started to wonder what was causing the delay, a Burger and a steak really shouldn't be an hour wait time. After speaking to the manager our food arrived within minutes. Thankfully the steak was well prepared. The burger however was a disappointment. When a Burger is named one expects the bar to be raised.... This however was not the case. My humble suggestion would be for the proprietor of this establishment to take a visit to a smaller newer establishment by the name of Cordial further south on Broadway. There they will be greeted and served quickly and cordially. The burger will not be frozen instead it will be a hand made patty freshly seasoned and served to your liking. This burger deserves to bear the moniker of the establishment that serves it. Maybe the experience would have been more palatable without the hour wait. Thankfully Mr Luna was able to provide excellent entertainment during this ordeal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc1pDN3F3RRAB",
            "text": "Lunch on a weekend.\n\nCalamari - batter was delicious and meat was tender. Portion smallish. Can eat 10 plates.\n\nFried rice - a little too heavy handed on the salt.\n\nShrimp teriyaki - a little too heavy handed on the sugar for the teriyaki sauce. Everything tasted sticky sweet including the broccoli.\n\nPrices are rather high for the Bronx. Can imagine it having nice ambience for dinner."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMk0tU2R3EAE",
            "text": "I went in Easter day with a group of 43 friends and family celebrating 2 birthdays… Since booking the reservation to the brunch experience, everything went smoothly. The prices is good for a 2 course meal with great food, the atmosphere was so nice,classy, fun, the live singer was so good and entertaining. The waitress, Leiny, was great… she handled the large group all by herself and did very well. She was very accommodating and sweet. I definitely recommend it and will be going back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNlBqcW9nRRAB",
            "text": "Good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXNxYXJRRRAB",
            "text": "Food IS  HORRIBLE! CHEF NEED TO BE FIRED!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LUtLWVZnEAE",
            "text": "I was acknowledged and welcomed immediately upon entering; loved the food, the drinks and the ambience; but what really wowed me was the outstanding customer service. Gleiny and Luchy were amazing! They were friendly, attentive and efficient. Had an amazing time and will for sure return."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMTlpbS13RRAB",
            "text": "Leiny & Luchy offered AMAZING service for our party of 28 dor our brother’s Retirement Party!  Food was great and overall service amazing. Will definetly come again!!!!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMUtPRVBnEAE",
            "text": "Leiny me quedé por el servicio que nos brindó excelente sólo me quedas decir Gracias Leybi Ramírez 🙏🙏🙏…"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdkt1OU53EAE",
            "text": "Gracias por la excelente atención y tan agradable ambiente musical sin dejar de lado lo principal tan deliciosa comida"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncGRXb2t3RRAB",
            "text": "Tucked away by the train, this place offers a serene escape with its soft lighting and the gentle glow of candlelight creating a warm, inviting ambiance. The tasteful decor, with plush seating and soft fabrics, sets the stage for an elegant and charming experience.\n\nDespite being located near bustling streets, as you step inside, you're greeted by the soothing sound of nice, relaxing music that encourages relaxation and intimate conversations. Whether you're on a romantic date or simply unwinding alone, the impeccable service ensures that every need is anticipated without being intrusive.\n\nFrom gourmet meals to finely crafted cocktails, every detail exudes quality and creativity. The combination of great music, a calm atmosphere, and excellent service makes it an ideal destination for any occasion. You'll leave feeling refreshed and already planning your next visit."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndktuTThRRRAB",
            "text": "Went for valentines day. Place was empty about 4 tables occupied. Waited at least 20 minutes to place our order... as soon as I start to order chicken parm she says they don't have that...I said but it's on the menu...she says ok... then I proceed to order steak and onions with mashed and she says they don't have steak because yesterday they didn't have steak... I'm starting to get confused... so I order a pork mofongo. The food did not come out for at least 40 minutes! Not once did she check on us refill water ask if we wanted more drinks...nothing...smh\n(A new customer satisfaction next to us and had a steak!)...smh\nThe mofongo was pork belly which I do not eat and it was a small scoop of plantain in a big bowl sitting in a type of soup which was not good either...smh\nWe were beyond disappointed but my husband didn't want to ruin the night so we let it go. We had to go to the bar to order drinks! At the end the bill was over 200 and she made an automatic 30 dollar tip! We won't be going there again..."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdDZLOThRRRAB",
            "text": "Me encantó fui a celebrar mi cumpleaños. Lo único que no permiten  es llevarte la comida cuando es brunch ,"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBLTR1dTN3RRAB",
            "text": "It's definitely a place I will recommend for a couple or a group of friends that want to talk and eat good food. The food is great."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMUt1ZEZREAE",
            "text": "Vale la pena visitar\neste lugar."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2a3BXNGV3EAE",
            "text": "I went to celebrate my Birthday with friends and family on a Sunday for brunch! The vibes were immaculate the food and drinks were really good! And big thanks to Carlos Tati for making sure everything was set for my party 🎉"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2b0ktU2NREAE",
            "text": "Excellent food, service, and ambitious. Hosted my business holiday brunch party, and it was a wonderful turnout."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdHEyNGRnEAE",
            "text": "The food is pretty damn good and the drinks are stiff. I'll try a second time to see how I feel afterwards. I know one of the head waiters there (from the now defunct Land & Sea) so we had no issues getting drinks, etc."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN2Ytek9BEAE",
            "text": "Me encanto Aroma Restaurante pata celebrar mi boda íntima con su brunch buenas atenciones, buen precio, música con un volumen excelente, todo muy sabroso y las chicas también muy serviciales, gracias a Carlos y Miguelina por su acogida, bendiciones 🙏🏻🙏🏻🙏🏻🙏🏻"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaUl6N2tBRRAB",
            "text": "Excelente lugar. Un ambiente diferente muy familiar y acogedor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueFBfN0lREAE",
            "text": "This restaurant was a great restaurant selection for Sunday Brunch. We felt soooo happy and comfortable with the awesome service which started since I called to make the reservation and spoke with Miguelina, who was very helpful and kind over the phone. The whole experience at the Aroma restaurant was superb, excellent, and splendid thanks to delicious food, marvelous atmosphere, impressive and talented artist, Arsenio Perez, and more importantly the fantastic, wonderful, and friendly/professional care and service received by the staff of Leinny, Luchy, and Miguelina."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueEwtR2RnEAE",
            "text": "Great Sunday Brunch for family! Live music and nice atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueE9fS1BnEAE",
            "text": "Sunday brunch is amaaaazing! Great service, live music and lively atmosphere! Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdnY2VW53RRAB",
            "text": "The service was decent considering all of our food took a very long time to come out. The food itself is not good at all. Me and my partner never experienced such horrible food unfortunately."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eU9TTFJBEAE",
            "text": "Good food (fried calamari is Fire), good drinks, great atmosphere. Stay late for the live performances. Good vibes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNTdQOUNREAE",
            "text": "Amazing place hidden from tourists. One of the best service in New York! Gorgeous presentation of dishes, authentic cuisine not all of the menu of course, amazing cocktails, service staff is top notch! I love this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOGVMVm93RRAB",
            "text": "Food didn't like"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyN291UTN3RRAB",
            "text": "Great ambiance , great Food ,great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMDV5cDNnRRAB",
            "text": "I went to this place 6/22/24 Service at the bar was terrible. The entire bar was upset! My partner and I asked for the same drink 3 times and everytime they forgot how we liked our drink. Ordered food and the order came out wrong. Seemed like the owner could care less if we were happy with the service. Trying to leave this place to fix my night I asked for the bill but the server kept giving attitude and moving at a slow pace. Nice looking place but seems they hire family members (50 yr old women) with no experience to service this place.  I wish I could leave zero stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cHUyMlVREAE",
            "text": "Excellent place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNXBYbEp3EAE",
            "text": "So I went there 5/22/24 have been there before and their sushi is amazing, haven’t been there in a while, and I’m guessing it’s a new menu so on the menu it’s said shrimp tempura rolls, I order.. they bring me fried shrimp sticks, when I told them this is not what I expected, and I wanted the sushi shrimp tempura rolls, the server JULIA V. Said that it was ok n that they would take it back although I never touched it they added IT TO MY BILL , they add their tip to bill as well, but because they went out there way and seemed kinda about the situation I add a cash tip on top of the amount. I feel like that was very sneaky and very low for the restaurant to do.. I still paid for it, I also was the only Dark toned person there, and felt like she was being really racist while she spoke to the person next to me in Spanish about what was going on, and seemed to be bothered by me I felt really outta place there. THE SUSHI WAS GREAT  as!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaDdicmFBEAE",
            "text": "Phenomenal service, food, cocktails and music!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENjlfaEdnEAE",
            "text": "Great place for a date or just lounge with friends. Passion Fruit Mojito was great, service by the waitress great. The food was good but on my beef teriyaki I would have preferred more thicker beef strips and less rice; but the presentation was super beautiful, will come again."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcHR2dTJ3RRAB",
            "text": "Acogedor lugar. Comida exquisita . Buenas atenciones y las atenciones excelentes. El ambiente es súper bohemio, se pasa muy bien! 🥂🍺"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENnBxU0l3EAE",
            "text": "Omg the food  and service is amazing and the drink is something sweet but if not bad ,I loved 😍"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eC1mc3RRRRAB",
            "text": "Excelente las atenciones, un personal extremadamente cuidadoso. La comida genial lo recomendamos 100%."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NWJtTENREAE",
            "text": "Aroma Restaurant & Sushi Bar menu outside the restaurant convinced us to go inside. Not Sushi eaters but the Teriyaki Chicken caught our eye.\n\nWelp I hit my 600K now Can ya'll the original number goal I had in my head ????\nHint I didn't hit it yet....\n\n@kendrickclone70 and I spent the day on some going to see our doctors to make sure our health is on point. And coming out one of our appointments we notice this restaurant across the street @aromarestaurantt which is listed Aroma Restaurant and Sushi Bar as we are reading the menu in the window. And the Teriyaki Chicken caught our eyes. So we pulled up.\nAs we are seated by a latin waitress with a nice size BBL I look around the restaurant and all the waitresses are latin with BBL's BBL's. Now I am wondering is BBL's mandatory for them to get a job there. We ordered both our Teriyaki Chicken and when they came out plated so nice. And the food was delicious. And what actually brings this restaurant over the top for me was not the BBL's and the abundance of latin woman.\nThe top for me was the simple glass of water. The water was a ice cold and even though it was in a cocktail glass our waitresses yes waitresses kept my glass refilled over and over and over. I added the lime and by the time I was finished eating my slow self lunch my mucous (pause) was no longer bothering me in my chest.\nHealth is wealth #2024"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bnFqZ2NREAE",
            "text": "The restaurant serves great dishes - I usually get the penne a La vodka with shrimp but this time around I got the samba sushi roll , fried calamari and then for my main course lamb chops- oh my good samba roll was delicious- fried calamari was tender and not chewy - plus that marinara sauce was on the money - the lamb chops were great and I had that with tostones and grilled vegetables - my neice ordered the branzino fish in which I tried - everything was finger licking good- you won’t be disappointed- the service is wonderful - beautiful polite women- who tend to every need including water whenever I drank it down and I drink a lot of water - the atmosphere is relaxing and I would go there every week if I could afford it 😜 but the prices are decent depending on what u get but please know that you won’t be waisting a dime on anything - it’s all worth it - highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOM05YRGdRRRAB",
            "text": "Excellent atmosphere and great good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNFBUZWR3EAE",
            "text": "After landing on my radar, finally got a chance to try Aroma Restaurant and Sushi Bar\n\nWhat got my attention is they advertise an appealing Happy Hour. Aroma is located in an area of Marble Hill where there's lots of public trans, buses(1,2&9) and trains(1 train and Metro North) It's close to many popular shopping spots like Target, Aldi , and right across the street from a Starbucks so there will be no trouble finding it. Unfortunately my dining partner and I missed the Happy Hour special on the night we visited because we ( like most NYers) get off later.\n\nHere is my honest opinion of our experience, and again it is only an OPINION no offense is meant or should be taken. Use this review as an opportunity to IMPROVE.  Everyone as a bad night, doesn't mean it's a bad place and things can change depending on the day so what we experienced can be completely different for other guests. Here goes:\n\nAt first, Ambiance was enjoyable. When we first arrived the place was pretty empty with only a few patrons. We were able to walk right up to a table with no waiting. Initially, our server was attentive , gave us our menus and asked us for our drink orders right away.\n\nI went with a passion fruit mojito and my partner ordered a tequila sunrise. Both were pleasant, not too strong, and tasty. For appetizer we decided on the Trio de Tostones with Ropa Vieja(3 muffin tin sized fried plantain cups filled with a tasty beef stew)  It did not disappoint and was yummy. (Sorry can't say the same for the entree)  Food and drinks arrived in a timely fashion.\n\nCons: First thing our server told us was there is no sushi . For that to be advertised in the title of business, this was of course a disappointment.\n\nFor entree,  I ordered the Chofan with chicken which for my preference, didn't taste good or fresh. It was made in a style that I did not enjoy,  I've been to many restaurants where I ordered this and enjoyed,  but this didn't hit.\n\nMy partner ordered the teriyaki chicken.  It was ok, nothing special. (Could have got it much cheaper and much better at a local Chinese restaurant) It did not meet their expectations presentation wise. Normally an order of chicken teriyaki  consist of thick slices or meaty chunks of chicken tossed in a generous amount of sauce served over a bed of rice. What they got was a piece of chicken breast pounded flat,  drizzled with teriyaki sauce in a decorative criss-cross pattern, which while didn't taste bad was not a winner.\n\nAlso our little corner got crowded  quickly when our servers sat a large party right next to us! This was unnecessary as there was a lot of other tables to maintain a reasonable distance.  We were bumped into, as more people continue to slide in to join the group throughout the night. We felt boxed as they sat children in high chairs right next to us.  If we wanted to feel like we were at Applebee's we could have just went there!  It was quite distracting and ruined the vibe as we tried to decompress from our long week.\n\nAs the evening progressed, the service declined significantly.  Long after we finished our meal , no one bothered to offer us another glass of water, drink or the check . We just sat there with our empty cocktail glasses and an cleared table for about a half hour.\nOverall Aroma Restaurant and Sushi Bar was pretty much a let down , so we will not be returning again.  We arrived for the happy hour but departed very unhappy:(\n\ntl;dr -Drinks and appetizer was fine, but main entrees didn't work. Service was uneven . We ended up getting flat out ignored by servers. Aroma Restaurant and Sushi was not worth the hefty price tag. IMO if you wanna go definitely try to make the Happy Hour and stick with the apps and cocktails which were the best part of the meal and are advertised at a fair price point."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bF9Ha1pnEAE",
            "text": "The food was delicious! The chef is very kind and passionate about his food and restaurant! My mom is a picky eater and was also definitely impressed. New neighborhood favorite! Food is very reasonably priced - economical even for the…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOWNudVh3EAE",
            "text": "This place is definitely one of my favorites in NYC🥰🥰😍🤩👏🏼... even when I visit other places in the city, I tend to finish my nights at this restaurant because of their music and their pretty affordable appetizers and drinks (which are good-good).\n\nIt's really weird to me to find mixed reviews over here, considering my friends, clients and myself never had an issue with them. I'd suggest you try these type of places by yourself, because you never know the two sides of a story.\n\nAroma has always delivered the best service no matter the crowd, the day nor the time. And I'm a regular there, so I know what I'm talking about.🤗\n\nOverall, it is a safe and clean restaurant with great vibes and ambiance, their music selection is always fiiiirrreeee 🔥🔥🔥🔥 THE FOOD: absolutely delicious, and if your a wine lover 🍷, they have a wide variety of world renowned brands and amazingly good cocktails. Try the margaritas and the Passion Fruit juice, sooo good... Specially the tamarindo mojito and the Jumbo Rainbow margarita, one of those and you'll be set!\n\nIf you're into pasta, order their Penne a la Vodka, the lobster ravioli or their Seafood Fra Diavolo 🥰. From the appetizers menu, I recommend the fried shumai, mofongo trios, the quesadilla, the Spring rolls, and finally the cheese and spinach empanadas.\n\nAlso, make sure to order sushi, IT'S THE BEST in the area! and actually one of the best in the city, for an unbeatable price. My favorite sushi rolls are \"Nemo Roll\" and \"Aroma Roll\" (those are a little spicy).\n\nOH! and make yourself a favor and try their Brunch, no worries with the kids, because they have a welcoming environment for everyone. 💯💯 #recommended"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlXzVQR19RRRAB",
            "text": "Dont do it to yourselves,\nThis place is A sushi place wanna be!\nHow we order ramen and literally this is a “sopa de pollo” everything ordered on the app was not what came!!! Very disappointing.\nNo Japanese vegetables - no egg, no scallions.\nDisgusting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLc3RURHF3RRAB",
            "text": "The interior was beautiful, the staff was very nice and courteous, and the food was very delicious. I really enjoyed the drink and the sushi. The best part is that there's a huge parking lot opposite opposite the restaurant where you can park your card for certain number of hours. Overall it was a very nice experience"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaGRhTEt3EAE",
            "text": "Lovely place, food very good, feels fresh, staff always asking if everything is good with you which makes you feel good even tho isn’t your server all the staff are ready to help you!!!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNjYzUnBnRRAB",
            "text": "Waooo, fue lo que constantemente repetí con cada bocado, la comida y el concepto es extraordinario, muy bunas atenciones , el sushi 🍣  de manos de un verdadero experto, altamente recomendable, ambiente familiar…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb1o2QW9BRRAB",
            "text": "Excellent food, great service, friendly staff, well deserved 5*'s ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScEpEUFpREAE",
            "text": "Like this place love Sundays with family. Thank you all"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbmNfQnV3RRAB",
            "text": "1st time visiting. I was truly impressed with this restaurant. I was part of a group of 11 and were seated promptly. Manager/Supervisor and waitstaff were superb!!! Food and drinks were excellent. Definitely recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeDRmU0pnEAE",
            "text": "Had the most delicious meal ever my self , son and brother.  The drinks were great try the coconut mojito you’ll love them.  The grilled octopus is divine.   Also the Paella will leave you wanting more. Last but not least the cheesecake have it ….  You’ll thank me later…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhN29YRWx3RRAB",
            "text": "The staff here are beautiful our waiter was really nice and friendly. I gave 3 stars because honey the food is not good. The salmon lacked flavor and was raw in the middle and smelled terrible. The shrimp scampi smh water and salt. The sushi was great but the rest of the food is not so much."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbDZhMGF3EAE",
            "text": "This was the last place we went to for dinner before my mom passed and I’m glad we did. She really enjoyed herself. The workers here are very friendly and the sushi was fresh and amazing."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaGJLeEdREAE",
            "text": "The mix of both Hispanic food and Asian food is something unique in the area. There's a lot available for both menus, plus beverages and desserts. The food is good but it could be better. And service is slow so don't be here with quiet people awkwardly waiting. What's work coming here for is the sushi, it's excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaE9YSVp3EAE",
            "text": "The restaurant was basically empty when we came in but the waitresses took forever to come and take our orders. They also told us that there was no sushi that day because the person didn't come into work. We ordered 2 chicken quesadillas and they took over 30 minutes to come out when no one else was getting food. I think the quesadillas were also supposed to come with guacamole but they didn't. And on top of that, the quesadillas were tiny and unremarkable for taking over 30 minutes to make. And on top of that, the receipt came out with tip already added in the total, and it asked for tip again when I paid"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMGNMWDJnRRAB",
            "text": "This place charges tips automatically in your bill. Beware not to overtip. I did and realized too late. The bartender did not say anything. Not morally honest!!! Food is okey - not creative, boring. Wrong neighborhood for this kind of food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMjgzUnlRRRAB",
            "text": "Love the decor and the staff was very accommodating and friendly...the food left a lot to be desired. I was waiting for some extraordinary tastes but left wanting. The food in itself was not bad I just anticipated a burst of flavors. If you are on a diet and healthy path this place is perfect their veggies were steamed to perfection"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbTlTSmZnEAE",
            "text": "I love this place. So glad they changed it from the old restaurant that was there before. Everything I've had here has been amazing. Love the workers and the drinks are always the best. Ima seafood person, and so far Everything I've tried always hit the spot !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5M00tQnRRRRAB",
            "text": "Sushi meals were very good, issue with the restaurant is they charge you 4% for using your credit card. What restaurant does that? Put the 4% charge into your menu pricing.  Who goes to a restaurant and carries cash and they put on your…"
        }
    ],
    "reviews_count": 69
}