{
    "name": "Tobala",
    "place_id": "ChIJPbOOFvPzwokRttFt-acm5qo",
    "grid": "BX8",
    "address": "3732 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.5,
    "user_ratings_total": 352,
    "phone_number": "(347) 427-6889",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKZ0xlZTJnRRAB",
            "text": "We love this place and are so happy it opened in our corner of NYC. The food is very unique and everything we have tried has been so enjoyable we are trying to work our way through the whole menu. The drinks are exquisite as well. Definitely worth a visit."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eGFYSnlabGd4UlZsdGVrcDVVbDlQZGpGTE9WRRAB",
            "text": "Delightful experience at Tobala. I really enjoyed the intense flavors paired with a thoughtful drinks menu. The guacamole is a little start and I can recommend the guava margarita. The carne asada is seared and then cooked to perfection, the bed of corn with spiced peppers adds a nice touch. You can't go past the Buñuelo de Viento for dessert, crispy fried biscuit stuffed with soft coffee flavoured cream and topped with delicious spiced chocolate ice cream\n\nService is attentive and the aesthetic and ambience is phenomenal. This is a splurge option restaurant."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMldFZHBjbmMwT1dONFh6ZG5RbnBwTFROQmQxRRAB",
            "text": "Tobala has the BEST cocktails in the Bronx and the food is 10/10. You can feel the time and investment that the owner gave to this place. The service is fantastic. All staff members are knowledgeable , hospitable, and  very accommodating. The hospitality training is felt. Then the food! 🤌🏽🤌🏽🤌🏽 What a selection of delectable plates. Incredible. In my experience, many places that exceed in the food offering fall short on the beverage program but this place is an absolute exception. The cocktails are just as amazing as the food! I’ve sat at a table and at the bar at various occasions and have been pleasantly surprised. This place is fantastic for a celebration, date night, or if you’re just in need of a delicious bite and a yummy cocktail. I love that you can dress it up or come in jeans and sneakers—the service and experience is exactly the same. There is nothing presumptuous about Tobala and everything is amazing. Well done! I highly encourage a visit."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201U1NGQjVaMnBLYVZRd05GQkxla2R0UkdNNWEwRRAB",
            "text": "Food was extremely unseasoned. No flavor at alllllllll except for the lamb tacos .. the lamb was good but the tortilla was inedible and the fish seemed like it was just thrown into the fryer with no salt or anything . The drinks were okay and the waitress & staff  were pleasant . Thats the best I can say . Go at your own risk"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNWMwVmtMVTlUYjFWSU5uRnlRMnhUTURCS1dFRRAB",
            "text": "Top tier Oaxacan food I’ve had outside of Mexico. The ambience has a mellowness to it the goes perfectly with the smell of palo santo the greats you at the door. The vast assortment of tequilas and mezcals will having coming back for more."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFJqQkNNVmRqWm1oaGRXaDVXbGxaY0haYWQwRRAB",
            "text": "Wonderful service, delicious moles, inspired inzerpretatiUnbelievableons of traditional dishes.  It’s expensive but worth every penny."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVFpYcHVTeTFqVjNodlMwazFUbXd3WjBOSFNGRRAB",
            "text": "Top food and experience we have had in Riverdale.  Delicious!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZmJqZHVibTkwUkRnMUxXWllUMmhyWW5aaE5GRRAB",
            "text": "Phenomenally good!\nDinner on a Tuesday night, not super crowded. We shared 2 appetizers:shrimp al crudo and their specialty corn with crema/cheese. Each was delectable, good size and we ate every bit. We split the entree, fish of the day which is prepared grilled with tomato purée, and this day it was branzino. It was OUTSTANDING!\n\nNo problem finding street parking. We enjoyed the setting, service and the incredibly prepared dishes. So many more to try. Will be back for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1dWOHlNazVvWlVnMGMyZEVMV0pTVjI1aVJrRRAB",
            "text": "Absolutely delicious and amazing atmosphere. Excellent service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdE9XSjFSbFZTUWpKWldrSkVRbGQyVUU5NU5VRRAB",
            "text": "Great food in a sophisticated ambiance with a beyond friendly staff. The  Mexican dishes with a Dominican 🇩🇴  twist , keeps your palette in culinary suspense. The energetic bartenders, serve up tropical cocktails from a well stocked bar. Tobala is a gem in the heart of Riverdale."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prdFJGYzVWVGN0U0RCSlpEWlVTbEZpTVdSSk1sRRAB",
            "text": "The idea of recreating the feeling of Oaxaca might sound appealing, but when it comes to the food, it completely misses the mark. What is presented as Oaxacan gastronomy feels more like a disrespectful imitation than a true homage. It comes across as a cultural fraud — another example of how American businesses appropriate traditions, exploit them, and then overcharge for an experience that lacks authenticity.”\n\nLa experiencia de sentirse en Oaxaca puede resultar valiosa, pero en lo que respecta a la comida me parece una total falta de respeto hacia la auténtica gastronomía oaxaqueña."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSmRtcDZPVXRLVmtSS1NEVmlXVlY2TXpscmVWRRAB",
            "text": "I recently celebrated my father’s birthday at Tobala and from the very beginning, the experience was impressive. Booking the reservation was simple and stress-free—no credit card required. They even called ahead to ask for my father’s name and mine, which made it feel very personal. Upon arrival, we were pleasantly surprised with a custom menu that said Happy Birthday with my father’s name printed on it. That thoughtful touch really stood out and showed they went above and beyond to make the celebration special.\n\nThe space itself is absolutely beautiful—elegant and stylish. For me, it was a little darker than I prefer, but the décor was gorgeous and clearly well thought out. The staff was another highlight: polished, professional, and organized. You can tell the owners have invested in building a strong team, and it shows in the level of service.\n\nThat being said, when it came to the food, it just wasn’t what we were expecting. If you’re looking for true, authentic Oaxacan or traditional Mexican flavors, this may not be the right spot. Most of our group felt the dishes leaned more toward American-Mexican cuisine, and unfortunately, none of us really enjoyed our meals.\n\nOverall, Tobala shines in its service, atmosphere, and attention to detail. While I personally wouldn’t come back to dine, I truly appreciate the effort the team put into making our evening feel special. For anyone seeking a beautifully designed space with excellent hospitality, Tobala delivers. But if your priority is authentic Mexican cuisine, I’d recommend exploring other options."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xT01teDZjWFl4VldKM2RGWkNSMkpxWjBaWGFXYxAB",
            "text": "Tobala isn’t just the best restaurant in Riverdale—it’s one of the best dining experiences in New York City.\n\nThe staff set the tone from the moment you arrive: attentive, knowledgeable, and genuinely welcoming. They’re deeply familiar with the menu and ingredients, and their thoughtful recommendations always enhance the meal.\n\nThe cocktail program is exceptional, with mezcal offerings that are carefully and expertly curated. Each drink feels considered, never generic.\n\nAs for the food, it’s consistently outstanding. Any dish featuring mole is a must-order, but the esquites stand out as some of the best we’ve had—even compared to Michelin-starred spots in Mexico City. Desserts deserve equal attention, especially the Flan de Elote paired with the rich, creamy Zapote Ice Cream.\n\nI’ve dined here eight times now—sometimes alone, sometimes with friends or family—and Tobala has never once disappointed. Whether it’s a quiet evening or a lively group dinner, the quality, care, and attention to detail always shine through."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Tk9XTkZWMVprUms5a1RsZE9iMlJvYW5OVk5IYxAB",
            "text": "High end Mexican cuisine with an exceptional bar.  The food was innovative and delicious.   Try the corn salad. Then everything else.  The devour is simple and soothing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VFYxTkxSVzlDVUdkQ2NESkxNaTFvWDFCME4zYxAB",
            "text": "Cute place, great servers. I’d go back for the drinks not the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S0xVTkZUV3g0UlZGVU9WbDVaMFJuT1d0TGEzYxAB",
            "text": "We go to Tobala periodically and have never regretted our choice. Since they have opened their doors their waitstaff is nothing short of amazing. Gyron & Oscar are informative, pleasant, and always anticipate the needs of the guest which is so important in hospitality especially when it comes to a place that has such a large selection of mezcal & other unique spirits. They are more than happy to share their knowledge and enhance your experience here. The food is simply delicious, authentic Oaxacan cuisine in a minimalistic, sexy & modern ambiance. The music is never too loud and the lights are never too bright. I could easily dine here every night and feel like I’m on an island. Thank you for always welcoming us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eFpFUnBiMnhUTlROYVRVVlJRWEJIZG5aR2NuYxAB",
            "text": "A great experience at Tobala! The food is deliciously experimental. The atmosphere was cozy and luxurious, from the lighting and interior decor to the dinnerware. We had the Esquite, Short-Rib Memela, and the steak Tlayuda for appetizers. They were delicious. The Short-Rib was on the salty side, but still quite delicious. Our family ordered the Duck Enmoladas, Pesca Del Día, and Pulpo. The Oaxacan-inspired dishes experimented with the traditional Oaxacan ingredients and dishes to create a unique bite. I highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSlEybExNVXRaWVd0YVJIbFFka05yU1MwMlpIYxAB",
            "text": "The food was exceptional and our server was kind, knowledgeable, and professional. She went above and beyond to curate an awesome experience for my family. Thank you so much!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcVIySmFZbmhETkd4aFZtNXhRa050VEMwMk9GRRAB",
            "text": "The food was absolutely 💯 amazing!!! Great staff and it was clean."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaVZVczROMGhQZEdwYVUzQnNiMWxsZDJsVGQzYxAB",
            "text": "Simply exceptional in Every way!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFJqaFJWM0ZoTVdoMFJVeDNiMkp3VFdrM1lrRRAB",
            "text": "Very good flavors.  I came for brunch so I would definitely like to come back for dinner to get a better feel for the menu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVWRUZ3RZblJ4V25sUU9TMUZNRlE0UWxKalQwRRAB",
            "text": "This restaurant was on my list for a while and was happy to finally stumble upon it. Our waiter Johnathan was great, witty, and knowledgeable. We had the draft beer, esquites, tacos de Barbacoa, duck mole, and the pastry/hot chocolate dessert. Food was balanced and delicious. If I had to be critical for this restaurant to reach its peak success- I would say the mole did not come out as hot as it could have (was just slightly warm) and the tacos de barbacoa could have used more balancing and freshness to it. Would definitely recommend and come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tka1luUTROVVU0Y1VWWVRFVk1SRWRrYVc5TE5GRRAB",
            "text": "Shockingly good. Every bite was delicious. The decor is stunning. The servers were extremely knowledgeable. Lastly, the smell of the whole place is dreamy. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcWRYUTBNMGxhU0ZoSmQycFFja3BVYmxSRk5tYxAB",
            "text": "So close to being a Michelin Restaurant, BUT missing that one thing.\n\nI was born and raised in Manhattan, but moved around here a couple years ago and Tobala's atmosphere, interior, service, and knowledge of the waitstaff is impeccable. I genuinely think they're near Michelin quality in terms of those aspects; HOWEVER, they're missing something major holding them back from achieving it.\n\nThe restaurant's food tastes good, but I think the food could taste a lot better. I really love it here, but this is something I deeply wish they'd improve. Since unfortunately, I think their nearby competition does beat them out in this aspect, I hate to say it. I really wish for Tobala to improve the taste of their food to match the presentation of it, as well as the rest of the immaculate aspect of the restaurant. If you're from this area though, it's definitely the place to try.\n\nIt's so refreshing and brings class to the area, I'm so thankful to have it here and will continue to go."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbWFGWkNRMDA0VW5sRVMwazFXVGxFZUhScWVHYxAB",
            "text": "I came to tobala with my mom for the first time about a week ago. The place is very aesthetically pleasing. The ambiance is very minimalist and nice. To me that was great. The menu is very limited and for the amount quite a little pricey. The food was not bad but it’s very unique to its style.  The Tlayuda was great with the steak. Everything else was ok for me. The service was good, the waitress was very attentive and very informative about the place which I enjoyed."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN2NMd3h3RRAB",
            "text": "It was a pretty good place. Would've liked to see more variety in their drink menus and they also only had 1 desert available. It has to taken into consideration that this place doesn't even have a year yet. But overall the experience was good. Definitely recomendable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTmRWQXRYMFpRUTBGWExYVm5WM05sTVdGeWVHYxAB",
            "text": "The food, service and decor of Tobala are wonderful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTmJWOXZkVEU1U1VOTVVqQXpSVWx3YmxaaFNHYxAB",
            "text": "a piece of México in Riverdale. def a place to enjoy good food. it's pricey though"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMlMxVnhWWEZaYVU1WU9GOVRTbmd6WTFKeWRHYxAB",
            "text": "Excellent all-around. Great product. Chef knows what he's doing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbmRXZDRlbmd3TFhkMlJHNHRPVkJKY0dsbU1YYxAB",
            "text": "Extremely expensive for tiny portions. I had a short rib memela that tasted as if the meat was reheated. The waiter was condescending and unprofessional. Don’t walk, run from this place!! Can’t say enough bad things about this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMVRESTFZVEJvV1VSUVVFeEVielZIU3pCS1gzYxAB",
            "text": "Very nice place. Food was great. Service at the bar was outstanding. Drinks are good and fun! Decor and atmosphere is very nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeFowcFRWR2Q1UjFGQ2VrWktXVk5LZFdGcVVXYxAB",
            "text": "10/10 food & drinks are amazing. Something different, would definitely return"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RlNtRmtOM3BzTFdZNVJtNDVZMWRHVWw5SE1IYxAB",
            "text": "This is absolutely the best restaurant in the entire Bronx! 🙌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUWNuaEdjR3RWTm5ZNFRteGlabkJxVTJ0cFRIYxAB",
            "text": "Delicious all around. I sat at the bar during happy hour—which, to my surprise, ran a little longer than expected, giving me extra time to enjoy the vibe and the drinks. The espresso martini was truly to die for—not like any other I’ve ever had. Rich, smooth, and perfectly balanced. Every cocktail we tried had its own personality, distinct and full of layered flavor.\n\nI started with the Tacos de Cochinita, which were tender, flavorful, and packed with slow-roasted goodness. The guacamole was fresh and creamy with just the right amount of lime and heat, served with warm, crisp chips. You could tell everything was made with care.\n\nThe service was a standout—attentive, knowledgeable, and genuinely enthusiastic about the menu. They offered helpful recommendations and checked in without being overbearing.\n\nThe setting itself felt upscale yet welcoming, with modern Mexican flair. It’s the kind of place where you can dress up a little, enjoy quality food and drinks, and still feel completely relaxed. Whether you’re there for a casual happy hour or a full dinner, this place delivers an elevated experience across the board."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQUHk4Wk9taU9ha3JRRRAB",
            "text": "This place is by far my favorite Mexican restaurant to eat, the food is amazing the space is gorgeous and the attention to detail well deserves a Michelin star.\n\nI have nothing else to say except to come to Tobala and try it for yourself, also their menu changes so that’s a plus for me!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYmh5YXF1djd5SndBRRAB",
            "text": "What a gem! Went here tonight for date night & was so impressed by the service and food. Their specialty drinks were also well curated. Love to see a beautiful spot like this in the community 🇲🇽🇩🇴"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYkU2ZGo2bzZ2RXFRRRAB",
            "text": "Unique and delicious.\nWhat a great experience, well designed with a modern take of Mexican style.\nAuthentic menu with traditional imported ingredients. And an amazing offer of agave produced drinks and their own tequila and mezcal brands.\nThe service is phenomenal, with plenty of space to park and excellent location.\n#HighlyRecommended by\n@Aventure.dos and @SoIsayIcancook"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMjFtWlQxNktxODVnRRAB",
            "text": "I went with my husband for dinner, Franmy was the best! Everything that he suggested we loved it, the decor is beautiful and the atmosphere is super cozy! We will come back for sure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbU5wNWFVbXNyRFpBEAE",
            "text": "Food was delicious and authentic. Service was exceptional."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMjhpYzNDdGJLV3ZBRRAB",
            "text": "Filled with lively conversations. Amazing food. The kind of restaurant where it's okay to spend the entire evening with friends. Waitstaff is supportive but never intrusive. Perfect timing for each course."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZekwtOFdREAE",
            "text": "Tobalá is a gem of a restaurant that beautifully blends creativity, flavor, and atmosphere. The moment you walk in, you’re greeted by a warm, intimate setting with thoughtful decor and a welcoming staff. The menu is inspired and ever-changing, showcasing seasonal ingredients with a strong nod to Mexican roots, particularly Oaxacan cuisine.\n\nWe started with the mezcal cocktails, which were expertly crafted — smoky, balanced, and unique. For starters, the heirloom corn tamales were a standout, with perfectly soft masa and rich fillings. The main dishes were equally impressive; the mole was deep, complex, and memorable, and the grilled meats were cooked to perfection.\n\nService was attentive without being intrusive, and the staff was happy to explain the dishes and suggest pairings. Prices are on the higher side, but well worth it for the quality and experience.\n\nOverall, Tobalá is a must-visit for anyone looking for a special dining experience that celebrates bold flavors and culinary artistry.\n\nThanks again for a great experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJZVh0YVNaM0xPZ0V3EAE",
            "text": "The food was good, but the service definitely needs improvement. No one came to our table for about 15 minutes after we were seated. I think the manager noticed and came over—she was very sweet and ended up taking our order. We also had to ask for water multiple times. Overall, it felt a bit overpriced for the level of service we received."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSzJtTXZqNXJpYldREAE",
            "text": "Of you are looking for an average \"mexican food\" this is NOT it.\n\nBest atmosphere, great people and services best food. Carefully handcrafted and fresh ingredients.\n\nAlways have a mezcal drink."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPVEF3ZXI3bzQ3dmRREAE",
            "text": "This was our first visit and we enjoyed our entrees, Enmoladas De Pato and the Tlayuda along with the guacamole appetizer. The guacamole for $18 comes with 3 tortillas. We asked for 2 more and were charged $5!!   That really soured the whole experience. We won't be back."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQQ0d3WXYxcXRMU1RREAE",
            "text": "No se ni por dónde empezar… tuvimos mala experiencia en varios puntos, no se si por ser mexicanos prácticamente no nos atendieron bien, la mesera ponía cara, el trago con una pizca de alcohol que parecía jugo, teníamos que levantar la mano…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMGZlRUl3EAE",
            "text": "This place is a guaranteed no-regrets date spot. We loved all our dishes, but the two big stand-outs were the Short Rib Memelas and the Crudo. Our cocktails were great, and the service was top-notch. Just go!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLWE2UWlBRRAB",
            "text": "Tobala was recommended to us by a Oaxacan friend when we visited Oaxaca City last month... and we finally tried it last night. The space is light, airy, open and lovely in its simplicity. The service is excellent. And the food was as delicious and as authentic as the meals we enjoyed in Oaxaca. We started with a mezcal-based cocktail, and small plates of grilled prawns in a mole rojo and a rich, butter-tender short rib memela. Both amazing. We moved on to a meal of pan-seared arctic char in a tangy mole verde with pureed pumpkin and pepitas, which was perfectly cooked and a generous portion. We had no room left for dessert, but I enjoyed some Amargo-Vallet (first time I tried Mexican bitters - aromatic and the perfect finish to a rich meal) and my husband had a beautifully presented flight of 3 pechuga mezcals; each one with a unique flavor profile. We had a wonderful time!\nTips: if you dine early, you will avoid the crowds and noise of the after-7 crush (the restaurant is popular, and the bar is spacious but fills up!), do make reservations, and plan to take your time to really enjoy the food. Prices are high but reflect the quality and value of the food, ambiance, and service. Worth it.\nWe are already planning our next visit. The menu changes seasonally, so we'll have new choices each time we dine. Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc3RtcTlBRRAB",
            "text": "Food was good, however extremely overpriced for little food. Drinks were ok, but overpriced as well.. love the ambience but won't be going back.."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dWRHWmRnEAE",
            "text": "Do not miss this spot. Absolutely exquisite from drinks all the way to dessert. Impeccable service. Thoughtful flavors. Ample portions. Out of this world flavors. I hate to gush, but wow. Just wow."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dXJlU0NREAE",
            "text": "Really good Mexican food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMDRxbjFRRRAB",
            "text": "Had a lovely time at Tobala. Outstanding service and lovely decor. The best dishes were Michelin worthy. Some didn’t quite hit the mark as much. But overall, a depth of flavor and loving attention to detail make this place worth a visit, despite the high prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMl9HX0tREAE",
            "text": "Tobalá was absolutely fantastic - from start to finish!\n\nReservations are not required, but I could see why it is suggested - it could easily get packed.\n\nWonderful service (Cindy was knowledgeable and courteous) and superb food (easily one of the top 5 meals I've ever eaten at a restaurant - thank you chef Moises!)... I could see why they're poised to get that Michelin star (good luck!)\n\nPerfect date night spot, great NYC location (Riverdale).\n\nHope to come back sooner than later."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkOGF6UElREAE",
            "text": "Beautiful Restaurant! The atmosphere is amazing we loved the decor from the point you enter to the bathrooms in the back. The service is outstanding. The food was good we got filled with apps and barely could finish our entrees. Will definitely need to return for a day time meal to see the place in daylight."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX05fSk1BEAE",
            "text": "We were dying to try this place for a while and went hard with the apps. The esquites were interesting and a bit of a modern take from the classic street food but they were delicious. The Aguachile de camarones had the spice I needed in the entire meal. The tostada de pulpo was another interesting take, I think I would’ve preferred it minus the tostada. The Guacamole was the best out of the four apps and will definitely come back to try at the bar with some drinks. As our main course we decided to share the Enmoladas de Pato and we instantly played a defying match of rock paper scissors to get the last bite. The enmoladas were, once again, a modern take on a classic and it did not disappoint. These were so good we forgot to take a photo. For dessert we got the Flan de Maíz and it was creamy and well prepared. Drinks are very well curated and will be great with food or on their own."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NDV6NTdnRRAB",
            "text": "Came here for dinner with the family and was extremely impressed with the service, the food and the drinks. The staff was incredibly friendly, knowledgeable and patient (we had a toddler with us) We started off with the guacamole, esquite and lamb tacos. Everything was nicely portioned and flavorful. We ordered the fish tacos and shrimp tostadas and very delighted with both. The fish tasted fresh and the shrimps had a nice kick to them. We finished off with the pollito de leche (the hen) and it was perfect! We ordered tortillas and made more tacos.\n\nThe drinks were great as well! I had el mero mero which was great, spicy and refreshing. I also had the spicy margarita which was amazing as well. I was able to try the guava Margarita and recommend that too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNFAtZG93RRAB",
            "text": "10/10 I came to celebrate my 8th year anniversary with my sweetheart and I must say I was highly impressed with the food service and atmosphere.\n\nThe food is great with so many authentic flavors of Mexico. Not your average Mexican dish but unique and tasty. I had the tlacoyo with beans and chorizo, the salad was beyond amazing and the pairing with the fried egg made it better. My partner had the memelita with the waygu and it was great as well.\n\nTHE DRINKS were beyoooooond amazing.\n10/10 CARAJILLO, ever had an espresso martini? This drink is 10x better than your average espresso martini. The flavor is so rich that it leaves you wanting more.\nIf you are looking for a spicy but yet refreshing drink get “El Mero Mero”.\n\nOur lovely server Ines was kind and sweet. She gave excellent hospitality and service. She recommended the best dishes and on top of that made our anniversary date special the way it should be.\n\nThank you! We will be back soon :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dHNENW93RRAB",
            "text": "Great place for drinks in Riverdale and a quick bite to eat at the bar. If you’re looking for something romantic, this is a strong contender. Candle lit tables and aromatics fill this space with great music, food and drinks. The service at the bar was fast and friendly. Drinks were consistent and food came out in good time. Pictured are the mariposa, serenata, guacamole and chips and the esquites. All were delicious and had great presentation. Tobala was somewhat busy on a Friday night which died down after 10pm or so. I’d recommend reservations as the weather gets better as there is plenty of outdoor seating available."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeHJfZ2h3RRAB",
            "text": "The service here is top notch. My wife and I sat at the bar. We weren't that hungry so the portions here were perfect and I was way more interested in the bar. We sat at the bar and our servers were very gracious. They created a mezcal flight for me based on my little knowledge of mezcal, my alcoholic preferences, and what dishes we ordered. $48 for a mezcal flight, 3 servings from 3 different bottles. Each one was very different from the last. My wife had a non alcoholic drink, La Orgua. I took a sip. It was a very mild flavored drink. Looked beautiful but tasted watered down. We ordered the guacamole which came from cotija cheese on top. The guac serving was generous and delicious. The aguachiles were Oaxacan style. I've had aguachiles in Mexico City so I was foolishly expecting a different flavor so I did not enjoy that much. Nothing wrong with the dish but I felt the seasoning was lacking. Still a generous portion. Both dishes served with tostadas. I'll definitely be back for mezcal and to try cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcEtTQ2NBEAE",
            "text": "What a stunning venue, with exquisite cuisine and an impressive selection of Mezcal.\n\nThis place instantly transports you to the heart of Oaxaca, Mexico. The decor is beautifully minimal yet meticulously detailed, creating a magical ambiance enhanced by the aroma of palo santo.\n\nThe food is simply delicious, offering a unique twist on traditional Mexican dishes. A must-try is the Aguachile de Camarones, Guacamole, Esquites, and Roasted Repollo.\n\nThe bar is a hidden gem, boasting an exceptional array of Mezcal. It promises a memorable experience for those who love Mezcal and newcomers as well. Don't hesitate to ask the staff for recommendations!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKemZmQWx3RRAB",
            "text": "I highly recommend coming here as the ambiance and service is unmatched. Ines, our server was so kind and empathetic. She gracefully attended to us and shared her recommendations. We felt at home here and never felt rushed. We loved the…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOVBpTzF3RRAB",
            "text": "One of the best Mexican cuisine I ever had. The lamb tacos were delicious, the Cochinita for share was really something, best Mexican pork I ever had.  The Pollito with milk,  was amazing with the mole. and really enjoyed the tamale dessert with coconut and pineapple. Great food, nicely decorated and good drinks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eS1Md0tREAE",
            "text": "I went to this place for brunch on a Sunday and it was amazing. I can see why they were nominated for a Michelin star, the food was amazing from\nThe appetizer to the entree and dessert. I definitely will be going back. A hidden gem at the heart of Riverdale! Nico the server was fantastic and very knowledgeable and patient."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdW92dFpBEAE",
            "text": "Staff is friendly, great smiles, decorations are awesome, soft music, family friendly, they also educate you on Oaxaca cuisine, ingredients use and special of the day. Portions are great, drinks amazing. Kitchen is open you can see chef and assistants preparing the food. We requested to see the chef and thank him for a delightful meal and dessert, also took a picture. Guacamole was amazing,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOGR5SjRRRRAB",
            "text": "I never leave reviews unless I literally been amazed by a place. This restaurant is the quintessential about food, ambience, service and kindness of the people!\nAs an Italian (born and raised in Italy) I rarely go out my “comfort food zone” but in this place we had a really terrific colorful and flavorful experience!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX2ZlVzFBRRAB",
            "text": "Hola chicos! Bueno, les quiero hacer mi reseña de este nuevo restaurante mexicano llamado \"Tobala\", esta en el barrio de Riverdale, Bronx. La primera vez que fuimos con mi Esposa, nos gusto mucho el ambiente muy climatizado y la atencion sobre todo, con las personas de la entra y el Barman de la barra. La segunda vez, tambien fue muy bueno el servicio, chicos. Las comidas son más un gourmet de un restaurante de categoria, de un restaurante regular. Las comidas son muy buenas, desde el Pulpo, el Guacamole muy diferente a lo tradicional y las otras cosas que probamos en general....! Yo lo recomiendo, vayan y disfruten mucho este nuevo restaurante.\n\nHi guys! Well, I want to give you my review of this new Mexican restaurant called \"Tobala\", it is in the Riverdale neighborhood, Bronx. The first time we went with my wife, we really liked the very air-conditioned environment and the attention, above all, with the people at the entrance and the bartender at the bar. The second time, the service was also very good, guys. The meals are more of a gourmet than an upscale restaurant, than a regular restaurant. The meals are very good, from the Octopus, the Guacamole very different from the traditional and the other things we tried in general...! I recommend it, go and enjoy this new restaurant a lot."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoci1IVWZREAE",
            "text": "Went for a special event with Gin Condesa from Mexico, the ambiance was beautiful, simple yet elegant. The service was great, very educational. I tried the octopus which has these ants that surface twice a year in a red sauce, delicious, couldn’t notice any distinct taste. The drinks (mariposa) and their spicy margaritas were also great, just wish the block of ice wasn’t so big. We tried the fish tacos and guacamole both delish. The music married everything together nicely. The Dj had great hits and the staff was adding to the wonderful energy by dancing. Loved it!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdHNEVWdnRRAB",
            "text": "I feel taken advantage of, robbed even.\n\nMy friend and I went to Tobalá to have the Valentine prefixe menu. We reserved our table via Resy, and paid a non-refundable deposit of $50 EACH, which they stated would go towards the overall tab at the end of the night.\n\nOur reservation was for 7pm, yet we were seated at a bit after 7:30pm, and did not receive our first course until 8:30. The wait time in-between courses was ridiculous and every dish was more mediocre than the last. The staff was pretty nice whenever they stopped by our table, but that was a rare occurrence in itself.\n\nWhen it was time to pay, they did not include the $100 we had already put towards the bill until we informed them. And when asked to split the bill in half between two cards, they ended up putting 1/3 on one card and 2/3 of the bill on the other.\n\nI would not come back, and definitely not recommend. I was looking forward to visiting this new addition to the Riverdale area, and really sad that this was the experience we got. Truly baffled.\nOverall we spent $300 on an unimaginative and tasteless meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNS1XSmtnRRAB",
            "text": "This place is a vibe. It’s beautifully decorated, clean, the food was delicious, the servers were friendly and kind. We went for a bday dinner although we didn’t announce it we just wanted to enjoy the food. The mariposa drink was so good! Only con/negative I would say is the services seemed a little slow but can’t knock them for that, it happens. Overall great place, great music. I would come back for a little date night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaTctMnRRRRAB",
            "text": "First time there a couple nights ago, even though they've been in business for nearly a year.  We had the Guacamole (Oaxacan-style) to start, and then a couple more appetizer/ tapas style dishes, the Octopus on a black bean molé  and the Scallops on a \"sauce\" (or really another molé) that has 20 ingredients that went into making it!  Everything was just fantastic, including our server, Victor, who went out of his way to make sure we were well taken care of.  He had a rather large section of the restaurant that night, but he was so helpful!\n\nAnd yes, even though the prices were more like Manhattan eatery prices, we will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcFllcWtRRRAB",
            "text": "There is a very respectable grilled branzino, butterflied and sprinkled with fresh and ground chiles, ready to be flaked and folded into a steaming-hot tortilla. These are pressed and griddled throughout the night by a dedicated tortilla…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMm9DUmFREAE",
            "text": "New Neighborhood Restaurant.. Simple Decor love the high wood beam ceiling. The food speaks for itself honestly High Class Cuisine. Really enjoyed every bite. Guacamole a musssssssttt…… Please try the Aquachile Camarones such a beautiful dish but the flavors are so goood. We had the pork for two honestly was a great choice I do say so myself lol. So wait back to the meal O M G the flavor profile on that pig was so succulent and the Blue corn tortillas. All I can say is presentation on point. Flavor profile is unique, ambiance classy yet simple and my spicy mango margarita EVERYTHING!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweTdHeWpRRRAB",
            "text": "We had a girls night during the collaboration night with Chef Bricia Lopez and it was such an amazing night.\n\nThe food quality and taste was so amazing, reminded me of my bbq at home in California.\n\nThe restaurant itself is a show stopper, thought I was in Manhattan or Brooklyn. So chic.\n\nSo happy a place like this opened up in the Bronx!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanJQUGh3RRAB",
            "text": "Amazing!! Just went here with my wife and although it’s opening week and their menu isn’t as versatile, the food is truly excepcional. The drinks are strong with a great quality taste. We totally recommend it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdk5PYl93RRAB",
            "text": "Friday night dinner with my mom at the new spot in #riverdale #tobalanyc.  The #cornishhen dish was my favorite.\n\n#tobalányc is quickly becoming one of my favorite restaurants in #riverdale #bronx. Cocktails as well made, innovative and strong, love the way their food and the different flavors I they have infused into each dish and the service is top notch!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeklLOEhBEAE",
            "text": "Everything was great!\nWe had esquites, guacamole and  2 cocktails my favorite was LA POSADA,  warm mezcal -hibiscus tea cocktail.\nFood is delicious, fresh,tasty\nService is TOP, I mean 100/10.\n\nWill come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LWZUaWt3RRAB",
            "text": "Was a fabulous meal last night. We had the guacamole, the tacos Dorado, and the absolutely stunning lamb Barbacoa tacos, and duck enchiladas with mole. Cocktails were also wonderful. We sat at the bar and the bartenders were friendly, and…"
        }
    ],
    "reviews_count": 76
}