{
    "name": "Cocina Chente",
    "place_id": "ChIJpzqwor7zwokRhRW4vxE4MVs",
    "grid": "BX8",
    "address": "3535 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.4,
    "user_ratings_total": 713,
    "phone_number": "(347) 843-8081",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUE5VWnhPRGxHZGtoRlprSjVURTlrZVVrdGExRRAB",
            "text": "Wow\n\nOur first time here last night\n\nWhat a cute restaurant\n\nService was very friendly\n\nWe had the Guacamole, Mexican Street Corn , and Fajitas ..... everything was delicious\n\nThe El Chapo cocktail was also fantastic and my wife loved the red Sangria"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weU9GcDRkVEEzZVcxTVRFdGhUWEkzYkd0WVRYYxAB",
            "text": "The food is really good, especially The Volcano. I loved the quesadillas, steak, my favorite. You must try the nachos!!! The cocktails are amazing. Try the Chenterita or skinny margaritas, they are delicious! The service was genuine and friendly. Everyday is a great day to go in and enjoy the drinks and food. Fridays are filled with fun with live DJ. I highly recommend this cozy and lively spot!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa1RqZE9aRkZwVW5KaldXTnZaemxZVG1FMmFIYxAB",
            "text": "This place is such a nice treat and great to have in the neighborhood.  The service was great and food was absolutely delicious.  Would come everyday if I could! Don't miss out, def go and try it."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WU2RIbDRVbmxNTlZKaE5EaDZlakZKV2tNd1pVRRAB",
            "text": "Recommended by friends, I loved this cute and cozy restaurant, with delicious food and wonderful signature drinks. The service was excellent, attentive and everyone was very friendly. They will see me soon again. 👍🏻👍🏻"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4algzbDBjVjl4YmpKeE5tRjJSRkppTUVGUWNtYxAB",
            "text": "Cheerful and colorful neighborhood spot. Tasty cocktails."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVmNTMHlOWFZuTjJRelJ6RmxWR05oYUhWallXYxAB",
            "text": "This is a great restaurant to have a fun and chill time, the food is excellent, flavor, quality portions, very authentic and well made Mexican food. The environment is very welcoming because of the employees and its design."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROc19QaUFnEAE",
            "text": "I can't say enough good things about this place. Been there several times. They have the best Tequila and Mezcal cocktails. Mexxo Tequila/Mexxo Mezcal.\n\nI've been there both solo and  with friends.. Both have been great experiences.\n\nThey also have events. Someone performs. I think it's once a month.\n\nI absolutely recommend this place. 💯💕"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaGNGZHVTa2xhYm1aMVVIY3libmhaTUZWTFVFRRAB",
            "text": "Ordered the fish tacos and margaritas from uber eats … when I say 🔥 !  You taste the alcohol in the drink. Tacos were amazing! They followed directions on the note I added. Just wow!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMVdsUjJPVEZ0T1ZSd2QzUjVTSEJaTmw5cVNWRRAB",
            "text": "It’s a cute spot. The staff is very kind. Food is great, although my favorites were the grilled octopus and plantain appetizers.\n\nI really liked the touch of fresh flowers at the table."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eFdHZHBNMGhYV2xKd00zWk9iMXB2TUVoM1JHYxAB",
            "text": "The drinks and the food were good. The staff was friendly and provided a good service."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eWFfc0ZREAE",
            "text": "Good food, great drinks, friendly local service.  I would say it is the best restaurant in this neighborhood. Would recommend the chicken breast and la Vegana."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25selFrbFNUMWx3ZVV0TE5XeEVWbEU0YlVFM1RWRRAB",
            "text": "Lucky find for us , can't understand why this has so little reviews . Rarely happens where everything we eat is delicious and really really good margaritas ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdVVuVlJNSEZzU0ZkU01rMWpjVlJzWWxGM2RWRRAB",
            "text": "This restaurant is in my neighborhood and I love it. They have a very good happy hour menu with flavored margaritas, tacos, and quesadillas on it. We ordered the fish tacos, shrimp tacos, chicken quesadillas, guacamole, churros, and mango and passion fruit margaritas. Everything was delicious! The only thing I would suggest is for them to give the guacamole more flavor, not to be scared to add more salt and lime- that’s the only thing that was bland and not that good. However, the tacos were soo tasty, and they weren’t cheap with the shrimp, churros were amazing. Drinks were strong and hitting! I definitely recommend this spot and will be going there again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRE1XNDJOell4ZDBaRllWSlNZbFZYV1d0QldHYxAB",
            "text": "We forgot our diaper bag for our baby and they tried to chase us down and held onto it until the next day when we called them."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRFRHZHpRbEZRYlRKbGMyRlRORlJuVFZrM1RXYxAB",
            "text": "Cocina Chente in Riverdale gave my friends and me a great experience last Friday. Making a reservation via Google was easy, and staff responded promptly, showing politeness and cheerfulness, creating a good first impression.\n\nThe restaurant had a fun, energetic vibe with many tables occupied, creating a lively ambiance perfect for the weekend.\n\nThe guacamole and chips were superb—fresh, thick, and satisfying. I ordered beef nachos, and my friends had chicken quesadillas; all arrived hot and tasty. The rice on the side was well-seasoned.\n\nFor drinks, I had the Rosa Colada—visually impressive with smoke for a dramatic effect—and my friends enjoyed Passion Fruit Mojitos. Both drinks were not overly sweet, a nice change.\n\nOverall, Cocina Chente offered a fun dining experience with great food, drinks, attentive staff, and a lively vibe. It’s a must-visit in Riverdale. We're returning, especially for their guac and chips—our favorites!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weVNEVTBZVWt3YkVkbFFtOVZXRzFOZUd4UU0zYxAB",
            "text": "Chente restaurant, excellent food presentation, refreshing and very delicious drinks, first-class service, very attentive and they recommend the best Juliana, excellent service, thank you, we will return with friends to enjoy more drinks and food, I highly recommend it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMM3BodU9uc0pLZzlRRRAB",
            "text": "The food is fantastic, highly recommend. Drinks as well. Best chicken quesadilla I’ve had in a while."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMZTY2X09Fc05fRjN3RRAB",
            "text": "The food was good—appetizers were better than the main course, but overall it wasn’t bad. The service, however, really lacked. The food took a long time to come out—we received one plate, then another five minutes later, and another five minutes after that.We had to call the server over just to order appetizers, then again for drinks, again to order our mains, and once more to ask for extra tortillas. Finally, we had to call them over again just to get the check. It felt like we were constantly having to take the initiative. Despite this, the servers were all super nice. Still, I believe in good customer service, and for an empty restaurant, there really wasn’t much of it. We were also given a check with an automatic 18% gratuity, which felt a bit off considering the experience. The server fixed the check and we left what we thought was appropriate for the service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVDdzTFhfX095TjNBRRAB",
            "text": "We visited cinco de mayo weekend and had a great time. We thought it would be packed but there was plenty of seating. The outdoor seating is cute but had a larger party at the time. We ordered the fish tacos which had more breading than fish. The beef nachos were hearty and had more meat than other places but still more chips than anything else. The margaritas were good, not too strong but you could taste the tequila which is my preference. The service was really good. Our waitress was really attentive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2EzNzVnRRAB",
            "text": "This place is a great ambience. Music amazing omg and Ruben the bartender was so lovely pleasant was always asking if we were ok. He is the best. Will definitely recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2MyYmJnEAE",
            "text": "Amazing place to hang and just have fun. Great food and hostess. All around amazing . Ruben is the best"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNjRUZVFBEAE",
            "text": "My experience in chente was awesome and Jennifer was so kind"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdThUbVhBEAE",
            "text": "While I love the food and the service is always lovely, the music volume level prevents me and many people I know from coming back to this place. It’s like a nightclub situation when you cannot hear yourself or your friends. You need to yell to be heard.\nAdvice to management: please turn your music down a notch."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMHAyWnhnRRAB",
            "text": "I’m here again, giving you guys other 5 stars!! Omar made the best Cocktails ever “rosa colada” my favorite, and Juliana best service at this place 💖💖💖💖💖 and the food delicious, come and try “Volcan”\n\nNice place place to enjoy a delicious food and drinks, the quinoa croquettes is so good and bebida chenterita my favorite 💕of course I’ll be back their beautiful staff are so kind"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReHJQMU5BEAE",
            "text": "ate here when they opened and did not have to wait long. service was phenomenal! he was great at providing recommendations. the food was delicious. i got la vegana and it was super filling and nutritious. my boyfriend got beef nachos and he said the portion was large and the cheese was amazing. we both were very satisfied by the end of the meal. only caveat was the music, which was techno dance music. regardless, highly recommend checking this place out!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdlBqcnNnRRAB",
            "text": "I love this restaurant. The food is good, the drinks delicious and if it’s your birthday you get to wear the birthday sombrero and everyone sings. It’s a festive, fun neighborhood restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNna0lTMnJBRRAB",
            "text": "Great service.   The Margaritas where great.\nLoved the Guacamole served with warm chips.\nThe food was good with generous portions.It wasa wonderful dining experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNjl6aTFBRRAB",
            "text": "Omar was absolutely attentive and we will be back. The entire staff made sure we were comfortable and happy!! 15 stars if it’s possible!! The food was tremendous !!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmazlYYUF3EAE",
            "text": "Quinoa croquettes are worth the trip alone. Chile relleno is fierce. Chicken quesadillas are scrumptious. Wish they would give you the option of a third taco for a little extra..."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeU8zNUJBEAE",
            "text": "Cocina has the yummiest selection of cocktails and the staff is very accommodating. The food is well plated and the music is authentic. I’ve never felt so relaxed at a restaurant before🥰\n\nThis is more of a ladies night, friend date, and family type of spot in my opinion. Leave the man at home for this one 🤣"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MjlXRi1nRRAB",
            "text": "Extremely pleased with the service and food…\nRecommend 100%"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdy16RGd3RRAB",
            "text": "Great food , delicious cocktails… highly recommended.!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbmJuS3hnRRAB",
            "text": "Beautiful ambience inside. Delicious drinks and the food was incredibly flavorful. We went for Riverdale restaurant week and we enjoyed every course! Highly recommend.\nI imagine in the summer when the patio is open is quite nice. Would be a great place for live music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbE1TUDh3RRAB",
            "text": "My niece wanted to take me to this place because she liked it so much. She didn't disappoint me. The food was delicious, especially the tostadas. You can view the menu on a tablet given by the server.  The look of the location was very true to their name.  I enjoyed my company and location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNUw2c1lnEAE",
            "text": "Absolutely love the food and service here. I’ve been to Cocina Chante several times now and every time the food has been delicious. I’m a huge fan of their guacamole and their steak is amazing. The natural juices are also very delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBazRPN01nEAE",
            "text": "This is my favorite restaurant in Riverdale! It has an exquisite tequila bar, excellent food, and an ambiance that makes for a great ladies' night out! My favorite dish.....chimi tacos!\n.\nThis restaurant is still my go to in Riverdale! Jorge makes you feel at home, going above and beyond, the service he renders is truly an art. And they are dig friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM2R1eE9nEAE",
            "text": "They sell a can of coke for $5"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNm9EekRREAE",
            "text": "The food was ok , but nice place for dinner with friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdmRhQzNnRRAB",
            "text": "Order for my partner was not served after mine came out for 10 minutes thinking suspicious. When asked, the manager was surprised and went to the kitchen to resolve the situation. Clearly they were jumping around. However, the server did not apologize at all. When asked, she gave me a BS telling me one of the ingredients took longer to prepare. So I asked again, then gave me another BS telling me she thought that was an appetizer. Another lie. Bad service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3LVlpWHpnRRAB",
            "text": "Great food and ambience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidU51T0h3EAE",
            "text": "This place has such great food and a cute atmosphere with outdoor seating. Even tho it is small it is such a great place to check out! Everyone should try the quinoa balls they’re SO good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaE1HQlpBEAE",
            "text": "Don’t ask how we been here ! Was a gift from the Gods. Excellent food good environment. I love the decoration. Simple and smart. Clean place. Service was excellent and know to make you to enjoy your time. Very good drinks. Very fair at the prices on drinks normal at the food for the quality they offer. Ceviche,nachos, sea bass and salmon our choices all are so good. Almost try all the cocktails and was really good. Love it ! Our server was Jorge  and he was excellent !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaE9Mb2hRRRAB",
            "text": "Great neighborhood gem. Food was amazing and the drinks were delicious. Definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMblp1VEFREAE",
            "text": "We had a great evening with the crew!! The flavored margaritas were good, had one with mango. Taco with beef was very good, so does guac’n chips. Nachos was okay.  Great atmosphere, Child friendly, the waitress’ were so good, helpful. Thank you!!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeE8tZlR3EAE",
            "text": "Excelente comida, bebidas y servicios"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ2FQQlNREAE",
            "text": "First time at this place  and the employees welcomed  me with a smile and accommodate me immediately. The food and service were excellent and fast. Great conversation with the bartender and the waiter. Great music. Clean place. Great place so far, I will come back for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXFTOWN3EAE",
            "text": "Just like most riverdalian places, the drinks are overpriced and under-alcoholic — but the food is good and creative — great date spot if you’re looking to impress with a good atmosphere and a big bill 😎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6X3VDMmtRRRAB",
            "text": "A great local restaurant that offers familiar tastes with creative presentation"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6anVHX3p3RRAB",
            "text": "Great place the food really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eHEzb0FREAE",
            "text": "Food was excellent and the wait- staff was very attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dFpLT1NBEAE",
            "text": "The food we ordered was good and the servers were pretty attentive. This is a nice place to go to if you want to catch up with friends and not feel pressured to hurry up and eat. The drink menu was pretty extensive and were solidly made as well. They have indoor and outdoor seating."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybGNfX2Z3EAE",
            "text": "I promised the owner I would add another review 😂 because I love this place he deserves all the good reviews ! Here’s my update:\n\nTonight a friend and I and her cute dog came for dinner . The flautas, maduros y tacos son delicioso. I a determined to try EVERYTHING on this menu 🤩Again, the service and food never disappoint! A local in the neighborhood asked where we came from and I’m pretty sure he grabbed dinner there too being a newbie in the area. Be back soon!\n\nFrom atmosphere to food to service, I give it 5 stars. The service was incredible. The hostess and server were so hospitable it felt like family. I love how quaint the place is.\n\nI had the enchiladas verdes which was AMAZING! So fresh and homemade! I will def be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cE4td3R3RRAB",
            "text": "Beautiful local spot.  I haven't been here since the shutdown.Great service by the staff. I was assisted by 4 different people and it was like they all knew me. Kinda like having 4 servers devoted to me. I was in time for happy hour,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyc1ByNF9nRRAB",
            "text": "Came here for happy hour with friends. The staff is extremely friendly and accommodating. The drinks and food were delicious. We had a baby with us and the staff constantly came to our table to provide fruit and other things for the baby. I would highly recommend this spot to anyone in the area or looking for a great spot to have a nice drink. #happyhour #drinks #family #tequila #whiskey #art"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOVpXRnp3RRAB",
            "text": "The food was delicious. The service and the environment was great. We celebrated a birthday and they sang Happy Birthday and put some, also they brought a Mexican cap and we had a great time."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcmUzMVBnEAE",
            "text": "Nice little spot. Very cozy and nice minimal decor. Their food was good and their staff was very attentive. They have a nice selection of tequila in case you were wondering and other selections of alcohol. My friend told me on the weekends they usually have live music."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbzdlc2dBRRAB",
            "text": "Food could be better, but is good. Would gladly come back. Service was great, expedite and caring.\nAtmosphere: a very loud place. Not suitable for a talk with your companion."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdE5xd01REAE",
            "text": "Visited on a Saturday night recently. It was pretty quiet; only 3 tables occupied and I’m surprised there weren’t more people. This place is great! I ordered the Rosa colada and wow! It was so good. It was like drinking a strawberry milkshake. I also ordered the guacamole and steak fajitas. Both were so, so good. The steak was well seasoned, tender and juicy. It came with rice and beans and tortillas. All fresh and tasty. The service was quick and attentive as well. I really enjoyed my experience and can’t wait to come back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzNnRhb1lnEAE",
            "text": "This restaurant came up on my Amex offers so I decided to give it a try since it was my girlfriends birthday. The appearance of the restaurant was beautiful inside and out. The food was amazing. I recommend everyone try out the tacos.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdnNtekdnEAE",
            "text": "A little jewell in the Bronx.The  food was excellent,  and our server was very nice and fast. Really enjoyed. Even, my son is really picked,he  enjoyed the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaE43WmN3EAE",
            "text": "Margaritas are delicious the service is excellent and the atmosphere is cool and chilled. Chente has outdoor and indoor seating which is always a plus. Tacos were tasty. Can’t wait for our next visit"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN0lPOFBREAE",
            "text": "Place was great, food was fantastic and service was great too.\nThis restaurant is huge with inside and outside seating.\nDefinitely would recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0MmZxMHhBRRAB",
            "text": "I went with a group of 18 people and we received the best service ever. This is place very unique and a hidden gem in the Bronx. The food was to die for. Very delicious juicy and tender. The taste just melts in your mouth. The vibe is…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLX3VmeS13RRAB",
            "text": "This place is somehow good but, the service is truly truly not the best and the wait time for food even on weekdays is soooooo so long, and they will tell you that you have a max time to be seated without even acknowledging how long it takes to get your food, in our case it took over an hour. Also, if you’re going with 3 persons, be expected to pay $170+. I will note that the cocktails are some of the best mezcal cocktails I’ve had, comparable to the ones I’ve enjoyed in Mexico City. The service just is not it, not the friendliest either, which makes you regret the long drive, if you’re not already in the Bronx.\n\nThe quesadilla I ordered was somewhat disappointing, very underwhelming."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMmI3NWVREAE",
            "text": "Tasty food! Service was amazing! We had the Tequila Lime Salmon and Steak with Chorizo rice with complimentary sangria and mimosa. Highly recommend this location"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NzQtVG5RRRAB",
            "text": "First time there. Lovely Mexican spot. Sat outside and enjoyed some fajitas while with my family. Great happy hour too! The waiter was also very personable and accommodating.  I'm definitely  coming back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVeTdtdVpnEAE",
            "text": "This is the cutest most modern take to a Mexican bar/restaurant. The decor does it, down to the plates they serve their 2oz shots of tequila! The drinks are delicious and the food is superb! I suggest coming up for happy hour and throwing back a couple of margaritas."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eGNQUWN3EAE",
            "text": "Nice addition to the neighborhood, corn dish was excellent and the tacos also loved the place, not a 5 star as the servers have to be more attentive, I had to wave them down for water for the check etc but definitely will try again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzaklia1pnEAE",
            "text": "Dined:2/22/2020\nFood: 3 Stars\n\nI ordered La Vegetariana. In simplified words an eggplant enchilada. With vegetables inside. In this case possibly singular considering the fact that I searched my plate for veggies and I could only find spinach inside the rolled eggplants. This dish was served in a green sauce with yellow rice and black beans on the side. Over all the dish was plated beautifully but the flavor was bland, absent and almost non existent. Sadly.\n\nMy guest ordered the Chile relleno with beef. Also served with the same flavorless rice and beans. As she said as well the beef lacked flavor including salt level. She had to add pepper and salt herself, which was also missing from the table and had to flag down the support staff for it.\n\nOne thing I could say was actually worth a try we’re the Crab and maduro croquetas in a mole sauce. Those did taste great and were just about the only thing on the table that had a decent taste. We also shared the nachos, which aren’t worth the mention. Nothing special about the nachos. Don’t bother with those.\n\nFor dessert we enjoyed the churros, which thankfully you can’t mess those up and I opted in for have the Plátano macho, sweet plantain cooked in cinnamon——well more like deep fried sweet plantains with deep fried whole cinnamon sticks. That was a big disappointment for me. Over cooked and very oily. Not necessarily as described or what I expected.\n\nCocktails were great. I definitely recommend La Maria it’s a sweet mezcal rosemary infused yup sod cocktail with tamarisk syrup. Served up. Definitely a different kind of drink.  For dessert cocktail I ordered the Carajillo, this must be one of my favorite espresso cocktails ever. Mezcal, espresso and Liquer 43.\nOver all the bartender is the best thing that’s happened to this place. Thanks man!\n\nService: 1 Star\n\nI honestly do not have much to say about our waitress except she was just an order taker, can not say a lot about someone who was not present or checked back with us about the food nor drinks etc.\n\nAmbiance: 4 star\n\nJust about possibly 95% of the reason why people return to this place seems to be because of the ambiance. Beautiful decor, great lighting for dinner, awesome playlist (great choice on Manu Chao), the menus are interesting and full of Frida Kahlo quotes and last but not least what the millennials would say it’s an instagramable place. Picture perfect—- just about.\n\nA place needs to have 2/3 of these\nFood only received a 3 because those cocktails were actually worth the drink. I’d recommend stopping by here for a possible happy hour or guac and chips kind of evening. But unless you’re someone who enjoys bland Mexican food do not go here. You’re better off at the taco truck on 53rd street and 7th Avenue who has amazing Mexican food!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdlo2dERnEAE",
            "text": "This place was really nice, lowkey, they have a live singer which is amazin. The atmosphere is great, drinks and food were good. The only reason I gave 4 stars is because the service was very very slow. My sister order seltzer water which…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzLTZ2aDZ3RRAB",
            "text": "Had a really nice evening at the bar last night. We caught the tail end of the live music (which was a lovely acoustic duo). Felix the bartender was great. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb2UtWFdREAE",
            "text": "I went to Chente in summer 2021 for brunch and the menu was quite limited. I went again tonight for dinner and it completely changed my opinion.\n\nThe drinks were amazing, the food was delicious, and the service was great.\n\nIt’s only a few stops from the 1 train on the Bx7 so it’s easy to get to.\n\nThey played Vicente Fernandez (appropriately), reggae, bachata and some great 80s tunes. The ambiance was great.\n\nI got two drinks and an entre for around $40.\n\nThe Mezcalita was the highlight!\n\nDefinitely a must visit in Riverdale and a fun place for dates!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNckt2YlFREAE",
            "text": "I loved it!!!.. the have a great selection of Mezcal.. the Mole enchiladas and the  guacamole were very good and tasty. The waitress was amazing... very educated in Mezcal. Tequilas and the whole menu."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaDVlVml3RRAB",
            "text": "Really tasty enchiladas and other Mexican fare at decent prices. Guacamole is made fresh and completes any meal. They’re not keen on making substitutions to accommodate dietary restrictions which can be a real struggle so be prepared and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrLUlLUllnEAE",
            "text": "It was pretty good, a bit expensive though for a lunch place. Drinks were good! Had the grapefruit peppercorn mezcal cocktail, churro, beef tacos, and flan! Shared with others, of course. My only complaint is that the service is very very…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcGFHQWx3RRAB",
            "text": "Loved the decorations!! The employees are very friendly and helpful. The food was great and the Margaritas were EVERYTHING!!!!!! I definitely recommend and will be coming back!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMVpQZDlBRRAB",
            "text": "Amazing tacos. Amazing nachos. Amazing margaritas. Service was great. Place look eclectic and modern. Bathroom in the back decent. Guacamole out of this world good or maybe the $5 dollar margaritas happy hour time is saying that. No really its amazing."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDc1lXbG13RRAB",
            "text": "What a wonderful little surprised this place is. Nestled in a corner on Riverdale Avenue. What a delicious meal. We spend a great deal of time in Mexico so are harsh critics when it comes to Mexican food..i have to say we were delighted. From the food to the cocktails it was all perfect..so much so that we ordered a second helping of the grilled octopus! This spot is a great hidden gem! So sadly I have now reduced to a 1 star. We waited over 1 hour for our food to arrive and the 3xcuse is that they were busy...i have 2 words...do better...what a disappointment....this is now a place to avoid"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMk55aXJ3RRAB",
            "text": "I ordered for a drink the Rosa Colada and the Churros to eat,  the drink was amazing, def taking my girls there for a drink and some snacks. Staff provided great service and the place is just super cute. Do not confuse with a Mexican restaurant."
        }
    ],
    "reviews_count": 79
}