{
    "name": "Yo-Burger",
    "place_id": "ChIJkS0prb7zwokR-T6gq-lXc-4",
    "grid": "BX8",
    "address": "3726 Riverdale Ave, Bronx, NY 10463, USA",
    "rating": 4.5,
    "user_ratings_total": 1016,
    "phone_number": "(718) 708-6828",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdU4zUlNaMU5aZVRWeFNIZHVhVEJoU0hKTFVsRRAB",
            "text": "according to my son, food was excellent, he loved his milkshake and enjoyed the burger very much. Place was nice and clean. We will come back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU01WQnlXV3hLVVc1eWVFNWxkR2MwUmt0aFkxRRAB",
            "text": "Great food and staff, they also service beer and ice-cream, I loved the outdoor seating. Can't wait to go back."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM2NFaDNTRE53UlhFNFVXbDNlbVJDZWtKM2VWRRAB",
            "text": "Great burgers!  Fries are delicious too!  A must try! They also have frozen yogurt u serve yourself with toppings of your choice!  Great place!!\nI'm a regular now!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeU5FWnNaVFo1TVZOWk1Fa3RYMDFCVVRKeldsRRAB",
            "text": "Good juicy burger hot and fresh. Service is okay nobody smiles or friendly. Affordable about $9 for a double cheeseburger with free toppings. Very nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM2RsSnFSWGxoWVZwdldXdE1TM2hMTkRaNFRXYxAB",
            "text": "clean fast food stop satisfactory service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNE0yNXdOamxKTldWTGFHcE9PV050UTFCSlVIYxAB",
            "text": "Taste like homemade burgers made, hotdog was okay. The french fries and the shakes are a must try. Nice selection of beers and froyo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWE1HVk5WMTlLU3pWaWRqWXRaR1ZLVmpocmFYYxAB",
            "text": "Good burgers, nice little spot with outside seating."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVG9sTjYtcUwzdXBnRRAB",
            "text": "Veggie burger was incredible (Beyond Meat)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1ZEZzFXVU15YUVGMGExRXlaRkZMWTNRMGMxRRAB",
            "text": "Favorite Burger Spot in NYC! 🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUlUybGFaVzVaUlZwUFdrOXlaRWs1YTI5YWVtYxAB",
            "text": "The food at Yo-Burger is consistently great, no complaints there. The flavors were spot on, and I really appreciate the consistent quality.\n\nHowever, the service left a bit to be desired this time. I requested every topping on my burger and I literally meant every topping available. It was a bit off-putting to be questioned about what I meant by “every topping.” Usually, that’s never an issue NEVER, but this time it created unnecessary confusion. It’s a small thing, but it makes a difference in how the customer feels about being understood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVzZvcEdlNUkyeHpRRRAB",
            "text": "So family friendly, clean and consistent. We love stopping here with the kids to grab a quick bite of dinner. It's a huge perk that it's affordable. We will always keep coming back because our kids love it!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURld2ZTOXdnRRAB",
            "text": "This place is the best place for high quality burger that is freshly cooked. You can also get delicious fries and frozen yogurt as well. The service is prompt and the general layout is a controlled space that is tight but allows for movement. The overall restaurant is clean and organized, on a nice day you can sit outside too. Excellent spot!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQU2sxYWVscTgzS0pnEAE",
            "text": "Everything there is awesome; burgers are great! Super fast too. Only thing is that I wish they would have ranch for the fries. Come on, guys, get ranch already. Thanks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKdmMwNU9Yc3B6bzZBRRAB",
            "text": "Consistently delicious burgers while still being affordable. It’s an amazing place to be honest."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUEpxZWpfdmNxRXlBRRAB",
            "text": "I love Yo-burger"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOGM3VWlBRRAB",
            "text": "First time eating here and the burger was way better than expected. The fries were good but wish they were different type of fries like curly or waffle. Overall nice experience and will return."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdDd1Qld3EAE",
            "text": "My order was completely wrong and they attempted to charge me for the change…ended up leaving it as such. Seems to be under new management."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX2UycFBREAE",
            "text": "All time favorite spot. Quality burgers and everything else. If you like your burger patty well done, tell them."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMzRpX21BRRAB",
            "text": "Amazing burgers"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdzQyUjFRRRAB",
            "text": "Yo-Burger is a fantastic go-to spot for delicious burgers! Their burgers are not only fresh but also incredibly affordable compared to those from fast food franchises. If you're in the mood for an authentic, fresh cheeseburger paired with crispy French fries and a milkshake, I highly recommend visiting Yo-Burger. You won't be disappointed!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaWNiRFhBEAE",
            "text": "Delicious, fair prices, highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdHVDLWxnRRAB",
            "text": "My burger wasn't top notch missing toppings been coming here for years first time with a so so experience\nDissatisfied"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaEpDUHJnRRAB",
            "text": "This is my new goto burger spot. The burgers and fries are 10/10 and the price is amazing too"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaG83bUlBEAE",
            "text": "There burgers are so good!!! Tried it twice: lettuce wrapped burger with bacon and sweet potato fries. Regular fries are greta as well. Does not taste greasy and is super affordable! Highly recommend 😋\n\nAs someone who is gluten and dairy free, I felt great after eating there both times!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaGMyRXBnRRAB",
            "text": "I ordered 2 burgers 2 hotdogs and 2 fries. It’s taking them more then 20 monutes just to make that it’s unbelievable"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N2NUanF3RRAB",
            "text": "Food poisoning from the veggie burger - do not recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X2NEV0J3EAE",
            "text": "The burgers here are really good. It surprised me and my friend the fact that they’re affordable and taste really good! It’s a clean spot too, a lot of people dine in here as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbWE2QzJRRRAB",
            "text": "I have been coming here for years and sadly never penned a review.\n\nWell here we go, after a long week Friday night called for some burgers. Bestie and I lucked up on parking and headed in to place our orders.\n\nAs always, a turkey burger, sweet potato fries,  and angry orchard x 2. We paid grabbed some ketchup and some seats at an available table as we waited for our buzzer to jump.\n\nThen we Enjoyed!\n\nBurgers are made to order and fries are hot, crispy and yet fluffy. The angry orchard on tap is cold and crisp.\n\nNever a bad decision when in the area.\n\nJust A Note:\n\nIf waiting is not your thing… Never park in front. This stretch of Riverdale Ave. is the double-parking capital. People will block you in and disappear and when they final return do not expect any sense of urgency."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydkxYbUhnEAE",
            "text": "Great burgers, and love their sweet potato fries! Very good value. I just wish they had another choice or two of a different cheese other than american."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbGMtUTN3RRAB",
            "text": "A lot of high school kids so it's a little bit noisy and crowded, but they serve a great burger."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcGRuTXpRRRAB",
            "text": "That's a tasty burger 🍔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMWFhdzFnRRAB",
            "text": "Always good 👍🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMkx1S1pBEAE",
            "text": "Just a great place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubjlxdXFnRRAB",
            "text": "Best burgers in riverdale area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURublBldE9nEAE",
            "text": "The kids work very hard. But on a busy Saturday with a party the manager should be there working with their team"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMEkyU3FnRRAB",
            "text": "Great burgers. I had forgotten how good they were!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINWQ2OHVRRRAB",
            "text": "**Disappointing Decline in Quality**\n\nI've been a loyal customer of Yo Burger for years and used to absolutely love coming here. The burgers were always top-notch, and the food quality was consistently great. However, over the last few visits, I've noticed a disappointing decline.\n\nThe last three times I've been here, the food hasn't been the same. The burgers don't taste as good as they used to, and the quality has noticeably dropped. Not only that, but there have been errors with my order each time, which has been frustrating.\n\nOne of the biggest letdowns has been the cheese fries. They recently changed the cheese they use, and it's just not the same. The old recipe was much better, and now the fries are bland and not as enjoyable.\n\nIt’s unfortunate because this used to be my go-to spot, but after these recent experiences, I’m reconsidering coming back. I hope they can get back to the quality they once had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURId2VEUk93EAE",
            "text": "Great food and decent prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ZzZDSG1BRRAB",
            "text": "Very seldomly do I give a near perfect review, but this place is one of the few. Down from the way the food is made to how service is always on point. They serve beer to wash down the amazing burgers/hotdogs. My only advice would be to go there and pick up your food or dine in. Delivery times varies and if it’s a super busy night, you’ll get a soggy order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dGFtaDZ3RRAB",
            "text": "Popular local burger joint. Smash burgers with all the toppings available. Worth a visit if your in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bnVXN0xBEAE",
            "text": "Cosy local burger joint with decent prices and quick service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNzdQVkt3EAE",
            "text": "It's a consistent burger spot for the neighborhood"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OEtUbEZnEAE",
            "text": "브롱스 마블힐? 인근 동네 버거집. 요거트아이스크림과 버거를 파는곳. 맛있음."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6akpxejFBRRAB",
            "text": "Yo Burger in Riverdale is our go-to spot for fantastic date nights and introducing friends to a gem in our neighborhood! We discovered this place about a year ago and have been hooked ever since. Their burgers, especially the turkey cheese burgers, are simply delicious. The beer selection perfectly complements the meals, and their froYo is the cherry on top of a perfect dining experience. Highly recommend Yo Burger for anyone looking for great food and a fun atmosphere!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScEs2NjJnRRAB",
            "text": "Everything about Yo Burger is great! The location... Great, the food... Great, milkshakes & frozen yogurt... Great, service... Great! I know, I know, I sound like Tony the tiger here lol but it's a really nice experience. It's also family friendly which I liked. I ordered a bacon cheeseburger with all the fixings, sweet potato fries, a Oreo milkshake and a sprite for the road! They have a large selection of toppings and most of them come at no additional cost. Everything is made to order so expect your food to be fresh. Also their burgers are made perfectly medium well. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsLXB1WnpRRRAB",
            "text": "Very happy with my first experience at Yo-Burger. The food was fresh and the staff was friendly to me. The burgers was very similar tasting to shake shack. The price was much better and I left full and satisfied. I recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLUtQMmJBEAE",
            "text": "Food and atmosphere is good and my food arrived really fast. The staff are helpful and polite. The location of this Yo Burger is great as well, very nice neighborhood. Will be back again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDbjktRTJ3RRAB",
            "text": "This place will keep your cravings satisfied.  They have burgers 🍔 and frozen yogurt 🍦.  No indoor seating is available right now due to covid-19 but the outdoor seating is perfect.  I love the benches.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NGZld2t3RRAB",
            "text": "I think it's great! Beer on tap. And the burger is made fresh to order. They give you a little buzzer puck that will buzz once the order is ready for counter pickup. They were out of Modelo , but they had other choices on tap."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdHZfZjZRRRAB",
            "text": "Love this Burger Place items are fresh and made to order. Frozen yogurt options different every month nice topping. And the cheeese fries so gooooood……"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzczZxZTdRRRAB",
            "text": "The best Burger in this neck of the woods. Clean, simple, self pick up at the counter, and self clean up. A Burger and small fries $7.26 with tax.\nA true steal for a hungry crowd."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaV9uNlFBEAE",
            "text": "Forget about McDonald, five guys, smash burger or even shake shack. This is the place to go to. Nicely cooked burgers, sweet fries are great, regular fries as well. And strawberry Oreo shake is awesome."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrcU11VHdRRRAB",
            "text": "I got the half and half burger with my choice of toppings and a side of regular fries.  The half and half burger is one beef patty and one veggie patty.  Their veggie Pattie is delicious, one of the best I've had!  If you are looking for a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMUtTbGtnRRAB",
            "text": "Great food, great prices, great service.\nThis place is perfect for families looking to get great value for their money.\nEverything is fresh and good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCM0xUaTl3RRAB",
            "text": "Great burgers, worth circling the block a few times to find street parking 😅"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnN1kzOVN3EAE",
            "text": "This is one of the best veggie burgers I've had in NYC. The veggie patty tasted so fresh and was cooked perfectly, and the toppings were all fresh. The pickles may have been my favorite part, but that might just be because I am a pickle lover. I also got a side of fries and they are fried to a golden crisp perfection. The people working there were all courteous and the restaurant was clean. They use those buzzers that Shake Shack uses to tell you the food is ready. Now that I'm thinking about it, this place feels a fresher, less commercialised version of Shake Shack. Yo Burger also does frozen yogurt that they charge by weight, which makes it turn out a bit pricey. I didn't try any, but it looked good and they had a nice selection of toppings. I wish Yo Burger's food could pair up with Shake Shack's shakes, that would be heaven."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdWJydmFREAE",
            "text": "Amazing burgers! Me and my girlfriend come here all the time for a bite. The sweet potato fries are delicious and the staff is amazing. A must visit if you love burgers."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeXUzZVZREAE",
            "text": "I was completely surprised about this restaurant, everything was really good, the food was delicious the shake with oreo was really tasty and the place looks great. 100% recommended"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMHEyMTRRRRAB",
            "text": "Wow, this meal was the bomb!! Two double cheeseburgers with grilled onions, lettuce, tomatoes, mayo, ketchup, bbq, and bacon & a large sweet potato fries. Try the strawberry shake with oreos! You’ll thank me later 😍💞"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNEpLek9BEAE",
            "text": "Amazing burger and yogurt. Haven't been here for sometime but i will make my visits regularly from now on !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX2ZqWmxnRRAB",
            "text": "I remember when Yo Burger first opened I was 20 years old, I went there with friends. 9 years later and it still truly is a gem! Their price point? Incredible, especially for the area, like the prices don’t need to be that reasonable but they are, and I love that for their customers. The addition of froyo was genius, as well as the kids meal and free toppings. 10/10 all around, wishing them nothing but blessings and prosperity!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbXMzbG9nRRAB",
            "text": "Great little spot, but note that the menu prices online aren’t accurate anymore, so I’ve uploaded an up to date photo of the menu with prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3VyMjl3RRAB",
            "text": "I was visiting New York with my family, and decided to try this out. Even if I'm not a fast food person, and like to stay healthy, my kids were actually eating for once. They said the food was so good, my son ate it all so fast. The food here, addition with the frozen yogurt, easy 10/10."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNlBhMS1BRRAB",
            "text": "The space of places where you can get a burger, drink, and fries for under $10 has been shrinking, and even a lot of the better fast-casual places have left this tier a while ago.  So when you find a place like this that serves you hot, fresh, and delicious food almost immediately in a comfortable environment, you immediately expect the check will be $15.  As soon as I saw that the final total was under $10, had to give this place five stars.  Great experience and an even better value!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNE5iY3ZnRRAB",
            "text": "The burgers were delicious 😋 and the price was just right.  You can sit inside or outside - perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWX01uT2RREAE",
            "text": "A good place for families with kids. The staff and environment are VERY kid friendly (I know because our kids come and meet up with friends and act like crazy people). Food is good. Fries and nice and thin/crispy and the self-serve yogurt bar is a good treat for the little ones."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbzZuQmdRRRAB",
            "text": "At first I was a little skeptical. \"Yo-Burger\" Hmmmm. But once I visited the location, Burgers and Frozen Yogurt. It all made sense not. But in all seriousness, you have to visit this burger spot. There did it right here. I tried one of there Burger doubles with all the fixings. Its was outstanding. The burger was moist, juicy and full of flavor. Decent size and priced right. A meal form two will run you about $20 to $25 dollars. Not bad in todays ridiculous prices. The location was clean and the staff was responsive. The bathrooms were rather clean and functional. The is a school near by and the location was full with teens enjoying frozen yogurts and milkshakes. I had nom issues what so ever. What won me over was the taste of the food. Excellent I will say. If you are in the Riverdale area like I was, I highly recommend this burger spot and try their double cheese burger with cheese. You will not be disappointed any all. Trust me."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX3VIdWxBRRAB",
            "text": "A very tasty burger. Next time I return, and I will return, I look forward to trying some of the Froyo they serve here"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLU92OFVREAE",
            "text": "Love this restaurant. The burgers taste so good. The ingredients you choose are super duper fresh. You make your burger your own way. You choose all your ingredients. They have veggie burgers for those who don’t eat beef burgers. I recommend trying the bacon cheese fries they taste good. They also sell frozen yogurt but I’m not a fan of frozen yogurt. They have a good amount of toppings."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdHFXZzR3RRAB",
            "text": "The most flavorful burger I have had in NYC!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNkozS1JREAE",
            "text": "Had the double veggie burger with cheese and side of fries, delicious!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMjlQUVlnEAE",
            "text": "These burgers are DELICIOUS!!! Came here with some friends for a birthday. First time here, but it definitely won't be the last. The parties were cooked really well, and the burger wasn't too greasy. They have a lot of options for toppings. They're fries are also pretty good too. Can't wait to come back and try their other menu items."
        }
    ],
    "reviews_count": 72
}