{
    "name": "Baby Crab",
    "place_id": "ChIJZ6FjbQjzwokRdXebzRrAPbc",
    "grid": "BX8",
    "address": "5740 Broadway Unit C, Bronx, NY 10463, USA",
    "rating": 4.7,
    "user_ratings_total": 145,
    "phone_number": "(631) 602-7775",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkS1NqVmFNRlptZW1GSmMyeHNiMWRsYW1kTlprRRAB",
            "text": "Was wayyyy to expensive for2ppl..28$ gratuity they put on the check when we got it"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTVpWWjZia3hOZW1SaVdXOUZSa2xXVEVwQ2NWRRAB",
            "text": "My mom and I went this past Saturday in short, it was DELICIOUS!! We both got the VIP crab boil and devoured it! We will definitely be  back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcVoxaFJRVWhqTW5kaFMya3dNR2RMUVRaTWEzYxAB",
            "text": "Delish! 😋 Service was excellent. We had a party of 9 and everyone was very happy with their food and accommodation. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vd016Qm1UR1ExTjNBeWVsbEpTQzE2YldsMFpWRRAB",
            "text": "Ordered the VIP for $50+ and was told a half pound of shrimp are considered a total of 6.\nThey literally count to make sure you have only 6 shrimp with this entree (I was told by server). Was told they were jumbo shrimp (although more on the medium side), this is not sufficient for the cost value. Most of their seafood boils appears to be overpriced for the serving.\nThe servers also appears to be just going with the flow, with no authentic interest in providing great customer service. Always appear to be short staffed with only 2 people working, 1 server and 1 bartender.\nPlease do better, start by lowering the cost or increasing some portions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZmNtUjNhMTkwUkRKM2J6RmFVR3BaWVhkblptYxAB",
            "text": "Must say excellent service food was delicious and temperature was good with every bite...😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZlRUUnZVMU5IWVVSbmVESjJUMEpsWDE5bmRsRRAB",
            "text": "Baby Crab is probably the best seafood spot in the Bronx! The menu is packed with a wide variety of fresh seafood options, and they also offer great non-seafood dishes if you’re dining with someone who prefers other choices.\n\nMy go-to picks are always the scallops, shrimp, and lobster tails—they’re consistently flavorful and cooked to perfection. To top it off, my absolute favorite side is the fried rice, which pairs perfectly with everything.\n\nIf you’re looking for delicious seafood in a casual and welcoming spot, Baby Crab is a must-try. Definitely check them out!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ME1pX1lBEAE",
            "text": "This is a great small restaurant with beautiful decoration that creates a warm and inviting atmosphere. The seafood boil was absolutely delicious—fresh, flavorful, and perfectly cooked. The staff were friendly and helpful, always ready to assist with a smile. Highly recommended if you love seafood and are looking for a cozy place to enjoy a great meal.\n\nEste es un excelente restaurante pequeño con una decoración hermosa que crea un ambiente cálido y acogedor. El marisco hervido estuvo delicioso: fresco, lleno de sabor y perfectamente cocinado. El personal fue amable y servicial, siempre dispuesto a ayudar con una sonrisa. Muy recomendado si te encanta el marisco y buscas un lugar acogedor para disfrutar de una buena comida."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWlJHbDFSbmxrVm5SdlpVZElWSE50UldGemNFRRAB",
            "text": "Crabs are a good size and worth the price"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM1ltWmZiMk5vVEZsR2VFWnZha2d0T0dkdlRGRRAB",
            "text": "I love this place! I come here often and most recently I tried the sizzling hot plate with pepper sauce and chicken option. Also had a frozen raspberry margarita. Service is always exceptionally rapid as well as friendly! In the past I’ve enjoyed the lobster roll, fried chicken sandwich and red snapper. Each entree exceeding my expectations in the best way possible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFdrUjRkRWxrTjJaR1lqYzBka1pIU0hCb2FuYxAB",
            "text": "I've been to multiple seafood boil spots especially cross country, but this one is MY FAVORITE EVER! I love coming here, it's makes my heart warm each and every single time I step foot to eat here.\n\nI highly recommend this spot to all my seafood lovers!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RFYxSk9Va2RNWkhOU1puTnpZbU5yWWpnM2QwRRAB",
            "text": "This place is so good. Food, drinks, and service 5 stars!! The seafood boil is so tasty and quality of the seafood is fresh! Definitely recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSDE0LS1Kc0ozRWh3RRAB",
            "text": "The food here is delicious! Reminds me of Joes Crab Shack which doesn’t exist anymore. We got the lobster Mac and cheese, crab ragoons & the mommy’s sea food boil. Highly recommend all three. Also had a frozen coconut margarita that was really good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUUxYb3hlbk5oUTBSeVRIaFNNVFpxY21SVk5HYxAB",
            "text": "Wings were bland and dry. The linguine was ok."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLUF2UFA1c29LSEVnEAE",
            "text": "This is our go to spot. Date night, drinks and good vibes. The food is always cooked perfectly and seasoned just right! The staff is kind and attentive. Antoly the bartender and our server always goes above and beyond to make sure we have the best experience. You’re missing out if you don’t give baby crab a try. Oh! And don’t miss their happy hour!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV0kyZUxkLWFmVUxnEAE",
            "text": "Tasty and fresh. I ordered the sizzling (grilled) scallops with fried rice and black pepper sauce."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbUJxcDNVeDd2aDZBRRAB",
            "text": "Stumbled upon this place, stayed for the NYS A grade and do not regret my decision at all. We were a party of four with different entrees and no one was disappointed. I had the branzino. I will definitely go back and try something else."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZlEwS1hZcHRuUmFnEAE",
            "text": "Love the ambiance. Love the food. Love the service. Everyone i brought, LOVED this place. Drink specials during the week AND on the weekend. You gotta try it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVFYydnJUazVmUFRnEAE",
            "text": "10/10! Went with my family (group of 6) on a Saturday afternoon for my dad’s birthday and everyone enjoyed the food and experience. Delicious food and drinks, attentive staff, fast service, and beautiful restaurant and decor. I look forward to coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2JldTFnRRAB",
            "text": "Absolutely horrific service. Constantly had to ask random servers for things we should’ve already had. Utensils, a plate, gloves, shell bucket, water refills. To top it all off. We ordered a medium spice cajun sauce for the boil and they made it extremely spicy & we’re the type of people with a pretty good spice tolerance. Upon letting the server know our “mild” was too spicy to the point where we were sniffling. The server says “ Cajun is really spicy” … ok but why? We asked for mild. Nonetheless, what was disappointing was her response. She didn’t even offer any solutions. So we’re suppose to just suck it up, spend $100+/pp annnnd pay their fixed gratuity to eat a meal that’s difficult to eat? I see why the servers don’t care to serve you well.\n\nIn any case, I ended up asking the server to bring me extra garlic butter to try to dilute the spicy. But like cmon, for the service to be that bad already.. now our food is realllly spicy. It was honestly all just very disappointing - spoke so highly of this place to a friend. Until they experienced the dining flaws themselves. Unfortunate. We definitely will not be coming back & I do not recommend after that experience. I feel ripped off."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc2R6cWVnEAE",
            "text": "Delicious!!!!!\nThe ceviche and fried shrimp are 10/10\nSoft shell crab 7/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdThhb2V3EAE",
            "text": "Crab legs gave heart burn each time i went and if its not spicy it just taste bland. Fish tacos was mid."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNGFmWDJnRRAB",
            "text": "Food is delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanJLYkd3EAE",
            "text": "Bring break in a holiday weekend. The hours of operations did not match up with what was online or in person. I had a family of six come in town for spring break only to be turned away at the door and it was only 8:45pm"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub3JuRWFnEAE",
            "text": "3rd time at this place and yes I will continue to come back came here with three other people we all enjoyed our time and as the same as all the time we left satisfied food made with love service great as always and for the price you pay you’ll stay it’s worth it people buy one get one through happy hour and this place is kid friendly if u have children they have options on the menu for the kids as well as vegetarian options come down and visit baby crab yall"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWZuVnpBRRAB",
            "text": "Ordered takeout- a bit too much breading on the fish for my liking but overall good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMXVIanh3RRAB",
            "text": "First of all, the shrimp ceviche was absolutely amazing! The VIP boil order was fantastic—the flavors were on point, the portions were generous, and every bite was delicious. The drinks were a hit too—the lychee martini and tropical punch were both strong and packed with incredible flavor.\n\nThe atmosphere was pleasant, and the decor was stunning. Toley was outstanding—so helpful and attentive, making the experience even better.\n\nThank you for an unforgettable birthday lunch! The seafood was top-tier, and it truly showed in every dish. I’ll definitely be coming back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3BuMHdnRRAB",
            "text": "Sometimes you gotta give the local spots a try. We tend to venture out of the Bronx quite a bit, to eat and enjoy ourselves but opted to eat right in our neighborhood and we were so pleasantly surprised! Walking in, the restaurant is very well kept, impeccably decorated and I loved that they held back on corny LED lighting. Parking was easy as it’s located in a strip mall. We were quickly seated and ordered a Cajun shrimp boil, fried snapper, fried rice, a frozen margarita, and a mango salad to share. The mango salad was definitely minimalist but incredibly fresh and the mango was sweet and perfect. The he margarita was a little on the sweet side for me but very creamy and yummy. Our entrees were the stars of the show! Cajun Shrimp Boil was FANTASTIC! The potatoes and the sauce were finger-licking. My snapper was fried to perfection and the various sauces were sweet/tangy with just the right amount of heat. $20 for a shrimp boil (tons of shrimp) and a snapper for $25 is unbeatable. We were well-fed and for a dinner for 2 under $100, you cannot beat that nowadays. Highly recommend and will be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d29tYUVBEAE",
            "text": "Great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcEsteUdBEAE",
            "text": "Limited menu and pretty high prices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNReThuVkp3EAE",
            "text": "10/10 would recommend! A great hidden seafood boil spot. Seafood quality is really good and the sauces for the boil is yummmy."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd0xfbFhREAE",
            "text": "La comida, el ambiente, el servicio y el lugar son excelentes"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHZXWm1BRRAB",
            "text": "I ordered delivery, it came warm and omg delicious! I was surprised with the portion and will definitely order again"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneko2V0t3EAE",
            "text": "Amazing food! I love coming here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOGFXX0hBEAE",
            "text": "Food was good, but I have definitely had many better seafood boils.  Scallops were excellent,  Alaskan crab wasn't that good.  Restaurant closes at 9:30 according to google,  got there by 8:20.  I was still eating by 9:30 but staff started vacuuming and then mopping while I'm still eating. Very rude and tacky and unacceptable for a $250 check for just my 12 yr old daughter and I.  I left restaurant by before 10pm, that's when they should have started vacuuming and mopping."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOHF5Y0lBEAE",
            "text": "The best happy hour & lunch special. Amazing food & drinks. Tolly is the best server and bartender. He definitely needs a raise."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNmNfbHN3RRAB",
            "text": "Cajun seafood is very well seasoned."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMXRpZGZnEAE",
            "text": "This has become my home away from home.\nI moved into my new apartment in the area and was looking for a happy hour spot and found one at Baby Crab.\nThe food was excellent, and the drinks were on point. The service and atmosphere were par excellence.\nThe staff and regulars treat you as family.\nI used to hang out at a similar spot in white plains, and I felt the same love and family here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b2NPTDF3RRAB",
            "text": "👍🏾👍🏾👍🏾👍🏾"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeG9HWWRREAE",
            "text": "Fine in was excellent!  I’m going to try delivery!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM1l6RTJ3RRAB",
            "text": "Great server, very attentive. Wish I had more corn and more sauce :D it was good. Sausage was very herbal, seasoned w star anise so watch out if you don't like that. Very good overall"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMmFDTGNnEAE",
            "text": "Food , Drinks and Service is always great!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc1lMSnNBRRAB",
            "text": "Hidden Gem, Amazing prices especially happy hour. Food is hot and fresh and served and serviced FAST"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTVIcGpnRRAB",
            "text": "This place is a gem. The seafood boil is fresh and delicious. Prices are very reasonable ands the service is great. Cannot recommend enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ2ZUdGVnEAE",
            "text": "I was in New York for a basketball tournament, wanted seafood. So I looked this place up, and seen the reviews so I decided to try it. Absolutely amazing! Food staff, drinks everything was perfect. It was a great end to a long day. Can't wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYZzl2XzJnRRAB",
            "text": "Great place, great food and EVERYTHING is delicious! The fried rice, which I always hated to eat was a pleasant surprise— Baby Crab made their fried rice sooo tasty and delicious, I was amazed, I almost ate the whole tub! The Boiler— the baby combo was great! We added a lobster tail, it was so tasty and fragrant. The dumplings were delish and the cod and fries were filling and oh so yummy!  The flan was decadent and filling, it is a  very close tie to Claudy’s, who have the most flavorful flan in NYC! Please give this place a try — we have to keep great neighborhood eats in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN3RMMXpBRRAB",
            "text": "Great portions. Cajun sauce was very tasty one of the best I have tried.  Fast service with a very clean and neat place.  This is a great sea food spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubU9YUFRBEAE",
            "text": "Good seafood boil. Very seasoned. They have a variety of sauces as well. For a reasonable price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIM0l1T013EAE",
            "text": "Great service and food is very flavorful. Been here over 5 times and can’t get enough."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaXRyNFZ3EAE",
            "text": "A Seafood Lover's Paradise!!!\n\nI recently dined at Baby Crab Restaurant, and it was a fantastic experience from start to finish. The restaurant has a cozy, welcoming atmosphere that immediately sets the tone for a great meal. The staff was attentive, knowledgeable, and very friendly,Amy the manager making sure we had everything we needed throughout our visit.\n\nAs for the food, it was absolutely amazing! The seafood was fresh and expertly prepared. We ordered the crab boil, which came with a generous portion of crab, shrimp, corn, and potatoes, all perfectly seasoned. The sauce was a delightful blend of spices that really brought out the flavors of the seafood i highly recommend Singapore Chilli Sauce is sweet spicy and tangy flavors.\n\nThe menu offers a wide variety of options, so there’s something for everyone, whether you’re a seafood enthusiast or prefer other dishes. The portions were more than generous, and the prices were reasonable given the quality of the food.\n\nOverall, Baby Crab Restaurant exceeded my expectations. It’s a must-visit for anyone who loves seafood and is looking for a memorable dining experience. I’ll definitely be returning soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieU02MXZ3RRAB",
            "text": "Great food, great drinks, the fried calamari were well seasoned and the sauce was fresh and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeS1Ic0JnEAE",
            "text": "Believe the hype. The reviews are 100% legit. The seafood was top tier. So much shrimp. The cajun seafood boil sauce was rich and flavorful. Even the burger was good. Food was quick to the table and plentiful. I hope this place sticks around for many years to come."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybnF2RWFnEAE",
            "text": "Must try. Delicious food and drinks at reasonable prices. Shrimp boil portions were very generous. Had to take it home. Fried rice was very delicious. Also had the crab ragoon. My favorite thing though, was the tropical crush cocktail. Wasn't expecting them to have a cocktail menu so this was a welcome surprise. Great service, too! Spent just under $100 for two people with tax and tip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObkllM0VBEAE",
            "text": "My first time visiting here was amazing Amy the owner & host was so nice & humble & immediately let us know happy hour drinks were 2 for 1 which was amazing, also they had soft shell crab which is usually hard to find, the bartender/server Tolly was amazing as well the drink were so good & strong alot of places water down they drinks but not here, which is most important to me lol. The place is super clean & peaceful I absolutely recommend it & will be coming back. They have happy hour M-F 12-7 👌🏽👌🏽🔥"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtMkk2NlZREAE",
            "text": "Visited for the first time a few nights ago, the service is good. The staff is very attentive, the decor and ambiance is nice, even the music. Great seafood selections, I also had some of their fried rice, which I found a bit bland, but probably healthier than other rice. Their wings were very good, I also had a Blue Piña colds drink which I was not a fan of. Overall it was a nice experience and I would revisit again. Lastly, I must reiterate, if you’re into it, definitely try the wings."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybHIzODVnRRAB",
            "text": "Very fine dinning, Amy our host was very helpful in recommending the best. Surely enjoyed ourselves the wife enjoyed the datenight and the food. Highly recommend the seafood pancake if your a shrimp lover.\n\nUpdate: newly added rock shrimp is the bomb and once again great hosting from Emily and the drinks from Rod was hitting the spot always enjoy brining friends over to enjoy the experience I have"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybWZDUVNREAE",
            "text": "First time coming to this restaurant, everything look clean & nice, staff was great, and the seafood was fresh, not forget to mention the restroom was fancy. The sauce I like is black pepper & baby sauce, also seafood pancake is a must try!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdHNpZmVBEAE",
            "text": "The chicken tenders and Fish (cod) absolutely needs more seasoning but the boil combo with the baby sauce (spicy) is definitely a great pick! We also had the wings, fried very well and crispy, my only drawback is that it only comes in one flavor. To pair, I had a Tropical Punch cocktail, sooo good! The staff was attentive and very pleasant, I will definitely be back!\n\nPs: Fried Cod instead of Catfish? Why?? Lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcVk3V1JREAE",
            "text": "Went for happy hour. Great deals for happy hour. Ordered the crab Rangoon, shrimp and the fried wontons. I do wish the dips were a little different for all the 3 appetizers ordered, it was literally all the same. Drinks were super good, 2 for 1. I had the Pinot Grigio and my partner had a sangria, which was a little weak lol but nothing a shot can’t fix 😉.Also the bartender was great. Very nice and sociable. He recommended a tequila we never tried, and my partner loved it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbXYzVjJRRRAB",
            "text": "This place is amazing in every aspect of the word. From service, ambiance, food, drinks, price. WOW I love this place. Very intimate with great music 🎶 sweet drinks 🍸  food is so delicious.  So welcoming, feels like family. I will be back VERY SOON. I am in love with this place!! 😍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aE1tWldnEAE",
            "text": "My friends always go to this seafood boil place and I would recommend it too! Food are always fresh and service are amazing! Thanks our host Amy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoamJLclZBEAE",
            "text": "Phenomenal! The service is truly unlike any other place. They really go above and beyond to make you feel so comfortable. The food is great and the ambiance is amazing. Believe the other reviews, and visit this spot!!! I had the sizzling plate and it was a 10/10."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeHZMUjJRRRAB",
            "text": "Went to celebrate a birthday on a Thursday night. The staff was friendly. No charge for bringing in my own birthday cake (some places do charge a fee) We did bring our own paper plates to make cleaning up easy. Must of us ordered the no head shrimp boil....so good. It already comes with potatoes and corn. You can order extra if you want. We took advantage of the happy hour special on 2 for 1 cocktail drinks."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ01lVHdBRRAB",
            "text": "Back at our favorite seafood restaurant in the Bronx! We love it here. Great food, clean restaurant and friendly service. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPazZ5dk93EAE",
            "text": "The Calamari and Lobster Bisque was delish. Not a fan of the chicken fried rice it was way to bland. However the presentation of the food, the restaurant  decor and the service was exceptional!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyclo2bDRRRRAB",
            "text": "I've waited so long for this place to open. Had the Lychee Martini for the 1st time and it was delicious. 🍸Fried Cod fillet was great. Toly the bartender was very friendly, will definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaDhtRlVnEAE",
            "text": "I went here on a Saturday afternoon with a big group for my Mother’s birthday. The servers were so attentive. The space is beautiful and very clean. Has a lovely bar right when you walk in. It’s a cute vibe. The bar is also neat and great to look at, stacked with with high end alcohol. Perfect for a date spot. I always prepare myself for a higher bill when it comes to seafood but the prices were perfect and the portions were pleasantly surprising. I took home tons of left overs. They gave me a whole pound of shrimp which is rare for seafood spots. The garlic noodles as a side were so yummy and the fried rice was amazing! Their special Cajun seasoning is on point. Don’t be afraid to get the spicy level! I would come here over and over again. I’m a Bronx native, so I love City Island but this is def my new seafood go-to!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN01hbld3EAE",
            "text": "I've eaten inside before and the food is good but the pricing is a lot. Say that the price of the meal is $35 and then it goes to $65 but it's from them taking a tip out of nowhere. So I now take out only which I usually spend about $20 or more if I want a little extra. The workers are nice and the restaurant is clean and has a chill-like vibe. They give free water if you are taking out or dining in. I would definitely recommend and still eat there"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eTU2Q2pBRRAB",
            "text": "Food was delicious, service was excellent. Will definitely go back. 3 of us dining. Enjoyable ambiance. Our server, Tonl was friendly and helpful when ordering. Prices were good. Bill came to $120.00 with 18% gratuity. Please try the Cod Fish fillets, Shrimp pancakes and Shrimp and Chicken Garlic Noodle and make your own Boil. We needed this in the community."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNElyRHN3RRAB",
            "text": "I ate there yesterday and it was amazing, the food was fresh, quick, and just great overall. They had great service also and they were very considerate. And this is also great for picky eaters because my sister is a picky eater and she…"
        }
    ],
    "reviews_count": 69
}