{
    "name": "Tililá",
    "place_id": "ChIJ3TKkAaPzwokRhjV6iZ7U0HI",
    "grid": "BX8",
    "address": "3648 Bailey Ave, Bronx, NY 10463, USA",
    "rating": 4.5,
    "user_ratings_total": 702,
    "phone_number": "(929) 222-4968",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT1pXOUNiSEphWTNoTmIwVkxiazV0Y0VOdldtYxAB",
            "text": "Excellent Food, service and ambiance.  Thank you Haidy for your service."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eWJGVmZWbXR4VVRjMlYwVkNWVzVTV1hCc1NYYxAB",
            "text": "So good, music and people Frank was so gentle and always checking on was i give him 10/10."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNVkxOUllWGRtUmxGUGVqVlpUWFpHUkdkWlZIYxAB",
            "text": "Omg, the food was amazing! 😍 I had this delicious eggplant dip with yanikekes and an incredible skirt steak. A few beers and a great bottle of Cabernet Sauvignon made it even better! 🍷✨ But honestly, the best part was the service — Frank was our waiter, and he was absolutely amazing! So attentive, detailed, and clearly passionate about his job. You can really see how much he cares about people. Definitely coming back to this restaurant!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNFREUlZVakJzZDNwUFpVMUpkVzl4UjFsdlNWRRAB",
            "text": "food made with love. drinks ready to help me dance and the people making me feel like home ❤️"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRE4yZGtlblpDUVVFelgzQldUWFZ4U2pFNWVIYxAB",
            "text": "Siempre será un placer visitar a Tilila, y después de tanta espera todo valió la pena porque el regreso fue mejor de lo esperado.\nTilila, es uno de esos lugares donde llega y te sientes en casa y siempre verás persona conocidas y un excelente trato y ambiente.\nRecomendado!!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNmRYcEhSM0J6U1Y5WVNUZGpiRUowYTJGbmVHYxAB",
            "text": "I’ve been coming to this restaurant for years, and every time I feel like part of the family. The food is consistently amazing, and the hospitality always leaves a lasting impression. Whenever I bring friends or relatives, they instantly fall in love with the service and atmosphere. I highly recommend Tilila to any New Yorker looking for great food, welcoming vibes, and live music that makes the night complete."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSVJFMUdZVk42TmsxUlIwdGtORzFYTUY5S2RXYxAB",
            "text": "Very nice place, music and food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdVUxQnBiMmhYWWtORlRtaGtMVE5VYlZrd1RHYxAB",
            "text": "Bad ,overpriced drinks, terrible service, do not recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUVQyNXRORFl5YjJKclQwWkJNMlJSWjFWcFgyYxAB",
            "text": "Mandatory tip for a table of 2? Never again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc1MxcHRhSGxUTUdsbFJVMHdOMDVPVURoelZVRRAB",
            "text": "The service was amazing!!! very attentive waitress, can't wait to go again for happy hour!!!! The chimi was delicious!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWUxVZFRMVkJXVGxKcE5XWjZSRVJ4ZDJoSU1uYxAB",
            "text": "Grateful for tonight’s Riccie Oriach performance in our community of The Bronx✨🥹🥳Thank you for bringing su ch a treasured Dominican artist 🥳🥳🥳"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReFVXaGFZbnBLWVRWQ2NFVTFSM0ZZV1doVGVVRRAB",
            "text": "Tilila always has a great vibe! I love that they have live music and all the artists are phenomenal. This place is definitely highly recommended for good food, drinks and  entertainment 👌🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFlVdDNNbHAyUWtoRFEyRkROMVJ2TVhseWJuYxAB",
            "text": "Great place great music great food good drinks atmosphere is nice"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T2JHaGxRMGt0YVhOSFducEdUMU5XYjNsRU1sRRAB",
            "text": "Heidi was amazing! Upon entering the restaurant she made sure that my party was comfortable and taken care of. She made sure that we had everything we needed 🫶🏼. The ambience was amazing. We had drinks and empanadas, they were both amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdFlrVTJURGRwZFZsTlVtRllkR2RVWmpSc1ZsRRAB",
            "text": "Excellent food and great customer service.  Will definitely recommend it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eFNsTlFSVlp5V25aa1dFRjJSRkJGYjB3M1ptYxAB",
            "text": "Coming to Tilila has always felt like coming home! It is such a warm and joyful atmosphere from the moment you step in! I have been a local for many years and Tilila never disappoints. I am super happy for their come back and their new Colmado decor that holds so much history and memories from Dominican Republic! The food and drinks are always delicious and the service excellent. The music and the ambiance is super fun! I love coming on Wednesdays for DJ La Maquina del Tiempo to dance and have fun with friends!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NelFTMU9kRU50YjNkR01reERValp5V0dsdFRGRRAB",
            "text": "Es como estar en casa. El ambiente, al atención, el respeto, el trato. Si vienes a Tilila repites y no una vez 👏🏼 aquí se disfruta buena comida, buena música, un lugar familiar y sano. Y si solo buscas disfrutar cócteles pues aquí preparan los mejores (Dahiana in the house) aparte de la variedad de cervezas, vinos y espumantes. Give it a try and salud!!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RFNtaHdWbEpTWTBselUwWm1SMUF5UVZOVU1FRRAB",
            "text": "La musica cuando no estan tocando en vivo es demasiado alta y no permite escuchar la persona de al lado que te habla. Por lo demas excelente!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnNFYxWTJUR2xtZEVFNFpIaHNiVEkxT0RodGNIYxAB",
            "text": "EL MEJOR AMBIENTE EXCELENTE  COMIDA . Y FINAS ATENCIONES LO RECOMIENDO 100%...."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwelZsRm5iRU5YVEZBM01taHNkSEJzYUhCMFJuYxAB",
            "text": "This place feels like your at your grandmas house! The atmosphere is so welcoming the staff is so nice and accommodating the food and drinks have great flavor and makes you feel like you’re in the country side! I highly recommend this spot"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTE5FcDVOR1JSUmpGYWNHd3dRWGN5UkdWaE0xRRAB",
            "text": "Had a great time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRWVWOXdUM1ZDUVROaVEyazFXRkJoT1RGckxXYxAB",
            "text": "This place was amazing. The interior design was so detailed oriented and food was delicious. We tried the calamari, steak and chicken chimi, red snapper and churrasco. It was all so delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR1NGWm9PV3RGV2tsaVQydDVhbUZXYUZaNWVsRRAB",
            "text": "Quality over everything and that is what this place has to offer. From food to service. One hundred percent recommend 🙌🏾"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMFlYSkthMW8wZDFkb2NsYzFaMUE1TFVGaFNIYxAB",
            "text": "I was finally able to try out this restaurant! The server was lovely and accommodating. The decor is very nostalgic as it has details throughout of country homes you would find in the Caribbean. Colorful and vibrant throughout and very spacious. The food was incredible with great flavor!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlQySXdTbkJTYkdWRFMwMXNNR3RKVmxGT1pGRRAB",
            "text": "Overall vibe is awesome, bar looks very pretty. The overall atmosphere is cool. Band was suppose to play at 10 it is 1119 and still nothing lol.\nBathroom: normal bathroom but only one stall\nFood: they got my meat temp wrong but they fixed it and was not lacking taste at all it was great!\nDrinks: didn’t love, taste was ok to say the most, the alcohol was almost nonexistent. Two of my friends enjoyed their drink but they’re not heavy drinkers\nService: server was awesome idk her name though"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScWJWVjZaa05qZDFoUU5EUmxha2czVGxKQ1puYxAB",
            "text": "Automatic 20% tip included even when sitting at the bar. That is too much. Customers do not even have options of 15, 18 or 20% it is only 20% automatically added. The music is very loud compare to music level sounds of previous years. You need to yell almost to be able to have a conversation with the person seated next go you. Limited menu."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MUxUZFNSRVp3WkdKR1kxSm5WVjloVjJWV1pWRRAB",
            "text": "Llegar a Tilila, es como llegar a casa pero mejor.\n\nEn el momento que Joaquín te saluda en la puerta sientes como si fuera un viejo amigo invitándote  a pasar a un lugar familiar, conocido y cómodo. Dayana en el bar prepara los mejores tragos y Frank como mesero siempre pendiente a todos los detalles pa hacerte sentir bien atendido.\n\nCualquier día de la semana tienen un súper ambiente, musiquita en vivo para el alma y como si no fuera suficiente todo lo  del menú es buenísimo, ir a Tilila es una super experiencia cada vez."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbUl1cHJhbzlMUHpRRRAB",
            "text": "Un lugar acogedor,excelente ambiente,excelente servicio un lugar donde se puede conversar sin la música molestar.\n🇺🇲🇺🇲🇺🇲"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1RVZENPVFZuVVRkTWJFSTNha0ZuZGt0bFpsRRAB",
            "text": "Bien"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU05qbHNlV3BSY1ZNd2QxVTNZbUY2TjJacFEzYxAB",
            "text": "Everyone was friendly and attentive. I had the deliciously Grilled Octopus with the perfect amount of crispy on the outside! The drinks were also delicious! Had the strawberry and passionfruit margaritas!!! Definitely Going back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJaWJuT0RveExKZhAB",
            "text": "Love the place low key with the family, the food is out this world 🌎. The owner is super nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbWtpWlNtbllYRjlBRRAB",
            "text": "I went with my coworker for first time and it was amazing. Food was excellent. The appetizers were delicious. The eggplant dip with yanikeke was amazing, the shrimp pincho cooked to perfection and the veggies very crunchy. I enjoyed every bit , the sauce it was great . It was not salty or lacking of flavor , it was just the right combination of flavors and texture.\n\nThe server was excellent. She explained the drinks and the food we will order .\nI will give him 5 starts ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTFcyNEQxaXJxTnVRRRAB",
            "text": "Great food, drinks and live music everyday! The staff is great as well! Highly recommend this spot in Riverdale!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZjRtZXVoemRQTHBRRRAB",
            "text": "Maravilloso ambiente! Exquisitas atenciones y los mejores artistas en vivo."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLURpX0RxdmJiSzFnRRAB",
            "text": "We really enjoyed the ceviche and eggplant appetizers. Red snapper and Tres leches was delicious as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNYkJpTmJCNmRpUkN3EAE",
            "text": "For the most part, everything was good!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLZVltdEhVcjhlWF9BRRAB",
            "text": "Buen ambiente , buena música en vivo , decoracion exquisita pero La comida es muy cara y las porciones pequeñas, dos bolitas de mofongo con dos camarones contados 14.00 dólares, el servicio regular , no te llevan los tragos en bandejas solo en las manos, muy bien ambiente pero muy caro para\nLo que ofrecen."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQ3RwSWZyNThqWW9RRRAB",
            "text": "Love the ambience and atmosphere!! I am definitely coming back!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQenowT21XcTdpbE1BEAE",
            "text": "Muy acogedor, buen servicio y buen tragos"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZakx5RDRRRRAB",
            "text": "Muy buena la comida, el servicio, el ambiente acogedor y te transportan al coro del patio, una experiencia totalmente recomendable y sobretodo las noches de musica en vivo 1A"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZakppOXB3RRAB",
            "text": "Excelente restaurant, con un ambiente muy agradable, donde se puede ir a disfrutar de buena música en vivo e ir con toda la familia. La comida sabrosísima y los tragos en su punto. Definitivamente volveré y recomiendo Tililá!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbE9UdlV3EAE",
            "text": "El lugar es super tipico, pero sin perder el toque de modernidad. Ideal para disfrutar en familia, parejas o grupos de amigos. Buena musica por parte del DJ y ademas en ocaciones tienen musica en vivo."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMk9tQVFREAE",
            "text": "Great spot. Live music! Amazing team. Recomend it 100%"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvblllcGxnRRAB",
            "text": "Good food with great entertainment. Definitely recommend it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOGVEV2dRRRAB",
            "text": "The only place in NYC that recreated those memories of our roots with their greatest food, music and the people who managed and work here its TILILA , Henry & Kenia amazing old friends,  thank you wendy that keeps me posted with every event."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2Vfc1lnEAE",
            "text": "This place feels like you’re in a different country. Very impressive what the owner and management has been able to create here."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNGNTUFl3EAE",
            "text": "Excelente para ir a tomar un trago en grupo. Cuando fui tenían cantantes en vivo. Se pasa bien en el lugar."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcnB1OVhnEAE",
            "text": "EXCELENTE LUGAR PARA DISFRUTAR SEGURO TRANQUILO LA COMIDA ES OTRO NIVEL BUENA MÚSICA SIMPLEMENTE GENIAL."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcnJ2VE9BEAE",
            "text": "Buen lugar excelente para gozar pasarla bien y la comida super super woww !!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMzlTTmJREAE",
            "text": "Absolutely delightful experience! From the moment we walked in, we were greeted with warm smiles and an inviting atmosphere. The decor is chic and modern, creating a perfect setting for a memorable dining experience.\n\nThe menu offers a fantastic variety of dishes, each more tempting than the last.\n\nThe service was impeccable; our server was attentive and knowledgeable, providing excellent recommendations and ensuring our glasses were never empty.\n\nThe Restaurant exceeded our expectations in every way. It's a must-visit for anyone looking to enjoy exquisite food and outstanding service. We can't wait to return! Five stars all the way!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdi1meHhRRRAB",
            "text": "Everything was amazing. The food, the service, the environment. This restaurant is underrated, probably because people would think it's mostly a bar. This place was definitely child friendly and all the staff here are amazing. Even with the low choices of meals, trust me when I say that you won't regret coming here!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd1oyZk5BEAE",
            "text": "Después de una larga espera! Esta reapertura ha sido increíble,  el lugar es mucho más grande y mucho mejor, El nuevo staff es muy amigable aunque hay algunas viejas caras, La comida deliciosa y los mejores Mojitos del Bronx!!\n\nY clarooooo El karaoke de los lunes mi favorito!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaW91NTd3RRAB",
            "text": "Cute Dominican restaurant in the Bronx.  More vegetarian options are required.  The decor is very interesting and hard to describe.  I went today, Monday afternoon.  They do play live music 🎶.  I would love to go on a weekend and see what the atmosphere is like.  My skirt steak was amazing!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0cE1tbVlnEAE",
            "text": "This is such a cute and chill place. It Really gives you the vibe as if you were somewhere in the Dominican Republic. Food was delicious and so where the drinks (my boyfriend didn’t quite like his drink) but overall we enjoyed our time there. The waitress was very attentive as well. Will definitely recommend and go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc0t6UElnEAE",
            "text": "I am absolutely thrilled to share that after a long journey of recovery since the unfortunate fire in 2021, our beloved spot has finally reopened its doors today! As a regular, I couldn't be happier to see this magical place back and better than ever.\n\nThe vibe remains as enchanting as before, with the same warm vibe that makes it feel like a second home. They've expanded the space, offering more room yet they've preserved the charm we all love.\n\nThe menu continues to be flavorful. It's heartwarming to see familiar faces among the staff, all eager to welcome us back and continue the tradition of excellent service.\n\nReopening after such a significant event is no small accomplishment , and their dedication to restoring our favorite spot is truly commendable. I am overjoyed to have my go-to place back in action and look forward to creating many more cherished memories here.\n\nWelcome back Casita Azul TILILÁ!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWJlZnNnRRAB",
            "text": "Restaurant Review: A Taste of Home with Unbeatable Hospitality\n\nStepping into Tilila feels like walking into a warm embrace. From the moment you arrive, the staff treats you like family, greeting you with genuine smiles and making sure you’re comfortable. The service is impeccable—attentive but never intrusive, always ready with a recommendation or a quick joke that reminds you of home.\n\nThe atmosphere is pure nostalgia, with classic Latin music playing softly in the background, transporting you to those carefree nights at your abuela’s house. Whether it’s the sound of a bachata guitar strumming or the familiar lyrics of an old merengue hit, the music sets the perfect tone for a meal filled with heart and heritage.\n\nAnd the food? Every bite is a reminder of tradition—flavors that bring back memories of home-cooked meals, made with love. Whether you’re indulging in a comforting plate of mofongo, a sizzling churrasco, or a creamy tres leches for dessert, each dish carries the warmth of generations past.\n\nIf you’re looking for a place that feeds not just your stomach but your soul, Tilila is it. Great service, great music, and that undeniable feeling of home—what more could you ask for?"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNHZDdDhnRRAB",
            "text": "This place is one of my all time favorite spots in whole wide world. The live music, Adonis the bartender is such a cool guy. They are like a nightlife family for me.\n\nEven when I support other local spot this one is my after party. I always end up here.\n\nThe vibe is so uplifting. It always get me in a good mood to come here. The casita dominicana decor and the colmado bar, makes feel I'm back Dominican Republic.\n\nMake sure you don't miss them. The drinks are to die for and the food is excellent. Bus stop right across the street. Heated front porch and amazing window live music."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbnNQNGhRRRAB",
            "text": "Tililà was great! Love the ambience, food, service and entertainment.  Definitely a place worth checking out. The ambiance is great and the music is not too loud which you can have a conversation and hear the person next to you unlike other…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOVk3ZEZREAE",
            "text": "The place is nice, it has a nice ambient. I went on a Sunday night and they had life music and I had lots of fund with the band! I would definitely come back and I really recommend to go and see Andre Veloz singing, she is very good!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLXzctQ3RRRRAB",
            "text": "Great service from the team at Tilila. The chicken mofongo was delicious. Atmosphere was classy and welcoming.  Great for a night out for dinner with the family and friends. I didn't know this place existed, now i can't wait to go back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMTgyaG5nRRAB",
            "text": "I was finally able to check out the newly reopened Tililá, and it did not disappoint. I used to come here often before it closed down. The place looks beautiful, and it still has the same homey vibe this place is known for. I had a chicken penne pasta dish they have, and it was delicious! For now, their menu is limited, but I was assured they are working diligently to expand the menu. They have a great happy hour menu as well. Both Leo and Juan made the best coconut margaritas! They were on point! Both Juan and Leo were very nice and attentive.\n10/10 definitely recommend!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjeHZQcXl3RRAB",
            "text": "Very nice, well priced and service great spot with live band. Valet Parking for $20 I found that to be a lot I’m from NJ. We have parking everywhere LOL."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJamViSzd3RRAB",
            "text": "Food was really good. Nice decor. Was not a fan of the automatic addition of the service fee as a set gratitude fee for a family of 5.\n\nThe yuca mashed was really good."
        },
        {
            "date": "수정일: 7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbjl6MWhBRRAB",
            "text": "Los visite hace 3 años. Me encantó el restaurante con el espíritu dominicano y buena onda que nos caracteriza. La música, la gente, la comida, un pedacito de nuestro corazón dominicano. (Por error se marcó 3 estrellas pero realmente es un 5!) 🫶🏻"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeklPUnV3RRAB",
            "text": "Buen ambiente,  rango de precio perfecto,  los camareros muy atentos se los recomiendo"
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbUlXQU5nEAE",
            "text": "Mi casita azul!! Si quieres algo tranquilo y bohemio esta casita te va gustar uno de mis lugares favoritos🥰…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaGZidmpRRRAB",
            "text": "Traditional Dominican decorations, food was good, and friendly staff, the only think is the manu is very limited, not too many items to choose from."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaVpfRlJ3EAE",
            "text": "Food was so delicious and the ambiance even better!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRXzVteUlnEAE",
            "text": "El menú muy limitado,  pedí un ceviche con los camarones en sílice, literal mas cebolla que todo lo demás, los mofongos horribles, los  tragos pesimos, realmente fuimos un grupo de amigas y ningunas salimos satisfecha!\nLo bueno del sitio es el baño, bien limpio."
        }
    ],
    "reviews_count": 69
}